{
   "weather_details": {
      "2024-06-29": {
         "rainfall": 15,
         "t_max": 31,
         "t_min": 22,
         "rh_max": 81,
         "rh_min": 47,
         "wind_speed": 11,
         "wind_direction": 248,
         "cloud_cover": 7
      },
      "2024-06-30": {
         "rainfall": 20,
         "t_max": 30,
         "t_min": 21,
         "rh_max": 84,
         "rh_min": 53,
         "wind_speed": 11,
         "wind_direction": 249,
         "cloud_cover": 8
      },
      "2024-07-01": {
         "rainfall": 5,
         "t_max": 30,
         "t_min": 21,
         "rh_max": 82,
         "rh_min": 56,
         "wind_speed": 12,
         "wind_direction": 249,
         "cloud_cover": 6
      },
      "2024-07-02": {
         "rainfall": 3,
         "t_max": 33,
         "t_min": 23,
         "rh_max": 86,
         "rh_min": 57,
         "wind_speed": 15,
         "wind_direction": 248,
         "cloud_cover": 4
      },
      "2024-07-03": {
         "rainfall": 2,
         "t_max": 35,
         "t_min": 24,
         "rh_max": 85,
         "rh_min": 55,
         "wind_speed": 13,
         "wind_direction": 249,
         "cloud_cover": 3
      }
   },
   "names_of_crops": [
      "ଚାଉଳ",
      "ଗାଈ।",
      "ଚିକେନ୍"
   ],
   "general_advisory": "ଜୁନ୍ ମାସର ଶେଷ ସପ୍ତାହ ଏବଂ ଜୁଲାଇ ମାସର ପ୍ରଥମ ସପ୍ତାହ ମଧ୍ଯ଼ରେ, ସୋରିଷ, କାକୁଡ଼ି, କଦଳୀର ଚାରା ବେସିନ ତିଆରି କରି ବୁଣିବାକୁ ପଡ଼ିବ। ବାଇଗଣ ଚାରା ଏବଂ ଓକ୍ରା ମଞ୍ଜି ଗୁଡ଼ିକର ଧାଡ଼ି ବୁଣିବା କରାଯାଇପାରିବ।",
   "crops_data": {
      "rice": {
         "advisory": [
            "ସୁନିଶ୍ଚିତ ଜଳସେଚିତ ଅଞ୍ଚଳରେ ଭଲ ଜଳ ନିଷ୍କାସନ ସୁବିଧା ସହିତ ଜଳସେଚନ ଜଳ ଉତ୍ସ ନିକଟରେ ଓଦା ଶଯ୍ଯ଼ା ନର୍ସରୀ ପାଇଁ ଜମି ଚଯ଼ନ କରନ୍ତୁ | ଗ୍ରାମ ସ୍ତରରେ ଗୋଷ୍ଠୀ ନର୍ସରୀ ଆଭିମୁଖ୍ଯ଼ ଅନୁସରଣ କରିବାକୁ ପରାମର୍ଶ ଦିଆଯାଇଛି। ନର୍ସରୀ ଅଞ୍ଚଳକୁ 1.5-metre-long, 10 ସେ. ମି. ଉଚ୍ଚତା ଏବଂ ସୁବିଧାଜନକ ଲମ୍ବ ବିଶିଷ୍ଟ ଛୋଟ ଛୋଟ ପ୍ଲଟରେ ବିଭକ୍ତ କରନ୍ତୁ। ଜଳସେଚନ/ଜଳ ନିଷ୍କାସନ ପାଇଁ ଶଯ୍ଯ଼ା ସହିତ 30 ସେ. ମି. ଓସାରର ଜଳସେଚନ ଚ୍ଯ଼ାନେଲ ନିର୍ମାଣ କରାଯିବା ଉଚିତ। ପ୍ରତ୍ଯ଼େକ ଧାଡ଼ି କିମ୍ବା ସିଧାସଳଖ ପ୍ରସାରଣ ମଧ୍ଯ଼ରେ 5 ସେ. ମି. ବ୍ଯ଼ବଧାନ ସହିତ ଧାଡ଼ି ବୁଣିବା ଦ୍ୱାରା ଅଙ୍କୁରିତ ବୀଜଗୁଡିକ ବୀଜ ଶଯ୍ଯ଼ାର @40-50 ଗ୍ରାମ୍/ମି2 ଅଞ୍ଚଳରେ ରୋପଣ କରାଯିବା ଉଚିତ ଏବଂ ମଞ୍ଜି ଉପରେ ଶୁଖିଲା କମ୍ପୋଷ୍ଟ ପକାଇବା ଉଚିତ।"
         ]
      },
      "cow": {
         "advisory": [
            "ଆଗାମୀ 5 ଦିନ ମଧ୍ଯ଼ରେ ହାଲୁକା ରୁ ମଧ୍ଯ଼ମ ବର୍ଷା ହେବାର ପୂର୍ବାନୁମାନ ହେତୁ, ପଶୁମାନଙ୍କୁ ଘର ଭିତରେ ରଖନ୍ତୁ | ବର୍ଷା ଋତୁରେ, ଦୁଗ୍ଧ ପଶୁମାନେ ଟିକ ସଂକ୍ରମଣ ଦ୍ୱାରା ପୀଡ଼ିତ ହୁଅନ୍ତି | କୃଷକମାନେ ସାଇପର୍ମେଥ୍ରିନ୍ କିମ୍ବା ଡେଲ୍ଟାମେଥ୍ରିନ୍ 2-4% ପରି ଏକ୍ଟୋପାରାସାଇଟାଇଡ୍ ପଶୁମାନଙ୍କ ଶରୀରରେ ଏବଂ ଛପରରେ ମଧ୍ଯ଼ ସ୍ପ୍ରେ କରିପାରିବେ | ଯଦି ଜ୍ୱର, କମ୍ପନ, ବାଦାମୀ ରଙ୍ଗର ପରିସ୍ରା, ଖାଦ୍ଯ଼ ନଦେବା ଇତ୍ଯ଼ାଦି ଦେଖାଯାଏ, ତୁରନ୍ତ ପଶୁ ଚିକିତ୍ସକଙ୍କ ପରାମର୍ଶ ନିଅନ୍ତୁ | ସେଡ୍ ଏବଂ ଆଖପାଖରେ ଚୂନ ଲଗାନ୍ତୁ ଯାହା ଜୀବାଣୁନାଶକ ସୃଷ୍ଟି କରେ ଏବଂ ଚଟାଣକୁ ଶୁଖିଲା ରଖେ | ସୁଲଭ ଷ୍ଟୋରେଜ୍ ଏବଂ ଦୁର୍ବଳ ସମଯ଼ରେ ବ୍ଯ଼ବହାର ପାଇଁ ବଳକା ସବୁଜ ଘାସରୁ ସାଇଲେଜ୍ ତିଆରି କରନ୍ତୁ |"
         ]
      },
      "chicken": {
         "advisory": [
            "ଖାଦ୍ଯ଼ ସାମଗ୍ରୀଗୁଡ଼ିକ ଓଦା ହେବାରୁ ରକ୍ଷା କରନ୍ତୁ, ଏବଂ ଖାଦ୍ଯ଼ର ପରିମାଣ ଅତ୍ଯ଼ଧିକ ହେବା ଉଚିତ ନୁହେଁ। ଘରର ଯୌଗିକ ଖାଦ୍ଯ଼କୁ ମାଟି ଉପରେ ଥିବା ମଞ୍ଚ ଉପରେ ରଖିବା ଉଚିତ, ଯାହାଦ୍ୱାରା ଖାଦ୍ଯ଼କୁ ଆର୍ଦ୍ରତା ଫେରିଆସିବାରୁ ରୋକାଯାଇପାରିବ। ଫଙ୍ଗସ୍ ପ୍ରଦୂଷଣରୁ ରକ୍ଷା ପାଇବା ପାଇଁ ଫିଡର୍ଗୁଡ଼ିକର ନିଯ଼ମିତ ଯାଞ୍ଚ। ଏହି ବର୍ଷା ଋତୁରେ ସମଯ଼ ସମଯ଼ରେ ଆପଣଙ୍କ ପକ୍ଷୀମାନଙ୍କୁ ଗରମ ପାଣି ଯୋଗାଇ ଦିଅନ୍ତୁ, ଯାହାଦ୍ୱାରା ସେମାନେ ବ୍ଯ଼ବହାରକୁ ଉତ୍ସାହିତ କରିପାରିବେ ଏବଂ ଏହି ପ୍ରକ୍ରିଯ଼ାରେ ବଳକା ଥିବା ଶକ୍ତିର ଉପଯୋଗ ନକରି ସେମାନଙ୍କୁ ଗରମ ରଖିବାରେ ସାହାଯ୍ଯ଼ କରିପାରିବେ। ବଗିଚାରେ ସଫେଇ କରୁଥିବା ପକ୍ଷୀମାନଙ୍କୁ ଅତିରିକ୍ତ ଖାଦ୍ଯ଼ ଦିଆଯିବା ଉଚିତ।"
         ]
      }
   },
   "date": "28-06-2024"
}