{
   "weather_details": {
      "2024-08-14": {
         "rainfall": 5,
         "t_max": 33,
         "t_min": 24,
         "rh_max": 91,
         "rh_min": 59,
         "wind_speed": 6,
         "wind_direction": 180,
         "cloud_cover": 6
      },
      "2024-08-15": {
         "rainfall": 6,
         "t_max": 34,
         "t_min": 25,
         "rh_max": 91,
         "rh_min": 78,
         "wind_speed": 5,
         "wind_direction": 204,
         "cloud_cover": 7
      },
      "2024-08-16": {
         "rainfall": 6,
         "t_max": 34,
         "t_min": 25,
         "rh_max": 94,
         "rh_min": 79,
         "wind_speed": 5,
         "wind_direction": 216,
         "cloud_cover": 7
      },
      "2024-08-17": {
         "rainfall": 10,
         "t_max": 34,
         "t_min": 26,
         "rh_max": 90,
         "rh_min": 66,
         "wind_speed": 6,
         "wind_direction": 248,
         "cloud_cover": 7
      },
      "2024-08-18": {
         "rainfall": 12,
         "t_max": 34,
         "t_min": 25,
         "rh_max": 89,
         "rh_min": 62,
         "wind_speed": 6,
         "wind_direction": 279,
         "cloud_cover": 7
      }
   },
   "names_of_crops": [
      "ଚାଉଳ",
      "କଳା ଚଣା",
      "ଓକ୍ରା/ଲେଡିଫିଙ୍ଗର"
   ],
   "general_advisory": "ଯେଉଁଠିକି ଚାରା ଗୁଡ଼ିକର ବଯ଼ସ ଅଧିକ ହୋଇଯାଇଥିବାରୁ ଧାନ ରୋପଣ ସମ୍ଭବ ନୁହେଁ, ସେଠାରେ କୃଷକମାନଙ୍କୁ ଜଳମଗ୍ନ ଧାନରେ 90-100 ଦିନର ଅବଧି ବିଶିଷ୍ଟ କିସମ ଗୁଡ଼ିକର ପ୍ରାକ୍-ଅଙ୍କୁରିତ ମଞ୍ଜି ଗୁଡ଼ିକୁ ସିଧାସଳଖ ଭିଜାଇ ବୁଣିବା ପାଇଁ ପରାମର୍ଶ ଦିଆଯାଉଛି। ଭବିଷ୍ଯ଼ତରେ ଧାନ କ୍ଷେତରେ ବ୍ଯ଼ବହାର ପାଇଁ ବର୍ଷା ଜଳକୁ ଗଚ୍ଛିତ ରଖନ୍ତୁ। ପନିପରିବା କ୍ଷେତରୁ ଅତିରିକ୍ତ ପାଣି ବାହାର କରନ୍ତୁ।",
   "crops_data": {
      "rice": {
         "advisory": [
            "ସର୍ବନିମ୍ନ ତାପମାତ୍ରା ଏବଂ ଆପେକ୍ଷିକ ଆର୍ଦ୍ରତା ବିସ୍ଫୋରଣର ବିରାମ ପାଇଁ ଅନୁକୂଳ | ରୋଗ ନିଯ଼ନ୍ତ୍ରଣ ପାଇଁ ଟେବୁକୋନାଜୋଲ 50 ପ୍ରତିଶତ + ଟି ରିଫ୍ଲକ୍ସିସ୍ଟ୍ରୋବିନ୍ 25 ପ୍ରତିଶତ @4 ଗ୍ରାମ/ଲିଟର କିମ୍ବା କାର୍ବେନଡାଜିମ୍ 50 ଡବ୍ଲ୍ଯ଼ୁ. ପି. @2 ଗ୍ରାମ/ଲିଟର ପାଣି ସ୍ପ୍ରେ କରନ୍ତୁ। ଅନ୍ଯ଼ଥା, ଯଦି ସଂକ୍ରମଣ ଦେଖାଯାଏ, ତେବେ ପ୍ରତି ଲିଟର ପାଣିରେ ବେଲ୍ (25 ଗ୍ରାମ୍ ତାଜା ପତ୍ର) କିମ୍ବା ତୁଳସୀ (25 ଗ୍ରାମ୍ ତାଜା ପତ୍ର) କିମ୍ବା ନିମ୍ (200 ଗ୍ରାମ୍ ତାଜା ପତ୍ର) ପତ୍ରର ନିର୍ଯାସ ସ୍ପ୍ରେ କରିବା ଦ୍ୱାରା ରୋଗର ପ୍ରକୋପ ହ୍ରାସ କରିବାରେ ସାହାଯ୍ଯ଼ କରିପାରିବ |"
         ]
      },
      "black gram": {
         "advisory": [
            "ବର୍ଷା ପରେ, ଡାଲି ଫସଲରେ ମୂଳ କ୍ଷଯ଼ ଦେଖିବାକୁ ମିଳିପାରେ, ଏକର ପିଛା 200 ଲିଟର ପାଣିରେ 400 ଗ୍ରାମ କାର୍ବେନଡାଜିମ୍ 50 ପ୍ରତିଶତ ଡବ୍ଲୁପିର ପ୍ରଯ଼ୋଗ ପାଇଁ ଯାଆନ୍ତୁ |"
         ]
      },
      "okra/ladyfinger": {
         "advisory": [
            "ବର୍ତ୍ତମାନର ପାଣିପାଗ ସ୍ଥିତି ହେତୁ ଓକ୍ରାରେ ଏଫିଡ୍, ଜ୍ଯାସିଡ୍, ଥ୍ରିପ୍ ଏବଂ ହ୍ୱାଇଟ୍ଫ୍ଲାଇ ପରି କୀଟ ଶୋଷିବାର ସମ୍ଭାବନା ଅଛି | ସଂକ୍ରମଣର ପ୍ରାରମ୍ଭିକ ପର୍ଯ୍ଯ଼ାଯ଼ରେ ଏହି କୀଟପତଙ୍ଗକୁ ପରିଚାଳନା କରିବା ପାଇଁ 200 ଲିଟର ପାଣିରେ ମିଶ୍ରଣ କରି ନିମ୍ବ-ଆଧାରିତ କୀଟନାଶକ (ନିମ୍ବ ତେଲ 1500 ପିପିଏମ @600-ମିଲି/ଏକର) ସ୍ପ୍ରେ କରନ୍ତୁ। ଏହି ଶୋଷକ କୀଟକୁ ନିଯ଼ନ୍ତ୍ରଣ କରିବା ପାଇଁ ରାସାଯ଼ନିକ ଉପାଯ଼ରେ ଥିଯ଼ାମେଥୋକ୍ସାମକୁ ଏକର ପିଛା 40 ଗ୍ରାମ୍ରେ 25 ପ୍ରତିଶତ ଡବ୍ଲୁ. ଜି. କିମ୍ବା ଏକର ପିଛା 30 ଗ୍ରାମ୍ରେ ଏସିଟାମିପ୍ରିଡ୍ 20 ପ୍ରତିଶତ ଏସ. ପି. କିମ୍ବା ଏକର ପିଛା 400 ମିଲି. ରେ ଟଲ୍ଫେନପାଇରାଡ୍ 15 ପ୍ରତିଶତ ଇ. ସି. 200 ଲିଟର ପାଣିରେ ମିଶାଇ ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      }
   },
   "date": "13-08-2024"
}