{
   "weather_details": {
      "30-07-2024": {
         "rainfall": 15,
         "t_max": 32,
         "t_min": 23,
         "rh_max": 90,
         "rh_min": 62,
         "wind_speed": 11,
         "wind_direction": 249,
         "cloud_cover": 8
      },
      "31-07-2024": {
         "rainfall": 20,
         "t_max": 30,
         "t_min": 22,
         "rh_max": 92,
         "rh_min": 71,
         "wind_speed": 12,
         "wind_direction": 252,
         "cloud_cover": 8
      },
      "01-08-2024": {
         "rainfall": 15,
         "t_max": 29,
         "t_min": 22,
         "rh_max": 90,
         "rh_min": 76,
         "wind_speed": 13,
         "wind_direction": 248,
         "cloud_cover": 8
      },
      "02-08-2024": {
         "rainfall": 10,
         "t_max": 31,
         "t_min": 23,
         "rh_max": 91,
         "rh_min": 76,
         "wind_speed": 11,
         "wind_direction": 248,
         "cloud_cover": 8
      },
      "03-08-2024": {
         "rainfall": 5,
         "t_max": 32,
         "t_min": 23,
         "rh_max": 91,
         "rh_min": 68,
         "wind_speed": 10,
         "wind_direction": 238,
         "cloud_cover": 7
      }
   },
   "names_of_crops": [
      "ଚାଉଳ",
      "ଟମାଟୋ",
      "ଓକ୍ରା/ଲେଡିଫିଙ୍ଗର",
      "ଗାଈ।"
   ],
   "general_advisory": "ନର୍ସରୀ ଶଯ୍ଯ଼ାରେ ପର୍ଯ୍ଯ଼ାପ୍ତ ଜଳ ନିଷ୍କାସନ ସୁବିଧା ଯୋଗାଇଦେବା ଉଚିତ। ଯେତେବେଳେ ବର୍ଷା ହେଉଛି, ନର୍ସରୀ ଶଯ୍ଯ଼ାକୁ ଧଳା ପଲିଥିନ୍ ଫିଲ୍ମ୍ରେ ଢାଙ୍କି ଦିଅନ୍ତୁ, କଳା ପଲିଥିନ୍ ଆଚ୍ଛାଦନରୁ ଦୂରେଇ ରୁହନ୍ତୁ କାରଣ ଏହା ତଳେ ଚାରା ଲମ୍ବା ହୋଇଥାଏ। ରୋପଣ ଏବଂ ସର୍ବୋତ୍ତମ ଉଦ୍ଭିଦ ସଂଖ୍ଯ଼ାର ରକ୍ଷଣାବେକ୍ଷଣ ପରେ ଚାରା ମୃତ୍ଯ଼ୁହାରକୁ ହ୍ରାସ କରିବା ପାଇଁ 4 ରୁ 5 ଚାରା/ପାହାଡ ସହିତ 30-45 ଦିନ ପୁରୁଣା ଚାରା ବ୍ଯ଼ବହାର କରନ୍ତୁ।",
   "crops_data": {
      "rice": {
         "advisory": [
            "ପ୍ରତିରୋପଣର 7 ଦିନ ପୂର୍ବରୁ 10 ଡେସିମାଲ୍ ନର୍ସରୀ କ୍ଷେତ୍ର ପାଇଁ 800-ଗ୍ରାମ୍ କାର୍ଟାପ୍ ହାଇଡ୍ରୋକ୍ଲୋରାଇଡ୍ 4 ପ୍ରତିଶତ ଗ୍ରାମ୍ କିମ୍ବା 400-ଗ୍ରାମ୍ କ୍ଲୋରାଣ୍ଟ୍ରାନିଲିପ୍ରୋଲ୍ 0.4 ପ୍ରତିଶତ ଗ୍ରାମ୍ ପ୍ରଯ଼ୋଗ କରନ୍ତୁ, ଯାହା ଦ୍ୱାରା ପ୍ରତିରୋପଣର 3 ସପ୍ତାହ ପର୍ଯ୍ଯ଼ନ୍ତ ପିତ୍ତନଳୀ, ଷ୍ଟେମ ବୋରର୍, କେସ୍ୱାର୍ମ୍, ପତ୍ର ଫୋଲଡର୍ ଏବଂ ରୁଟ୍ ନାଟ୍ ନେମାଟୋଡ୍ ପରିଚାଳନା କରାଯାଇପାରିବ।"
         ]
      },
      "tomato": {
         "advisory": [
            "ଟମାଟୋରେ ଫଳ ଛେଦକକୁ ପରିଚାଳନା କରିବା ପାଇଁ ପ୍ରଥମେ ପ୍ରଭାବିତ ଫଳ ଏବଂ ବିକଶିତ ଲାର୍ଭା ସଂଗ୍ରହ କରି ନଷ୍ଟ କରନ୍ତୁ | ଏକର ପିଛା ହେଲିଲ୍ଯ଼ୁର ବିଶିଷ୍ଟ 20ଟି ଫେରୋମୋନ୍ ଫାନ୍ଦ ସ୍ଥାପନ କରନ୍ତୁ। କୀଟ ସଂକ୍ରମଣର ପ୍ରାଥମିକ ପର୍ଯ୍ଯ଼ାଯ଼ରେ 200 ଲିଟର ପାଣିରେ ମିଶ୍ରଣ କରି ନିମ୍ବ-ଆଧାରିତ କୀଟନାଶକ (ଆଜାଦିରାକ୍ଟିନ) 1500 ପିପିଏମ @600-ମିଲି/ଏକର ସ୍ପ୍ରେ କରନ୍ତୁ। ଯଦି 10 ପ୍ରତିଶତ ଫଳ ଛେଦକ ଦ୍ୱାରା ସଂକ୍ରମିତ, ତେବେ କୀଟନାଶକ ସିଞ୍ଚନ କରନ୍ତୁ। ରାସାଯ଼ନିକ ନିଯ଼ନ୍ତ୍ରଣ ପାଇଁ କ୍ଲୋରାଣ୍ଟ୍ରାନିଲିପ୍ରୋଲ <ଆଇ. ଡି. 1> ଏସ୍. ସି. @80-ମିଲି/ଏକର କିମ୍ବା ଫ୍ଲୁବେଣ୍ଡିଆମାଇଡ୍ <ଆଇ. ଡି. 2> ଏମ୍/ଏମ୍. ଏସ୍. ସି. @40-ମିଲି/ଏକର କିମ୍ବା ଇଣ୍ଡୋକ୍ସାକାର୍ବ <ଆଇ. ଡି. 3> ଏସ୍. ସି. @200-ମିଲି/ଏକର ସ୍ପ୍ରେ କରନ୍ତୁ। କୀଟନାଶକ ସିଞ୍ଚନ ପାଇଁ ଏକର ପିଛା 200 ଲିଟର ପାଣି ଆବଶ୍ଯ଼କ। ଉପରୋକ୍ତ କୀଟନାଶକଗୁଡ଼ିକ ମଧ୍ଯ଼ରୁ କୌଣସିଟିକୁ 15 ଦିନ ବ୍ଯ଼ବଧାନରେ ବିକଳ୍ପ ଭାବେ ବ୍ଯ଼ବହାର କରନ୍ତୁ। (ପାଗ ସ୍ୱଚ୍ଛ ଥିବା ସମଯ଼ରେ ପ୍ରଯ଼ୋଗ କରନ୍ତୁ)"
         ]
      },
      "okra/ladyfinger": {
         "advisory": [
            "ବର୍ତ୍ତମାନର ପାଣିପାଗ ସ୍ଥିତି ହେତୁ ଓକ୍ରାରେ ଏଫିଡ୍, ଜ୍ଯାସିଡ୍, ଥ୍ରିପ୍ ଏବଂ ହ୍ୱାଇଟ୍ଫ୍ଲାଇ ପରି କୀଟ ଶୋଷିବାର ସମ୍ଭାବନା ଅଛି | ସଂକ୍ରମଣର ପ୍ରାରମ୍ଭିକ ପର୍ଯ୍ଯ଼ାଯ଼ରେ ଏହି କୀଟପତଙ୍ଗକୁ ପରିଚାଳନା କରିବା ପାଇଁ 200 ଲିଟର ପାଣିରେ ମିଶ୍ରଣ କରି ନିମ୍ବ-ଆଧାରିତ କୀଟନାଶକ (ନିମ୍ବ ତେଲ 1500 ପିପିଏମ @600-ମିଲି/ଏକର) ସ୍ପ୍ରେ କରନ୍ତୁ। ଏହି ଶୋଷକ କୀଟପତଙ୍ଗକୁ ନିଯ଼ନ୍ତ୍ରଣ କରିବା ପାଇଁ ରାସାଯ଼ନିକ ଉପାଯ଼ରେ ଥିଯ଼ାମେଥୋକ୍ସାମ୍ 25 ପ୍ରତିଶତ ଡବ୍ଲୁ. ଜି. @40 ଗ୍ରାମ୍/ଏକରରେ 200 ଲିଟର ପାଣିରେ ସିଞ୍ଚନ କରନ୍ତୁ। (ପାଣିପାଗ ସ୍ୱଚ୍ଛ ଥିବା ବେଳେ ପ୍ରଯ଼ୋଗ କରନ୍ତୁ)"
         ]
      },
      "cow": {
         "advisory": [
            "ପଶୁମାନଙ୍କୁ ପର୍ଯ୍ଯ଼ାପ୍ତ ପରିମାଣର ସ୍ୱଚ୍ଛ ପାନୀଯ଼ ଜଳ ଯୋଗାଇ ଦିଅନ୍ତୁ। ଗୋରୁମାନଙ୍କୁ ଓଦା କିମ୍ବା ପାଣିରେ ଭିଜାଇ ରଖିଥିବା ନଡ଼ିଆ ଖାଇବାକୁ ଦିଅନ୍ତୁ ନାହିଁ। ଖାଇବାକୁ ଦେବା ପୂର୍ବରୁ ଏହାକୁ ସୂର୍ଯ୍ଯ଼କିରଣ ତଳେ ଭଲ ଭାବେ ଶୁଖାନ୍ତୁ। ପଶୁମାନଙ୍କର ଘର ଏବଂ ତା 'ର ଚଟାଣ ଅଧିକ ସମଯ଼ ପର୍ଯ୍ଯ଼ନ୍ତ ଓଦା ଏବଂ ଥଣ୍ଡା ରହିବା ଉଚିତ ନୁହେଁ।"
         ]
      }
   },
   "date": "30-07-2024"
}