{
   "weather_details": {
      "2024-11-20": {
         "rainfall": 0,
         "t_max": 30,
         "t_min": 12,
         "rh_max": 76,
         "rh_min": 35,
         "wind_speed": 3,
         "wind_direction": 337,
         "cloud_cover": 2
      },
      "2024-11-21": {
         "rainfall": 0,
         "t_max": 29,
         "t_min": 12,
         "rh_max": 76,
         "rh_min": 35,
         "wind_speed": 3,
         "wind_direction": 330,
         "cloud_cover": 1
      },
      "2024-11-22": {
         "rainfall": 0,
         "t_max": 29,
         "t_min": 12,
         "rh_max": 76,
         "rh_min": 34,
         "wind_speed": 2,
         "wind_direction": 338,
         "cloud_cover": 2
      },
      "2024-11-23": {
         "rainfall": 0,
         "t_max": 29,
         "t_min": 12,
         "rh_max": 75,
         "rh_min": 32,
         "wind_speed": 2,
         "wind_direction": 90,
         "cloud_cover": 2
      },
      "2024-11-24": {
         "rainfall": 0,
         "t_max": 28,
         "t_min": 13,
         "rh_max": 68,
         "rh_min": 32,
         "wind_speed": 3,
         "wind_direction": 90,
         "cloud_cover": 1
      }
   },
   "names_of_crops": [
      "ଚାଉଳ",
      "ସବୁଜ ଚଣା",
      "ବାଇଗଣ",
      "ସାଧାରଣ ମାଛ"
   ],
   "general_advisory": "ଫସଲ ଅମଳ କରିବାର 15 ଦିନ ପୂର୍ବରୁ ଧାନ କ୍ଷେତରୁ ପାଣି ବାହାର କରନ୍ତୁ। ଶାରୀରିକ ପରିପକ୍ୱତା ସମୟରେ ଧାନ ଫସଲ ଅମଳ କରନ୍ତୁ (85 ପ୍ରତିଶତ ଶସ୍ୟ ଏକ ଗଣ୍ଠିରେ ପରିପକ୍ୱ ହୋଇଥାଏ) ଏବଂ ଏହା ଫିକା ହଳଦିଆ ରଙ୍ଗର ଦେଖାଯାଏ। ଯଦି ଶସ୍ୟକୁ ବୀଜ ଉଦ୍ଦେଶ୍ୟରେ ରଖିବାକୁ ହେବ, ତେବେ ବନ୍ଧଠାରୁ ଏକ ମିଟର ଦୂରରେ ରଖି ଫସଲ ଅମଳ କରନ୍ତୁ। 14 ପ୍ରତିଶତ ଆର୍ଦ୍ରତା ପାଇବା ପାଇଁ ଅମଳ ହୋଇଥିବା ଧାନ ଶସ୍ୟକୁ ସିଧାସଳଖ ସୂର୍ଯ୍ୟାଲୋକରେ 2ରୁ 3 ଦିନ ଶୁଖାଇ ଦିଅନ୍ତୁ। ବୀଜ ଉଦ୍ଦେଶ୍ୟରେ, ଶସ୍ୟକୁ 12 ପ୍ରତିଶତରୁ କମ୍ ଆର୍ଦ୍ରତା ପର୍ଯ୍ୟନ୍ତ ଶୁଖାଇବା ଉଚିତ୍। ଅସମୟରୁ ରକ୍ଷା ପାଇବା ପାଇଁ ସମସ୍ତ ଅମଳ ହୋଇଥିବା ଉତ୍ପାଦକୁ ସଫା ବ୍ୟାଗରେ ରଖିବା ଏବଂ ପଲିଥିନ୍ ସହିତ ଆଚ୍ଛାଦନ କରିବା ଆବଶ୍ୟକ |",
   "crops_data": {
      "rice": {
         "advisory": [
            "ଯଦି ବ୍ରାଉନ୍ ପ୍ଲାଣ୍ଟପର୍ (ବିପିଏଚ) ର ଜନସଂଖ୍ଯ଼ା ଇଟିଏଲ (5-10 ହପର୍ସ୍/ହିଲ୍) ରୁ ଅଧିକ ହୁଏ, ତେବେ ବିକଳ୍ପ ଭିଜା ଏବଂ ଶୁଖାଇବା କୌଶଳ ଦ୍ୱାରା ଧାନ କ୍ଷେତର ମାଇକ୍ରୋ-ଜଳବାଯ଼ୁ ପରିବର୍ତ୍ତନ କରିବାକୁ ପରାମର୍ଶ ଦିଆଯାଇଛି (ପାଣି ଦୀର୍ଘ ସମଯ଼ ଧରି କ୍ଷେତରେ ଠିଆ ହେବା ଉଚିତ ନୁହେଁ)। ଯଦି ସମସ୍ଯ଼ା ଜାରି ରହେ, ଟ୍ରାଇଫ୍ଲୁମେଜୋପାଇରିମ୍ 10 ପ୍ରତିଶତ ଏସ୍ସି @94 ମିଲି/ଏକର କିମ୍ବା ପାଇମେଟ୍ରୋଜିନ୍ 50 ପ୍ରତିଶତ ଡବ୍ଲୁଜି @120 ଗ୍ରାମ୍/ଏକର କିମ୍ବା ଡାଇନୋଟେଫୁରାନ୍ 20 ପ୍ରତିଶତ ଏସ୍ଜି @80 ଗ୍ରାମ୍/ଏକର କିମ୍ବା ଇମିଡାକ୍ଲୋପ୍ରିଡ୍ 17.8% ଏସ୍ଏଲ୍ @50 ମିଲି/ଏକର କିମ୍ବା ଆସେଫେଟ୍ 75 ପ୍ରତିଶତ ଏସ୍. ପି. @400 ଗ୍ରାମ୍/ଏକର ସ୍ପ୍ରେ କରନ୍ତୁ। ବିପିଏଚ ପାଇଁ ସୁପାରିସ କରାଯାଇଥିବା କୀଟନାଶକକୁ କେବଳ ନିର୍ଦ୍ଦିଷ୍ଟ ମାତ୍ରାରେ ବ୍ଯ଼ବହାର କରନ୍ତୁ। ବିପିଏଚ ସଂକ୍ରମଣ ସମଯ଼ରେ ନାଇଟ୍ରୋଜେନ ସାର ବ୍ଯ଼ବହାରରୁ ଦୂରେଇ ରୁହନ୍ତୁ।"
         ]
      },
      "green gram": {
         "advisory": [
            "ସବୁଜ ବୁଟରେ ସ୍ପୋଡୋପ୍ଟେରା ସଂକ୍ରମଣ ପରିଲକ୍ଷିତ ହୋଇଛି। ଏକର ପିଛା 200 ଲିଟର ପାଣି ପିଛା 90 ଗ୍ରାମ ଦରରେ 5 ପ୍ରତିଶତ ଏସ୍ଜି ଇମାମେକ୍ଟିନ୍ ବେନ୍ଜୋଏଟ୍ ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "brinjal": {
         "advisory": [
            "ବାଇଗଣରେ ବ୍ଯ଼ାକ୍ଟେରିଆଲ୍ ୱିଲ୍ଟ ଦେଖିବାକୁ ମିଳିଛି। ବାଇଗଣର କ୍ଷଯ଼କୁ ନିଯ଼ନ୍ତ୍ରଣ କରିବା ପାଇଁ ଏକର ପିଛା 200 ଲିଟର ପାଣିରେ 50 ଡବ୍ଲ୍ଯ଼ୁ. ପି. @600 ଗ୍ରାମ୍ + ପ୍ଲାଣ୍ଟୋମାଇସିନ୍ @200 ଗ୍ରାମ୍ ସହିତ ମୃତ୍ତିକା ଆବର୍ଜନା ପକାନ୍ତୁ।"
         ]
      },
      "common fish": {
         "advisory": [
            "ଶୀତ ଋତୁରେ, ମାଛରେ ବିଭିନ୍ନ ଫଙ୍ଗଲ୍, ବ୍ୟାକ୍ଟେରିଆ ଏବଂ ପରଜୀବୀ ରୋଗ ଦେଖାଯାଇପାରେ | ଶୀତଋତୁ ଆରମ୍ଭ ହେବାର ଠିକ୍ ପୂର୍ବରୁ ପୋଖରୀକୁ ସି. ଆଇ. ଏଫ୍. ଏ. ଏକ୍ସ. @400 ମିଲି/ଏକରରେ ବ୍ୟବହାର କରନ୍ତୁ। ପୋଖରୀରେ ପୋଟାସିୟମ୍ ପର୍ମାଙ୍ଗାନେଟ୍ ପ୍ରତି ଏକର ପିଛା 1 ରୁ 2 କି. ଗ୍ରା. କିମ୍ବା ଚୂନପଥର ପ୍ରତି ଏକର ପିଛା 1 ରୁ 1 କି. ଗ୍ରା. ବ୍ୟବହାର କରନ୍ତୁ। ଏକର ପିଛା 100 କିଲୋଗ୍ରାମ ଲବଣ ପ୍ରୟୋଗ ମଧ୍ୟ ଶୀତ ଋତୁରେ ମାଛମାନଙ୍କୁ ରୋଗ ପ୍ରାଦୁର୍ଭାବରୁ ରକ୍ଷା କରିବାରେ ସାହାଯ୍ୟ କରିଥାଏ।"
         ]
      }
   },
   "date": "19-11-2024"
}