{
   "weather_details": {
      "14-09-2024": {
         "rainfall": 10,
         "t_max": 28,
         "t_min": 25,
         "rh_max": 87,
         "rh_min": 63,
         "wind_speed": 10,
         "wind_direction": 281,
         "cloud_cover": 8
      },
      "15-09-2024": {
         "rainfall": 10,
         "t_max": 29,
         "t_min": 24,
         "rh_max": 87,
         "rh_min": 80,
         "wind_speed": 13,
         "wind_direction": 269,
         "cloud_cover": 8
      },
      "16-09-2024": {
         "rainfall": 5,
         "t_max": 32,
         "t_min": 24,
         "rh_max": 93,
         "rh_min": 64,
         "wind_speed": 15,
         "wind_direction": 244,
         "cloud_cover": 6
      },
      "17-09-2024": {
         "rainfall": 5,
         "t_max": 28,
         "t_min": 24,
         "rh_max": 91,
         "rh_min": 81,
         "wind_speed": 13,
         "wind_direction": 235,
         "cloud_cover": 6
      },
      "18-09-2024": {
         "rainfall": 5,
         "t_max": 31,
         "t_min": 26,
         "rh_max": 91,
         "rh_min": 81,
         "wind_speed": 13,
         "wind_direction": 235,
         "cloud_cover": 6
      }
   },
   "names_of_crops": [
      "ଚାଉଳ",
      "ଲଙ୍କା",
      "ବାଇଗଣ"
   ],
   "general_advisory": "ବଲାଙ୍ଗିର ଜିଲ୍ଲାରେ ଆଗାମୀ 5 ଦିନ ଆକାଶ ସାଧାରଣତଃ ମେଘୁଆ ରହିବା ସହିତ ହାଲୁକା ବର୍ଷା ହେବାର ସମ୍ଭାବନା ରହିଛି। ସର୍ବାଧିକ ତାପମାତ୍ରା 29-33 °C ଏବଂ ସର୍ବନିମ୍ନ ତାପମାତ୍ରା 19-25 °C ମଧ୍ଯ଼ରେ ରହିବ। ସର୍ବାଧିକ ଏବଂ ସର୍ବନିମ୍ନ ଆପେକ୍ଷିକ ଆର୍ଦ୍ରତା ଯଥାକ୍ରମେ 88-93% ଏବଂ 63-71% ହେବ। ଆଗାମୀ 5 ଦିନ ପର୍ଯ୍ଯ଼ନ୍ତ ପବନର ବେଗ ଘଣ୍ଟାପ୍ରତି 14 ରୁ 16 କିଲୋମିଟର ମଧ୍ଯ଼ରେ ରହିବ। କେତେକ ଫସଲରୁ ଅତିରିକ୍ତ ପାଣି ବାହାର କରନ୍ତୁ, ପନିପରିବା ଗଛକୁ ଷ୍ଟାକିଂ ପ୍ରଦାନ କରନ୍ତୁ, ଏବଂ ଆବଶ୍ଯ଼କତା ଅନୁଯାଯ଼ୀ ଫସଲରେ କୀଟନାଶକ କିମ୍ବା କୀଟନାଶକ ସ୍ପ୍ରେ କରନ୍ତୁ |",
   "crops_data": {
      "rice": {
         "advisory": [
            "ଫସଲଟି ସକ୍ରିୟ ଚାଷ ପର୍ଯ୍ୟାୟରେ ରହିଛି। ହଳଦିଆ କାଣ୍ଡ ଛେଦକ ଦ୍ୱାରା ସଂକ୍ରମଣ ପାଇଁ ଅନୁକୂଳ ପରିସ୍ଥିତି | କାଣ୍ଡ ଛେଦକକୁ ପରିଚାଳନା କରିବା ପାଇଁ କାର୍ଟାପ୍ ହାଇଡ୍ରୋକ୍ଲୋରାଇଡ୍ କିମ୍ବା କ୍ଲୋରାଣ୍ଟ୍ରାନିଲିପ୍ରୋଲ୍ କିମ୍ବା ଇମିଡାକ୍ଲୋପ୍ରିଡ୍ ପ୍ରୟୋଗ କରନ୍ତୁ।"
         ]
      },
      "chilli": {
         "advisory": [
            "ଲଙ୍କା ଫସଲ ଚାରା ରୋପଣ ପର୍ଯ୍ୟାୟରେ ରହିଛି। ମାଙ୍କୋଜେବ୍ କିମ୍ବା ପତ୍ର ସ୍ପ୍ରେ ଦ୍ୱାରା ମାଟାଲ୍ୟାକ୍ସିଲ୍ କିମ୍ବା ମେଟାଲ୍ୟାକ୍ସିଲ୍ + ମାଙ୍କୋଜେବ୍ ଦ୍ୱାରା ମୃତ୍ତିକାକୁ ଭିଜାଇ ଦିଅନ୍ତୁ, ଯାହା ଦ୍ୱାରା ରୋଗ ହ୍ରାସ ପାଇବ ନାହିଁ।"
         ]
      },
      "brinjal": {
         "advisory": [
            "ବାଇଗଣ ଫୁଲ ଫୁଟାଇବା ଠାରୁ ଆରମ୍ଭ କରି ଫଳ ଧାରଣ କରିବା ପର୍ଯ୍ଯ଼ନ୍ତ ପର୍ଯ୍ଯ଼ାଯ଼ରେ ରହିଛି। ଶୁଟ୍ ଏବଂ ଫଳ ଛେଦକଙ୍କ ପାଇଁ ଅନୁକୂଳ ପରିସ୍ଥିତି। ଫେରୋମୋନ୍ ଟ୍ରାପ୍ ସ୍ଥାପନ କରନ୍ତୁ ଏବଂ କୀଟ ପରିଚାଳନା ପାଇଁ ଏମାମେକ୍ଟିନ୍ ବେନ୍ଜୋଏଟ୍ କିମ୍ବା କ୍ଲୋରାଣ୍ଟ୍ରାନିଲିପ୍ରୋଲ୍ ପରି ରାସାଯ଼ନିକ ନିଯ଼ନ୍ତ୍ରଣ ବ୍ଯ଼ବହାର କରନ୍ତୁ |"
         ]
      }
   },
   "date": "13-09-2024"
}