{
   "weather_details": {
      "10-09-2024": {
         "rainfall": 30,
         "t_max": 29,
         "t_min": 24,
         "rh_max": 70,
         "rh_min": 90,
         "wind_speed": 15,
         "wind_direction": 230,
         "cloud_cover": 8
      },
      "11-09-2024": {
         "rainfall": 2,
         "t_max": 30,
         "t_min": 24,
         "rh_max": 70,
         "rh_min": 90,
         "wind_speed": 15,
         "wind_direction": 246,
         "cloud_cover": 8
      },
      "12-09-2024": {
         "rainfall": 5,
         "t_max": 31,
         "t_min": 24,
         "rh_max": 67,
         "rh_min": 90,
         "wind_speed": 15,
         "wind_direction": 250,
         "cloud_cover": 8
      },
      "13-09-2024": {
         "rainfall": 5,
         "t_max": 32,
         "t_min": 24,
         "rh_max": 81,
         "rh_min": 93,
         "wind_speed": 15,
         "wind_direction": 239,
         "cloud_cover": 6
      },
      "14-09-2024": {
         "rainfall": 5,
         "t_max": 32,
         "t_min": 25,
         "rh_max": 70,
         "rh_min": 89,
         "wind_speed": 17,
         "wind_direction": 239,
         "cloud_cover": 6
      }
   },
   "names_of_crops": [
      "ଚାଉଳ",
      "କପା",
      "ପନିପରିବା ଫସଲ",
      "କଦଳୀ",
      "ଗାଈ/ମଇଁଷି"
   ],
   "general_advisory": "ଗୋଟିଏ କିମ୍ବା ଦୁଇଟି ସ୍ଥାନରେ ପ୍ରବଳ ବର୍ଷା ସହିତ ହାଲୁକା ରୁ ମଧ୍ୟମ ବର୍ଷା ହେବାର ସମ୍ଭାବନା ରହିଛି ଏବଂ ବଜ୍ରପାତ ଏବଂ ବଜ୍ରପାତ 10.09.2024 ରୁ 11.09.224 ର 8:30 ଘଣ୍ଟା ମଧ୍ୟରେ, ତେଣୁ କୃଷକମାନଙ୍କୁ ଜଳସେଚନ ଏବଂ ସିଞ୍ଚନ କାର୍ଯ୍ୟ ପାଇଁ ଆଉ ଗୋଟିଏ ଦିନ ଅପେକ୍ଷା କରିବାକୁ ପରାମର୍ଶ ଦିଆଯାଇଛି ଏବଂ ସେମାନଙ୍କ ପଶୁମାନଙ୍କୁ କୌଣସି ବୈଦ୍ୟୁତିକ ଉପକରଣରୁ ଦୂରରେ ରଖିବାକୁ ପରାମର୍ଶ ଦିଆଯାଇଛି। ଫସଲ କ୍ଷେତରୁ ଅତିରିକ୍ତ ଜଳ ନିଷ୍କାସନ କରିବା ଏବଂ ଭବିଷ୍ୟତରେ ବ୍ୟବହାର ପାଇଁ ନିକଟସ୍ଥ ବନ୍ଧ/ପୋଖରୀରେ ସେହି ଜଳ ସଂରକ୍ଷଣ କରିବା ପାଇଁ ପରାମର୍ଶ ଦିଆଯିବା ଉଚିତ।",
   "crops_data": {
      "rice": {
         "advisory": [
            "ସଠିକ ବୃଦ୍ଧି ପାଇଁ କୃଷକମାନେ ଧାନ କ୍ଷେତରେ 5 ସେ. ମି. ଜଳ ସ୍ତର ବଜାୟ ରଖିବା ଉଚିତ।",
            "ବର୍ଷା ପରେ ଧାନ କ୍ଷେତରେ ଶୀଥ୍ ବ୍ଲାଇଟ୍ ଏବଂ ଶୀଥ୍ ରଟ୍ ରୋଗର ସଂକ୍ରମଣ ହେବାର ସମ୍ଭାବନା ଥାଏ, ତେଣୁ ଏହି ରୋଗକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ କୃଷକମାନେ ଟ୍ରାଇଫ୍ଲୋକ୍ସିସ୍ଟ୍ରୋବିନ୍ 25 ପ୍ରତିଶତ + ଟେବୁକୋନାଜୋଲ୍ 50 ପ୍ରତିଶତ ଡବ୍ଲୁଜି @80 ଗ୍ରାମ୍ କିମ୍ବା ପ୍ରୋପିକୋନାଜୋଲ୍ 25 ପ୍ରତିଶତ @200 ମିଲି କିମ୍ବା ହେକ୍ଟର ପିଛା 200 ଲିଟର ପାଣିରେ ହେକ୍ସାକୋନାଜୋଲ୍ 5 ପ୍ରତିଶତ ଏସ୍ସି @250 ମିଲି ସ୍ପ୍ରେ କରିବା ଉଚିତ୍। 7-10 ଦିନର ବ୍ୟବଧାନରେ ସ୍ପ୍ରେକୁ ପୁନରାବୃତ୍ତି କରନ୍ତୁ।"
         ]
      },
      "cotton": {
         "advisory": [
            "କପା ଫସଲରେ ଫୁଲ ହ୍ରାସକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ, ବୀଜ ବୁଣିବା ପରେ 60-65 ଦିନ ପରେ ଏକର ପିଛା 200 ଲିଟର ପାଣିରେ 90 ମିଲି ପ୍ଲାନୋଫିକ୍ସ ଲଗାନ୍ତୁ।",
            "କପା ଫସଲରେ ଶୋଷକ କୀଟପତଙ୍ଗ (ଏଫିଡ୍, ଥ୍ରିପ୍ସ ଇତ୍ୟାଦି) ଆକ୍ରମଣକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ, ନିମ୍ବ ଆଧାରିତ କୀଟନାଶକ ଯେପରିକି ନିମ୍ବ ତେଲ @600-800 ml + 200 ଗ୍ରାମ୍ ଡିଟର୍ଜେଣ୍ଟ ପାଉଡରକୁ ଏକର ପିଛା 200 ଲିଟର ପାଣି ସହିତ ମିଶାଇ ବ୍ୟବହାର କରିବା ଉଚିତ।",
            "ଫୁଲ ଫୁଟିବାର ପ୍ରାରମ୍ଭିକ ପର୍ଯ୍ୟାୟରେ, କୃଷକମାନେ କପା ଫସଲରେ କୌଣସି ରାସାୟନିକ ପ୍ରୟୋଗରୁ ଦୂରେଇ ରହିବା ଉଚିତ୍।"
         ]
      },
      "vegetable crops": {
         "advisory": [
            "ବାଇଗଣ, ଟମାଟୋ, ଓକ୍ରା ଆଦିରେ ଫଳ ଏବଂ ଶୁଣ୍ଠି ଛେଦକକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ ପ୍ରାରମ୍ଭିକ ପର୍ଯ୍ୟାୟରେ ଏକର ପିଛା 600 ମିଲିଲିଟର ହାରରେ ନିମ ଆଧାରିତ କୀଟନାଶକ 1500 ପିପିଏମ ସିଞ୍ଚନ କରିବାକୁ ପରାମର୍ଶ ଦିଆଯିବା ଉଚିତ। ଗୁରୁତର କ୍ଷେତ୍ରରେ, 15 ଦିନର ବ୍ୟବଧାନରେ ଏକର ପିଛା ସ୍ପିନୋସାଦ୍ 45 ପ୍ରତିଶତ ଏସ୍. ସି. @70 ମିଲି ଏବଂ ଇମାମେକ୍ଟିନ୍ ବେନ୍ଜୋଏଟ୍ @80 ଗ୍ରାମ୍ ବିକଳ୍ପ ସ୍ପ୍ରେ କରିବା ପାଇଁ ପରାମର୍ଶ ଦିଆଯିବା ଉଚିତ।",
            "ଯଦି ଶୋଷକ କୀଟ ଆକ୍ରମଣ ଲକ୍ଷ୍ୟ କରାଯାଏ, ତେବେ ଥାଇମେଥୋକ୍ସାମ୍ @0.20 ଗ୍ରାମ୍ କିମ୍ବା ଇମିଡାକ୍ଲୋପ୍ରିଡ୍ @0.33 ମିଲି ଲିଟର ପ୍ରତି ପାଣି ସିଞ୍ଚନ କରିବାକୁ ପରାମର୍ଶ ଦିଆଯିବା ଉଚିତ।",
            "ୱିଲ୍ଟ, ରୁଟ୍ ରଟ୍ ଇତ୍ୟାଦି କିଛି ରୋଗକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ କୃଷକମାନେ ବିନା ବର୍ଷା ଅବସ୍ଥାରେ ଲିଟର ପିଛା 2 ଗ୍ରାମ୍ କାର୍ବେନଡାଜିମ୍ କିମ୍ବା 3 ମିଲି ଲିଟର କପର୍ ଅକ୍ସାଇକ୍ଲୋରାଇଡ୍ ବ୍ୟବହାର କରିବା ଉଚିତ୍।"
         ]
      },
      "banana": {
         "advisory": [
            "ପ୍ରଚଳିତ ପାଣିପାଗ ସ୍ଥିତି କଦଳୀ ଗଛରେ ଥ୍ରୀପ୍ ଆକ୍ରମଣ ପାଇଁ ଅନୁକୂଳ, ତେଣୁ ପ୍ରାରମ୍ଭିକ ପର୍ଯ୍ୟାୟରେ ଢାଙ୍କୁଣି କିମ୍ବା ବଣ୍ଡିଲ୍କୁ ଝୋଟ ବ୍ୟାଗରେ ଆବୃତ କରନ୍ତୁ, ସେହି ଅଞ୍ଚଳ ଆଗାଛା ମୁକ୍ତ ହେବା ଉଚିତ, ଏବଂ ଏହି କୀଟକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ ଏକର ପିଛା ନୀଳ ଷ୍ଟିକ୍ କାର୍ଡର 15-20 ନମ୍ବର ବ୍ୟବହାର କରିବାକୁ ପରାମର୍ଶ ଦିଆଯିବା ଉଚିତ। ରାସାୟନିକ ନିୟନ୍ତ୍ରଣ ପାଇଁ, ଲିଟର ପିଛା 2 ଗ୍ରାମ୍ (15 ଦିନ ବ୍ୟବଧାନରେ ଦୁଇଥର) ରେ 50 ପ୍ରତିଶତ ଡବ୍ଲ୍ୟୁ. ପି. ଡାଏଫେନ୍ଥିଓରନ୍ ସିଞ୍ଚନ କରିବା ଉଚିତ।"
         ]
      },
      "cow/buffalo": {
         "advisory": [
            "ବର୍ତ୍ତମାନର ଅବସ୍ଥାରେ କେତେକ ପଶୁମାନଙ୍କଠାରେ ମାସ୍ତାଇଟିସ୍ ରୋଗ ମଧ୍ୟ ଦେଖାଯାଏ, ଯେଉଁ କାରଣରୁ ଦୁଗ୍ଧ ଉତ୍ପାଦନ ଏବଂ ଗୁଣବତ୍ତା ବାଧାପ୍ରାପ୍ତ ହୋଇପାରେ, ତେଣୁ ଏହି ରୋଗକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ କେତେକ ପ୍ରତିଷେଧକ ତଥା ନିୟନ୍ତ୍ରଣ ପଦକ୍ଷେପ ଯଥା ଆଣ୍ଟିସେପ୍ଟିକ୍ ତରଳ ପଦାର୍ଥ ସହିତ ବୁଡ଼ାଇବା ପୂର୍ବରୁ ଏବଂ ପରେ, ଉପଯୁକ୍ତ ପରିମଳ ବ୍ୟବସ୍ଥା, ଓଦା ଚଟାଣକୁ ରୋକିବା, ଖାଇବା ସମୟରେ ଏବଂ କ୍ଷୀର ଦୋଇବା ପରେ ପଶୁମାନଙ୍କୁ ବସିବା ଏଡ଼ାଇବା ପାଇଁ ଟିଟ୍ ସ୍ଫିଂକ୍ଟର୍ ବନ୍ଦ କରିବା ପୂର୍ବରୁ, ବିଶ୍ରାମ ଚଟାଣରେ ଚୂନ ପ୍ରୟୋଗ, ସକାଳେ ଏବଂ ସନ୍ଧ୍ୟାରେ ଏକ ଲିଟର ପାଣିରେ 2 ଲେମ୍ବୁ ଏବଂ 200 ଗ୍ରାମ୍ ଚିନି ମିଶ୍ରଣ ପ୍ରଦାନ କରିବା ଇତ୍ୟାଦି ଗ୍ରହଣ କରାଯିବା ଉଚିତ। କ୍ଷେତରେ ମଧୁର ଜଳର ଉପଲବ୍ଧତା ସୁନିଶ୍ଚିତ କରାଯିବା ଉଚିତ।"
         ]
      }
   },
   "date": "10-09-2024"
}