{
   "weather_details": {
      "19-10-2024": {
         "rainfall": 0,
         "t_max": 35,
         "t_min": 25,
         "rh_max": 90,
         "rh_min": 58,
         "wind_speed": 4,
         "wind_direction": 66,
         "cloud_cover": 4
      },
      "20-10-2024": {
         "rainfall": 0,
         "t_max": 35,
         "t_min": 25,
         "rh_max": 89,
         "rh_min": 55,
         "wind_speed": 5,
         "wind_direction": 45,
         "cloud_cover": 6
      },
      "21-10-2024": {
         "rainfall": 0,
         "t_max": 35,
         "t_min": 25,
         "rh_max": 87,
         "rh_min": 52,
         "wind_speed": 4,
         "wind_direction": 48,
         "cloud_cover": 6
      },
      "22-10-2024": {
         "rainfall": 0,
         "t_max": 34,
         "t_min": 24,
         "rh_max": 80,
         "rh_min": 44,
         "wind_speed": 4,
         "wind_direction": 35,
         "cloud_cover": 5
      },
      "23-10-2024": {
         "rainfall": 0,
         "t_max": 34,
         "t_min": 24,
         "rh_max": 75,
         "rh_min": 41,
         "wind_speed": 6,
         "wind_direction": 18,
         "cloud_cover": 4
      }
   },
   "names_of_crops": [
      "ଚାଉଳ",
      "କପା",
      "ଓକ୍ରା",
      "କୋଲେ ଫସଲ",
      "ଆମ୍ବ",
      "ଗାଈ/ମଇଁଷି"
   ],
   "general_advisory": "ଆଗାମୀ ଦିନରେ ପାଗ ଶୁଖିଲା ରହିବ ବୋଲି ଆଶା କରାଯାଉଛି, ତେଣୁ କୃଷକମାନଙ୍କୁ ସେହି ସମଯ଼ରେ କୃଷି କାର୍ଯ୍ଯ଼ (ଜଳସେଚନ, ସିଞ୍ଚନ, ଆନ୍ତଃସାଂସ୍କୃତିକ କାର୍ଯ୍ଯ଼ ଇତ୍ଯ଼ାଦି) କରିବାକୁ ପରାମର୍ଶ ଦିଆଯାଇଛି। ପଶୁମାନଙ୍କୁ ଉପଯୁକ୍ତ ଖାଦ୍ଯ଼ ପାଇବା ପାଇଁ ସବୁଜ ପଶୁଖାଦ୍ଯ଼ ବୁଣିବା ପାଇଁ ପରାମର୍ଶ ଦିଆଯିବା ଉଚିତ। କୃଷକମାନେ ନର୍ସରୀ ବୁଣିବା ଏବଂ କୋଲ୍ ଫସଲ ଏବଂ ଅନ୍ଯ଼ାନ୍ଯ଼ ଶୀତ ଋତୁ ପନିପରିବା ରୋପଣ କରିବା ଆରମ୍ଭ କରିବା ଉଚିତ୍। ପଶୁମାନଙ୍କୁ ପାଦ ଏବଂ ମୁଖ ରୋଗ ଏବଂ ବ୍ରୁସେଲୋସିସ୍ ବିରୁଦ୍ଧରେ କୃମି ଦୂରୀକରଣ ଏବଂ ଟୀକାକରଣ ପରାମର୍ଶ ଦିଆଯିବା ଉଚିତ।",
   "crops_data": {
      "rice": {
         "advisory": [
            "ଆଗାମୀ ଦିନରେ ବର୍ଷା ହେବାର ସମ୍ଭାବନା ବହୁତ କମ୍ ଥିବାରୁ କୃଷକମାନେ ଗୋଟିଏ ଜଳସେଚନ କରି ଧାନ କ୍ଷେତରେ ପର୍ଯ୍ଯ଼ାପ୍ତ ଆର୍ଦ୍ରତା ବଜାଯ଼ ରଖିବା ଉଚିତ।",
            "ଧାନ କ୍ଷେତରେ ପିତ୍ତ ମିଜ୍ ଆକ୍ରମଣକୁ ନିଯ଼ନ୍ତ୍ରଣ କରିବା ପାଇଁ କୃଷକମାନେ ଲାମ୍ବା-ସାଇହାଲୋଥ୍ରିନ୍ 0.5% ଇସି @100 ମିଲି, ଥାଯ଼ାମେଥୋକ୍ସାମ୍ 25% ଡବ୍ଲୁଜି @40 ଗ୍ରାମ୍ କିମ୍ବା ଫିପ୍ରୋନିଲ୍ 5% ଏସସି @400 ମିଲି କିମ୍ବା କ୍ଲୋରୋପାଇରିଫସ୍ 20 ଇସି @500 ମିଲି ଏକର ପିଛା 200 ଲିଟର ପାଣିରେ ସଫା ଏବଂ ଶାନ୍ତ ପାଣିପାଗ ସ୍ଥିତିରେ ସ୍ପ୍ରେ କରିବା ଉଚିତ୍।",
            "ପତ୍ର ଫୋଲଡରକୁ ନିଯ଼ନ୍ତ୍ରଣ କରିବା ପାଇଁ, ସ୍ୱଚ୍ଛ ପାଗ ସମଯ଼ରେ ଏକର ପିଛା 200 ଲିଟର ପାଣିରେ କ୍ଲୋରାଣ୍ଟ୍ରାନିଲିପ୍ରୋଲ 18.5% ଏସ୍ସି @60 ମିଲି କିମ୍ବା ଟେଟ୍ରାନିଲିପ୍ରୋଲ 200 ଏସ୍ସି @100-120 ମିଲି କିମ୍ବା ଫ୍ଲୁବେଣ୍ଡିଆମାଇଡ୍ 20 ଡବ୍ଲୁଜି 50 ଗ୍ରାମ୍ ସିଞ୍ଚନ କରିବା ଉଚିତ।"
         ]
      },
      "cotton": {
         "advisory": [
            "କପା ଫସଲରେ ବୋଲୱର୍ମ କମ୍ପ୍ଲେକ୍ସକୁ ନିଯ଼ନ୍ତ୍ରଣ କରିବା ପାଇଁ, କୃଷକମାନଙ୍କୁ ସ୍ୱଚ୍ଛ ପାଗରେ 10 ଲିଟର ପାଣିରେ 5 ପ୍ରତିଶତ ଏସ୍ଜି @4ଜି କିମ୍ବା ପ୍ରୋଫେନୋଫସ୍ 50 ପ୍ରତିଶତ ଇସି @30 ମିଲି ସିଞ୍ଚନ କରିବାକୁ ପରାମର୍ଶ ଦିଆଯାଇଛି।"
         ]
      },
      "okra": {
         "advisory": [
            "ଓକ୍ରା ଆଦିରେ ଫଳ ଏବଂ ଅଙ୍କୁର ଛେଦକକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ ପ୍ରାରମ୍ଭିକ ପର୍ଯ୍ୟାୟରେ ଏକର ପିଛା ନିମ୍ବ ଆଧାରିତ କୀଟନାଶକ 1500 ପିପିଏମ @600ml ସିଞ୍ଚନ କରିବାକୁ ପରାମର୍ଶ ଦିଆଯିବା ଉଚିତ। ଗୁରୁତର କ୍ଷେତ୍ରରେ, 15 ଦିନର ବ୍ୟବଧାନରେ ଏକର ପିଛା ସ୍ପିନୋସାଦ୍ 45 ପ୍ରତିଶତ ଏସ୍. ସି. @70 ମିଲି ଏବଂ ଇମାମେକ୍ଟିନ୍ ବେନ୍ଜୋଏଟ୍ @80 ଗ୍ରାମ୍ ବିକଳ୍ପ ସ୍ପ୍ରେ କରିବା ପାଇଁ ପରାମର୍ଶ ଦିଆଯିବା ଉଚିତ।"
         ]
      },
      "cole crop": {
         "advisory": [
            "ନର୍ସରୀ ଶଯ୍ଯ଼ା 3 ମିଟର ଲମ୍ବ, 1 ମିଟର ଚଉଡ଼ା ଏବଂ 15-20 ସେ. ମି. ଉଚ୍ଚତା ସହିତ ପ୍ରସ୍ତୁତ ହେବା ଉଚିତ୍। ବୁଣିବା ପୂର୍ବରୁ, ପ୍ରତ୍ଯ଼େକ ନର୍ସରୀ ଶଯ୍ଯ଼ାରେ <ଆଇ. ଡି. 1>................................................। ଉନ୍ନତ କିସମ କ୍ଷେତ୍ରରେ, 200-250 ଗ୍ରାମ୍ ମଞ୍ଜି ଏବଂ ହାଇବ୍ରିଡ୍ 100-150 ଗ୍ରାମ୍ ମଞ୍ଜି ଏକ ଏକର କ୍ଷେତ୍ର ପାଇଁ ଆବଶ୍ଯ଼କ ହୋଇଥାଏ।",
            "ଯେଉଁଠାରେ ଜଳସେଚନ ସୁବିଧା ଉପଲବ୍ଧ ଅଛି, ସେଠାରେ ପୂର୍ବରୁ ପ୍ରସ୍ତୁତ ଜମିରେ ଫସଲ ରୋପଣ କରିବାକୁ ପରାମର୍ଶ ଦିଆଯାଇଛି।"
         ]
      },
      "mango": {
         "advisory": [
            "ପୁରୁଣା ଆମ୍ବ ବଗିଚାରେ, ଆଗାଛା, ରୋଗାକ୍ରାନ୍ତ ଏବଂ ସଂକ୍ରମିତ ଶାଖା ଏବଂ ପତ୍ରର ପ୍ରଶିକ୍ଷଣ, ଛାଣିବା ଏବଂ ସଫା କରିବା ପାଇଁ ପରାମର୍ଶ ଦିଆଯିବା ଉଚିତ। ଯଦି ପତ୍ର ୱେବର୍ ସଂକ୍ରମଣ ହୁଏ, ତେବେ କ୍ୱିନାଲ୍ଫସ୍ 20 ଇ. ସି. ଲିଟର ପିଛା 2.5 ମିଲି. ରେ ସ୍ପ୍ରେ କରିବାକୁ ପରାମର୍ଶ ଦିଆଯିବା ଉଚିତ।",
            "ନୂତନ ଭାବରେ ରୋପଣ କରାଯାଇଥିବା ଆମ୍ବ ବଗିଚାରେ, ଯଦି ପତ୍ର କାଟିବା ଦ୍ୱାରା କୀଟ ଆକ୍ରମଣ ହୁଏ, ତେବେ କୃଷକମାନେ ଏହି କୀଟକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ ଲିଟର ପିଛା ଲାମ୍ବଡା ସାଇହାଲୋଥ୍ରିନ୍ 5 ପ୍ରତିଶତ ଇସି @0.5-1 ମିଲି କିମ୍ବା କ୍ଲୋରୋପାଇରିଫୋସ୍ 20 ଇସି @ଲିଟର ପିଛା 2 ମିଲି କିମ୍ବା ସ୍ପିନୋସାଡ୍ 45 ପ୍ରତିଶତ ଏସସି @ଲିଟର ପିଛା 0.4 ମିଲି କିମ୍ବା କ୍ୱିନାଲଫୋସ୍ 20 ଇସି @ଲିଟର ପିଛା 2 ମିଲି ସିଞ୍ଚନ କରିବା ଉଚିତ।"
         ]
      },
      "cow/buffalo": {
         "advisory": [
            "ଏଫଏମଡି ହେଉଛି ଏକ ଅତ୍ଯ଼ଧିକ ସଂକ୍ରାମକ ଭାଇରାଲ ରୋଗ ଯାହା ଜିଭ ଏବଂ ଓଠରେ, ପାଟିରେ, ଦାନ୍ତରେ ଏବଂ ଖୁର ମଧ୍ଯ଼ରେ ଜ୍ୱର ଏବଂ ଫୋଡ଼ା ପରି ଘା ଦ୍ୱାରା ଚିହ୍ନିତ | ବଯ଼ସ୍କ ପଶୁମାନଙ୍କ କ୍ଷେତ୍ରରେ ଏହି ରୋଗ କ୍ୱଚିତ୍ ମାରାତ୍ମକ ହୋଇଥାଏ, କିନ୍ତୁ ଛୋଟ ପଶୁମାନଙ୍କ କ୍ଷେତ୍ରରେ ମୃତ୍ଯ଼ୁ ହାର ଅଧିକ ରହିଥାଏ। ତେଣୁ କିଛି ପ୍ରତିଷେଧକ ଏବଂ ନିଯ଼ନ୍ତ୍ରଣ ପଦକ୍ଷେପ ନିମ୍ନରେ ଦିଆଯାଇଛିଃ -",
            "ଗୋରୁ ଏବଂ ମଇଁଷି ବାଛୁରୀମାନଙ୍କୁ 4 ରୁ 5 ମାସ ବଯ଼ସ ହେବା ପରେ ପ୍ରାଥମିକ ଟୀକାକରଣ କରାଯିବା ଉଚିତ ଏବଂ ପ୍ରତି ଛଅ ମାସରେ ସମାନ ପୁନରାବୃତ୍ତି କରିବା ଉଚିତ୍ | କୃମି ଦୂରୀକରଣ ପାଇଁ ପରାମର୍ଶ ଦିଆଯିବା ଉଚିତ।",
            "ପ୍ରଭାବିତ ପଶୁମାନଙ୍କର ପାଟି ଏବଂ ପାଦ 0.1% (1 ଗ୍ରାମ୍/ଲିଟର ପାଣି) ପୋଟାସିଯ଼ମ୍ ପର୍ମାଙ୍ଗାନେଟ୍ (କେଏମ୍ଏନ୍ଓ4) ଆଣ୍ଟିସେପ୍ଟିକ୍ ମାଉଥ୍ ୱାଶ୍ ଦ୍ୱାରା ଦିନକୁ 3ରୁ 4 ଥର ଧୋଇବା ଉଚିତ। କ୍ଷତ ଉପରେ ଗ୍ଲିସରିନ୍ ଲଗାଯାଇପାରେ। ଆକ୍ରାନ୍ତ ପଶୁମାନଙ୍କୁ ସୁସ୍ଥ ପଶୁମାନଙ୍କଠାରୁ ଅଲଗା କରନ୍ତୁ।",
            "ଯୋଗ୍ୟ ପଶୁ ଚିକିତ୍ସକଙ୍କ ସହିତ ଆଣ୍ଟିବାୟୋଟିକ ଚିକିତ୍ସା ଏବଂ ପରାମର୍ଶ କରାଯିବା ଉଚିତ୍।"
         ]
      }
   },
   "date": "18-10-2024"
}