{
   "weather_details": {
      "11-01-2025": {
         "rainfall": 0,
         "t_max": 28,
         "t_min": 12,
         "rh_max": 59,
         "rh_min": 23,
         "wind_speed": 2,
         "wind_direction": 346,
         "cloud_cover": 2
      },
      "12-01-2025": {
         "rainfall": 0,
         "t_max": 29,
         "t_min": 13,
         "rh_max": 52,
         "rh_min": 20,
         "wind_speed": 4,
         "wind_direction": 350,
         "cloud_cover": 2
      },
      "13-01-2025": {
         "rainfall": 0,
         "t_max": 29,
         "t_min": 14,
         "rh_max": 58,
         "rh_min": 25,
         "wind_speed": 4,
         "wind_direction": 10,
         "cloud_cover": 3
      },
      "14-01-2025": {
         "rainfall": 0,
         "t_max": 30,
         "t_min": 14,
         "rh_max": 52,
         "rh_min": 20,
         "wind_speed": 4,
         "wind_direction": 350,
         "cloud_cover": 2
      },
      "15-01-2025": {
         "rainfall": 0,
         "t_max": 30,
         "t_min": 14,
         "rh_max": 58,
         "rh_min": 25,
         "wind_speed": 4,
         "wind_direction": 10,
         "cloud_cover": 3
      }
   },
   "names_of_crops": [
      "ଖରିଫ ଚାଉଳ",
      "ଶୁଖିଲା ଋତୁ ଚାଉଳ",
      "ସୋରିଷ",
      "ଫଳ ଏବଂ ପନିପରିବା ଫସଲ",
      "ପଶୁପାଳନ"
   ],
   "general_advisory": "ଆଇ. ଏମ୍. ଡି., ଏମ୍. ସି., ଭୁବନେଶ୍ୱରର ବର୍ଦ୍ଧିତ ପରିସୀମା ପୂର୍ବାନୁମାନ ଅନୁଯାୟୀ, ସପ୍ତାହ-1 (ଜାନୁଆରୀ 10 ରୁ 16,2025) ଏବଂ ସପ୍ତାହ-2 (ଜାନୁଆରୀ 17 ରୁ 23,2025) ମଧ୍ୟରେ ଓଡ଼ିଶାର ଜିଲ୍ଲାଗୁଡ଼ିକରେ ଶୁଖିଲା ପାଗ ସହିତ ସ୍ୱାଭାବିକ ଠାରୁ କମ୍ ସର୍ବନିମ୍ନ ତାପମାତ୍ରା ଆଶା କରାଯାଏ, ତେଣୁ କୃଷକମାନଙ୍କୁ ସେହି ସମୟରେ ଜଳସେଚନ ଏବଂ ଯେକୌଣସି ପ୍ରକାରର ସ୍ପ୍ରେ କାର୍ଯ୍ୟ କରିବାକୁ ପରାମର୍ଶ ଦିଆଯାଇଛି ଏବଂ ଫସଲ ତଥା ପଶୁମାନଙ୍କୁ ଥଣ୍ଡାରୁ ରକ୍ଷା କରିବା ପାଇଁ ବ୍ୟବସ୍ଥା ମଧ୍ୟ କରାଯାଇଛି। କୁହୁଡ଼ି ଦିନ ଏବଂ ଶୀତ ଲହରୀ ସମୟରେ ପଶୁମାନଙ୍କ ଟୀକାକରଣରୁ ଦୂରେଇ ରହିବା ଉଚିତ୍। କ୍ଷେତରେ ଧାନ ନଡ଼ା କିମ୍ବା ଫସଲର ଅବଶିଷ୍ଟାଂଶ ଜଳାଇବା ଠାରୁ ଦୂରେଇ ରହିବାକୁ କୃଷକମାନଙ୍କୁ ପରାମର୍ଶ ଦିଆଯାଇଛି କାରଣ ଏହା ପରିବେଶକୁ ବାଧା ଦେଇଥାଏ।",
   "crops_data": {
      "kharif rice": {
         "advisory": [
            "ଗଚ୍ଛିତ ଶସ୍ୟ କୀଟପତଙ୍ଗର ସଂକ୍ରମଣକୁ ଲକ୍ଷ୍ୟ କରିବା ପରେ, ଆଲୁମିନିୟମ୍ ଫସଫାଇଡ୍ (ଘରେ ବ୍ୟବହାର କରନ୍ତୁ ନାହିଁ) ଟାବଲେଟ୍ @3 ଟାବଲେଟ୍/ଟନ୍ ଶସ୍ୟ (ମୋଟ 9 ଗ୍ରାମ୍ ଟାବଲେଟ୍) କୁ ମୋଟାମୋଟି ଏୟାରଟାଇଟ କଣ୍ଟେନରରେ ବ୍ୟବହାର କରନ୍ତୁ କିମ୍ବା ମୋଟା ତିରପାଲ ଦ୍ୱାରା ଆଚ୍ଛାଦନ କରନ୍ତୁ ଯାହା କୌଣସି ବ୍ୟବଧାନ ଛାଡି ନଥାଏ | ଟାବଲେଟ୍ଗୁଡ଼ିକୁ ଷ୍ଟାକ୍ରେ ରଖିବା ପୂର୍ବରୁ ସେଗୁଡ଼ିକୁ ସୂତା ପାଉଚରେ ବାନ୍ଧି ରଖିବା ଉଚିତ। ଗ୍ୟାସ୍ ଲିକ୍ ରୋକିବା ପାଇଁ ପ୍ଲାଷ୍ଟିକ୍ କଭରର ସମସ୍ତ କୋଣକୁ 6 ଇଞ୍ଚ ମୋଟା ସ୍ତର କାଦୁଅ/ଆଡ଼େସିଭ୍ ଟେପ୍ ସହିତ ପ୍ଲାଷ୍ଟର କରାଯିବା ଉଚିତ୍ | ସର୍ବନିମ୍ନ ଏକ୍ସପୋଜର ଅବଧି ପ୍ରାୟ 7-10 ଦିନ ପାଇଁ |"
         ]
      },
      "dry season rice": {
         "advisory": [
            "ଶୁଖିଲା ଋତୁରେ ଧାନ ରୋପଣ ପାଇଁ, କୃଷକମାନେ 120 ସେ. ମି. ଚଉଡ଼ା, 10 ସେ. ମି. ଉଚ୍ଚତା ଏବଂ ସୁବିଧାଜନକ ଲମ୍ବ ସହିତ ଦୁଇଟି ଶଯ୍ୟା ମଧ୍ୟରେ 30 ସେ. ମି. ବ୍ୟବଧାନ ଥିବା କାଦୁଅରେ ଆର୍ଦ୍ର ନର୍ସରୀ ମଞ୍ଜି ପ୍ରସ୍ତୁତ କରିବା ଉଚିତ। ଏକ ଏକରର ମୁଖ୍ୟ କ୍ଷେତ ରୋପଣ ପାଇଁ ପ୍ରାୟ 320 ବର୍ଗ ମିଟର ନର୍ସରୀ କ୍ଷେତ୍ର ଆବଶ୍ୟକ। କାର୍ବେଣ୍ଡାଜିମ୍ 50 ଡବ୍ଲ୍ୟୁ. ପି. @1.5 ଗ୍ରାମ/କେଜି ମଞ୍ଜି କିମ୍ବା ଟ୍ରାଇକୋଡର୍ମା ଫର୍ମୁଲେସନ @10 ଗ୍ରାମ/କେଜି ମଞ୍ଜି ସାହାଯ୍ୟରେ ମଞ୍ଜି ଚିକିତ୍ସା କରାଯିବା ଉଚିତ। ଥଣ୍ଡା ଶୀତ ଦିନରେ ଧାନ ନର୍ସରୀକୁ ଥଣ୍ଡା ଆଘାତରୁ ରକ୍ଷା କରିବା ପାଇଁ, ଶଯ୍ୟାକୁ ଅପେକ୍ଷାକୃତ ଗରମ ରଖିବା ପାଇଁ ଏକ ଓଦା ଶଯ୍ୟାରେ ମଞ୍ଜି ବୁଣିବା ପରେ ଭଲ ଭାବେ ଅପଘଟିତ ଏଫ୍. ଆଇ. ଏମ୍. ର ଏକ ପତଳା ସ୍ତର ଲଗାନ୍ତୁ। ଏକ ସନ୍ଧ୍ୟାରେ ଜଳସେଚନ ପାଇଁ ବୋର କୂଅ ପାଣିର ବ୍ୟବହାର କରିବା ଉଚିତ ଏବଂ ମୃତ୍ତିକାର ତାପମାତ୍ରା ବୃଦ୍ଧି ପାଇଁ ଅନୁକୂଳ ରଖିବା ପାଇଁ ସକାଳେ ଥଣ୍ଡା ପାଣି ବାହାର କରନ୍ତୁ |"
         ]
      },
      "mustard": {
         "advisory": [
            "15 ରୁ 20 ଦିନ ପୁରୁଣା ଫସଲ କ୍ଷେତ୍ରରେ ଗୋଟିଏ ହୋଇଂ ଏବଂ ନିଡ଼ାଇବାର ପରାମର୍ଶ ଦିଆଯିବା ଉଚିତ। ଘନ ରୋପଣ କ୍ଷେତ୍ରରେ, ସର୍ବୋତ୍ତମ ଉଦ୍ଭିଦ ସଂଖ୍ୟାକୁ ବଜାୟ ରଖିବା ପାଇଁ ଗୋଟିଏ ପତଳା କାର୍ଯ୍ୟ କରିବାକୁ ପରାମର୍ଶ ଦିଆଯାଏ | ବିଦ୍ୟମାନ ପାଣିପାଗ ସ୍ଥିତି ସୋରିଷ ଫସଲରେ ଏଫିଡ୍ ଆକ୍ରମଣ ପାଇଁ ଅନୁକୂଳ, ତେଣୁ ଏହି କୀଟ ବିରୁଦ୍ଧରେ ନିୟମିତ ତଦାରଖ କରିବାକୁ ପରାମର୍ଶ ଦିଆଯିବା ଉଚିତ |"
         ]
      },
      "fruit and vegetable crops": {
         "advisory": [
            "ଆମ୍ବ ଗୁଳ୍ମକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ ଆମ୍ବ ଗଛରେ ପଲିଥିନ୍/ଆଲ୍କାଥେନ୍ ଚାଦରକୁ ଜୋରରେ ବାନ୍ଧି ରଖନ୍ତୁ। ରୋଗାକ୍ରାନ୍ତ ଏବଂ ଅନାବଶ୍ୟକ ଶାଖା ଏବଂ ପତ୍ର ଗୁଡ଼ିକର ପ୍ରଶିକ୍ଷଣ ଏବଂ ଛାଣିବା ପାଇଁ ପରାମର୍ଶ ଦିଆଯିବା ଉଚିତ। ଶୀତ ଋତୁରେ କ୍ଷେତରେ ମୃତ୍ତିକାର ଆର୍ଦ୍ରତା ତଥା ତାପମାତ୍ରା ବଜାୟ ରଖିବା ପାଇଁ ଷ୍ଟ୍ରା ମଲ୍ଚିଙ୍ଗ ସାମଗ୍ରୀ ଭାବରେ ବ୍ୟବହୃତ ହୋଇପାରେ | ପରିପକ୍ୱ ଫସଲର ଅମଳ ତଥା ଉଦ୍ଭିଦ ବୃଦ୍ଧି ପର୍ଯ୍ୟାୟରେ ଥିବା ଫସଲରେ ଗୋଟିଏ ହାଲୁକା ଜଳସେଚନ ପରାମର୍ଶ ଦିଆଯିବା ଉଚିତ କାରଣ ଆଗାମୀ ସପ୍ତାହରେ ଶୁଖିଲା ପାଗ ଆଶା କରାଯାଏ |"
         ]
      },
      "livestock": {
         "advisory": [
            "ପଶୁମାନଙ୍କ ଶଯ୍ୟା ଭାବରେ ଶୁଖିଲା ନଡ଼ିଆ ସମେତ ଥଣ୍ଡା ପବନରେ ପଶୁମାନଙ୍କର ସିଧାସଳଖ ସଂସ୍ପର୍ଶରେ ଆସିବାକୁ ଏଡ଼ାଇବା ପାଇଁ ରାତିରେ ପଶୁ ଆଶ୍ରୟସ୍ଥଳକୁ ଚାରି ପାର୍ଶ୍ୱରୁ ଘୋଡାଇ ରଖନ୍ତୁ | ଦୁର୍ବଳ ଏବଂ ଅସୁସ୍ଥ ପଶୁମାନଙ୍କୁ ଥଣ୍ଡାରୁ ରକ୍ଷା କରିବା ପାଇଁ ବସ୍ତା କପଡ଼ାରେ ଢାଙ୍କିବା ଉଚିତ। ଏଥି ସହିତ, ରାତିରେ, ସମସ୍ତ ପଶୁମାନଙ୍କୁ ଏକ ଆଚ୍ଛାଦିତ ଆଶ୍ରୟସ୍ଥଳୀରେ ରଖିବା ଉଚିତ୍ | ପଶୁମାନଙ୍କୁ ଆର୍ଦ୍ର ସ୍ଥାନରେ ରଖିବା ଠାରୁ ଦୂରେଇ ରୁହନ୍ତୁ, ଏବଂ ସେମାନଙ୍କୁ ନିଆଁରୁ ଧୂଆଁରୁ ରକ୍ଷା କରନ୍ତୁ ଯାହା ଉତ୍ତାପ ପ୍ରଦାନ କରିବା ପାଇଁ ଜଳାଯାଏ | ଆର୍ଦ୍ରତା ଏବଂ ଧୂଆଁ ନିମୋନିଆ ସଂକ୍ରମିତ ହେବାର ସମ୍ଭାବନାକୁ ବୃଦ୍ଧି କରେ | ପଶୁମାନଙ୍କ ଶରୀରର ତାପମାତ୍ରା ବଜାୟ ରଖିବା ପାଇଁ, ସେମାନଙ୍କୁ ଥଣ୍ଡା ସମୟରେ ଶରୀରକୁ ଆଚ୍ଛାଦନ କରିବା ସହିତ ତୈଳ କେକ୍ ଏବଂ ଗୁଡ଼୍ର ମିଶ୍ରଣ ସହିତ ଖାଇବାକୁ ଦେବା ଉଚିତ୍ | ଗର୍ଭବତୀ ପଶୁମାନଙ୍କୁ (> 6 ମାସ) ଅତିରିକ୍ତ ଖାଦ୍ୟ ଦିଆଯିବା ଉଚିତ।"
         ]
      }
   },
   "date": "10-01-2025"
}