{
   "weather_details": {
      "11-12-2024": {
         "rainfall": 0,
         "t_max": 31,
         "t_min": 18,
         "rh_max": 71,
         "rh_min": 32,
         "wind_speed": 5,
         "wind_direction": 4,
         "cloud_cover": 4
      },
      "12-12-2024": {
         "rainfall": 0,
         "t_max": 30,
         "t_min": 17,
         "rh_max": 68,
         "rh_min": 29,
         "wind_speed": 4,
         "wind_direction": 17,
         "cloud_cover": 1
      },
      "13-12-2024": {
         "rainfall": 0,
         "t_max": 30,
         "t_min": 17,
         "rh_max": 66,
         "rh_min": 26,
         "wind_speed": 4,
         "wind_direction": 11,
         "cloud_cover": 1
      },
      "14-12-2024": {
         "rainfall": 0,
         "t_max": 29,
         "t_min": 16,
         "rh_max": 61,
         "rh_min": 22,
         "wind_speed": 4,
         "wind_direction": 90,
         "cloud_cover": 0
      },
      "15-12-2024": {
         "rainfall": 0,
         "t_max": 29,
         "t_min": 16,
         "rh_max": 59,
         "rh_min": 20,
         "wind_speed": 5,
         "wind_direction": 4,
         "cloud_cover": 0
      }
   },
   "names_of_crops": [
      "ଚାଉଳ",
      "କପା",
      "ସବୁଜ ଚଣା",
      "କଳା ଚଣା",
      "ମାଟି ବାଦାମ",
      "କୋଲେ ଫସଲ"
   ],
   "general_advisory": "ଆଗାମୀ ଦିନରେ ଶୁଖିଲା ପାଗକୁ ଦୃଷ୍ଟିରେ ରଖି କୃଷକମାନଙ୍କୁ ସେମାନଙ୍କ ପରିପକ୍ୱ ଫସଲ ଅମଳ କରିବାକୁ ଏବଂ ସେହି ସମୟରେ ସିଞ୍ଚନ କାର୍ଯ୍ୟ କରିବାକୁ ପରାମର୍ଶ ଦିଆଯାଇଛି। କୃଷକମାନଙ୍କୁ ପରାମର୍ଶ ଦିଆଯାଇଛି ଯେ ସେମାନେ ରବି ଫସଲ ଯଥା ସୋରିଷ, ଚଣା, ଚିନାବାଦାମ, ସବୁଜ ଚଣା/କଳା ଚଣା ଇତ୍ୟାଦି ବୁଣିବା ସମ୍ପୂର୍ଣ୍ଣ କରନ୍ତୁ ଏବଂ ଜଳସେଚନ ସୁବିଧା ଉପଲବ୍ଧ ଥିବା ସ୍ଥାନରେ ରବି ଧାନର ନର୍ସରୀ ବୁଣିବା ପାଇଁ ଜମି ପ୍ରସ୍ତୁତି ଆରମ୍ଭ କରନ୍ତୁ। ରୋଗ ପ୍ରତିରୋଧକ ଶକ୍ତି ବୃଦ୍ଧି କରିବା ଏବଂ କୌଣସି କ୍ଷତିକାରକ ରୋଗରୁ ରକ୍ଷା କରିବା ପାଇଁ ପଶୁମାନଙ୍କୁ କୃମି ଦୂରୀକରଣ ଏବଂ ଟୀକାକରଣ ପରାମର୍ଶ ଦିଆଯିବା ଉଚିତ।",
   "crops_data": {
      "rice": {
         "advisory": [
            "ଆଗାମୀ ଦିନରେ କୌଣସି ବର୍ଷା ହେବାର ସମ୍ଭାବନା ନାହିଁ ତେଣୁ କୃଷକମାନଙ୍କୁ ଅମଳ କାର୍ଯ୍ୟ କରିବାକୁ ଏବଂ ଅଧିକ କ୍ଷତି ଏଡ଼ାଇବା ପାଇଁ ଅମଳ ହୋଇଥିବା ଧାନ ଫସଲକୁ ସୁରକ୍ଷିତ ସ୍ଥାନରେ ରଖିବା ପାଇଁ ବ୍ୟବସ୍ଥା କରିବାକୁ ପରାମର୍ଶ ଦିଆଯାଇଛି।",
            "ଅମଳ ପରେ ଧାନକୁ 2ରୁ 3 ଦିନ ପାଇଁ କ୍ଷେତରେ ଶୁଖାଇବା ଉଚିତ ଏବଂ ତା 'ପରେ ଅମଳ କରିବା ଉଚିତ। ଚାଉଳ 12 ପ୍ରତିଶତ ଆର୍ଦ୍ରତା ସ୍ତରରେ ସୁରକ୍ଷିତ ସ୍ଥାନରେ ରଖିବା ଉଚିତ।"
         ]
      },
      "cotton": {
         "advisory": [
            "ଆଗାମୀ ସପ୍ତାହରେ ପାଗ ଶୁଖିଲା ରହିବ ବୋଲି ଆଶା କରାଯାଉଛି, ତେଣୁ ପରିପକ୍ୱ ଶୁଣ୍ଢଗୁଡ଼ିକୁ ଉଠାଇବାକୁ ପରାମର୍ଶ ଦିଆଯିବା ଉଚିତ ଏବଂ ଆର୍ଦ୍ରତାକୁ 8-10% କୁ ହ୍ରାସ କରିବା ପାଇଁ ବୀଜ କପା ଉପରେ ଶୁଖାଇବା ଉଚିତ।"
         ]
      },
      "green gram": {
         "advisory": [
            "ଆଗାମୀ ସପ୍ତାହରେ ସବୁଜ ଚଣା/କଳା ଚଣା ବୁଣିବା ସମ୍ପୂର୍ଣ୍ଣ କରିବାକୁ କୃଷକମାନଙ୍କୁ ପରାମର୍ଶ ଦିଆଯାଇଛି।",
            "ବୁଣିବାର ଏକ ସପ୍ତାହ ପୂର୍ବରୁ, ପ୍ରତି କିଲୋଗ୍ରାମ ମଞ୍ଜି ପିଛା କାର୍ବେନଡାଜିମ୍ @1.5-2.0g ଏବଂ ଇମିଡାକ୍ଲୋପ୍ରିଡ୍ @5 ଗ୍ରାମ୍ ସହିତ ମଞ୍ଜି ଚିକିତ୍ସା କରାଯିବା ଉଚିତ।"
         ]
      },
      "black gram": {
         "advisory": [
            "ଆଗାମୀ ସପ୍ତାହରେ ସବୁଜ ଚଣା/କଳା ଚଣା ବୁଣିବା ସମ୍ପୂର୍ଣ୍ଣ କରିବାକୁ କୃଷକମାନଙ୍କୁ ପରାମର୍ଶ ଦିଆଯାଇଛି।",
            "ବୁଣିବାର ଏକ ସପ୍ତାହ ପୂର୍ବରୁ, ପ୍ରତି କିଲୋଗ୍ରାମ ମଞ୍ଜି ପିଛା କାର୍ବେନଡାଜିମ୍ @1.5-2.0g ଏବଂ ଇମିଡାକ୍ଲୋପ୍ରିଡ୍ @5 ଗ୍ରାମ୍ ସହିତ ମଞ୍ଜି ଚିକିତ୍ସା କରାଯିବା ଉଚିତ।"
         ]
      },
      "ground nut": {
         "advisory": [
            "ଯେଉଁ କୃଷକମାନେ ଏପର୍ଯ୍ୟନ୍ତ ମଞ୍ଜି ବୁଣିନାହାନ୍ତି, ସେମାନେ ଉନ୍ନତ ଚିନାବାଦାମ କିସମ ଯଥା ଟିଏଜି-24, ଜେଏଲ-24, ଗିରନାର-3, ସ୍ମୃତି, ଟିଜି-3, ଟିଜି-22, କାଦ୍ରି-5 ବ୍ୟବହାର କରିପାରିବେ।",
            "ମଞ୍ଜି ବୁଣିବା ପୂର୍ବରୁ ମଞ୍ଜି ଚିକିତ୍ସା ସୁନିଶ୍ଚିତ କରନ୍ତୁ ଏବଂ ଯଦି ସମ୍ଭବ, ଚିକିତ୍ସାର 7 ଦିନ ପରେ ବ୍ୟାକ୍ଟେରିଆ କିମ୍ବା ଫସଫୋ କଲ୍ଚର ସହିତ ଚିକିତ୍ସା କରନ୍ତୁ।"
         ]
      },
      "cole crop": {
         "advisory": [
            "ପାନ୍ଟିଙ୍ଗ ସମୟରେ, ପଲିଥିନକୁ ମଲ୍ଚିଙ୍ଗ ସାମଗ୍ରୀ ଭାବରେ ବ୍ୟବହାର କରାଯାଇପାରିବ କିମ୍ବା ଯଦି ପୂର୍ବରୁ କରାଯାଇଥିବା ନଡ଼ିଆ ରୋପଣ ଆର୍ଦ୍ରତା ତଥା ମୃତ୍ତିକା ତାପମାତ୍ରା ପନିପରିବା ଫସଲ ବଜାୟ ରଖିବା ପାଇଁ ସମାନ ଉଦ୍ଦେଶ୍ୟରେ ବ୍ୟବହାର କରାଯାଇପାରିବ |",
            "ଫୁଲକୋବିରେ ଡାଇମଣ୍ଡ ବ୍ୟାକ୍ ମଥ୍ର ଆକ୍ରମଣ ଉପରେ ନିୟମିତ ନଜର ରଖିବା ପାଇଁ ପରାମର୍ଶ ଦିଆଯିବା ଉଚିତ।"
         ]
      }
   },
   "date": "10-12-2024"
}