{
   "weather_details": {
      "28-12-2024": {
         "rainfall": 0,
         "t_max": 25,
         "t_min": 16,
         "rh_max": 85,
         "rh_min": 36,
         "wind_speed": 3,
         "wind_direction": 139,
         "cloud_cover": 3
      },
      "29-12-2024": {
         "rainfall": 4,
         "t_max": 25,
         "t_min": 15,
         "rh_max": 81,
         "rh_min": 39,
         "wind_speed": 3,
         "wind_direction": 154,
         "cloud_cover": 5
      },
      "30-12-2024": {
         "rainfall": 2,
         "t_max": 26,
         "t_min": 14,
         "rh_max": 83,
         "rh_min": 48,
         "wind_speed": 3,
         "wind_direction": 166,
         "cloud_cover": 4
      },
      "31-12-2024": {
         "rainfall": 0,
         "t_max": 27,
         "t_min": 13,
         "rh_max": 84,
         "rh_min": 41,
         "wind_speed": 1,
         "wind_direction": 198,
         "cloud_cover": 1
      },
      "01-01-2025": {
         "rainfall": 0,
         "t_max": 27,
         "t_min": 13,
         "rh_max": 76,
         "rh_min": 33,
         "wind_speed": 1,
         "wind_direction": 236,
         "cloud_cover": 0
      }
   },
   "names_of_crops": [
      "ଖରିଫ ଚାଉଳ",
      "ଗ୍ରୀଷ୍ମକାଳୀନ ଚାଉଳ",
      "ମାଟି ବାଦାମ",
      "କୋଲେ ଫସଲ",
      "ପଶୁପାଳନ",
      "କୁକୁଡ଼ା ମାଂସ"
   ],
   "general_advisory": "ଆଇଏମଡିର ବର୍ଦ୍ଧିତ ପରିସର ପୂର୍ବାନୁମାନ ଅନୁଯାୟୀ, କୃଷକମାନଙ୍କୁ ସେହି ଅନୁଯାୟୀ ଅମଳ, ବୁଣିବା ଏବଂ ସିଞ୍ଚନ କାର୍ଯ୍ୟ କରିବାକୁ ପରାମର୍ଶ ଦିଆଯାଇଛି। ଫସଲ ଏବଂ ପଶୁମାନଙ୍କୁ ଥଣ୍ଡାରୁ ରକ୍ଷା କରିବା ପାଇଁ ଉପଯୁକ୍ତ ଯତ୍ନ ନେବାକୁ ପରାମର୍ଶ ଦିଆଯାଇଛି। ରବି ଫସଲ ବୁଣିବା ସମ୍ପୂର୍ଣ୍ଣ କରିବା ଏବଂ ଜଳସେଚନ ସୁବିଧା ଉପଲବ୍ଧ ଥିବା ଗ୍ରୀଷ୍ମ ଧାନର ନର୍ସରୀ ବୁଣିବା ଆରମ୍ଭ କରିବାକୁ ପରାମର୍ଶ ଦିଆଯାଇଛି।",
   "crops_data": {
      "kharif rice": {
         "advisory": [
            "ଆଗାମୀ ଦିନର ପ୍ରଥମାର୍ଦ୍ଧରେ ବର୍ଷା ହେବାର ସମ୍ଭାବନା ରହିଛି, ତେଣୁ ଅମଳ କାର୍ଯ୍ୟ ପାଇଁ ଅପେକ୍ଷା କରନ୍ତୁ ଏବଂ ଅମଳ ହୋଇଥିବା ଧାନକୁ ସଠିକ୍ ଭାବରେ ସଂରକ୍ଷଣ କରନ୍ତୁ।",
            "କ୍ଷତିକୁ ଏଡାଇବା ପାଇଁ 'ସୁପର ଗ୍ରେନ୍ ବ୍ୟାଗ୍ \"କିମ୍ବା ଉପଯୁକ୍ତ ଷ୍ଟୋରେଜ୍ ପଦ୍ଧତି ବ୍ୟବହାର କରନ୍ତୁ।",
            "ଗଚ୍ଛିତ ଶସ୍ୟ କୀଟ ପରିଚାଳନା ବିରୁଦ୍ଧରେ ସତର୍କତା ଅବଲମ୍ବନ କରନ୍ତୁ।"
         ]
      },
      "summer rice": {
         "advisory": [
            "ଉନ୍ନତ କିସମ ସହିତ ଗ୍ରୀଷ୍ମକାଳୀନ ଧାନ ଚାଷ ପାଇଁ କ୍ଷେତ୍ର ପ୍ରସ୍ତୁତି ଆରମ୍ଭ କରନ୍ତୁ।"
         ]
      },
      "ground nut": {
         "advisory": [
            "କୀଟ ଆକ୍ରମଣ ପାଇଁ ଚିନାବାଦାମ ଫସଲ ଉପରେ ନଜର ରଖନ୍ତୁ ଏବଂ ଆବଶ୍ୟକ ହେଲେ ଉପଯୁକ୍ତ କୀଟନାଶକ ବ୍ୟବହାର କରନ୍ତୁ।",
            "ଆଶା କରାଯାଉଥିବା ବର୍ଷା କାରଣରୁ ଜଳସେଚନ ଏବଂ ସିଞ୍ଚନ କାର୍ଯ୍ୟ ପାଇଁ ଅପେକ୍ଷା କରନ୍ତୁ।"
         ]
      },
      "cole crop": {
         "advisory": [
            "ମାଟିର ଆର୍ଦ୍ରତା ଏବଂ ତାପମାତ୍ରା ରକ୍ଷଣାବେକ୍ଷଣ ପାଇଁ ପନିପରିବା ଫସଲରେ ମଲ୍ଚିଙ୍ଗ ସାମଗ୍ରୀ ଭାବରେ ଷ୍ଟ୍ରା ବ୍ୟବହାର କରନ୍ତୁ |",
            "ଡାଇମଣ୍ଡ ବ୍ୟାକ୍ ମଥ୍ ଆକ୍ରମଣ ବିରୁଦ୍ଧରେ ନଜର ରଖନ୍ତୁ ଏବଂ ଆବଶ୍ୟକ ହେଲେ ଫେରୋମୋନ୍ ଟ୍ରାପ୍ ବ୍ୟବହାର କରନ୍ତୁ |",
            "ଆକ୍ରମଣ ହେଲେ ବର୍ଷା ପରେ ନିମ୍ବ ତେଲ କିମ୍ବା ଇମାମେକ୍ଟିନ୍ ବେନ୍ଜୋଏଟ୍ ଲଗାନ୍ତୁ।"
         ]
      },
      "livestock": {
         "advisory": [
            "ବିଛଣା ସାମଗ୍ରୀ ଭାବରେ ଝୋଟ ବସ୍ତା ଏବଂ ନଡ଼ିଆ ସହିତ ପଶୁମାନଙ୍କୁ ଥଣ୍ଡାରୁ ରକ୍ଷା କରନ୍ତୁ |",
            "ଗୋରୁମାନଙ୍କ ପାଇଁ ସ୍ୱଚ୍ଛ ପାନୀୟ ଜଳ ସୁନିଶ୍ଚିତ କରନ୍ତୁ ଏବଂ ମାଛିମାନଙ୍କୁ ରୋକିବା ପାଇଁ ପରିଷ୍କାର ଛପର ରକ୍ଷଣାବେକ୍ଷଣ କରନ୍ତୁ।",
            "ରୋଗ ନିୟନ୍ତ୍ରଣ ପାଇଁ ପଶୁମାନଙ୍କୁ ଟୀକାକରଣ ଏବଂ କୃମିନାଶକ କରନ୍ତୁ।"
         ]
      },
      "poultry": {
         "advisory": [
            "କୁକୁଡ଼ା ପାଳିରେ ଉପଯୁକ୍ତ ଭେଣ୍ଟିଲେସନ୍ ଏବଂ ଉତ୍ତାପ ଉତ୍ସ ପ୍ରଦାନ କରନ୍ତୁ |",
            "କୁକୁଡ଼ା ପାଇଁ ଉପଯୁକ୍ତ ପାନୀୟ ଜଳ ତାପମାତ୍ରା ବଜାୟ ରଖନ୍ତୁ |",
            "କୁକୁଡ଼ା ପାଳିକୁ ଗରମ ଏବଂ ଶୁଖିଲା ରଖିବା ପାଇଁ ଇନସୁଲେସନ୍ ପଦ୍ଧତି ବ୍ୟବହାର କରନ୍ତୁ |"
         ]
      }
   },
   "date": "27-12-2024"
}