{
   "weather_details": {
      "31-07-2024": {
         "rainfall": 15,
         "t_max": 29,
         "t_min": 25,
         "rh_max": 78,
         "rh_min": 50,
         "wind_speed": 15,
         "wind_direction": 216,
         "cloud_cover": 8
      },
      "01-08-2024": {
         "rainfall": 20,
         "t_max": 29,
         "t_min": 25,
         "rh_max": 85,
         "rh_min": 56,
         "wind_speed": 16,
         "wind_direction": 249,
         "cloud_cover": 8
      },
      "02-08-2024": {
         "rainfall": 15,
         "t_max": 30,
         "t_min": 25,
         "rh_max": 80,
         "rh_min": 64,
         "wind_speed": 19,
         "wind_direction": 248,
         "cloud_cover": 8
      },
      "03-08-2024": {
         "rainfall": 10,
         "t_max": 32,
         "t_min": 26,
         "rh_max": 81,
         "rh_min": 59,
         "wind_speed": 16,
         "wind_direction": 246,
         "cloud_cover": 7
      },
      "04-08-2024": {
         "rainfall": 10,
         "t_max": 33,
         "t_min": 27,
         "rh_max": 80,
         "rh_min": 61,
         "wind_speed": 15,
         "wind_direction": 216,
         "cloud_cover": 7
      }
   },
   "names_of_crops": [
      "ଚାଉଳ",
      "ଝୋଟ",
      "ଆଖୁ",
      "ପନିପରିବା",
      "ମତ୍ସ୍ଯ଼ଚାଷ",
      "ପଶୁପାଳନ"
   ],
   "general_advisory": "ନିକଟରେ ହୋଇଥିବା ବର୍ଷାକୁ ବ୍ଯ଼ବହାର କରି ସିଧାସଳଖ ବୁଣାଯାଇଥିବା ଚାଉଳରେ ବିଉଶନିଂ ସମ୍ପୂର୍ଣ୍ଣ କରାଯିବା ଉଚିତ ଏବଂ କ୍ଷେତରେ ପାଣିର ଏକ ପତଳା ସ୍ତର ବଜାଯ଼ ରଖିବା ଉଚିତ। ଆଗାମୀ ଦିନରେ ଭଲ ପରିମାଣର ବର୍ଷା ହେବାର ସମ୍ଭାବନା ଥିବାରୁ ବର୍ଷା ଜଳ/କେନାଲ ଜଳ/ପୋଖରୀ ବ୍ଯ଼ବହାର କରି ଧାନ ରୋପଣ ଜାରି ରଖିବାକୁ କୃଷକମାନଙ୍କୁ ପରାମର୍ଶ ଦିଆଯାଇଛି। ଧାନ ନର୍ସରୀ ଏବଂ ଝୋଟ କ୍ଷେତରୁ ଅତିରିକ୍ତ ପାଣି ବାହାର କରନ୍ତୁ।",
   "crops_data": {
      "rice": {
         "advisory": [
            "ପ୍ରତ୍ଯାଶିତ ବର୍ଷାକୁ ଦୃଷ୍ଟିରେ ରଖି କୃଷକମାନେ ଚାରା ଉପୁଡ଼ିବା ସାତ ଦିନ ପୂର୍ବରୁ କାର୍ଟାପ୍ ହାଇଡ୍ରୋକ୍ଲୋରାଇଡ୍ (4ଜି) @100 ଗ୍ରାମ୍/1 ଡେସିମାଲ୍ ନର୍ସରୀ କିମ୍ବା ଫିପ୍ରୋନିଲ୍ 0.3 ଗ୍ରାମ୍ @100 ଗ୍ରାମ୍/1 ଡେସିମାଲ୍ ନର୍ସରୀ କ୍ଷେତ୍ର ପରି ଗ୍ରାନୁଲାର କୀଟନାଶକ ସହିତ ନର୍ସରୀ ଚିକିତ୍ସା ପରେ ଚାଉଳ ରୋପଣ ଆରମ୍ଭ କରିବା ଉଚିତ୍।",
            "ଦୀର୍ଘ ଅବଧି ପାଇଁ 20 X 15 ସେ. ମି. ଏବଂ ମଧ୍ଯ଼ମ ଅବଧି କିସମ ପାଇଁ 20 X 10 ସେ. ମି. ବ୍ଯ଼ବଧାନରେ ଅଗଭୀର ଗଭୀରତାରେ 2 ରୁ 3 ଚାରା/ପାହାଡ ରୋପଣ କରନ୍ତୁ।",
            "25 କିଲୋଗ୍ରାମ ଶୁଖିଲା ବାଲି ମିଶାଇ ପ୍ରତିରୋପଣ (ଡିଏଟି) ର 3 ରୁ 4 ଦିନ ପରେ ପ୍ରି-ଇମର୍ଜେନ୍ସ ୱେଡିସାଇଡ୍ ବେନ୍ସଲ୍ଫୁରନ୍ ମିଥାଇଲ + Pretilachlor@10kg ହେକ୍ଟର କିମ୍ବା ପାଇରାଜୋସଲ୍ଫୁରନ୍ ଇଥାଇଲ @20g a.i./ha ଲଗାନ୍ତୁ।"
         ]
      },
      "jute": {
         "advisory": [
            "କ୍ଷେତରେ ଅତ୍ଯ଼ଧିକ ପାଣି ଝୋଟ୍ର ଗୁଣବତ୍ତା ହ୍ରାସ କରିଥାଏ। ତେଣୁ କ୍ଷେତରୁ ଅତିରିକ୍ତ ପାଣି ବାହାର କରନ୍ତୁ।",
            "ବୃଦ୍ଧି ବଢ଼ାଇବା ପାଇଁ ଆନ୍ତଃ-ଫସଲ ସମଯ଼ରେ ଶାଖାଗୁଡ଼ିକୁ କାଟନ୍ତୁ |",
            "ସାମ୍ପ୍ରତିକ ବର୍ଷା ଝୋଟରେ ଆଗାଛା ସଂଖ୍ଯ଼ା ବୃଦ୍ଧି କରିବ, ଘାସ ଆଗାଛାକୁ ନିଯ଼ନ୍ତ୍ରଣ କରିବା ପାଇଁ କୁଇଜାଲ୍ଫପ୍-ପେଥିଲ୍ @2ml ଲିଟର ପାଣି ପ୍ରଯ଼ୋଗ କରନ୍ତୁ |",
            "ବର୍ତ୍ତମାନର ବର୍ଷା ପାଗ ସେମିଲୋପର୍, ବିହାରୀ ହେଯ଼ାର କ୍ଯ଼ାଟର୍ପିଲାର୍ ଏବଂ ଅନ୍ଯ଼ାନ୍ଯ଼ ପତ୍ର ଫିଡର୍ ପରି କୀଟପତଙ୍ଗ ଆକ୍ରମଣ ପାଇଁ ଅନୁକୂଳ | ଏହି କୀଟପତଙ୍ଗକୁ ନିଯ଼ନ୍ତ୍ରଣ କରିବା ପାଇଁ, ଲାମ୍ବା ସାଇହାଲୋଥ୍ରିନ୍ 4.9CS @250 ମିଲି/ଏକର ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "sugarcane": {
         "advisory": [
            "ଛିଦ୍ରକାରୀ-ପ୍ରଭାବିତ ଟିଲର୍ ଏବଂ ବିଳମ୍ବରେ ଗଠିତ ଟିଲର୍ଗୁଡ଼ିକୁ ବାହାର କରନ୍ତୁ, ଆଂଶିକ ଶୁଖିଲା ତଳ ପତ୍ର ସହିତ ଦୁଇ କିମ୍ବା ତିନୋଟି ସହିତ ବେତ ଅଙ୍କୁରକୁ ବାନ୍ଧି ଦିଅନ୍ତୁ |",
            "ଆଖୁ ପତ୍ର ଛେଦନକାରୀକୁ ଶୀଘ୍ର ନିଯ଼ନ୍ତ୍ରଣ କରିବା ପାଇଁ ଫିପ୍ରୋନିଲ 5ଏସସି @400 ମିଲି/ଏକରର ସ୍ପ୍ରେ କରିବା ପାଇଁ ପରାମର୍ଶ ଦିଆଯାଇଛି।"
         ]
      },
      "vegetables": {
         "advisory": [
            "ଗତ ସପ୍ତାହରେ ବର୍ଷା ଏବଂ ଅତ୍ଯ଼ଧିକ ଆର୍ଦ୍ରତା କାରଣରୁ ପନିପରିବା ଗଛରେ ଶୁଷ୍କତା ଦେଖାଯିବାର ସମ୍ଭାବନା ରହିଛି।",
            "କ୍ଷେତରୁ ପାଣି ବାହାର କରନ୍ତୁ।",
            "200 ଲିଟର ପାଣିରେ ଏକର ପିଛା କାରବକ୍ସିନ + ଥିରାମ @400g କିମ୍ବା ମେଟାଲାକ୍ସିଲ 8 ପ୍ରତିଶତ + ମାନକୋଜେବ 64 ପ୍ରତିଶତ ଡବ୍ଲ୍ଯ଼ୁ. ପି. @400g ସହିତ Streoptocyline@20g ସ୍ପ୍ରେ କରନ୍ତୁ।",
            "ନିମ୍ବ କିମ୍ବା କରଣଜା କେକ୍ @1g ଏକର ଲଗାନ୍ତୁ, ଟେବୁକୋନାଜୋଲ୍ @1ml ଲିଟରକୁ ଭିଜାଇବାକୁ ପରାମର୍ଶ ଦିଆଯାଇପାରେ।",
            "ବାଇଗଣ ଏବଂ ଓକ୍ରା ରେ ଫଳ ଏବଂ ଶୁଟ୍ ଛେଦକକୁ ନିଯ଼ନ୍ତ୍ରଣ କରିବା ପାଇଁ ପ୍ରାରମ୍ଭିକ ପର୍ଯ୍ଯ଼ାଯ଼ରେ ନିମ୍ବ-ଆଧାରିତ କୀଟନାଶକ 1500 ପିପିଏମ @600ml ଏକର ସ୍ପ୍ରେ କରନ୍ତୁ। ଯଦି କୀଟପତଙ୍ଗ ଇ. ଟି. ଏଲ୍. ଜାରି ରଖେ, ତେବେ 15 ଦିନ ବ୍ଯ଼ବଧାନରେ ସ୍ପିନୋସାଡ୍ 45 ପ୍ରତିଶତ ଏସ୍. ସି. <ଆଇ. ଡି. 1> ଏକର ଏବଂ ଇମାମେକ୍ଟିନ୍ ବେନ୍ଜୋଏଟ୍ <ଆଇ. ଡି. 2> ଏକରର ବିକଳ୍ପ ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "pisciculture": {
         "advisory": [
            "ରୋହୁ, କାଟଲା ଏବଂ ମୃଗାଲ୍ ପରି କାର୍ପ, ଯାହା ଦ୍ରୁତ ଗତିରେ ବଢିଥାଏ, ଲାଭ ବୃଦ୍ଧି ପାଇଁ 4:3:3 ର ଏକ ନିର୍ଦ୍ଦିଷ୍ଟ ଅନୁପାତରେ ଷ୍ଟକ୍ କରାଯିବା ଉଚିତ୍ |",
            "ସାଧାରଣତଃ, ହେକ୍ଟର ପିଛା 5,000 ଫିଙ୍ଗରଲିଙ୍ଗର ଘନତ୍ୱ ଏକ ମାନକ ଷ୍ଟକିଂ ଭାବରେ ରଖାଯାଏ |",
            "ଚିନାବାଦାମ ତେଲ କେକ୍ ଏବଂ ଚାଉଳ ଚୋପା ଷ୍ଟକିଂ ସାମଗ୍ରୀର ମୋଟ ବାଯ଼ୋମାସର ସମାନ ଅନୁପାତ @5% ରେ ଦିଆଯିବା ଉଚିତ୍ | ପୁଷ୍କରିଣୀର ଗୁଣବତ୍ତା ବୃଦ୍ଧି ପାଇଁ ଗୋବର, ଯ଼ୁରିଆ ଏବଂ ସୁପରଫସଫେଟ୍ ପ୍ରଯ଼ୋଗ କରାଯିବା ଉଚିତ। 8-10 ମାସରେ, ମାଛମାନେ ସେମାନଙ୍କର ବିପଣନ ଯୋଗ୍ଯ଼ ଆକାରରେ ପହଞ୍ଚନ୍ତି |"
         ]
      },
      "livestock": {
         "advisory": [
            "ଯଦି ପଶୁମାନଙ୍କୁ ଏପର୍ଯ୍ଯ଼ନ୍ତ ଏଫ୍. ଏମ୍. ଡି., ରକ୍ତସ୍ରାବଜନିତ ସେପ୍ଟିସେମିଆ, ବ୍ଲାକ୍ କ୍ୱାର୍ଟର୍, ଏଣ୍ଟେରୋଟକ୍ସିମିଆ ଇତ୍ଯ଼ାଦି ବିରୁଦ୍ଧରେ ଟୀକାକରଣ କରାଯାଇ ନାହିଁ, ତେବେ ଏଗୁଡ଼ିକ କରିବା ଆବଶ୍ଯ଼କ |"
         ]
      }
   },
   "date": "30-07-2024"
}