{
   "weather_details": {
      "28-12-2024": {
         "rainfall": 0,
         "t_max": 28,
         "t_min": 17,
         "rh_max": 74,
         "rh_min": 41,
         "wind_speed": 10,
         "wind_direction": 13,
         "cloud_cover": 1
      },
      "29-12-2024": {
         "rainfall": 0,
         "t_max": 28,
         "t_min": 17,
         "rh_max": 74,
         "rh_min": 41,
         "wind_speed": 7,
         "wind_direction": 357,
         "cloud_cover": 3
      },
      "30-12-2024": {
         "rainfall": 0,
         "t_max": 28,
         "t_min": 17,
         "rh_max": 70,
         "rh_min": 46,
         "wind_speed": 9,
         "wind_direction": 23,
         "cloud_cover": 2
      },
      "31-12-2024": {
         "rainfall": 0,
         "t_max": 29,
         "t_min": 16,
         "rh_max": 74,
         "rh_min": 46,
         "wind_speed": 11,
         "wind_direction": 16,
         "cloud_cover": 1
      },
      "01-01-2025": {
         "rainfall": 0,
         "t_max": 29,
         "t_min": 15,
         "rh_max": 71,
         "rh_min": 38,
         "wind_speed": 11,
         "wind_direction": 8,
         "cloud_cover": 2
      }
   },
   "names_of_crops": [
      "ଚାଉଳ",
      "ସୋରିଷ ଓ ସୋରିଷ",
      "ଚିନାବାଦାମ",
      "ବାଇଗଣ",
      "କୋଇଲା ଫସଲ",
      "ପେଁପେ",
      "ମତ୍ସ୍ୟଚାଷ",
      "ଗୋରୁ।"
   ],
   "general_advisory": "ଖରିଫ ଫସଲର ଅବଶିଷ୍ଟାଂଶକୁ କ୍ଷେତରେ ନ ଜଳାଇବାକୁ କୃଷକମାନଙ୍କୁ ପରାମର୍ଶ ଦିଆଯାଇଛି କାରଣ ଏହା କେବଳ ପରିବେଶକୁ ପ୍ରଦୂଷିତ କରେ ନାହିଁ ବରଂ ଗୁରୁତର ସ୍ୱାସ୍ଥ୍ୟ ସମସ୍ୟା ମଧ୍ୟ ସୃଷ୍ଟି କରେ। ଅମଳ ହୋଇଥିବା ପରିପକ୍ୱ ଧାନ ଫସଲକୁ ସୁରକ୍ଷିତ ସ୍ଥାନରେ ରଖନ୍ତୁ ଏବଂ ଯଦି ସମ୍ଭବ ସୂର୍ଯ୍ୟକିରଣ ତଳେ ଶୁଖାନ୍ତୁ। ଫସଲ ଏବଂ ପନିପରିବା କ୍ଷେତରୁ ଅତିରିକ୍ତ ପାଣି ବାହାର କରନ୍ତୁ। କୀଟାଣୁନାଶକ/ବ୍ଲିଚିଂ ପାଉଡର/ଫିନାଇଲ ସିଞ୍ଚନ କରି ପଶୁଶାଳାକୁ ସଫା କରନ୍ତୁ।",
   "crops_data": {
      "rice": {
         "advisory": [
            "ଧାନଶସ୍ୟକୁ 3ରୁ 4 ଦିନ ସୂର୍ଯ୍ୟକିରଣ ତଳେ ଶୁଖାଇବା ଆବଶ୍ୟକ, ବ୍ୟବହାର ପାଇଁ 14 ପ୍ରତିଶତ ଆର୍ଦ୍ରତା ଏବଂ ବୀଜ ଉଦ୍ଦେଶ୍ୟରେ 12 ପ୍ରତିଶତ ଆର୍ଦ୍ରତା ରହିବା ଆବଶ୍ୟକ। ପୂର୍ବରୁ ଅମଳ ହୋଇଥିବା ଧାନକୁ କ୍ଷେତରୁ ଗୋ ଡାଉନ୍ କିମ୍ବା କୌଣସି ଛାୟାଯୁକ୍ତ ସ୍ଥାନକୁ ସ୍ଥାନାନ୍ତର କରନ୍ତୁ। ମଳତ୍ୟାଗ ସ୍ଥଳ ଏବଂ ଭଣ୍ଡାର ଗୋଦାମକୁ ସଫା ରଖନ୍ତୁ ଏବଂ ଲାମ୍ବଡା ସାୟାହାଲୋଥ୍ରିନ୍ 4.9ସି. ଏସ୍. @1.5 ମିଲି./ଲି. ଜଳ ସ୍ପ୍ରେ କରନ୍ତୁ, ଯାହାଦ୍ୱାରା ଭବିଷ୍ୟତରେ ଭଣ୍ଡାର କୀଟପତଙ୍ଗ ସଂକ୍ରମିତ ହେବାର ସମ୍ଭାବନା କମ୍ ରହିବ।"
         ]
      },
      "rapeseed and mustard": {
         "advisory": [
            "ସର୍ବୋତ୍ତମ ଉଦ୍ଭିଦ ସଂଖ୍ୟାକୁ ବଜାୟ ରଖିବା ପାଇଁ ଉପର ଡ୍ରେସିଂ ପୂର୍ବରୁ ପତଳା କରାଯିବା ଉଚିତ୍ | ଏଫିଡ୍, ତମାଖୁ କ୍ୟାଟର୍ପିଲର କାର୍ଯ୍ୟକଳାପ ଏବଂ ସୋରିଷରେ ଅଲ୍ଟରନେରିଆ ଲିଫ୍ ସ୍ପଟ୍ ରୋଗର ଘଟଣା ଉପରେ ନଜର ରଖନ୍ତୁ |"
         ]
      },
      "groundnut": {
         "advisory": [
            "ବର୍ଷା ବନ୍ଦ ହେବା ପରେ, ଚିନାବାଦାମରେ କଲାର୍ ରଟ୍ ଏବଂ ପ୍ରାରମ୍ଭିକ ପତ୍ର ବ୍ଲାଇଟ୍ ରୋଗର ବିସ୍ତାରକୁ ରୋକିବା ପାଇଁ ରାଇଡୋମିଲ୍ ଏମ୍-ଜେଡ @2 ଗ୍ରାମ୍/ଲି ପାଣି ସ୍ପ୍ରେ କରନ୍ତୁ |"
         ]
      },
      "brinjal": {
         "advisory": [
            "ବାଇଗଣ-ଅଧିକ ଆର୍ଦ୍ରତା ପରେ ବର୍ଷା ଦ୍ୱାରା ବାଇଗଣର ଶୁଷ୍କତା ବା ଆଂଶିକ ଶୁଷ୍କତା ବୃଦ୍ଧି ପାଇଥାଏ। ଏହାକୁ ରୋକିବା ପାଇଁ କ୍ଷେତରୁ ଅତିରିକ୍ତ ପାଣି ବାହାର କରନ୍ତୁ। ନିମ୍ବ କିମ୍ବା କରଞ୍ଜା କେକ୍ ଏକର ପିଛା 1 କୁଇଣ୍ଟାଲ୍ରେ ଲଗାନ୍ତୁ, ଟେବୁକୋନାଜୋଲ୍ ଲିଟର ପିଛା 1 ମିଲିଲିଟର୍ରେ ଭିଜାଇବାକୁ ପରାମର୍ଶ ଦିଆଯାଇପାରେ।"
         ]
      },
      "cole crops": {
         "advisory": [
            "ରୋଗ ସଂକ୍ରମିତ ଗଛ ଗୁଡ଼ିକୁ ଛାଣିଦିଅନ୍ତୁ ଏବଂ ମୃତ୍ତିକାକୁ ସୂର୍ଯ୍ୟଙ୍କ ସଂସ୍ପର୍ଶରେ ଆଣନ୍ତୁ।"
         ]
      },
      "papaya": {
         "advisory": [
            "ପେପା-ପେପା ଲିଫ୍ କର୍ଲ ଭାଇରସର ଭେକ୍ଟର (ହ୍ୱାଇଟ୍ଫ୍ଲାଇ) କୁ ଧରିବା ପାଇଁ ହଳଦିଆ ଷ୍ଟିକି ଫାନ୍ଦ ଲଗାନ୍ତୁ। ନିମ୍ବ ତେଲ ଗଠନ 1500 ପିପିଏମ @3 ମିଲି/ଲିଟର ଜଳର ବିକଳ୍ପ ସ୍ପ୍ରେ ଏବଂ ଧଳା ମାଛି ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ ଫ୍ଲୋନିକାମିଡ 50 ଡବ୍ଲୁଜି @0.3 ଗ୍ରାମ୍/ଲିଟର ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "pisciculture": {
         "advisory": [
            "ରୋଗ ସଂକ୍ରମଣ ଉପରେ ନିୟମିତ ନଜର ରଖିବା ଏବଂ ମାଛର ପରିପୂରକ ଖାଦ୍ୟ ଉପରେ ନଜର ରଖିବା ପାଇଁ ପରାମର୍ଶ ଦିଆଯାଇଛି। ପ୍ରବଳ ବର୍ଷା ପରେ ମାଛ ପୋଖରୀଗୁଡ଼ିକର ଜଳର ଗୁଣବତ୍ତାରେ ପରିବର୍ତ୍ତନ କରାଯାଇପାରେ, ତେଣୁ ପାଣିର ପି. ଏଚ୍. ଏବଂ ଆବଶ୍ୟକତା ଆଧାରିତ ପରୀକ୍ଷଣ ପାଇଁ 2 ଦିନ ବ୍ୟବଧାନରେ 3 ଭାଗ (40:40:20) ରେ ଏକର ପିଛା @100kg ଚୁନାର ପ୍ରୟୋଗ କରିବା ପାଇଁ ପରାମର୍ଶ ଦିଆଯାଇଛି।"
         ]
      },
      "cattle": {
         "advisory": [
            "ପଶୁଟିକୁ ଛପର ଭିତରେ ରଖନ୍ତୁ। କୀଟାଣୁନାଶକ/ବ୍ଲିଚିଂ ପାଉଡର/ଫିନାଇଲ ସିଞ୍ଚନ କରି ପଶୁଶାଳାକୁ ସଫା କରନ୍ତୁ।"
         ]
      }
   },
   "date": "27-12-2024"
}