{
   "weather_details": {
      "03/04/2024": {
         "rainfall": 0,
         "t_max": 40,
         "t_min": 26,
         "rh_max": 57,
         "rh_min": 13,
         "wind_speed": 12,
         "wind_direction": 205,
         "cloud_cover": 0
      },
      "04/04/2024": {
         "rainfall": 0,
         "t_max": 40,
         "t_min": 26,
         "rh_max": 80,
         "rh_min": 15,
         "wind_speed": 11,
         "wind_direction": 180,
         "cloud_cover": 1
      },
      "05/04/2024": {
         "rainfall": 0,
         "t_max": 41,
         "t_min": 27,
         "rh_max": 70,
         "rh_min": 23,
         "wind_speed": 15,
         "wind_direction": 207,
         "cloud_cover": 1
      },
      "06/04/2024": {
         "rainfall": 0,
         "t_max": 41,
         "t_min": 27,
         "rh_max": 67,
         "rh_min": 15,
         "wind_speed": 13,
         "wind_direction": 210,
         "cloud_cover": 0
      },
      "07/04/2024": {
         "rainfall": 0,
         "t_max": 42,
         "t_min": 27,
         "rh_max": 55,
         "rh_min": 10,
         "wind_speed": 12,
         "wind_direction": 242,
         "cloud_cover": 2
      }
   },
   "names_of_crops": [
      "ଧାନ।",
      "ବାଇଗଣ",
      "ଓକ୍ରା",
      "ରସୁଣ",
      "ଆମ୍ବ"
   ],
   "general_advisory": "ଧାନ ଫସଲରେ, ପେନିକଲ୍ ଦୀକ୍ଷା, ପେନିକଲ୍ ଉତ୍ଥାନ, ଫୁଲ, ଏବଂ କ୍ଷୀର ଦୋଇବା ପର୍ଯ୍ଯ଼ାଯ଼ ଗୁରୁତ୍ୱପୂର୍ଣ୍ଣ | ଆଖୁରେ ଶୁଖିଲା ପତ୍ରରେ ଧାଡ଼ିଗୁଡ଼ିକୁ ଢାଙ୍କି ଦିଅନ୍ତୁ। ଉତ୍ତାପ ପ୍ରଭାବକୁ ହ୍ରାସ କରିବା ପାଇଁ ସ୍ପ୍ରିଂକଲର ଜଳସେଚନ ପ୍ରଯ଼ୋଗ କରନ୍ତୁ। ଜଳସେଚନ ଚ୍ଯ଼ାନେଲରେ ପଲିଥିନ୍ ବିସ୍ତାର କରନ୍ତୁ। ନଡ଼ିଆ ପତ୍ରକୁ ଛାଣନ୍ତୁ। ନୂତନ ଭାବରେ ରୋପଣ କରାଯାଇଥିବା ପନିପରିବା ଚାରା ଉପରେ କାଗଜ କ୍ଯ଼ାପ୍ ସହିତ ଆଚ୍ଛାଦନ କରନ୍ତୁ | ଅଗଭୀର ପୋଖରୀରେ ଫିଙ୍ଗରଲିଂ ଅମଳ କରନ୍ତୁ | ଧାନରେ ହଳଦିଆ କାଣ୍ଡ ଛେଦକକୁ ପରିଚାଳନା କରନ୍ତୁ। ବିସ୍ଫୋରଣ ରୋଗକୁ ନିଯ଼ନ୍ତ୍ରଣ କରନ୍ତୁ। ତମାଖୁ କ୍ଯ଼ାଟର୍ପିଲର ପରିଚାଳନା କରନ୍ତୁ। ଆଖୁରେ ପ୍ରାରମ୍ଭିକ ଅଙ୍କୁର ଛେଦକକୁ ପରିଚାଳନା କରନ୍ତୁ। ବାଇଗଣ ଅଙ୍କୁର ଏବଂ ଫଳ ଛେଦକକୁ ପରିଚାଳନା କରନ୍ତୁ। ଓକ୍ରାରେ ଶ୍ୱେତ ମାଛି ସଂକ୍ରମଣରୁ ରକ୍ଷା କରନ୍ତୁ। ଅମଳ ହୋଇଥିବା କଞ୍ଚାଲଙ୍କା ଭଲ ଭାବେ ଗଚ୍ଛିତ ରଖନ୍ତୁ। ଆମ୍ବ ହପରକୁ ନିଯ଼ନ୍ତ୍ରଣ କରନ୍ତୁ।",
   "crops_data": {
      "paddy": {
         "advisory": [
            "ଧାନ ଫସଲରେ, ପେନିକଲ୍ ଆରମ୍ଭ, ପେନିକଲ୍ ଉଦ୍ଭବ, ଫୁଲ, ଏବଂ କ୍ଷୀର ଦୋଇବା ପର୍ଯ୍ଯ଼ାଯ଼ ଗୁରୁତ୍ୱପୂର୍ଣ୍ଣ | ଏହି ପର୍ଯ୍ଯ଼ାଯ଼ଗୁଡ଼ିକରେ ଜଳର ଅଭାବକୁ ଏଡ଼ାଇବା ଉଚିତ।"
         ]
      },
      "brinjal": {
         "advisory": [
            "ବାଇଗଣ ଅଙ୍କୁର ଏବଂ ଫଳ ଛେଦକକୁ ପରିଚାଳନା କରିବା ପାଇଁ, ଫେରୋମୋନ୍ ଟ୍ରାପ୍ ସ୍ଥାପନ କରନ୍ତୁ ଏବଂ ନିମ-ଆଧାରିତ କୀଟନାଶକ ବ୍ଯ଼ବହାର କରନ୍ତୁ | ନିର୍ଦ୍ଦିଷ୍ଟ କୀଟନାଶକ ସହିତ ରାସାଯ଼ନିକ ନିଯ଼ନ୍ତ୍ରଣ ପାଇଁ ଯାଆନ୍ତୁ।"
         ]
      },
      "okra": {
         "advisory": [
            "ଓକ୍ରାରେ ଧଳା ମାଛି ସଂକ୍ରମଣକୁ ରୋକିବା ପାଇଁ, ବୁଣିବା ପୂର୍ବରୁ ମଞ୍ଜି ଚିକିତ୍ସା କରନ୍ତୁ ଏବଂ ଫସଲ ବୃଦ୍ଧି ସମୟରେ ହଳଦିଆ ଚଟପଟା ଜାଲ ବ୍ୟବହାର କରନ୍ତୁ |"
         ]
      },
      "onion": {
         "advisory": [
            "ଅମଳ ପରେ, ଗଚ୍ଛିତ ରଖିବା ପାଇଁ କଟା ହୋଇଥିବା ଉପର ଭାଗ ଏବଂ ଶୁଖିଲା କନ୍ଦକୁ ଭଲ ଭାବେ କାଟି ଦିଅନ୍ତୁ।"
         ]
      },
      "mango": {
         "advisory": [
            "ଆମ୍ବ ହପରକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ, ନିର୍ଦ୍ଦିଷ୍ଟ କୀଟନାଶକ ସ୍ପ୍ରେ କରନ୍ତୁ କିମ୍ବା ଗଛ ତଳେ ଧୂଆଁ ଲଗାନ୍ତୁ |"
         ]
      }
   },
   "date": "02-04-2024"
}