{
   "weather_details": {
      "03/04/2024": {
         "rainfall": 0,
         "t_max": 40,
         "t_min": 26,
         "rh_max": 57,
         "rh_min": 13,
         "wind_speed": 12,
         "wind_direction": 205,
         "cloud_cover": 0
      },
      "04/04/2024": {
         "rainfall": 0,
         "t_max": 40,
         "t_min": 26,
         "rh_max": 80,
         "rh_min": 15,
         "wind_speed": 11,
         "wind_direction": 180,
         "cloud_cover": 1
      },
      "05/04/2024": {
         "rainfall": 0,
         "t_max": 41,
         "t_min": 27,
         "rh_max": 70,
         "rh_min": 23,
         "wind_speed": 15,
         "wind_direction": 207,
         "cloud_cover": 1
      },
      "06/04/2024": {
         "rainfall": 0,
         "t_max": 41,
         "t_min": 27,
         "rh_max": 67,
         "rh_min": 15,
         "wind_speed": 13,
         "wind_direction": 210,
         "cloud_cover": 0
      },
      "07/04/2024": {
         "rainfall": 0,
         "t_max": 42,
         "t_min": 27,
         "rh_max": 55,
         "rh_min": 10,
         "wind_speed": 12,
         "wind_direction": 242,
         "cloud_cover": 2
      }
   },
   "names_of_crops": [
      "ଧାନ।",
      "ଗ୍ରୀଷ୍ମ ଋତୁର ଡାଲି",
      "ତୈଳବୀଜ",
      "ପନିପରିବା",
      "ସୋରିଷ",
      "ଚିନାବାଦାମ",
      "ମୁଙ୍ଗ",
      "ବିରୀ",
      "କୁଲଥି",
      "ଆଖୁ",
      "ମକା",
      "ଟମାଟୋ",
      "ବାଇଗଣ",
      "ନଡ଼ିଆ",
      "ପନିପରିବା ଚାରା",
      "ଫିଙ୍ଗରଲିଙ୍ଗ୍"
   ],
   "general_advisory": "ଧାନ ଫସଲରେ, ପେନିକଲ୍ ଦୀକ୍ଷା, ପେନିକଲ୍ ଉତ୍ଥାନ, ଫୁଲ ଏବଂ କ୍ଷୀର ଦୋଇବା ପର୍ଯ୍ୟାୟ ହେଉଛି ଗୁରୁତ୍ୱପୂର୍ଣ୍ଣ ପର୍ଯ୍ୟାୟ | ଏହି ପର୍ଯ୍ୟାୟଗୁଡ଼ିକରେ ଜଳର ଅଭାବ କିମ୍ବା ଜଳର ଅଭାବ ଉତ୍ପାଦନରେ ଅପେକ୍ଷାକୃତ ଅଧିକ ହ୍ରାସ ଘଟାଇଥାଏ। ଆଖୁରେ ଶୁଖିଲା ପତ୍ରରେ ଧାଡ଼ିଗୁଡ଼ିକୁ ଢାଙ୍କି ଦିଅନ୍ତୁ। ଗ୍ରୀଷ୍ମ ଋତୁରେ ପାଣିର ଅଭାବରୁ ଫସଲକୁ ରକ୍ଷା କରିବା ପାଇଁ 4 ପ୍ରତିଶତ ପୋଟାସିୟମ ସହିତ ଉପର ପୋଷାକ ପିନ୍ଧନ୍ତୁ | ଉତ୍ତାପ ପ୍ରଭାବକୁ ହ୍ରାସ କରିବା ପାଇଁ ସ୍ପ୍ରିଂକଲର ଜଳସେଚନ ପ୍ରୟୋଗ କରନ୍ତୁ। ବିକଳ୍ପ ଧାଡ଼ିରେ ଜଳସେଚନ କରି 50 ପ୍ରତିଶତ ପର୍ଯ୍ୟନ୍ତ ଜଳ ସଞ୍ଚୟ କରନ୍ତୁ। ଉଚ୍ଚ ତାପମାତ୍ରା ମକା ଫସଲର ଜଳ ଆବଶ୍ୟକତା ବୃଦ୍ଧି କରିଥାଏ। ଫସଲକୁ ଜଳସେଚନ କରନ୍ତୁ। କ୍ଷେତରେ ପାଣି କେବେ ବି ଛଅ ଘଣ୍ଟାରୁ ଅଧିକ ସମୟ ପାଇଁ ଅଟକି ରହିବାକୁ ଦିଅନ୍ତୁ ନାହିଁ। ବାଲୁକାମୟ ଏବଂ ଦୋଆଁଶ ମାଟିରେ ଜଳସେଚନ ସମୟରେ ଜଳ ଅପଚୟକୁ ରୋକିବା ପାଇଁ ଜଳସେଚନ ଚ୍ୟାନେଲରେ ପଲିଥିନ୍ ବିସ୍ତାର କରନ୍ତୁ। ଦିନର ଉଚ୍ଚ ତାପମାତ୍ରାରେ ଟମାଟୋ ଏବଂ ବାଇଗଣ ଶୁଖିଯାଇପାରେ। ମୂଳ ଅଞ୍ଚଳରେ 10 ଲିଟର ପାଣିରେ 1 ଗ୍ରାମ୍ ସ୍ଟ୍ରେପ୍ଟୋସାଇକ୍ଲିନ୍ ଲଗାନ୍ତୁ। ଜଳକ୍ଷୟକୁ ହ୍ରାସ କରିବା ପାଇଁ ଏକ ନଡ଼ିଆ ଗଛ ଚାରିପାଖରେ ମଲ୍ଚ ନଡ଼ିଆ 1.8 ମି. ଛାଡ଼ିଥାଏ। ଦିନରେ ନୂତନ ଭାବରେ ରୋପଣ କରାଯାଇଥିବା ପନିପରିବା ଚାରା ଉପରେ କାଗଜ କ୍ୟାପ୍ ସହିତ ଆଚ୍ଛାଦନ କରନ୍ତୁ | ଅଗଭୀର ପୋଖରୀରେ, ଯଦି ପାଣିର ତାପମାତ୍ରା 30 ଡିଗ୍ରୀ ସେଲସିୟସକୁ ବୃଦ୍ଧି ପାଏ, ତେବେ ଫିଙ୍ଗରଲିଙ୍ଗସ ଅମଳ କରନ୍ତୁ। ପୋଖରୀରେ ଫିଙ୍ଗରଲିଂ ଲଗାଇବା ପୂର୍ବରୁ ପର୍ଯ୍ୟାପ୍ତ ଜଳ ଗଭୀରତା ସୁନିଶ୍ଚିତ କରନ୍ତୁ। ପି. ଏ. ଡି. ଡି. ୱାଇ. (ଗ୍ରୀଷ୍ମ): ହଳଦିଆ କାଣ୍ଡ ଛେଦକ ପରିଚାଳନା-ତାପମାତ୍ରା ବୃଦ୍ଧି ହେତୁ ଧାନ ଫସଲରେ କାଣ୍ଡ ଛେଦକ ସଂକ୍ରମଣ ବୃଦ୍ଧି ହେବାର ସମ୍ଭାବନା ରହିଛି। ଧାନରେ ହଳଦିଆ ଷ୍ଟେମ ବୋରର ପରିଚାଳନା ପାଇଁ ଫିପ୍ରୋନିଲ 5 ପ୍ରତିଶତ ଏସ୍ସି @400 ମିଲି/ଏକର କିମ୍ବା ଫ୍ଲୁବେଣ୍ଡିଆମାଇଡ୍ 20 ପ୍ରତିଶତ ଡବ୍ଲୁଜି @50 ଗ୍ରାମ୍/ଏକର କିମ୍ବା କ୍ଲୋରାଣ୍ଟ୍ରାନିଲିପ୍ରୋଲ 18.5% ଏସ୍ସି @60 ମିଲି/ଏକର କିମ୍ବା କ୍ରୋମାଫେନୋଜାଇଡ୍ 80 ପ୍ରତିଶତ ଡବ୍ଲ୍ୟୁ. ପି. @50 ଗ୍ରାମ୍/ଏକର ସ୍ପ୍ରେ କରନ୍ତୁ। ବିସ୍ଫୋରଣ ରୋଗ ପରିଚାଳନା-ବିସ୍ଫୋରଣ ରୋଗ ପରିଚାଳନା ପାଇଁ ହେକ୍ଟର ପିଛା 400-ମିଲି ହେକ୍ସାକୋନାଜୋଲ 5 ପ୍ରତିଶତ ଏସ୍. ସି. କିମ୍ବା ଏଜୋକ୍ସିସ୍ଟ୍ରୋବିନ୍ 18.2% + ଡିଫେନୋକାନାଜୋଲ 11.4% ଏସ୍. ସି. @200-ମିଲି/ଏକର କିମ୍ବା ଟେବୁକୋନାଜୋଲ 50 ପ୍ରତିଶତ + ଟ୍ରାଇଫ୍ଲୋକ୍ସିସ୍ଟ୍ରୋବିନ୍ 25 ପ୍ରତିଶତ ଡବ୍ଲୁ. ଜି. @80-ଗ୍ରାମ/ଏକର ସ୍ପ୍ରେ କରନ୍ତୁ। କଳା ଗ୍ରାମ ଏବଂ ସବୁଜ ଗ୍ରାମଃ ତମାଖୁ କ୍ୟାଟରପିଲର ପରିଚାଳନା-କ୍ଷେତର ଚାରିପାଖରେ କ୍ଲୋରପିରିଫସ୍ 1.5% ଡି @10 କିଲୋଗ୍ରାମରେ ଧୂଳି ଉଡ଼ାଇ କ୍ୟାଟର୍ପିଲର ସ୍ଥାନାନ୍ତରଣ ଯାଞ୍ଚ କରନ୍ତୁ। ରାସାୟନିକ ନିୟନ୍ତ୍ରଣ ପାଇଁ ନୋଭାଲୁରନ୍ 5.25% + ଇଣ୍ଡୋକ୍ସାକାର୍ବ 4.25% @400-ମିଲି/ଏକର କିମ୍ବା ଲାମ୍ବଡା ସାଇହାଲୋଥ୍ରିନ୍ 4.9 ସିଏସ୍ @300 ମିଲି କିମ୍ବା ଫ୍ଲୁବେଣ୍ଡିଆମାଇଡ୍ 20 ପ୍ରତିଶତ ଡବ୍ଲୁଜି @120 ଗ୍ରାମ ସ୍ପ୍ରେ କରନ୍ତୁ। କୀଟନାଶକ ସିଞ୍ଚନ ପାଇଁ ଏକର ପିଛା 200 ଲିଟର ପାଣି ଆବଶ୍ୟକ। ସୁଗାରକେନ୍ଃ ଅର୍ଲି ସୁଟ୍ ବୋରର୍ଃ ଆଖୁରେ ପ୍ରାରମ୍ଭିକ ସୁଟ୍ ବୋରର୍ ପରିଚାଳନା କରିବାକୁ, ଗରମ ମାସରେ ଫସଲକୁ ବାରମ୍ବାର ଜଳସେଚନ କରନ୍ତୁ | ଆକ୍ରମଣ କରାଯାଇଥିବା ଶୁଟ୍ କୁ ଠିକ୍ ସମୟରେ ଭୂମି ସ୍ତରରେ କିମ୍ବା ତଳେ କାଟିବା ଅଧିକାଂଶ କ୍ୟାଟର୍ପିଲାରର ବିନାଶ ନିଶ୍ଚିତ କରେ | ଅଣ୍ଡାକୁ ହାତ ଦ୍ୱାରା ସଂଗ୍ରହ କରି ନଷ୍ଟ କରନ୍ତୁ। ଫୁରୋରେ, ଫିପ୍ରୋନିଲ 0.3% ଜିଆର @10 କେଜି/ଏକର ପ୍ରୟୋଗ କରନ୍ତୁ ପ୍ରଥମ ମୃତ୍ତିକା ଉଠାଇବା ସମୟରେ। ବ୍ରିଞ୍ଜାଲ୍ଃ ବ୍ରିଞ୍ଜାଲ୍ ସୁଟ୍ ଏବଂ ଫଳ ଛେଦକ-ଏହି କୀଟକୁ ପରିଚାଳନା କରିବା ପାଇଁ, 20 ଟି ନମ୍ବର ସ୍ଥାପନ କରନ୍ତୁ | ଏକର ପିଛା ଲ୍ୟୁସିନ୍ ଲ୍ୟୁର୍ ଥିବା ଫେରୋମୋନ୍ ଫାନ୍ଦ। କୀଟ ସଂକ୍ରମଣର ପ୍ରାଥମିକ ପର୍ଯ୍ୟାୟରେ 200 ଲିଟର ପାଣିରେ ମିଶ୍ରଣ କରି ନିମ୍ବ-ଆଧାରିତ କୀଟନାଶକ (ଆଜାଦିରାକ୍ଟିନ) 1500 ପିପିଏମ @600-ମିଲି/ଏକର ସ୍ପ୍ରେ କରନ୍ତୁ। ରାସାୟନିକ ନିୟନ୍ତ୍ରଣ ପାଇଁ ଯାଆନ୍ତୁ ଯଦି ଟର୍ମିନାଲ୍ ଶୁଟର 4 ପ୍ରତିଶତ ଶୁଖିଲା ଅଛି କିମ୍ବା 14 ପ୍ରତିଶତ ଫଳ ବୋରର ଦ୍ୱାରା ସଂକ୍ରମିତ | ରାସାୟନିକ ନିୟନ୍ତ୍ରଣ ପାଇଁ ସ୍ପିନୋସାଦ୍ 45 ପ୍ରତିଶତ ଏସ୍. ସି. @75-ମିଲି/ଏକର କିମ୍ବା ଏମାମେକ୍ଟିନ୍ ବେନ୍ଜୋଏଟ୍ 5 ପ୍ରତିଶତ ଏସ୍. ଜି. @80-ଗ୍ରାମ୍/ଏକର କିମ୍ବା କ୍ଲୋରାଣ୍ଟ୍ରାନିଲିପ୍ରୋଲ୍ 18.5% ଏସ୍. ସି. @80-ମିଲି/ଏକର କିମ୍ବା ସ୍ପିନେଟୋରାମ୍ 11.7% ଏସ୍. ସି. @200-ମିଲି/ଏକର ସ୍ପ୍ରେ କରନ୍ତୁ। ସମାନ କୀଟନାଶକକୁ ପୁନରାବୃତ୍ତି କରନ୍ତୁ ନାହିଁ। ଉପରୋକ୍ତ ଯେ କୌଣସି କୀଟନାଶକକୁ 15 ଦିନର ବ୍ୟବଧାନରେ ବିକଳ୍ପ ଭାବେ ବ୍ୟବହାର କରନ୍ତୁ। ଓ. କେ. ଆର. ଏ.: ଶ୍ୱେତ ମାଛି ସଂକ୍ରମଣଃ ଓକ୍ରା ମଞ୍ଜିରେ ଶ୍ୱେତ ମାଛି ସଂକ୍ରମଣକୁ ରୋକିବା ପାଇଁ ବୁଣିବା ପୂର୍ବରୁ ଇମିଡାକ୍ଲୋପ୍ରିଡ୍ @7-ଗ୍ରାମ୍/କେଜି ମଞ୍ଜି ସହିତ ଚିକିତ୍ସା କରାଯିବା ଉଚିତ୍। ଫସଲର 2ରୁ 3ଟି ପତ୍ର ପର୍ଯ୍ୟାୟରୁ ଆରମ୍ଭ କରି ଅନେକ ହଳଦିଆ ଚଟପଟା ଜାଲ 8-10 ଲଗାନ୍ତୁ। ପିଜୁଳିଃ ପିଜୁଳି କାଟିବା ପରେ, କନ୍ଦ ଉପରେ 2-2.5 ସେ. ମି. ରଖି ଉପର ଭାଗକୁ କାଟି ଦିଅନ୍ତୁ। ଅମଳ ହୋଇଥିବା କନ୍ଦକୁ ଭଲ ଭାବେ ବାୟୁ ଚଳାଚଳ କରୁଥିବା କଂକ୍ରିଟ୍ ଚଟାଣ ଥିବା କୋଠରୀରେ ଶୁଖାଇବା ଉଚିତ। ଭଲ ଭାବେ ଶୁଖିଲା କନ୍ଦକୁ ଅଧିକ ସମୟ ପର୍ଯ୍ୟନ୍ତ ଗଚ୍ଛିତ ରଖାଯାଇପାରିବ। ମାଙ୍ଗୋଃ ଆମ୍ବ ହପର-ଆମ୍ବ ହପରମାନଙ୍କୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ ଇମିଡାକ୍ଲୋପ୍ରିଡ୍ 17.8% ଏସ୍. ଏଲ୍. @5 ମିଲି/15 ଲିଟର ପାଣି କିମ୍ବା ଥିୟାମେଥୋକ୍ସାମ୍ 25 ପ୍ରତିଶତ ଡବ୍ଲୁ. ଜି. @3 ମିଲି/15 ଲିଟର ପାଣି କିମ୍ବା ଏସିଟାମିପ୍ରିଡ୍ 20 ପ୍ରତିଶତ ଏସ୍. ପି. ସ୍ପ୍ରେ କରନ୍ତୁ। @4 ଗ୍ରାମ/15 ଲିଟର ପାଣି। ଗଛ ତଳେ ଧୂଆଁ ଲଗାଇବା ଦ୍ୱାରା କୀଟପତଙ୍ଗ ସଂଖ୍ୟା ହ୍ରାସ କରିବାରେ ମଧ୍ୟ ସହାୟତା ମିଳିପାରିବ।",
   "crops_data": {
      "paddy": {
         "advisory": [
            "ଧାନ ଫସଲରେ, ପେନିକଲ୍ ଦୀକ୍ଷା, ପେନିକଲ୍ ଉତ୍ଥାନ, ଫୁଲ ଫୁଟାଇବା ଏବଂ କ୍ଷୀର ଦୋଇବା ପର୍ଯ୍ୟାୟ ହେଉଛି ଗୁରୁତ୍ୱପୂର୍ଣ୍ଣ ପର୍ଯ୍ୟାୟ | ଏହି ପର୍ଯ୍ୟାୟଗୁଡ଼ିକରେ ଜଳର ଅଭାବ କିମ୍ବା ଜଳର ଅଭାବ ଉତ୍ପାଦନରେ ଅପେକ୍ଷାକୃତ ଅଧିକ ହ୍ରାସ ଘଟାଇଥାଏ।"
         ]
      },
      "sugarcane": {
         "advisory": [
            "ଆଖୁରେ ଶୁଖିଲା ପତ୍ରରେ ଧାଡ଼ିଗୁଡ଼ିକୁ ଢାଙ୍କି ଦିଅନ୍ତୁ। ଗ୍ରୀଷ୍ମ ଋତୁରେ ପାଣିର ଅଭାବରୁ ଫସଲକୁ ରକ୍ଷା କରିବା ପାଇଁ 4 ପ୍ରତିଶତ ପୋଟାସିୟମ ସହିତ ଉପର ପୋଷାକ ପିନ୍ଧନ୍ତୁ |"
         ]
      },
      "maize": {
         "advisory": [
            "ଉଚ୍ଚ ତାପମାତ୍ରା ମକା ଫସଲର ଜଳ ଆବଶ୍ୟକତା ବୃଦ୍ଧି କରିଥାଏ। ଫସଲକୁ ଜଳସେଚନ କରନ୍ତୁ। କ୍ଷେତରେ ପାଣି କେବେ ବି ଛଅ ଘଣ୍ଟାରୁ ଅଧିକ ସମୟ ପାଇଁ ଅଟକି ରହିବାକୁ ଦିଅନ୍ତୁ ନାହିଁ।"
         ]
      },
      "tomato": {
         "advisory": [
            "ଦିନର ଉଚ୍ଚ ତାପମାତ୍ରା ଟମାଟୋରେ ଶୁଷ୍କତା ସୃଷ୍ଟି କରିପାରେ। ମୂଳ ଅଞ୍ଚଳରେ 10 ଲିଟର ପାଣିରେ 1 ଗ୍ରାମ୍ ସ୍ଟ୍ରେପ୍ଟୋସାଇକ୍ଲିନ୍ ଲଗାନ୍ତୁ।"
         ]
      },
      "brinjal": {
         "advisory": [
            "ଦିନର ଉଚ୍ଚ ତାପମାତ୍ରା ବାଇଗଣରେ ଶୁଷ୍କତା ସୃଷ୍ଟି କରିପାରେ। ମୂଳ ଅଞ୍ଚଳରେ 10 ଲିଟର ପାଣିରେ 1 ଗ୍ରାମ୍ ସ୍ଟ୍ରେପ୍ଟୋସାଇକ୍ଲିନ୍ ଲଗାନ୍ତୁ।"
         ]
      },
      "coconut": {
         "advisory": [
            "ଜଳକ୍ଷୟକୁ ହ୍ରାସ କରିବା ପାଇଁ ଏକ ନଡ଼ିଆ ଗଛ ଚାରିପାଖରେ ମଲ୍ଚ ନଡ଼ିଆ 1.8 ମି. ଛାଡ଼ିଥାଏ।"
         ]
      },
      "vegetables": {
         "advisory": [
            "ଦିନରେ ନୂତନ ଭାବରେ ରୋପଣ କରାଯାଇଥିବା ପନିପରିବା ଚାରା ଉପରେ କାଗଜ କ୍ୟାପ୍ ସହିତ ଆଚ୍ଛାଦନ କରନ୍ତୁ |"
         ]
      },
      "fingerlings": {
         "advisory": [
            "ଅଗଭୀର ପୋଖରୀରେ, ଯଦି ପାଣିର ତାପମାତ୍ରା 30 ଡିଗ୍ରୀ ସେଲସିୟସକୁ ବୃଦ୍ଧି ପାଏ, ତେବେ ଫିଙ୍ଗରଲିଙ୍ଗ ଅମଳ କରନ୍ତୁ। ପୋଖରୀରେ ଫିଙ୍ଗରଲିଙ୍ଗ ଲଗାଇବା ପୂର୍ବରୁ ପର୍ଯ୍ୟାପ୍ତ ଜଳ ଗଭୀରତା ସୁନିଶ୍ଚିତ କରନ୍ତୁ।"
         ]
      },
      "summer pulses": {
         "advisory": [
            "ଗ୍ରୀଷ୍ମକାଳୀନ ଡାଲି ବୁଣିବା କାର୍ଯ୍ୟ ଜାରି ରହିଛି।"
         ]
      },
      "oilseed": {
         "advisory": [
            "ତୈଳବୀଜ ବୁଣିବା କାର୍ଯ୍ୟ ଜାରି ରହିଛି।"
         ]
      },
      "mustard": {
         "advisory": [
            "ସୋରିଷ ଅମଳ ଶେଷ ହୋଇଛି।"
         ]
      },
      "groundnut": {
         "advisory": [
            "ଚିନାବାଦାମ ଅମଳ ଶେଷ ହୋଇଛି।"
         ]
      },
      "mung": {
         "advisory": [
            "ମୁଗ ଅମଳ ଶେଷ ହୋଇଛି।"
         ]
      },
      "biri": {
         "advisory": [
            "ବିଡ଼ି ଅମଳ ଶେଷ ହୋଇଛି।"
         ]
      },
      "kulthi": {
         "advisory": [
            "କୁଲଥି ଅମଳ ଶେଷ ହୋଇଛି।"
         ]
      },
      "tobacco caterpillar": {
         "advisory": [
            "କ୍ଷେତର ଚାରିପାଖରେ କ୍ଲୋରପିରିଫସ୍ 1.5% ଡି @10 କିଲୋଗ୍ରାମରେ ଧୂଳିସାତ୍ କରି କ୍ୟାଟର୍ପିଲାର୍ମାନଙ୍କର ସ୍ଥାନାନ୍ତରଣ ଯାଞ୍ଚ କରନ୍ତୁ | ରାସାୟନିକ ନିୟନ୍ତ୍ରଣ ପାଇଁ ନୋଭାଲୁରନ୍ 5.25% + ଇଣ୍ଡୋକ୍ସାକାର୍ବ 4.25% @400-ମିଲି/ଏକର କିମ୍ବା ଲାମ୍ବଡା ସାଇହାଲୋଥ୍ରିନ୍ 4.9 ସିଏସ୍ @300 ମିଲି କିମ୍ବା ଫ୍ଲୁବେଣ୍ଡିଆମାଇଡ୍ 20 ପ୍ରତିଶତ ଡବ୍ଲୁଜି @120 ଗ୍ରାମ ସ୍ପ୍ରେ କରନ୍ତୁ। କୀଟନାଶକ ସିଞ୍ଚନ ପାଇଁ ଏକର ପିଛା 200 ଲିଟର ପାଣି ଆବଶ୍ୟକ।"
         ]
      }
   },
   "date": "02-04-2024"
}