{
   "weather_details": {
      "03/04/2024": {
         "rainfall": 0,
         "t_max": 40,
         "t_min": 26,
         "rh_max": 57,
         "rh_min": 13,
         "wind_speed": 12,
         "wind_direction": 205,
         "cloud_cover": 0
      },
      "04/04/2024": {
         "rainfall": 0,
         "t_max": 40,
         "t_min": 26,
         "rh_max": 80,
         "rh_min": 15,
         "wind_speed": 11,
         "wind_direction": 180,
         "cloud_cover": 1
      },
      "05/04/2024": {
         "rainfall": 0,
         "t_max": 41,
         "t_min": 27,
         "rh_max": 70,
         "rh_min": 23,
         "wind_speed": 15,
         "wind_direction": 207,
         "cloud_cover": 1
      },
      "06/04/2024": {
         "rainfall": 0,
         "t_max": 41,
         "t_min": 27,
         "rh_max": 67,
         "rh_min": 15,
         "wind_speed": 13,
         "wind_direction": 210,
         "cloud_cover": 0
      },
      "07/04/2024": {
         "rainfall": 0,
         "t_max": 42,
         "t_min": 27,
         "rh_max": 55,
         "rh_min": 10,
         "wind_speed": 12,
         "wind_direction": 242,
         "cloud_cover": 2
      }
   },
   "names_of_crops": [
      "ଧାନ।",
      "ଆଖୁ",
      "ମକା",
      "ଟମାଟୋ",
      "ନଡ଼ିଆ",
      "ବାଇଗଣ",
      "ଓକ୍ରା",
      "ରସୁଣ",
      "ଆମ୍ବ"
   ],
   "general_advisory": "ପାଣିପାଗ ଏବଂ ଫସଲ ବିଷୟରେ ସାଧାରଣ ପରାମର୍ଶଃ ଧାନ ଫସଲରେ, ପେନିକଲ୍ ଆରମ୍ଭ, ପେନିକଲ୍ ଉଦ୍ଭବ, ଫୁଲ ଏବଂ କ୍ଷୀର ଦୋଇବା ପର୍ଯ୍ୟାୟ ହେଉଛି ଗୁରୁତ୍ୱପୂର୍ଣ୍ଣ ପର୍ଯ୍ୟାୟ | ଏହି ପର୍ଯ୍ୟାୟରେ, ଜଳର ଅଭାବ କିମ୍ବା ଜଳର ଅଭାବ ଉତ୍ପାଦନରେ ଅପେକ୍ଷାକୃତ ଅଧିକ ହ୍ରାସ ଘଟାଇଥାଏ। ତେଣୁ, ଏହି ପର୍ଯ୍ୟାୟଗୁଡ଼ିକରେ ଜଳର ଅଭାବକୁ ଏଡ଼ାଇବା ଉଚିତ।",
   "crops_data": {
      "paddy": {
         "advisory": [
            "ଧାନ ଫସଲରେ, ପେନିକଲ୍ ଦୀକ୍ଷା, ପେନିକଲ୍ ଉତ୍ଥାନ, ଫୁଲ ଏବଂ କ୍ଷୀର ଦୋଇବା ପର୍ଯ୍ୟାୟ ହେଉଛି ଗୁରୁତ୍ୱପୂର୍ଣ୍ଣ ପର୍ଯ୍ୟାୟ | ଏହି ପର୍ଯ୍ୟାୟଗୁଡ଼ିକରେ ଜଳର ଅଭାବ କିମ୍ବା ଜଳର ଅଭାବ ଉତ୍ପାଦନରେ ଅପେକ୍ଷାକୃତ ଅଧିକ ହ୍ରାସ ଘଟାଇଥାଏ। ତେଣୁ, ଏହି ପର୍ଯ୍ୟାୟଗୁଡ଼ିକରେ ଜଳର ଅଭାବକୁ ଏଡ଼ାଇବା ଉଚିତ।"
         ]
      },
      "sugarcane": {
         "advisory": [
            "ଆଖୁରେ ଶୁଖିଲା ପତ୍ରରେ ଧାଡ଼ିଗୁଡ଼ିକୁ ଢାଙ୍କି ଦିଅନ୍ତୁ। ଗ୍ରୀଷ୍ମ ଋତୁରେ ପାଣିର ଅଭାବରୁ ଫସଲକୁ ରକ୍ଷା କରିବା ପାଇଁ 4 ପ୍ରତିଶତ ପୋଟାସିୟମ ସହିତ ଉପର ପୋଷାକ ପିନ୍ଧନ୍ତୁ |",
            "ଉତ୍ତାପ ପ୍ରଭାବକୁ ହ୍ରାସ କରିବା ପାଇଁ ସ୍ପ୍ରିଂକଲର ଜଳସେଚନ ପ୍ରୟୋଗ କରନ୍ତୁ। ବିକଳ୍ପ ଧାଡ଼ିରେ ଜଳସେଚନ କରି 50 ପ୍ରତିଶତ ପର୍ଯ୍ୟନ୍ତ ଜଳ ସଞ୍ଚୟ କରନ୍ତୁ।",
            "ଉଚ୍ଚ ତାପମାତ୍ରା ମକା ଫସଲର ଜଳ ଆବଶ୍ୟକତା ବୃଦ୍ଧି କରିଥାଏ। ଫସଲକୁ ଜଳସେଚନ କରନ୍ତୁ। କ୍ଷେତରେ ପାଣି କେବେ ବି ଛଅ ଘଣ୍ଟାରୁ ଅଧିକ ସମୟ ପାଇଁ ଅଟକି ରହିବାକୁ ଦିଅନ୍ତୁ ନାହିଁ।"
         ]
      },
      "maize": {
         "advisory": [
            "ଉଚ୍ଚ ତାପମାତ୍ରା ମକା ଫସଲର ଜଳ ଆବଶ୍ୟକତା ବୃଦ୍ଧି କରିଥାଏ। ଫସଲକୁ ଜଳସେଚନ କରନ୍ତୁ। କ୍ଷେତରେ ପାଣି କେବେ ବି ଛଅ ଘଣ୍ଟାରୁ ଅଧିକ ସମୟ ପାଇଁ ଅଟକି ରହିବାକୁ ଦିଅନ୍ତୁ ନାହିଁ। ବାଲୁକାମୟ ଏବଂ ଦୋଆଁଶ ମାଟିରେ ଜଳସେଚନ ସମୟରେ ଜଳ ଅପଚୟକୁ ରୋକିବା ପାଇଁ ଜଳସେଚନ ଚ୍ୟାନେଲରେ ପଲିଥିନ୍ ବିସ୍ତାର କରନ୍ତୁ।"
         ]
      },
      "tomato": {
         "advisory": [
            "ଦିନର ଉଚ୍ଚ ତାପମାତ୍ରାରେ ଟମାଟୋ ଏବଂ ବାଇଗଣ ଶୁଖିଯାଇପାରେ। ମୂଳ ଅଞ୍ଚଳରେ 10 ଲିଟର ପାଣିରେ 1 ଗ୍ରାମ୍ ସ୍ଟ୍ରେପ୍ଟୋସାଇକ୍ଲିନ୍ ଲଗାନ୍ତୁ।"
         ]
      },
      "coconut": {
         "advisory": [
            "ଜଳକ୍ଷୟକୁ ହ୍ରାସ କରିବା ପାଇଁ ଏକ ନଡ଼ିଆ ଗଛ ଚାରିପାଖରେ ମଲ୍ଚ ନଡ଼ିଆ 1.8 ମି. ଛାଡ଼ିଥାଏ।"
         ]
      },
      "brinjal": {
         "advisory": [
            "ଅଗଭୀର ପୋଖରୀରେ, ଯଦି ଜଳ ତାପମାତ୍ରା 30 ଡିଗ୍ରୀ ସେଲସିୟସକୁ ବୃଦ୍ଧି ପାଏ, ତେବେ ଫିଙ୍ଗରଲିଙ୍ଗସ ଅମଳ କରନ୍ତୁ। ପୋଖରୀରେ ଫିଙ୍ଗରଲିଂ ଲଗାଇବା ପୂର୍ବରୁ ପର୍ଯ୍ୟାପ୍ତ ଜଳ ଗଭୀରତା ସୁନିଶ୍ଚିତ କରନ୍ତୁ।",
            "ଦିନରେ ନୂତନ ଭାବରେ ରୋପଣ କରାଯାଇଥିବା ପନିପରିବା ଚାରା ଉପରେ କାଗଜ କ୍ୟାପ୍ ସହିତ ଆଚ୍ଛାଦନ କରନ୍ତୁ |"
         ]
      },
      "okra": {
         "advisory": [
            "ଶ୍ୱେତ ମାଛି ସଂକ୍ରମଣଃ ଓକ୍ରା ମଞ୍ଜିରେ ଶ୍ୱେତ ମାଛି ସଂକ୍ରମଣକୁ ରୋକିବା ପାଇଁ ବୁଣିବା ପୂର୍ବରୁ ଇମିଡାକ୍ଲୋପ୍ରିଡ୍ @7-ଗ୍ରାମ୍/କେଜି ମଞ୍ଜି ସହିତ ଚିକିତ୍ସା କରାଯିବା ଉଚିତ୍। ଫସଲର 2ରୁ 3ଟି ପତ୍ର ପର୍ଯ୍ୟାୟରୁ ଆରମ୍ଭ କରି ଅନେକ ହଳଦିଆ ଚଟପଟା ଜାଲ 8-10 ଲଗାନ୍ତୁ।"
         ]
      },
      "onion": {
         "advisory": [
            "ପିଆଜର ଅମଳ ପରେ, କନ୍ଦ ଉପରେ 2-2.5 ସେ. ମି. ରଖି ଉପର ଭାଗକୁ କାଟି ଦିଅନ୍ତୁ। ଅମଳ ହୋଇଥିବା କନ୍ଦକୁ ଭଲ ଭାବେ ବାୟୁ ଚଳାଚଳ କରୁଥିବା କଂକ୍ରିଟ୍ ଚଟାଣ ଥିବା କୋଠରୀରେ ଶୁଖାଇବା ଉଚିତ। ଭଲ ଭାବେ ଶୁଖିଲା କନ୍ଦକୁ ଅଧିକ ସମୟ ପର୍ଯ୍ୟନ୍ତ ଗଚ୍ଛିତ ରଖାଯାଇପାରିବ।"
         ]
      },
      "mango": {
         "advisory": [
            "ଆମ୍ବ ହପରମାନଙ୍କୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ ଇମିଡାକ୍ଲୋପ୍ରିଡ୍ 17.8% ଏସ୍. ଏଲ୍. @5 ମିଲି/15 ଲିଟର ପାଣି କିମ୍ବା ଥିୟାମେଥୋକ୍ସାମ୍ 25 ପ୍ରତିଶତ ଡବ୍ଲୁ. ଜି. @3 ମିଲି/15 ଲିଟର ପାଣି କିମ୍ବା ଏସିଟାମିପ୍ରିଡ୍ 20 ପ୍ରତିଶତ ଏସ୍. ପି. @4 ଗ୍ରାମ/15 ଲିଟର ପାଣି ସିଞ୍ଚନ କରନ୍ତୁ। ଗଛ ତଳେ ଧୂଆଁ ଲଗାଇବା ଦ୍ୱାରା କୀଟପତଙ୍ଗ ସଂଖ୍ୟା ହ୍ରାସ କରିବାରେ ମଧ୍ୟ ସହାୟକ ହୋଇଥାଏ।"
         ]
      }
   },
   "date": "02-04-2024"
}