{
   "weather_details": {
      "03/04/2024": {
         "rainfall": 0,
         "t_max": 40,
         "t_min": 26,
         "rh_max": 57,
         "rh_min": 13,
         "wind_speed": 12,
         "wind_direction": 205,
         "cloud_cover": 0
      },
      "04/04/2024": {
         "rainfall": 0,
         "t_max": 40,
         "t_min": 26,
         "rh_max": 80,
         "rh_min": 15,
         "wind_speed": 11,
         "wind_direction": 180,
         "cloud_cover": 1
      },
      "05/04/2024": {
         "rainfall": 0,
         "t_max": 41,
         "t_min": 27,
         "rh_max": 70,
         "rh_min": 23,
         "wind_speed": 15,
         "wind_direction": 207,
         "cloud_cover": 1
      },
      "06/04/2024": {
         "rainfall": 0,
         "t_max": 41,
         "t_min": 27,
         "rh_max": 67,
         "rh_min": 15,
         "wind_speed": 13,
         "wind_direction": 210,
         "cloud_cover": 0
      },
      "07/04/2024": {
         "rainfall": 0,
         "t_max": 42,
         "t_min": 27,
         "rh_max": 55,
         "rh_min": 10,
         "wind_speed": 12,
         "wind_direction": 242,
         "cloud_cover": 2
      }
   },
   "names_of_crops": [
      "ଧାନ।",
      "ଆଖୁ",
      "ମକା",
      "ଟମାଟୋ",
      "ବାଇଗଣ",
      "ନଡ଼ିଆ",
      "ପନିପରିବା",
      "ଫିଙ୍ଗରଲିଙ୍ଗ୍",
      "କଳା ଚଣା",
      "ସବୁଜ ଚଣା",
      "ଓକ୍ରା",
      "ରସୁଣ",
      "ଆମ୍ବ"
   ],
   "general_advisory": "ଧାନ ଫସଲରେ, ପେନିକଲ୍ ଦୀକ୍ଷା, ପେନିକଲ୍ ଉତ୍ଥାନ, ଫୁଲ ଏବଂ କ୍ଷୀର ଦୋଇବା ପର୍ଯ୍ଯ଼ାଯ଼ ହେଉଛି ଗୁରୁତ୍ୱପୂର୍ଣ୍ଣ ପର୍ଯ୍ଯ଼ାଯ଼ | ଏହି ପର୍ଯ୍ଯ଼ାଯ଼ଗୁଡ଼ିକରେ ଜଳର ଅଭାବ କିମ୍ବା ଜଳର ଅଭାବ ଉତ୍ପାଦନରେ ଅପେକ୍ଷାକୃତ ଅଧିକ ହ୍ରାସ ଘଟାଇଥାଏ। ତେଣୁ, ଏହି ପର୍ଯ୍ଯ଼ାଯ଼ଗୁଡ଼ିକରେ ଜଳର ଅଭାବକୁ ଏଡ଼ାଇବା ଉଚିତ। ଆଖୁରେ ଶୁଖିଲା ପତ୍ରରେ ଧାଡ଼ିଗୁଡ଼ିକୁ ଘୋଡାଇ ରଖନ୍ତୁ। ଗ୍ରୀଷ୍ମ ଋତୁରେ ପାଣିର ଅଭାବରୁ ଫସଲକୁ ରକ୍ଷା କରିବା ପାଇଁ 4 ପ୍ରତିଶତ ପୋଟାସିଯ଼ମ ସହିତ ଉପର ପୋଷାକ ପିନ୍ଧନ୍ତୁ | ଉତ୍ତାପ ପ୍ରଭାବକୁ ହ୍ରାସ କରିବା ପାଇଁ ସ୍ପ୍ରିଂକଲର ଜଳସେଚନ ପ୍ରଯ଼ୋଗ କରନ୍ତୁ। ବିକଳ୍ପ ଧାଡ଼ିରେ ପାଣି ଦେଇ 50 ପ୍ରତିଶତ ପର୍ଯ୍ଯ଼ନ୍ତ ଜଳ ସଞ୍ଚଯ଼ କରନ୍ତୁ। ଉଚ୍ଚ ତାପମାତ୍ରା ମକା ଫସଲର ଜଳ ଆବଶ୍ଯ଼କତା ବୃଦ୍ଧି କରିଥାଏ। ଫସଲକୁ ଜଳସେଚନ କରନ୍ତୁ। କ୍ଷେତରେ ପାଣି କେବେ ବି ଛଅ ଘଣ୍ଟାରୁ ଅଧିକ ସମଯ଼ ପାଇଁ ଅଟକି ରହିବାକୁ ଦିଅନ୍ତୁ ନାହିଁ। ବାଲୁକାମଯ଼ ଏବଂ ଦୋଆଁଶ ମାଟିରେ ଜଳସେଚନ ସମଯ଼ରେ ଜଳ ଅପଚଯ଼କୁ ରୋକିବା ପାଇଁ ଜଳସେଚନ ଚ୍ଯ଼ାନେଲରେ ପଲିଥିନ୍ ବିସ୍ତାର କରନ୍ତୁ। ଦିନରେ ଅଧିକ ତାପମାତ୍ରା ଯୋଗୁଁ ଟମାଟୋ ଏବଂ ବାଇଗଣ ଶୁଖିଯାଇପାରେ। ମୂଳ ଅଞ୍ଚଳରେ 10 ଲିଟର ପାଣିରେ 1 ଗ୍ରାମ୍ ସ୍ଟ୍ରେପ୍ଟୋସାଇକ୍ଲିନ୍ ଲଗାନ୍ତୁ। ଜଳକ୍ଷଯ଼ ହ୍ରାସ କରିବା ପାଇଁ ଏକ ନଡ଼ିଆ ଗଛ ଚାରିପଟେ ମଲ୍ଚ ନଡ଼ିଆ 1.8 ମିଟର ସ୍ଥାନ ଛାଡିଥାଏ। ଦିନରେ ନୂତନ ଭାବରେ ରୋପଣ କରାଯାଇଥିବା ପନିପରିବା ଚାରା ଉପରେ କାଗଜ କ୍ଯ଼ାପ୍ ସହିତ ଆଚ୍ଛାଦନ କରନ୍ତୁ | ଅଗଭୀର ପୋଖରୀରେ, ଯଦି ଜଳ ତାପମାତ୍ରା 30 ଡିଗ୍ରୀ ସେଲସିଯ଼ସକୁ ବୃଦ୍ଧି ପାଏ, ତେବେ ଫିଙ୍ଗରଲିଙ୍ଗ ଅମଳ କରନ୍ତୁ। ପୋଖରୀରେ ଫିଙ୍ଗରଲିଙ୍ଗ ଲଗାଇବା ପୂର୍ବରୁ ପର୍ଯ୍ଯ଼ାପ୍ତ ଜଳ ଗଭୀରତା ସୁନିଶ୍ଚିତ କରନ୍ତୁ।",
   "crops_data": {
      "paddy": {
         "advisory": [
            "ହଳଦିଆ କାଣ୍ଡ ଛେଦକ ପରିଚାଳନା-ତାପମାତ୍ରା ବୃଦ୍ଧି ହେତୁ ଧାନ ଫସଲରେ କାଣ୍ଡ ଛେଦକ ସଂକ୍ରମଣ ବୃଦ୍ଧି ହେବାର ସମ୍ଭାବନା ରହିଛି। ଧାନରେ ହଳଦିଆ ଷ୍ଟେମ ବୋରର ପରିଚାଳନା ପାଇଁ ଫିପ୍ରୋନିଲ 5 ପ୍ରତିଶତ ଏସ୍ସି @400 ମିଲି/ଏକର କିମ୍ବା ଫ୍ଲୁବେଣ୍ଡିଆମାଇଡ୍ 20 ପ୍ରତିଶତ ଡବ୍ଲୁଜି @50 ଗ୍ରାମ୍/ଏକର କିମ୍ବା କ୍ଲୋରାଣ୍ଟ୍ରାନିଲିପ୍ରୋଲ 18.5% ଏସ୍ସି @60 ମିଲି/ଏକର କିମ୍ବା କ୍ରୋମାଫେନୋଜାଇଡ୍ 80 ପ୍ରତିଶତ ଡବ୍ଲ୍ଯ଼ୁ. ପି. @50 ଗ୍ରାମ୍/ଏକର ସ୍ପ୍ରେ କରନ୍ତୁ।",
            "ବିସ୍ଫୋରଣ ରୋଗ ପରିଚାଳନା-ବିସ୍ଫୋରଣ ରୋଗ ପରିଚାଳନା ପାଇଁ ହେକ୍ଟର ପିଛା 400-ମିଲି ହେକ୍ସାକୋନାଜୋଲ 5 ପ୍ରତିଶତ ଏସ୍. ସି. କିମ୍ବା ଏଜୋକ୍ସିସ୍ଟ୍ରୋବିନ୍ <ଆଇ. ଡି. 2> + ଡିଫେନୋକାନାଜୋଲ <ଆଇ. ଡି. 1> ଏସ୍. ସି. @200-ମିଲି/ଏକର କିମ୍ବା ଟେବୁକୋନାଜୋଲ 50 ପ୍ରତିଶତ + ଟ୍ରାଇଫ୍ଲୋକ୍ସିସ୍ଟ୍ର ଓବିନ୍ 25 ପ୍ରତିଶତ ଡବ୍ଲୁ. ଜି. @80-ଗ୍ରାମ/ଏକର ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "sugarcane": {
         "advisory": [
            "ପ୍ରାରମ୍ଭିକ ସୁଟ୍ ବୋରର୍ଃ ଆଖୁରେ ପ୍ରାରମ୍ଭିକ ସୁଟ୍ ବୋରର୍ ପରିଚାଳନା କରିବାକୁ, ଗରମ ମାସରେ ଫସଲକୁ ବାରମ୍ବାର ଜଳସେଚନ କରନ୍ତୁ | ଆକ୍ରମଣ କରାଯାଇଥିବା ଶୁଟ୍ କୁ ଠିକ୍ ସମଯ଼ରେ ଭୂମି ସ୍ତରରେ କିମ୍ବା ତଳେ କାଟିବା ଅଧିକାଂଶ କ୍ଯ଼ାଟର୍ପିଲାରର ବିନାଶ ନିଶ୍ଚିତ କରେ | ଅଣ୍ଡାକୁ ହାତ ଦ୍ୱାରା ସଂଗ୍ରହ କରି ନଷ୍ଟ କରନ୍ତୁ। ଫୁରୋରେ, ଫିପ୍ରୋନିଲ 0.3% ଜିଆର @10 କେଜି/ଏକର ପ୍ରଯ଼ୋଗ କରନ୍ତୁ ପ୍ରଥମ ମୃତ୍ତିକା ଉଠାଇବା ସମଯ଼ରେ।"
         ]
      },
      "maize": {
         "advisory": [
            "ଉଚ୍ଚ ତାପମାତ୍ରା ମକା ଫସଲର ଜଳ ଆବଶ୍ଯ଼କତା ବୃଦ୍ଧି କରିଥାଏ। ଫସଲକୁ ଜଳସେଚନ କରନ୍ତୁ। କ୍ଷେତରେ ପାଣି କେବେ ବି ଛଅ ଘଣ୍ଟାରୁ ଅଧିକ ସମଯ଼ ପାଇଁ ଅଟକି ରହିବାକୁ ଦିଅନ୍ତୁ ନାହିଁ।"
         ]
      },
      "tomato": {
         "advisory": [
            "ଦିନରେ ଅଧିକ ତାପମାତ୍ରା ଯୋଗୁଁ ଟମାଟୋ ଶୁଖିଯାଇପାରେ। ମୂଳ ଅଞ୍ଚଳରେ 10 ଲିଟର ପାଣିରେ 1 ଗ୍ରାମ୍ ସ୍ଟ୍ରେପ୍ଟୋସାଇକ୍ଲିନ୍ ଲଗାନ୍ତୁ।"
         ]
      },
      "brinjal": {
         "advisory": [
            "ବାଇଗଣ ଶୁଟ୍ ଏବଂ ଫଳ ଛେଦକ-ଏହି କୀଟକୁ ପରିଚାଳନା କରିବା ପାଇଁ, ଏକର ପିଛା ଲ୍ଯ଼ୁସିନ୍ ଲ୍ଯ଼ୁର୍ ଥିବା 20 ଟି ଫେରୋମୋନ୍ ଟ୍ରାପ୍ ସ୍ଥାପନ କରନ୍ତୁ | କୀଟ ସଂକ୍ରମଣର ପ୍ରାଥମିକ ପର୍ଯ୍ଯ଼ାଯ଼ରେ, 200 ଲିଟର ପାଣିରେ ମିଶ୍ରଣ କରି ନିମ୍ବ-ଆଧାରିତ କୀଟନାଶକ (ଆଜାଦିରାକ୍ଟିନ) 1500 ପିପିଏମ @600-ମିଲି/ଏକର ସ୍ପ୍ରେ କରନ୍ତୁ। ରାସାଯ଼ନିକ ନିଯ଼ନ୍ତ୍ରଣ ପାଇଁ ଯାଆନ୍ତୁ ଯଦି ଟର୍ମିନାଲ୍ ଶୁଟର 4 ପ୍ରତିଶତ ଶୁଖିଲା ଅଛି କିମ୍ବା 14 ପ୍ରତିଶତ ଫଳ ବୋରର ଦ୍ୱାରା ସଂକ୍ରମିତ | ରାସାଯ଼ନିକ ନିଯ଼ନ୍ତ୍ରଣ ପାଇଁ ସ୍ପିନୋସାଦ୍ 45 ପ୍ରତିଶତ ଏସ୍. ସି. @75-ମିଲି/ଏକର କିମ୍ବା ଏମାମେକ୍ଟିନ୍ ବେନ୍ଜୋଏଟ୍ 5 ପ୍ରତିଶତ ଏସ୍. ଜି. @80-ଗ୍ରାମ୍/ଏକର କିମ୍ବା କ୍ଲୋରାଣ୍ଟ୍ରାନିଲିପ୍ରୋଲ୍ <ଆଇ. ଡି. 2> ଏସ୍. ସି. <ଆଇ. ଡି. 3>-ମିଲି/ଏକର କିମ୍ବା ସ୍ପିନେଟୋରାମ୍ <ଆଇ. ଡି. 1> ଏସ୍. ସି. @200-ମିଲି/ଏକର ସ୍ପ୍ରେ କରନ୍ତୁ। ସମାନ କୀଟନାଶକକୁ ପୁନରାବୃତ୍ତି କରନ୍ତୁ ନାହିଁ। ଉପରୋକ୍ତ ଯେ କୌଣସି କୀଟନାଶକକୁ 15 ଦିନର ବ୍ଯ଼ବଧାନରେ ବିକଳ୍ପ ଭାବେ ବ୍ଯ଼ବହାର କରନ୍ତୁ।"
         ]
      },
      "coconut": {
         "advisory": [
            "ଜଳକ୍ଷଯ଼ ହ୍ରାସ କରିବା ପାଇଁ ଏକ ନଡ଼ିଆ ଗଛ ଚାରିପଟେ ମଲ୍ଚ ନଡ଼ିଆ 1.8 ମିଟର ସ୍ଥାନ ଛାଡିଥାଏ।"
         ]
      },
      "vegetable": {
         "advisory": [
            "ଦିନରେ ନୂତନ ଭାବରେ ରୋପଣ କରାଯାଇଥିବା ପନିପରିବା ଚାରା ଉପରେ କାଗଜ କ୍ଯ଼ାପ୍ ସହିତ ଆଚ୍ଛାଦନ କରନ୍ତୁ |"
         ]
      },
      "fingerlings": {
         "advisory": [
            "ଅଗଭୀର ପୋଖରୀରେ, ଯଦି ପାଣିର ତାପମାତ୍ରା 30 ଡିଗ୍ରୀ ସେଲସିଯ଼ସକୁ ବୃଦ୍ଧି ପାଏ, ତେବେ ଫିଙ୍ଗରଲିଙ୍ଗ ଅମଳ କରନ୍ତୁ। ପୋଖରୀରେ ଫିଙ୍ଗରଲିଙ୍ଗ ଲଗାଇବା ପୂର୍ବରୁ ପର୍ଯ୍ଯ଼ାପ୍ତ ଜଳ ଗଭୀରତା ସୁନିଶ୍ଚିତ କରନ୍ତୁ।"
         ]
      },
      "black gram": {
         "advisory": [
            "ତମାଖୁ କ୍ଯ଼ାଟରପିଲର ମ୍ଯ଼ାନେଜମେଣ୍ଟ-କ୍ଷେତର ଚାରିପାଖରେ କ୍ଲୋରପିରିଫସ୍ 1.5% ଡି @10 କିଲୋଗ୍ରାମରେ ଧୂଳିସାତ୍ କରି କ୍ଯ଼ାଟର୍ପିଲର ସ୍ଥାନାନ୍ତରଣ ଯାଞ୍ଚ କରନ୍ତୁ | ରାସାଯ଼ନିକ ନିଯ଼ନ୍ତ୍ରଣ ପାଇଁ, ନୋଭାଲୁରନ୍ 5.25% + ଇଣ୍ଡୋକ୍ସାକାର୍ବ 4.25% @400-ମିଲି/ଏକର କିମ୍ବା ଲାମ୍ବଡା ସାଇହାଲୋଥ୍ରିନ୍ 4.9 ସିଏସ୍ @300 ମିଲି କିମ୍ବା ଫ୍ଲୁବେଣ୍ଡିଆମାଇଡ୍ 20 ପ୍ରତିଶତ ଡବ୍ଲୁଜି @120 ଗ୍ରାମ ସ୍ପ୍ରେ କରନ୍ତୁ। କୀଟନାଶକ ସିଞ୍ଚନ ପାଇଁ ଏକର ପିଛା 200 ଲିଟର ପାଣି ଆବଶ୍ଯ଼କ ହୋଇଥାଏ।"
         ]
      },
      "green gram": {
         "advisory": [
            "ତମାଖୁ କ୍ଯ଼ାଟରପିଲର ମ୍ଯ଼ାନେଜମେଣ୍ଟ-କ୍ଷେତର ଚାରିପାଖରେ କ୍ଲୋରପିରିଫସ୍ 1.5% ଡି @10 କିଲୋଗ୍ରାମରେ ଧୂଳିସାତ୍ କରି କ୍ଯ଼ାଟର୍ପିଲର ସ୍ଥାନାନ୍ତରଣ ଯାଞ୍ଚ କରନ୍ତୁ | ରାସାଯ଼ନିକ ନିଯ଼ନ୍ତ୍ରଣ ପାଇଁ ନୋଭାଲୁରନ୍ 5.25% + ଇଣ୍ଡୋକ୍ସାକାର୍ବ 4.25% @400-ମିଲି/ଏକର କିମ୍ବା ଲାମ୍ବଡା ସାଇହାଲୋଥ୍ରିନ୍ 4.9 ସିଏସ୍ @300 ମିଲି କିମ୍ବା ଫ୍ଲୁବେଣ୍ଡିଆମାଇଡ୍ 20 ପ୍ରତିଶତ ଡବ୍ଲୁଜି @120 ଗ୍ରାମ ସ୍ପ୍ରେ କରନ୍ତୁ। କୀଟନାଶକ ସିଞ୍ଚନ ପାଇଁ ଏକର ପିଛା 200 ଲିଟର ପାଣି ଆବଶ୍ଯ଼କ ହୋଇଥାଏ।"
         ]
      },
      "okra": {
         "advisory": [
            "ଶ୍ୱେତ ମାଛି ସଂକ୍ରମଣଃ ଓକ୍ରା ମଞ୍ଜିରେ ଶ୍ୱେତ ମାଛି ସଂକ୍ରମଣକୁ ରୋକିବା ପାଇଁ ବୁଣିବା ପୂର୍ବରୁ ଇମିଡାକ୍ଲୋପ୍ରିଡ୍ @7-ଗ୍ରାମ୍/କେଜି ମଞ୍ଜି ସହିତ ଚିକିତ୍ସା କରାଯିବା ଉଚିତ୍। ଫସଲର 2ରୁ 3ଟି ପତ୍ର ପର୍ଯ୍ଯ଼ାଯ଼ରୁ ଆରମ୍ଭ କରି ଅନେକ ହଳଦିଆ ଚଟପଟା ଜାଲ 8-10 ଲଗାନ୍ତୁ।"
         ]
      },
      "onion": {
         "advisory": [
            "ପିଆଜର ଅମଳ ପରେ, କନ୍ଦ ଉପରେ 2-2.5 ସେ. ମି. ରଖି ଉପର ଭାଗକୁ କାଟି ଦିଅନ୍ତୁ। ଅମଳ ହୋଇଥିବା କନ୍ଦକୁ ଭଲ ଭାବେ ବାଯ଼ୁ ଚଳାଚଳ କରୁଥିବା କଂକ୍ରିଟ୍ ଚଟାଣ ଥିବା କୋଠରୀରେ ଶୁଖାଇବା ଉଚିତ। ଭଲ ଭାବେ ଶୁଖିଲା କନ୍ଦକୁ ଅଧିକ ସମଯ଼ ପର୍ଯ୍ଯ଼ନ୍ତ ଗଚ୍ଛିତ ରଖାଯାଇପାରିବ।"
         ]
      },
      "mango": {
         "advisory": [
            "ଆମ୍ବ ହପର-ଆମ୍ବ ହପରକୁ ନିଯ଼ନ୍ତ୍ରଣ କରିବା ପାଇଁ ଇମିଡାକ୍ଲୋପ୍ରିଡ୍ <ଆଇ. ଡି. 1> ଏସ୍. ଏଲ୍. @5 ମିଲି/15 ଲିଟର ପାଣି କିମ୍ବା ଥାଯ଼ାମେଥୋକ୍ସାମ୍ 25 ପ୍ରତିଶତ ଡବ୍ଲୁ. ଜି. @3 ମିଲି/15 ଲିଟର ପାଣି କିମ୍ବା ଏସିଟାମିପ୍ରିଡ୍ 20 ପ୍ରତିଶତ ଏସ୍. ପି. @4 ଗ୍ରାମ/15 ଲିଟର ପାଣି ସିଞ୍ଚନ କରନ୍ତୁ। ଗଛ ତଳେ ଧୂଆଁ ଲଗାଇବା ଦ୍ୱାରା କୀଟପତଙ୍ଗ ସଂଖ୍ଯ଼ା ହ୍ରାସ କରିବାରେ ମଧ୍ଯ଼ ସହାଯ଼କ ହୋଇଥାଏ।"
         ]
      }
   },
   "date": "02-04-2024"
}