{
   "weather_details": {
      "30/10/2024": {
         "rainfall": 8,
         "t_max": 30,
         "t_min": 22,
         "rh_max": 98,
         "rh_min": 30,
         "wind_speed": 2,
         "wind_direction": 0,
         "cloud_cover": 7
      },
      "31/10/2024": {
         "rainfall": 11,
         "t_max": 30,
         "t_min": 23,
         "rh_max": 98,
         "rh_min": 31,
         "wind_speed": 2,
         "wind_direction": 100,
         "cloud_cover": 6
      },
      "01/11/2024": {
         "rainfall": 0,
         "t_max": 31,
         "t_min": 23,
         "rh_max": 96,
         "rh_min": 32,
         "wind_speed": 2,
         "wind_direction": 79,
         "cloud_cover": 5
      },
      "02/11/2024": {
         "rainfall": 0,
         "t_max": 32,
         "t_min": 23,
         "rh_max": 89,
         "rh_min": 31,
         "wind_speed": 1,
         "wind_direction": 34,
         "cloud_cover": 5
      },
      "03/11/2024": {
         "rainfall": 0,
         "t_max": 31,
         "t_min": 22,
         "rh_max": 86,
         "rh_min": 31,
         "wind_speed": 2,
         "wind_direction": 22,
         "cloud_cover": 4
      }
   },
   "names_of_crops": [
      "ଖରିଫ ଧାନ",
      "ରବି ଫସଲ",
      "ଗହମ",
      "ସୋରିଷ",
      "ପନିପରିବା ଫସଲ",
      "ପଶୁମାନେ",
      "ମତ୍ସ୍ଯ଼ଚାଷ"
   ],
   "general_advisory": "ଅତି ହାଲୁକା ରୁ ହାଲୁକା ବର୍ଷା ହେବାର ପୂର୍ବାନୁମାନ ହେତୁ ଫସଲ ଅମଳ କିଛି ଦିନ ପାଇଁ ସ୍ଥଗିତ ରଖାଯାଇଛି। ରବି ଫସଲ ବୁଣିବା ପାଇଁ ଯାଆନ୍ତୁ।",
   "crops_data": {
      "kharif paddy": {
         "advisory": [
            "ଧାନରେ କ୍ଷୀର ଦୋଇବା ସମଯ଼ରେ ଯେତେବେଳେ ଗୁଣ୍ଡି ବଗ୍ର ସଂଖ୍ଯ଼ା ଅର୍ଥନୈତିକ ସୀମା ସ୍ତର (ଇ. ଟି. ଏଲ୍.) ଅର୍ଥାତ୍ 2 ଜଣ ବଯ଼ସ୍କ/ପାହାଡ କିମ୍ବା 5 ଜଣ ବଯ଼ସ୍କ/ବର୍ଗ ମି. ରୁ ଅଧିକ ହୋଇଥାଏ, ମାଲାଥିଅନ୍ ଉପରେ ଏକର ପିଛା 10 କି. ଗ୍ରା. ଦରରେ 5 ପ୍ରତିଶତ ଧୂଳି ଉଡ଼ାନ୍ତୁ କିମ୍ବା ଇଟୋଫେନ୍ପ୍ରୋକ୍ସ 10 ଇ. ସି. @ଗ୍ରାମୀଣ କୃଷି ମୌସମ ସେବା ଭାରତ ପାଣିପାଗ ବିଭାଗ ଓଡ଼ିଶା କୃଷି ଏବଂ ପ୍ରଯୁକ୍ତିବିଦ୍ଯ଼ା ବିଶ୍ୱବିଦ୍ଯ଼ାଳଯ଼, ଆଞ୍ଚଳିକ ଗବେଷଣା ଏବଂ ପ୍ରଯୁକ୍ତିବିଦ୍ଯ଼ା ସ୍ଥାନାନ୍ତର ସବ୍ ଷ୍ଟେସନ୍, କିରି, ସୁନ୍ଦରଗଡ଼-770073 200 ମି. ଲି./ଏକର କିମ୍ବା କ୍ଲୋରୋପାଇରିଫୋସ୍ 20 ପ୍ରତିଶତ ଇ. ସି. <ଆଇ. ଡି. 1> ଏକର ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "rabi crops": {
         "advisory": [
            "ରବି ଫସଲ ପାଇଁ, କୃଷକମାନେ ଅକ୍ଟୋବର ମାସରେ ପତିତ କ୍ଷେତରେ ସେମାନଙ୍କର କ୍ଷେତ୍ର କାର୍ଯ୍ଯ଼ ଆରମ୍ଭ କରିପାରିବେ। ଟ୍ରାକ୍ଟର ଡ୍ରା ରୋଟୋରେଟର କିମ୍ବା କଲ୍ଟିଭେଟର ବ୍ଯ଼ବହାର କରାଯାଇପାରିବ ଏବଂ ଅଗଭୀର ହଳ କରିବା ଉଚିତ | ଅକ୍ଟୋବର ମାସରେ, ଗହମ, ମୁଗ, ଉଡ଼ଦ, ତୋରିଆ, ମକା, ସୂର୍ଯ୍ଯ଼ମୁଖୀ ଏବଂ ଘାସ ଫସଲ ନିଆଯାଇପାରେ।"
         ]
      },
      "wheat": {
         "advisory": [
            "ଯ଼ୁପି 262 ଭଳି ଉତ୍ତମ ମାନର ମଞ୍ଜି ସଂଗ୍ରହ କରନ୍ତୁ। ପ୍ରତି କିଲୋଗ୍ରାମ ମଞ୍ଜି ପିଛା 2 ଗ୍ରାମ ମୂଲ୍ଯ଼ରେ ଭିଟାବ୍ଯ଼ାକ୍ସ ଶକ୍ତିରେ ମଞ୍ଜିଗୁଡ଼ିକୁ ଚିକିତ୍ସା କରନ୍ତୁ। ବୁଣିବା ପୂର୍ବରୁ ଏକର ପିଛା 600 ଗ୍ରାମ୍ ପି. ଏସ୍. ବି. ସହିତ ମଧ୍ଯ଼ ଉପଚାର କରନ୍ତୁ। ଏକର ପିଛା ଏହାର ବିହନ ମୂଲ୍ଯ଼ 40 କିଲୋଗ୍ରାମ ରହିଛି।"
         ]
      },
      "mustard": {
         "advisory": [
            "ଯେଉଁ କୃଷକମାନେ ସୋରିଷ ଫସଲ ଚାଷ କରିବାକୁ ଚାହାଁନ୍ତି, ସେମାନେ କ୍ଷେତ ପ୍ରସ୍ତୁତ କରିବା ପରେ ବୁଣିବା ଆରମ୍ଭ କରିପାରିବେ ଏବଂ ଏହି ଅଞ୍ଚଳ ପାଇଁ ସୁପାରିଶ କରାଯାଇଥିବା ଉନ୍ନତ ମଞ୍ଜି ଯଥା ବରୁଣ, ପୁସା ବୋଲ୍ଡ, ଏମ 27, ଅନୁରାଧା ଇତ୍ୟାଦି ଚୟନ କରିପାରିବେ। ଗୋଟିଏ ଏକର ଜମିରେ ଚାଷ କରିବା ପାଇଁ 3 କିଲୋ ମଞ୍ଜି ଆବଶ୍ୟକ ହୋଇଥାଏ। 30 ସେ. ମି. ଦୂରରେ ଧାଡ଼ିରେ ମଞ୍ଜି ବୁଣନ୍ତୁ। (ଧାଡ଼ି ରୁ ଧାଡ଼ି) ଏବଂ 10 ସେ. ମି. (ଗଛରୁ ଗଛ)।"
         ]
      },
      "vegetable crop": {
         "advisory": [
            "ପନିପରିବା ଫସଲ ପାଇଁ ନର୍ସରୀ ପ୍ରସ୍ତୁତ କରନ୍ତୁ ଯାହା ରବି ଋତୁରେ ଅଧିକ ଲାଭ ପ୍ରଦାନ କରେ ଯେପରିକି ଫୁଲକୋବି, ବ୍ରୋକୋଲି, ବିଟ୍ ରୁଟ୍, ବିଳମ୍ବିତ କାକୁଡ଼ି, ବିଳମ୍ବରେ ତିକ୍ତ ଲାଉ ଫସଲ ପ୍ରୋ-ଟ୍ରେରେ କିମ୍ବା କ୍ଷେତ ପ୍ରସ୍ତୁତ କରିବା ପରେ ସିଧାସଳଖ ମଞ୍ଜି ବୁଣନ୍ତୁ |"
         ]
      },
      "animals": {
         "advisory": [
            "ପଶୁ ଏବଂ ପଶୁମାନଙ୍କୁ ସ୍ୱଚ୍ଛ ପାନୀଯ଼ ଜଳ ପ୍ରଦାନ କରିବା ସହିତ ସ୍ୱଚ୍ଛତା ବଜାଯ଼ ରଖିବା ଉଚିତ।"
         ]
      },
      "pisciculture": {
         "advisory": [
            "ଶରୀର ପୁଞ୍ଜିର 3 ପ୍ରତିଶତ ମାତ୍ରାରେ ଖଣିଜ ପଦାର୍ଥ ଦିଅନ୍ତୁ।"
         ]
      }
   },
   "date": "29-10-2024"
}