{
   "weather_details": {
      "29/01/2025": {
         "rainfall": 0,
         "t_max": 29,
         "t_min": 14,
         "rh_max": 88,
         "rh_min": 30,
         "wind_speed": 3,
         "wind_direction": 103,
         "cloud_cover": 3
      },
      "30/01/2025": {
         "rainfall": 0,
         "t_max": 29,
         "t_min": 14,
         "rh_max": 96,
         "rh_min": 33,
         "wind_speed": 4,
         "wind_direction": 107,
         "cloud_cover": 1
      },
      "31/01/2025": {
         "rainfall": 0,
         "t_max": 28,
         "t_min": 13,
         "rh_max": 87,
         "rh_min": 24,
         "wind_speed": 1,
         "wind_direction": 124,
         "cloud_cover": 1
      },
      "01/02/2025": {
         "rainfall": 0,
         "t_max": 28,
         "t_min": 13,
         "rh_max": 89,
         "rh_min": 25,
         "wind_speed": 1,
         "wind_direction": 124,
         "cloud_cover": 1
      },
      "02/02/2025": {
         "rainfall": 0,
         "t_max": 29,
         "t_min": 14,
         "rh_max": 90,
         "rh_min": 24,
         "wind_speed": 5,
         "wind_direction": 126,
         "cloud_cover": 3
      }
   },
   "names_of_crops": [
      "ମଞ୍ଜି ଏବଂ ସୋରିଷ",
      "ରବି ଧାନ",
      "ଗହମ",
      "ଗ୍ରୀଷ୍ମକାଳୀନ ମକା",
      "ସେସମମ୍",
      "ଗ୍ରୀଷ୍ମ ଋତୁର ଚିନାବାଦାମ",
      "ରସୁଣ"
   ],
   "general_advisory": "ଧାନ କ୍ଷେତରେ ହାଲୁକା ଜଳସେଚନ ବ୍ୟବସ୍ଥା କରନ୍ତୁ। ରବି ଫସଲ ପାଇଁ ଗୁରୁତ୍ୱପୂର୍ଣ୍ଣ ଜଳସେଚନ ବ୍ୟବସ୍ଥା ରଖନ୍ତୁ। କୀଟ ଆକ୍ରମଣ ପାଇଁ ସର୍ଭେ କରନ୍ତୁ ଏବଂ ଆବଶ୍ୟକ ପଦକ୍ଷେପ ନିଅନ୍ତୁ। ରବି ଫସଲରେ ସମ୍ପୂର୍ଣ୍ଣ ଜମି। ପାଣିପାଗ କାରଣରୁ, 200 ଲିଟର ପାଣିରେ 1 କିଲୋଗ୍ରାମ ସ୍ପ୍ରେ ସଲଫର୍ ପାଉଡର ପରିଚାଳନା କରିବା ପାଇଁ ବିଭିନ୍ନ ଫସଲରେ ପାଉଡର ଫଙ୍ଗୁର ସମ୍ଭାବନା ରହିଛି।",
   "crops_data": {
      "rape seed & mustard": {
         "advisory": [
            "ପାଣିପାଗ କାରଣରୁ, ଏଫିଡ୍, ସ୍ପ୍ରେ ଇମିଡାକ୍ଲୋପ୍ରିଡ୍ କିମ୍ବା ଡାଇମେଥୋଏଟ୍ @2 ମିଲି/ଲିଟରର ଗୁରୁତର ସଂକ୍ରମଣ ହେବ।",
            "ପୁଷ୍ପ ଏବଂ ଶୁଆ ବିକାଶ ପର୍ଯ୍ୟାୟରେ ଗୁରୁତ୍ୱପୂର୍ଣ୍ଣ ପର୍ଯ୍ୟାୟରେ ଗୋଟିଏ ଜଳସେଚନ ପ୍ରଦାନ କରନ୍ତୁ।"
         ]
      },
      "rabi paddy": {
         "advisory": [
            "ଚୂଡ଼ାନ୍ତ ଜମି ପ୍ରସ୍ତୁତି ପାଇଁ ଯାଆନ୍ତୁ ଏବଂ 35 କିଲୋଗ୍ରାମର ଗ୍ରାମୀଣ କୃଷି ମୌସୁମୀ ସେବା ପ୍ରୟୋଗ କରନ୍ତୁ।",
            "25-30 ଦିନ ପୁରୁଣା ଚାରା ରୋପଣ 20 x 15 ସେ. ମି. ବ୍ୟବଧାନରେ କରାଯିବା ଉଚିତ, ଅଧିକ ଉତ୍ପାଦନକ୍ଷମ ପ୍ରଜାତି ପାଇଁ ପ୍ରତି ପାହାଡ଼ରେ 2-3 ଚାରା ଲଗାଇବା ଉଚିତ।"
         ]
      },
      "wheat": {
         "advisory": [
            "ପାଣିପାଗ କାରଣରୁ, ଏହି ସ୍ପ୍ରେ ଟ୍ରାୟାଜୋଫସ୍ @2 ମିଲି/ଲିଟର ପାଣିକୁ ପରିଚାଳନା କରିବା ପାଇଁ ଷ୍ଟେମ ବୋରର ଆକ୍ରମଣର ସମ୍ଭାବନା ରହିଛି।",
            "ଦିନର ତାପମାତ୍ରା ବୃଦ୍ଧି ହେତୁ, ଫସଲକୁ ଗୁରୁତ୍ୱପୂର୍ଣ୍ଣ ପର୍ଯ୍ୟାୟ ଜଳସେଚନ ପ୍ରଦାନ କରନ୍ତୁ। ଯେକୌଣସି କୀଟ ପାଇଁ ସର୍ଭେ କରନ୍ତୁ।",
            "ଏକର ପିଛା 12-16 କିଲୋଗ୍ରାମ ନାଇଟ୍ରୋଜେନ୍ ଲଗାନ୍ତୁ।"
         ]
      },
      "summer maize": {
         "advisory": [
            "ମକା ବୁଣିବା ପାଇଁ ଏହା ଉପଯୁକ୍ତ ସମୟ। ମକା ବୁଣିବାରେ ବିଳମ୍ବ ପରାଗଣ ପର୍ଯ୍ୟାୟରେ ଉଚ୍ଚ ତାପମାତ୍ରା ସହିତ ସଂଯୋଗ ହେତୁ ପରାଗଣରେ ବାଧା ସୃଷ୍ଟି କରିବ |",
            "ବିଳମ୍ବ ନକରି ଏକର ପିଛା 6 କିଲୋଗ୍ରାମ ମକା ବୁଣନ୍ତୁ। ୱାର୍ମାଇଟ ପ୍ରବଣ ଅଞ୍ଚଳରେ ଏକର ପିଛା 10 କିଲୋଗ୍ରାମ କ୍ଲୋରପାଇପ ଲଗାନ୍ତୁ। ମୃତ୍ତିକାରେ 5 ସେ. ମି. ଗଭୀରତା ସହିତ ଦୂରତା ହେଉଛି 60 x 25 ସେ. ମି.।"
         ]
      },
      "sesamum": {
         "advisory": [
            "ପ୍ରାଚି, ଜି-10, କାଳିକା ଭଳି ତିଲ ପ୍ରତି ଏକର ପିଛା 3 କି. ଗ୍ରା. ରେ ବୁଣିବା ପାଇଁ ଯାଆନ୍ତୁ। ମୃତ୍ତିକା-ବାହିତ ଏବଂ ବୀଜ-ବାହିତ ରୋଗର ସୁରକ୍ଷା ପାଇଁ ମଞ୍ଜିଗୁଡ଼ିକୁ ଚିକିତ୍ସା କରନ୍ତୁ।",
            "ଏକର ପିଛା 12-8 କି. ଗ୍ରା. ଏନ. ପି. କେ. ସହିତ 10 କି. ଗ୍ରା. ଗନ୍ଧକକୁ ମୂଳ ମାତ୍ରା ଭାବେ ପ୍ରୟୋଗ କରନ୍ତୁ।"
         ]
      },
      "summer groundnut": {
         "advisory": [
            "30 x 10 ସେ. ମି. ବ୍ୟବଧାନରେ ଗ୍ରୀଷ୍ମକାଳୀନ ଚିନାବାଦାମର ସମ୍ପୂର୍ଣ୍ଣ ବୁଣିବା। ବୀଜର ହାର ହେଉଛି 50 କିଲୋଗ୍ରାମ ଶୁଆ/ଏସି। କଳିଙ୍ଗ ଚିନାବାଦମ୍, ଦେବୀ, ଧରଣୀ ପରି ଭଲ କିସମ |",
            "ପ୍ରାରମ୍ଭିକ ବୁଣାଯାଇଥିବା ଫସଲରେ, ଫୁଲ ଫୁଟିବା ପରେ ପରସ୍ପର ମଧ୍ୟରେ ଚାଷ କରନ୍ତୁ ନାହିଁ।"
         ]
      },
      "onion": {
         "advisory": [
            "ହାଲୁକା ଆନ୍ତଃ ଚାଷ କରିବାକୁ ପଡିବ କାରଣ ମୂଳଗୁଡ଼ିକ ଅଗଭୀର ହେବ ଏବଂ ମୃତ୍ତିକା ପୃଷ୍ଠରେ ଦେଖିବାକୁ ମିଳିବ |"
         ]
      }
   },
   "date": "28-01-2025"
}