{
   "weather_details": {
      "28/12/2024": {
         "rainfall": 0,
         "t_max": 28,
         "t_min": 16,
         "rh_max": 80,
         "rh_min": 37,
         "wind_speed": 2,
         "wind_direction": 18,
         "cloud_cover": 2
      },
      "29/12/2024": {
         "rainfall": 3,
         "t_max": 27,
         "t_min": 15,
         "rh_max": 81,
         "rh_min": 41,
         "wind_speed": 1,
         "wind_direction": 56,
         "cloud_cover": 4
      },
      "30/12/2024": {
         "rainfall": 3,
         "t_max": 27,
         "t_min": 15,
         "rh_max": 83,
         "rh_min": 46,
         "wind_speed": 3,
         "wind_direction": 45,
         "cloud_cover": 3
      },
      "31/12/2024": {
         "rainfall": 0,
         "t_max": 28,
         "t_min": 14,
         "rh_max": 83,
         "rh_min": 41,
         "wind_speed": 4,
         "wind_direction": 6,
         "cloud_cover": 1
      },
      "01/01/2025": {
         "rainfall": 0,
         "t_max": 28,
         "t_min": 13,
         "rh_max": 79,
         "rh_min": 34,
         "wind_speed": 4,
         "wind_direction": 90,
         "cloud_cover": 1
      }
   },
   "names_of_crops": [
      "ରବି ଧାନ",
      "ରବି ଚିନାବାଦାମ",
      "ଗହମ",
      "ଆଳୁ",
      "ଡାଲି ଫସଲ",
      "ଲଙ୍କା",
      "ରସୁଣ",
      "ମତ୍ସ୍ୟଚାଷ"
   ],
   "general_advisory": "ଆଗାମୀ 5 ଦିନ ମଧ୍ୟରେ ହାଲୁକା ବର୍ଷା ହେବାର ପୂର୍ବାନୁମାନ ହେତୁ, କୃଷି ଉତ୍ପାଦକୁ ଏକ ସୁରକ୍ଷିତ ସ୍ଥାନକୁ ସ୍ଥାନାନ୍ତର କରନ୍ତୁ କିମ୍ବା ଉପଯୁକ୍ତ ପଲିଥିନ୍ ସହିତ ଆଚ୍ଛାଦନ କରନ୍ତୁ ଏବଂ ରବି ଫସଲ ପାଇଁ ଗୁରୁତ୍ୱପୂର୍ଣ୍ଣ ଜଳସେଚନ ବ୍ୟବସ୍ଥା ରଖନ୍ତୁ | କୀଟ ଆକ୍ରମଣ ପାଇଁ ସର୍ଭେ କରନ୍ତୁ ଏବଂ ଆବଶ୍ୟକ ପଦକ୍ଷେପ ନିଅନ୍ତୁ। ରବି ଫସଲରେ ସମ୍ପୂର୍ଣ୍ଣ ଜମି। ପାଣିପାଗ କାରଣରୁ, 200 ଲିଟର ପାଣିରେ 1 କିଲୋ ସଲଫର୍ ପାଉଡର ସ୍ପ୍ରେ ପରିଚାଳନା କରିବା ପାଇଁ ବିଭିନ୍ନ ଫସଲରେ ପାଉଡର ଫଙ୍ଗୁର ସମ୍ଭାବନା ରହିଛି।",
   "crops_data": {
      "rabi paddy": {
         "advisory": [
            "ବର୍ତ୍ତମାନ ଧାନ କ୍ଷେତରେ ଯତ୍ନ ନେବା ଆବଶ୍ୟକ।",
            "ଧାନ କ୍ଷେତ 15 ଦିନ ପୁରୁଣା ହୋଇଗଲେ, 2 ପ୍ରତିଶତ ୟୁରିଆ ଛିଞ୍ଚି ଦିଅନ୍ତୁ।",
            "ରୋପଣର ଏକ ସପ୍ତାହ ପୂର୍ବରୁ, ପ୍ରତି 10 ଡେସିଲିଟର୍ କ୍ଷେତରେ 800 ଗ୍ରାମ ପୋଟାସିୟମ୍ ଲଗାନ୍ତୁ ଏବଂ 2 ରୁ 3 ଦିନ ପାଇଁ ପାଣିରେ ଭିଜାଇ ରଖନ୍ତୁ |"
         ]
      },
      "rabi groundnut": {
         "advisory": [
            "ଚାଇନିଜ୍ ବ୍ଲାଇଟ୍ର ଆକ୍ରମଣକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ ଲିଟର ପିଛା 2 ଗ୍ରାମ ହାରରେ ମେଟାଲାକ୍ସିଲ୍ ଏବଂ ମାଙ୍କୋଜେବ୍ ମିଶ୍ରଣ ସ୍ପ୍ରେ କରନ୍ତୁ |",
            "ରବି ଦାଲଚିନିରେ ବଡିଂ ରୋଗକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ, ଗଛରେ ଦୁଇଟି ପତ୍ର ଥିବାବେଳେ ଲିଟର ପିଛା 2 ଗ୍ରାମ ହାରରେ କାର୍ବେନଡାଜିମ୍ ଛିଞ୍ଚନ୍ତୁ |"
         ]
      },
      "wheat": {
         "advisory": [
            "ବିଳମ୍ବରେ ରୋପଣ କରାଯାଇଥିବା ଗହମର 25 ଦିନ ପରେ, ଅପତୃଣ ନିୟନ୍ତ୍ରଣ ପାଇଁ ଅପତୃଣ ଚୟନ କରନ୍ତୁ କିମ୍ବା ହେକ୍ଟର ପିଛା 1 କିଲୋଗ୍ରାମ 2-4-ଡି-ସୋଡ଼ିଅମ ହର୍ବିସାଇଡ ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "potato": {
         "advisory": [
            "ମେଘୁଆ ପାଗ ପୂର୍ବାନୁମାନ କାରଣରୁ ଆଳୁ ଫସଲରେ ପତ୍ର ରୋଗ ହେବାର ସମ୍ଭାବନା ରହିଛି। ଆଲୁର ରୋଗକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ କାର୍ବେନଡାଜିମ୍ 12 ପ୍ରତିଶତ + ମାନକୋଜେବ୍ 63 ପ୍ରତିଶତ ଡବ୍ଲୁ. ପି. @ଏକର ପିଛା 400 ଗ୍ରାମ୍ ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "pulse crop": {
         "advisory": [
            "ମଟର ଫସଲ ପରିପକ୍ୱ ହେବା ପରେ ମଟର ଚାଷ ହେବା ପରେ ତୁରନ୍ତ 2 ପ୍ରତିଶତ ଡିଏପି ଲଗାନ୍ତୁ।",
            "ମୁଗ ବିନ୍ ଆଦିର ସମ୍ଭାବ୍ୟ ସଂକ୍ରମଣ କ୍ଷେତ୍ରରେ, ଏକର ପିଛା 2000 ଲିଟର ପାଣିରେ 50 ମିଲି ଇମିଡାକ୍ଲୋପ୍ରିଡ୍ କିମ୍ବା 400 ମିଲି ମିଥାଇଲ ଡେମିଟନ୍ ସ୍ପ୍ରେ କରନ୍ତୁ।",
            "ମଟର ଏବଂ ବୁଟ ବ୍ଲାଇଟ୍ର ନିୟନ୍ତ୍ରଣ ପାଇଁ ଏକର ପିଛା 300 ଗ୍ରାମ କାର୍ବେନଡାଜିମ୍କୁ 200 ଲିଟର ପାଣିରେ ଲଗାନ୍ତୁ।"
         ]
      },
      "chilli": {
         "advisory": [
            "ଗୋଲମରିଚ ଫସଲରେ ଏଫିଡ୍କୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ ଲିଟର ପିଛା 2.5 ମିଲି ହାରରେ 50 ପ୍ରତିଶତ ଇସି ଇଥିୟନ ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "onion": {
         "advisory": [
            "ଆଗାଛା ହେଉଛି ପିଆଜ ଫସଲର ମୁଖ୍ୟ ଶତ୍ରୁ।",
            "ପିଆଜର ଗଛ ଉପରେ ହାଲୁକା ମାଟି ସ୍ତର ରହିବା ଉଚିତ ଏବଂ ସେଥିରେ ଅଧିକ ଆଳୁ ରଖିବା ଉଚିତ ନୁହେଁ।",
            "ପିଆଜ ରୋପଣର 60 ଦିନ ପରେ, ମୃତ୍ତିକାକୁ ନଷ୍ଟ କରିବା ଉଚିତ ନୁହେଁ।",
            "ତେଣୁ, 60 ଦିନ ପୂର୍ବରୁ, ହାଲୁକା ଭାବେ 2ରୁ 3 ଥର ଅମଳ କରନ୍ତୁ ଏବଂ ଅନାବୃତ ଘାସ ବାଛନ୍ତୁ।",
            "60 ଦିନ ପରେ, ଯଦି ଆବଶ୍ୟକ ହୁଏ, ମୃତ ଘାସକୁ ହାତ ଦ୍ୱାରା ବାହାର କରି ସଫା ରଖନ୍ତୁ |"
         ]
      },
      "fish farming": {
         "advisory": [
            "ଯଦି ଜୈବିକ ସାର ପ୍ରୟୋଗର 7 ଦିନ ପୂର୍ବରୁ ମାଛ ପୋଖରୀରେ ଅମ୍ଳତା 7.5 ରୁ କମ୍ ଥାଏ, ତେବେ ହେକ୍ଟର ମିଟର ପାଣିରେ 100 କିଲୋଗ୍ରାମ ଚୂନ ଲଗାନ୍ତୁ। 1 ହେକ୍ଟର ମାଛ ପୋଖରୀରେ 12500 ଯମଜ ଶିଶୁଙ୍କ ପାଇଁ ଦୈନିକ 3 କିଲୋ 750 ଗ୍ରାମ କାଣ୍ଡିକୁଣ୍ଡା ଏବଂ 3 କିଲୋ 750 ଗ୍ରାମ ବାଦାମ ପିଡିଆ ଖାଇବାକୁ ଦିଅନ୍ତୁ। ପୁଷ୍କରିଣୀର ନିମ୍ନସ୍ତରରେ ଥିବା ମିରିକାଲି ଏବଂ ବିଲାଟି ରୋହି ପୁଷ୍କରିଣୀର ଉପର ସ୍ତରକୁ ଉଠିଥିଲେ, ଯଦି ମାଟି ଦୁର୍ଗନ୍ଧଯୁକ୍ତ ହୋଇଥାଏ, ତେବେ ହେକ୍ଟର ମିଟର ପିଛା 50 କିଲୋଗ୍ରାମ ଜିଓଲାଇଟ ବ୍ୟବହାର କରନ୍ତୁ।"
         ]
      }
   },
   "date": "27-12-2024"
}