{
   "weather_details": {
      "07.02.2025": {
         "rainfall": 0,
         "t_max": 30,
         "t_min": 16,
         "rh_max": 85,
         "rh_min": 45,
         "wind_speed": 8,
         "wind_direction": 120,
         "cloud_cover": 4
      }
   },
   "names_of_crops": [
      "ଆଖୁ",
      "କଳା ଗ୍ରାମ",
      "ସବୁଜ ଚଣା",
      "ସୋରିଷ",
      "ଟମାଟୋ",
      "ଲଙ୍କା",
      "ଆଳୁ",
      "ରସୁଣ",
      "କଦଳୀ",
      "ଫୁଲକୋବି",
      "କାକୁଡ଼ି",
      "ଆମ୍ବ",
      "କୁକୁଡ଼ା ମାଂସ"
   ],
   "general_advisory": "ଭାଇରାଲ ରୋଗକୁ ରୋକିବା ପାଇଁ ପକ୍ଷୀମାନଙ୍କୁ ଆରଡି, ଫାଉଲ ପକ୍ସ ଏବଂ ଆଇବି ବିରୁଦ୍ଧରେ ଟୀକାକରଣ କରନ୍ତୁ। ସି. ଆର୍. ଡି. (କ୍ରନିକ୍ ରେସପିରେଟୋରୀ ଡିଜିଜ୍) କୁ ରୋକିବା ପାଇଁ ଆବର୍ଜନାକୁ ସଠିକ୍ ଭାବରେ ବଜାୟ ରଖନ୍ତୁ, କୀଟାଣୁମୁକ୍ତ କରିବାର ଯତ୍ନ ନିଅନ୍ତୁ ଏବଂ କୁକୁଡ଼ା ପାଳିରେ ଆମୋନିଆ ଜମା ହେବାରୁ ଦୂରେଇ ରୁହନ୍ତୁ |",
   "crops_data": {
      "sugarcane": {
         "advisory": [
            "ଆଖୁ ଫସଲ ରୋପଣ କରନ୍ତୁ।",
            "ରୋପଣ ପରେ ସେଟ୍ ଟ୍ରଟ୍ ରୋଗକୁ ପରିଚାଳନା କରିବା ପାଇଁ, କାର୍ବେନଡାଜିମ୍ 12 ପ୍ରତିଶତ + ମାନକୋଜେବ୍ 63 ପ୍ରତିଶତ ସହିତ ବେସାଲ୍ ଡ୍ରେଞ୍ଚିଂ କରନ୍ତୁ |",
            "ରୋପଣ ପରେ ସେଟ୍ ଟ୍ରଟ୍ ରୋଗକୁ ପରିଚାଳନା କରିବା ପାଇଁ, ମେଟାଲାକ୍ସିଲ୍ 8 ପ୍ରତିଶତ + ମାନକୋଜେବ୍ 64 ପ୍ରତିଶତ ଡବ୍ଲ୍ୟୁ. ପି. ସହିତ ପତ୍ର ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "blackgram": {
         "advisory": [
            "ସବୁଜ ଚଣା ଏବଂ କଳା ଚଣା ଫସଲରେ ବିହାରର ଲୋମଯୁକ୍ତ କ୍ୟାଟର୍ପିଲାରକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ କ୍ଲୋରପିରିଫସ୍ 50 ପ୍ରତିଶତ + ସାଇପର୍ମେଥ୍ରିନ 5 ପ୍ରତିଶତ ଇ. ସି. ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "green gram": {
         "advisory": [
            "ସବୁଜ ଚଣା ଏବଂ କଳା ଚଣା ଫସଲରେ ବିହାରର ଲୋମଯୁକ୍ତ କ୍ୟାଟର୍ପିଲାରକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ କ୍ଲୋରପିରିଫସ୍ 50 ପ୍ରତିଶତ + ସାଇପର୍ମେଥ୍ରିନ 5 ପ୍ରତିଶତ ଇ. ସି. ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "mustard": {
         "advisory": [
            "ସୋରିଷ ଫସଲରେ ଲିଫ୍ ୱେବର୍ ଏବଂ ସୋରଡ୍ ସାଫ୍ଲାଇ ସଂକ୍ରମଣର ପରିଚାଳନା ପାଇଁ, ଇଥୋଫେନ୍ପ୍ରୋକ୍ସ 10 ପ୍ରତିଶତ ଇସି ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "tomato": {
         "advisory": [
            "ଟମାଟୋରେ ଫଳ ଛେଦକକୁ ପରିଚାଳନା କରିବା ପାଇଁ, ପ୍ରଭାବିତ ଫଳ ଏବଂ ଲାର୍ଭା ସଂଗ୍ରହ ଏବଂ ନଷ୍ଟ କରନ୍ତୁ |"
         ]
      },
      "chilli": {
         "advisory": [
            "ଲଙ୍କା ଫସଲରେ ଫଳ ସଡ଼ିବା ଏବଂ ଡାଇ ବ୍ୟାକ୍ ରୋଗକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ ପ୍ରୋପିନେବ୍ ସ୍ପ୍ରେ 70 ପ୍ରତିଶତ ଡବ୍ଲ୍ୟୁ. ପି."
         ]
      },
      "potato": {
         "advisory": [
            "ଆଳୁ ଫସଲରେ କଟା ପୋକକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ କ୍ଲୋରପିରିଫସ୍ 50 ପ୍ରତିଶତ + ସାଇପର୍ମେଥ୍ରିନ୍ 5 ପ୍ରତିଶତ ଇ. ସି. ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "onion": {
         "advisory": [
            "ପିଆଜରେ ପର୍ପଲ ବ୍ଲଚ୍ ଏବଂ ଷ୍ଟେମଫିଲିଅମ୍ ଲିଫ୍ ବ୍ଲାଇଟ୍ ରୋଗକୁ ପରିଚାଳନା କରିବା ପାଇଁ, ମାନକୋଜେବ୍ 75 ପ୍ରତିଶତ ଡବ୍ଲ୍ୟୁ. ପି. ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "cabbage": {
         "advisory": [
            "ବିଳମ୍ବରେ ବୁଣାଯାଇଥିବା ଫୁଲକୋବି ଏବଂ ବନ୍ଧାକୋବି ଫସଲରେ ଡିମଣ୍ଡ ବ୍ୟାକ୍ ମଥ୍ ଏବଂ ହେଡ୍ ବୋରର୍ ପରିଚାଳନା କରିବା ପାଇଁ, କ୍ୟାଟର୍ପିଲାର୍ ସଂଗ୍ରହ ଏବଂ ନଷ୍ଟ କରନ୍ତୁ |"
         ]
      },
      "cauliflower": {
         "advisory": [
            "ବିଳମ୍ବରେ ବୁଣାଯାଇଥିବା ଫୁଲକୋବି ଏବଂ ବନ୍ଧାକୋବି ଫସଲରେ ଡିମଣ୍ଡ ବ୍ୟାକ୍ ମଥ୍ ଏବଂ ହେଡ୍ ବୋରର୍ ପରିଚାଳନା କରିବା ପାଇଁ, କ୍ୟାଟର୍ପିଲାର୍ ସଂଗ୍ରହ ଏବଂ ନଷ୍ଟ କରନ୍ତୁ |"
         ]
      },
      "cucurbits": {
         "advisory": [
            "କୁକୁଡ଼ାରେ ଏପିଲାକ୍ନା ବିଟଲର ସଂକ୍ରମଣକୁ ପରିଚାଳନା କରିବା ପାଇଁ, କ୍ଲୋରପିରିଫସ୍ 20 ପ୍ରତିଶତ ଇସି ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "mango": {
         "advisory": [
            "ଫୁଲ ବାହାରିବା ପରେ ନିୟମିତ ବ୍ୟବଧାନରେ ଜଳସେଚନ କରନ୍ତୁ।",
            "ଫୁଲ ବାହାରିବା ପରେ, ସବୁବେଳେ ମଧ୍ୟାହ୍ନ ଏବଂ ସନ୍ଧ୍ୟା ସମୟରେ ଫସଲକୁ ସିଞ୍ଚନ କରନ୍ତୁ।"
         ]
      },
      "poultry": {
         "advisory": [
            "ଭାଇରାଲ ରୋଗକୁ ରୋକିବା ପାଇଁ ପକ୍ଷୀମାନଙ୍କୁ ଆରଡି, ଫାଉଲ ପକ୍ସ ଏବଂ ଆଇବି ବିରୁଦ୍ଧରେ ଟୀକାକରଣ କରନ୍ତୁ",
            "ସି. ଆର୍. ଡି. (କ୍ରନିକ୍ ରେସପିରେଟୋରୀ ଡିଜିଜ୍) କୁ ରୋକିବା ପାଇଁ, ଆବର୍ଜନାକୁ ସଠିକ୍ ଭାବରେ ବଜାୟ ରଖନ୍ତୁ, କୀଟାଣୁମୁକ୍ତ କରିବାର ଯତ୍ନ ନିଅନ୍ତୁ ଏବଂ କୁକୁଡ଼ା ପାଳିରେ ଆମୋନିଆ ଜମା ହେବାରୁ ଦୂରେଇ ରୁହନ୍ତୁ।"
         ]
      }
   },
   "date": "07-02-2025"
}