{
   "weather_details": {
      "20.12.2024": {
         "rainfall": 0,
         "t_max": 28,
         "t_min": 16,
         "rh_max": 79,
         "rh_min": 34,
         "wind_speed": 10,
         "wind_direction": 120,
         "cloud_cover": 4
      }
   },
   "names_of_crops": [
      "ସୋରିଷ",
      "କାକୁଡ଼ି",
      "ଭାରତୀୟ ବିନ୍",
      "ପାଳଙ୍ଗ ଶାଗ",
      "ରସୁଣ",
      "ଆଳୁ",
      "ଫୁଲକୋବି"
   ],
   "general_advisory": "ସାଫ୍ଲାଇ ସଂକ୍ରମଣର ପରିଚାଳନା ପାଇଁ ସୋରିଷ ଫସଲ ପାଇଁ ଉପଯୁକ୍ତ ଜଳସେଚନ ଅଭ୍ୟାସ ସୁନିଶ୍ଚିତ କରନ୍ତୁ। କମ୍ ତାପମାତ୍ରା ହେତୁ କାକୁଡ଼ିରେ ଡାଉନି ଫଙ୍ଗୁକୁ ନିୟନ୍ତ୍ରଣ କରନ୍ତୁ। ଭାରତୀୟ ବିନ୍ ଗୁଡ଼ିକୁ ଏଫିଡ୍ ଠାରୁ ରକ୍ଷା କରନ୍ତୁ। ପାଳଙ୍ଗ ଏବଂ ରସୁଣ ପାଇଁ ଉପଯୁକ୍ତ ବୁଣିବା ଅଭ୍ୟାସ ଅନୁସରଣ କରନ୍ତୁ। ଆଳୁ ଏବଂ ଫୁଲକୋବିରେ ଆଲ୍ଟରନେରିଆ ପତ୍ର ଦାଗରେ ଶୀଘ୍ର ପତ୍ର ରୋଗ ପ୍ରତିରୋଧ କରନ୍ତୁ | ରୋଗରୁ ରକ୍ଷା ପାଇବା ପାଇଁ ପଶୁପାଳନରେ ଭଲ ବାୟୁ ଚଳାଚଳ ସୁନିଶ୍ଚିତ କରନ୍ତୁ।",
   "crops_data": {
      "mustard": {
         "advisory": [
            "ସୋରିଷ ଫସଲରେ ସାଫ୍ଲାଇ ସଂକ୍ରମଣ ହେବାର ସମ୍ଭାବନା ରହିବ।",
            "ଏହି କୀଟକୁ ପରିଚାଳନା କରିବା ପାଇଁ, ଚାରା ରୋପଣ ପର୍ଯ୍ୟାୟରେ ଜଳସେଚନ କରାଯିବା ଉଚିତ।",
            "ହାତ ଦ୍ୱାରା ସାଫ୍ଲାଇର ଗ୍ରବ୍ ସଂଗ୍ରହ ଏବଂ ନଷ୍ଟ କରନ୍ତୁ |",
            "ଇଥୋଫେନପ୍ରୋକ୍ସ 10 ପ୍ରତିଶତ ଇ. ସି. କିମ୍ବା କ୍ଲୋରପାଇରିଫସ୍ 50 ପ୍ରତିଶତ + ସାଇପର୍ମେଥ୍ରିନ 5 ପ୍ରତିଶତ ଇ. ସି. ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "cucurbits": {
         "advisory": [
            "ନିମ୍ନ ତାପମାତ୍ରା କାରଣରୁ ଡାଉନି ଫଙ୍ଗୁର ସଂକ୍ରମଣ ବୃଦ୍ଧି ପାଇବ।",
            "ମେଟାଲ୍ୟାକ୍ସିଲ 8% + ମାନକୋଜେବ 64% ଡବ୍ଲୁପି କିମ୍ବା ଫୋସେଟାଇଲ-ଏଏଲ 80% ଡବ୍ଲୁପି ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "indian bean": {
         "advisory": [
            "ଏଫିଡ୍ ପରିଚାଳନା କରିବା ପାଇଁ, ଏକର ପିଛା ହଳଦିଆ ଚଟପଟା ଜାଲ ଲଗାନ୍ତୁ।",
            "ଗୁରୁତର ସଂକ୍ରମଣ ହେଲେ ନିମ୍ବ ଆଧାରିତ କୀଟନାଶକ କିମ୍ବା ରାସାୟନିକ କୀଟନାଶକ ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "spinach": {
         "advisory": [
            "ପାଲକର ବିଭିନ୍ନ ପ୍ରକାର ମଧ୍ୟରେ ରହିଛି 'ପୁସା ପାଲକ୍', 'ଅଲ୍ ଗ୍ରୀନ୍', 'ପୁସା ଜ୍ୟୋତି', 'ପୁସା ହରିତ', 'କୋମଲ', 'ପଞ୍ଜାବ ଗ୍ରୀନ୍'।",
            "ବୁଣିବା ପୂର୍ବରୁ ମଞ୍ଜିଗୁଡ଼ିକୁ ପାଣିରେ ଭିଜାଇ ରଖନ୍ତୁ।"
         ]
      },
      "garlic": {
         "advisory": [
            "ଅଗ୍ରିଫାଉଣ୍ଡ୍ ହ୍ୱାଇଟ୍, ଜମୁନା ସାଫେଡ୍, ଜି-282, ଅଗ୍ରିଫାଉଣ୍ଡ୍ ପାର୍ବତୀ ଭଳି ଉଦ୍ଭିଦ ପ୍ରଜାତି।",
            "ରସୁଣ ଲବଙ୍ଗକୁ କାର୍ବେନଡାଜିମ୍ ସହିତ ଚିକିତ୍ସା କରନ୍ତୁ।",
            "ରସୁଣ ପାଇଁ ସର୍ବୋତ୍ତମ ବ୍ୟବଧାନ ବଜାୟ ରଖନ୍ତୁ |"
         ]
      },
      "potato": {
         "advisory": [
            "ଆଳୁରେ ପ୍ରାରମ୍ଭିକ ପତ୍ର ବ୍ଲାଇଟ୍ ରୋଗର ସମ୍ଭାବନା।",
            "ମାନକୋଜେବ୍ 75 ପ୍ରତିଶତ ଡବ୍ଲ୍ୟୁ. ପି. କିମ୍ବା କାର୍ବେଣ୍ଡାଜିମ୍ 12 ପ୍ରତିଶତ + ମାନକୋଜେବ୍ 63 ପ୍ରତିଶତ ଡବ୍ଲ୍ୟୁ. ପି. ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "cauliflower": {
         "advisory": [
            "ଆଲ୍ଟରନେରିଆ ଲିଫ୍ ସ୍ପଟ୍ ରୋଗକୁ ପରିଚାଳନା କରିବା ପାଇଁ, ମାନକୋଜେବ୍ 75 ପ୍ରତିଶତ ଡବ୍ଲ୍ୟୁ. ପି. କିମ୍ବା କାର୍ବେଣ୍ଡାଜିମ୍ 12 ପ୍ରତିଶତ + ମାନକୋଜେବ୍ 63 ପ୍ରତିଶତ ଡବ୍ଲ୍ୟୁ. ପି. ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      }
   },
   "date": "20-12-2024"
}