{
   "weather_details": {
      "31.01.2025": {
         "rainfall": 0,
         "t_max": 32,
         "t_min": 18,
         "rh_max": 90,
         "rh_min": 55,
         "wind_speed": 10,
         "wind_direction": 120,
         "cloud_cover": 5
      }
   },
   "names_of_crops": [
      "ଚିନାବାଦାମ",
      "ଆଖୁ",
      "ଆଳୁ",
      "ରସୁଣ",
      "କଦଳୀ",
      "ଫୁଲକୋବି",
      "ଲଙ୍କା",
      "ବାଇଗଣ",
      "ଆମ୍ବ",
      "ଜାସ୍ମିନ୍"
   ],
   "general_advisory": "ଉଲ୍ଲିଖିତ ଫସଲରେ କୀଟ ସଂକ୍ରମଣ ଏବଂ ରୋଗ ଉପରେ ତୀକ୍ଷ୍ଣ ନଜର ରଖନ୍ତୁ | ଫଳପ୍ରଦ କୀଟ ପରିଚାଳନା ପାଇଁ ସୁପାରିଶ କରାଯାଇଥିବା ସିଞ୍ଚନ କାର୍ଯ୍ୟସୂଚୀ ଏବଂ ମାତ୍ରା ଅନୁସରଣ କରନ୍ତୁ। ଉତ୍ତମ ଫୁଲ ପାଇଁ ଚମେଲୀ ଗଛ କାଟି ଦିଅନ୍ତୁ।",
   "crops_data": {
      "groundnut": {
         "advisory": [
            "ଚିନାବାଦାମରେ ଟିକ୍କା ରୋଗକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ କ୍ଲୋରୋଥାଲୋନିଲ୍ 75 ପ୍ରତିଶତ ଡବ୍ଲ୍ୟୁ. ପି. କିମ୍ବା ମାନକୋଜେବ୍ 75 ପ୍ରତିଶତ ଡବ୍ଲ୍ୟୁ. ପି. କିମ୍ବା ହେକ୍ସାକୋନାଜୋଲ୍ 5 ପ୍ରତିଶତ ଇ. ସି. ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "sugarcane": {
         "advisory": [
            "ରୋପଣ ସମୟରେ 87 କିଲୋଗ୍ରାମ ଡିଏପି, 20 କିଲୋଗ୍ରାମ ଏମଓପି ଏବଂ 4 ଟନ ଏଫ୍. ଆଇ. ଏମ୍. ପ୍ରୟୋଗ କରନ୍ତୁ।"
         ]
      },
      "potato": {
         "advisory": [
            "ଆଳୁ ଫସଲରେ କଟା ପୋକକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ କ୍ଲୋରପିରିଫସ୍ 50 ପ୍ରତିଶତ + ସାଇପର୍ମେଥ୍ରିନ୍ 5 ପ୍ରତିଶତ ଇ. ସି. ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "onion": {
         "advisory": [
            "ପିଆଜରେ ବାଇଗଣୀ ବ୍ଲଚ୍ ଏବଂ ଷ୍ଟେମଫିଲିଅମ୍ ଲିଫ୍ ବ୍ଲାଇଟ୍ ରୋଗକୁ ପରିଚାଳନା କରିବା ପାଇଁ, ମାନକୋଜେବ୍ 75 ପ୍ରତିଶତ ଡବ୍ଲ୍ୟୁ. ପି. କିମ୍ବା ଡିଫେନୋକାନାଜୋଲ୍ 25 ପ୍ରତିଶତ ଇ. ସି. କିମ୍ବା ଟେବୁକୋନାଜୋଲ୍ 25.9% ଇ. ସି. ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "cabbage": {
         "advisory": [
            "ବିଳମ୍ବରେ ବୁଣାଯାଇଥିବା ଫୁଲକୋବି ଏବଂ ବନ୍ଧାକୋବି ଫସଲରେ ଡିମଣ୍ଡ ବ୍ୟାକ୍ ମଥ୍ ଏବଂ ହେଡ୍ ବୋରର୍ ପରିଚାଳନା କରିବା ପାଇଁ, ନିମ୍ ଆଧାରିତ କୀଟନାଶକ (ଆଜାଦିରାକ୍ଟିନ) 300 ପିପିଏମ ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "cauliflower": {
         "advisory": [
            "ବିଳମ୍ବରେ ବୁଣାଯାଇଥିବା ଫୁଲକୋବି ଏବଂ ବନ୍ଧାକୋବି ଫସଲରେ ଡିମଣ୍ଡ ବ୍ୟାକ୍ ମଥ୍ ଏବଂ ହେଡ୍ ବୋରର୍ ପରିଚାଳନା କରିବା ପାଇଁ, ନିମ୍ ଆଧାରିତ କୀଟନାଶକ (ଆଜାଦିରାକ୍ଟିନ) 300 ପିପିଏମ ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "chilli": {
         "advisory": [
            "ଲଙ୍କା ଫସଲରେ ଥ୍ରୀପ୍ ପରିଚାଳନା କରିବା ପାଇଁ, ନିମ-ଆଧାରିତ କୀଟନାଶକ (ଆଜାଦିରାକ୍ଟିନ) 1500 ପିପିଏମ ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "brinjal": {
         "advisory": [
            "ବାଇଗଣରେ ଏପିଲାକ୍ନା ବିଟଲ ସଂକ୍ରମଣକୁ ପରିଚାଳନା କରିବା ପାଇଁ, ଏକ ବାଲ୍ଟି କିରୋସିନ୍ ମିଶ୍ରିତ ପାଣିରେ ଗ୍ରବ୍, ପିଉପା ଏବଂ ବୟସ୍କମାନଙ୍କୁ ହଟାଇବା ପାଇଁ ଗଛକୁ ହଲାନ୍ତୁ |"
         ]
      },
      "mango": {
         "advisory": [
            "ଆମ୍ବ ହପର ପରିଚାଳନା ପାଇଁ ଇମିଡାକ୍ଲୋପ୍ରିଡ୍ 17.8% ଏସ୍. ଏଲ୍. କିମ୍ବା ଥାୟାମେଥୋକ୍ସାମ୍ 25 ପ୍ରତିଶତ ଡବ୍ଲୁ. ଜି. କିମ୍ବା ଏସିଟାମିପ୍ରିଡ୍ 20 ପ୍ରତିଶତ ଏସ୍. ପି. ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "jasmine": {
         "advisory": [
            "ଉତ୍ତମ ଫୁଲ ପାଇଁ ଚମେଲୀ ଗଛ କାଟି ଦିଅନ୍ତୁ।"
         ]
      }
   },
   "date": "31-01-2025"
}