{
   "weather_details": {
      "18.10.2024": {
         "rainfall": 0,
         "t_max": 33,
         "t_min": 23,
         "rh_max": 89,
         "rh_min": 60,
         "wind_speed": 7,
         "wind_direction": 180,
         "cloud_cover": 4
      }
   },
   "names_of_crops": [
      "ଚିନାବାଦାମ",
      "ଆଖୁ",
      "ଆଳୁ",
      "ରସୁଣ",
      "ଟମାଟୋ",
      "ଲଙ୍କା",
      "କଦଳୀ",
      "ଫୁଲକୋବି"
   ],
   "general_advisory": "ଉଚ୍ଚ ଅଙ୍କୁରୋଦଗମ ହାର ବଜାୟ ରଖିବା ପାଇଁ ଡେସିକାଣ୍ଟ ସହିତ ପଲିଥିନ୍ ଲାଇନ୍ ହୋଇଥିବା ଗନ୍ନୀ ବ୍ୟାଗରେ ଚିନାବାଦାମର ଉପଯୁକ୍ତ ସଂରକ୍ଷଣ ନିଶ୍ଚିତ କରନ୍ତୁ | ଉପଯୁକ୍ତ କୀଟନାଶକ ଦ୍ୱାରା ଆଖୁରେ ସଂକ୍ରମଣକୁ ରୋକନ୍ତୁ। ଚାଷ ପାଇଁ ଉପଯୁକ୍ତ ଆଳୁ, ଆଳୁ, ଟମାଟୋ, ଲଙ୍କା, ବନ୍ଧାକୋବି ଏବଂ ଫୁଲକୋବି କିସମ ବାଛନ୍ତୁ।",
   "crops_data": {
      "groundnut": {
         "advisory": [
            "ଫଳପ୍ରଦ ଷ୍ଟୋରେଜ୍ ପାଇଁ ଫିଉଜଡ୍ କ୍ଯ଼ାଲସିଯ଼ମ୍ କ୍ଲୋରାଇଡ୍ ପରି ଡେସିକାଣ୍ଟ ସହିତ ପଲିଥିନ୍ ଲାଇନ୍ ଗନ୍ନୀ ବ୍ଯ଼ାଗରେ ଚିନାବାଦାମ ଷ୍ଟୋର୍ କରନ୍ତୁ |"
         ]
      },
      "sugarcane": {
         "advisory": [
            "ଇମିଡାକ୍ଲୋପ୍ରିଡ୍ ଦ୍ରବଣରେ ପୂର୍ବରୁ ସେଟ୍ ଭିଜାଇ ସ୍କେଲ୍ କୀଟ ସଂକ୍ରମଣକୁ ରୋକନ୍ତୁ |",
            "କୀଟ ନିୟନ୍ତ୍ରଣ ପାଇଁ ଟ୍ରାଇକୋଗ୍ରାମ ଚିଲିନିସ୍ କାର୍ଡ ବ୍ୟବହାର କରନ୍ତୁ।",
            "ରାସାଯ଼ନିକ ନିଯ଼ନ୍ତ୍ରଣ ପାଇଁ ଥାଯ଼ାମେଥୋକ୍ସାମ୍, ଇମିଡାକ୍ଲୋପ୍ରିଡ୍, କିମ୍ବା ଏସିଟାମିପ୍ରିଡ୍ ପ୍ରଯ଼ୋଗ କରନ୍ତୁ।"
         ]
      },
      "potato": {
         "advisory": [
            "ରୋପଣ ପାଇଁ ସୁପାରିଶ କରାଯାଇଥିବା କିସମର ରୋଗ-ମୁକ୍ତ ଏବଂ ଭଲ ଭାବେ ଅଙ୍କୁରିତ କନ୍ଦ ମଞ୍ଜି ବାଛନ୍ତୁ।",
            "ବୀଜର ଆକାର ଏବଂ ଏକର ଆଧାରରେ ଆବଶ୍ଯ଼କ ପରିମାଣର କନ୍ଦ ମଞ୍ଜି ଗଣନା କରନ୍ତୁ।"
         ]
      },
      "onion": {
         "advisory": [
            "ଶୀତକାଳୀନ ଚାଷ ପାଇଁ ଉପଯୁକ୍ତ ପ୍ରକାରର ପିଆଜର ଚଯ଼ନ କରନ୍ତୁ।",
            "ନର୍ସରୀ ଚାଷ ପାଇଁ ଏକର ଆଧାରରେ ମଞ୍ଜି ପରିମାଣ ନିର୍ଦ୍ଧାରଣ କରନ୍ତୁ।"
         ]
      },
      "tomato": {
         "advisory": [
            "ଟମାଟୋ ଚାଷ ପାଇଁ ସୁପାରିସ କରାଯାଇଥିବା ମୂଳ ସାର ପ୍ରଯ଼ୋଗ କରନ୍ତୁ।",
            "ସର୍ବୋତ୍ତମ ଉଦ୍ଭିଦ ବୃଦ୍ଧି ପାଇଁ ଉପଯୁକ୍ତ ବ୍ଯ଼ବଧାନ ବଜାଯ଼ ରଖନ୍ତୁ |"
         ]
      },
      "chilli": {
         "advisory": [
            "ଲଙ୍କା ଚାରା ରୋପଣ କରିବା ପୂର୍ବରୁ ନିର୍ଦ୍ଦିଷ୍ଟ ମୂଳ ସାର ପ୍ରୟୋଗ କରନ୍ତୁ।",
            "ରୋପଣ ସମୟରେ ସୁପାରିଶ କରାଯାଇଥିବା ଧାଡ଼ି ଏବଂ ଗଛ ମଧ୍ୟରେ ବ୍ୟବଧାନ ବଜାୟ ରଖନ୍ତୁ।"
         ]
      },
      "cabbage": {
         "advisory": [
            "ବିଭିନ୍ନ ପ୍ରକାରର ବନ୍ଧାକୋବି ପାଇଁ ଉପଯୁକ୍ତ ଧାଡ଼ି ଏବଂ ଗଛର ବ୍ଯ଼ବଧାନ ବଜାଯ଼ ରଖନ୍ତୁ |",
            "ଉନ୍ନତ ପ୍ରତିଷ୍ଠା ପାଇଁ ଅପରାହ୍ନରେ ଚାରା ରୋପଣ କରନ୍ତୁ।"
         ]
      },
      "cauliflower": {
         "advisory": [
            "ସଫଳ ରୋପଣ ପାଇଁ ଫୁଲକୋବିର ବିଭିନ୍ନତା ଅନୁଯାଯ଼ୀ ଧାଡ଼ି ଏବଂ ଗଛର ବ୍ଯ଼ବଧାନକୁ ଆଡଜଷ୍ଟ କରନ୍ତୁ।"
         ]
      }
   },
   "date": "18-10-2024"
}