{
   "weather_details": {
      "10-07-2024": {
         "rainfall": 4,
         "t_max": 34,
         "t_min": 26,
         "rh_max": 83,
         "rh_min": 46,
         "wind_speed": 13,
         "wind_direction": 159,
         "cloud_cover": 6
      },
      "11-07-2024": {
         "rainfall": 5,
         "t_max": 34,
         "t_min": 26,
         "rh_max": 81,
         "rh_min": 48,
         "wind_speed": 11,
         "wind_direction": 171,
         "cloud_cover": 7
      },
      "12-07-2024": {
         "rainfall": 4,
         "t_max": 35,
         "t_min": 25,
         "rh_max": 79,
         "rh_min": 42,
         "wind_speed": 11,
         "wind_direction": 171,
         "cloud_cover": 7
      },
      "13-07-2024": {
         "rainfall": 4,
         "t_max": 35,
         "t_min": 25,
         "rh_max": 75,
         "rh_min": 44,
         "wind_speed": 9,
         "wind_direction": 216,
         "cloud_cover": 6
      },
      "14-07-2024": {
         "rainfall": 5,
         "t_max": 34,
         "t_min": 24,
         "rh_max": 78,
         "rh_min": 42,
         "wind_speed": 10,
         "wind_direction": 289,
         "cloud_cover": 6
      }
   },
   "names_of_crops": [
      "ଧାନ।",
      "ଚିନାବାଦାମ",
      "ଅରହର"
   ],
   "general_advisory": "ମୃତ୍ତିକାର ଆର୍ଦ୍ରତାର ଉତ୍ତମ ଉପଯୋଗ ପାଇଁ, ଉଚ୍ଚଭୂମିରେ ଚିନାବାଦାମ, ଅରହର ଏବଂ ତିଲ ପରି ଅଣ-ଧାନ ଫସଲ ବୁଣିବା ପାଇଁ ଯାଆନ୍ତୁ। ବିଦ୍ଯ଼ମାନ ମେଘୁଆ ପାଗ ଏବଂ ଉଚ୍ଚ ଆପେକ୍ଷିକ ଆର୍ଦ୍ରତା ସ୍ଥିତି ସ୍ଥାଯ଼ୀ ଫସଲରେ କୀଟ ଆକ୍ରମଣ ପାଇଁ ଅନୁକୂଳ | ନିଯ଼ମିତ ନିରୀକ୍ଷଣ ଏବଂ ଉପଯୁକ୍ତ ଉଦ୍ଭିଦ ସୁରକ୍ଷା ପଦକ୍ଷେପ ଗ୍ରହଣ କରାଯିବା ଉଚିତ।",
   "crops_data": {
      "paddy": {
         "advisory": [
            "ଠିକ୍ ସମଯ଼ରେ ପାଣି ନିଷ୍କାସନ ଏବଂ ରୋପଣ ପାଇଁ ମୁଖ୍ଯ଼ ଧାନ କ୍ଷେତରେ ପାଣି ବାନ୍ଧି ରଖନ୍ତୁ।",
            "କୌଣସି ବିଳମ୍ବ ନକରି ଧାନ ରୋପଣ କରନ୍ତୁ କାରଣ ସକ୍ରିଯ଼ ମୌସୁମୀ କାରଣରୁ ଉଚିତ ପରିମାଣର ବର୍ଷା ହୋଇଥାଏ ଏବଂ ଆଗାମୀ ପାଞ୍ଚ ଦିନ ମଧ୍ଯ଼ରେ ଭଲ ପରିମାଣର ବର୍ଷା ହେବାର ସମ୍ଭାବନା ରହିଛି।",
            "ପ୍ରତିରୋପଣର 7 ଦିନ ପୂର୍ବରୁ 10 ଦଶମିକ ନର୍ସରୀ ଅଞ୍ଚଳରେ କ୍ଲୋରେଣ୍ଟ୍ରାନିଲିପ୍ରୋଲ 0.4% ଜି @400 ଗ୍ରାମ୍ କିମ୍ବା କାର୍ଟାପ୍ ହାଇଡ୍ରୋକ୍ଲୋରାଇଡ୍ 4% ଜି. ଆର୍ @800 ଗ୍ରାମ୍ କିମ୍ବା ଫିପ୍ରୋନିଲ୍ 0.3% ଜି. ଆର୍. @1 କିଲୋଗ୍ରାମ୍ ପ୍ରଯ଼ୋଗ କରନ୍ତୁ, ଯାହାଦ୍ୱାରା ପିତ୍ତନଳୀର ମିଜ୍, ଷ୍ଟେମ ବୋରର୍, କେସ୍ୱର୍ମ୍, ଲିଫ୍ ଫୋଲ୍ଡର୍ ଏବଂ ରୁଟ୍ ନାଟ୍ ନେମାଟୋଡ୍ ପ୍ରତିରୋପଣର 3 ସପ୍ତାହ ପର୍ଯ୍ଯ଼ନ୍ତ ନିଯ଼ନ୍ତ୍ରିତ ହୋଇପାରିବ।"
         ]
      },
      "groundnut": {
         "advisory": [
            "ଶ୍ୱେତ ଗ୍ରବ୍ କୀଟକୁ ରୋକିବା ପାଇଁ କ୍ଲୋରପିରିଫସ୍ ଧୂଳି ପ୍ରଯ଼ୋଗ କରନ୍ତୁ @12-10 କେଜି/ଏକର ଶେଷରେ ହଳ କରିବା ସମଯ଼ରେ କିମ୍ବା ଏହି ଧୂଳି ବୁଣିବା ପରେ ମଞ୍ଜି ଉପରେ ଲଗାନ୍ତୁ ଏବଂ ପରେ ଏହାକୁ ଢାଙ୍କି ଦିଅନ୍ତୁ |"
         ]
      },
      "arhar": {
         "advisory": [
            "ବର୍ତ୍ତମାନ ପାଗ ଚିନାବାଦାମ ବୁଣିବା ପାଇଁ ଅନୁକୂଳ ଅଟେ। ପି. ଆର୍. ଜି.-235, ପି. ଆର୍. ଜି. 176, ଭି. ଏଲ୍. ଆର୍. ଏଚ୍. ଏ. ଆର୍. 1, ଟି-ଆର୍. ଏଚ୍. ଏ. ଆର୍. ଇତ୍ଯ଼ାଦି ପରି କିଛି ଉନ୍ନତ କିସମ ଅରହର ବୁଣିବା ପାଇଁ ଯାଆନ୍ତୁ।",
            "ଯଦି କ୍ଷେତରେ ଲାଇନ ବୁଣିବା କରାଯାଏ, ତେବେ ଶୀଘ୍ର ଏବଂ ବିଳମ୍ବରେ ପରିପକ୍ୱ ହେଉଥିବା କିସମ ପାଇଁ ପ୍ରସ୍ତାବିତ ବୀଜ ହାର ଏକର ପିଛା 8 ଏବଂ 6 କିଲୋଗ୍ରାମ ଅଟେ।",
            "କାର୍ବେଣ୍ଡାଜିମ୍ 50% ଡବ୍ଲ୍ଯ଼ୁ. ପି. @2-ଗ୍ରାମ୍/କେଜି ମଞ୍ଜି କିମ୍ବା କାରବକ୍ସିନ୍ <ଆଇ. ଡି. 1> + ଥିରମ୍ <ଆଇ. ଡି. 1> ଡି. ଏସ୍. ଡବ୍ଲ୍ଯ଼ୁ. ପି. ସହିତ ମଞ୍ଜି ଚିକିତ୍ସା କରାଯାଇପାରିବ। ବୁଣିବା 1 ଘଣ୍ଟା ପୂର୍ବରୁ 20 ଗ୍ରାମ୍/କି. ଗ୍ରା. ମୂଲ୍ଯ଼ର ସୁପାରିଶ କରାଯାଇଥିବା ପ୍ରଜାତିର ରାଇଜୋବିଯ଼ମ୍ ବ୍ଯ଼ାକ୍ଟେରିଆ କଲ୍ଚର୍ର ମଞ୍ଜି ବ୍ଯ଼ବହାର କରନ୍ତୁ। ରାସାଯ଼ନିକ ବୀଜ ଚିକିତ୍ସା ଏବଂ ରାଇଜୋବିଯ଼ମ୍ ଚିକିତ୍ସା ମଧ୍ଯ଼ରେ ବ୍ଯ଼ବଧାନ ଅତିକମରେ 7 ଦିନ ହେବା ଉଚିତ।"
         ]
      }
   },
   "date": "09-07-2024"
}