{
   "weather_details": {
      "06.09.2024": {
         "rainfall": 0,
         "t_max": 32,
         "t_min": 24,
         "rh_max": 85,
         "rh_min": 65,
         "wind_speed": 10,
         "wind_direction": 130,
         "cloud_cover": 5
      }
   },
   "names_of_crops": [
      "ଅରହର",
      "ଆଖୁ ଚିନି",
      "କାକୁଡ଼ି",
      "ଓକ୍ରା",
      "ଟମାଟୋ",
      "କଦଳୀ"
   ],
   "general_advisory": "ଅରହର, ଆଖୁ, କାକୁଡ଼ି, ଭେଣ୍ଡି, ଟମାଟୋ ଏବଂ ମଟର ଭଳି ଫସଲର ବୃଦ୍ଧି ପାଇଁ ପାଣିପାଗ ଅନୁକୂଳ ଅଟେ। ପ୍ରତ୍ୟେକ ଫସଲ ପାଇଁ ଉଲ୍ଲେଖ କରାଯାଇଥିବା ନିର୍ଦ୍ଦିଷ୍ଟ ପରାମର୍ଶଗୁଡ଼ିକୁ ଅନୁସରଣ କରନ୍ତୁ।",
   "crops_data": {
      "arhar": {
         "advisory": [
            "ଅରହର ଫସଲରେ ଲିଫ୍ ୱେବର୍ ସଂକ୍ରମଣ ହେବାର ସମ୍ଭାବନା ରହିଛି। ଅରହରରେ ଲିଫ୍ ୱେବର୍ ପରିଚାଳନା କରିବା ପାଇଁ କ୍ଲୋରପିରିଫସ୍ 50 ପ୍ରତିଶତ + ସାଇପର୍ମେଥ୍ରିନ୍ 5 ପ୍ରତିଶତ ଇସି @400-ମିଲି/ଏକର କିମ୍ବା ପ୍ରୋଫେନୋଫସ୍ 50 ପ୍ରତିଶତ ଇସି @400-ମିଲି/ଏକର ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "sugar cane": {
         "advisory": [
            "ଆଖୁ ଫସଲରେ ଲିଫ୍ ହପର୍-ପାଇରିଲା ଏବଂ ମିଲି ବଗ୍କୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ ଇମିଡାକ୍ଲୋପ୍ରିଡ୍ <ଆଇ. ଡି. 1> ଏସ୍. ଏଲ୍. @ଏକର ପିଛା 60 ମିଲି କିମ୍ବା ଥିୟାମେଥୋକ୍ସାମ୍ 25 ପ୍ରତିଶତ ଡବ୍ଲୁ. ଜି. @ଏକର ପିଛା 40 ଗ୍ରାମ୍ କିମ୍ବା ପ୍ରୋଫେନୋଫସ୍ 50 ପ୍ରତିଶତ ଇ. ସି. @ଏକର ପିଛା 400 ମିଲି 200 ଲିଟର ପାଣିରେ ମିଶାଇ ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "cucurbits": {
         "advisory": [
            "କମ୍ ବର୍ଷା ଫଳରେ କାକୁଡ଼ି ଫସଲରେ ଏପିଲାଚନା ବିଟଲର ସଂକ୍ରମଣ ହୋଇପାରେ। କାକୁଡ଼ିରେ ଏପିଲାକ୍ନା ବିଟଲ୍ର ପରିଚାଳନା ପାଇଁ infestation.To ର ପ୍ରାରମ୍ଭିକ ପର୍ଯ୍ୟାୟରେ ନିମ୍ବ-ଆଧାରିତ କୀଟନାଶକ (ନିମ୍ବ ତେଲ 1500 ପିପିଏମ) ଲିଟର ପିଛା 3 ମିଲି. ରେ ସିଞ୍ଚନ କରନ୍ତୁ, ଏପିଲାଚନା ବିଟଲ୍ର ପରିଚାଳନା କରନ୍ତୁ, ରାସାୟନିକ ଭାବେ କ୍ଲୋରପିରିଫସ୍ 20 ପ୍ରତିଶତ ଇସି. ଲିଟର ପିଛା 2 ମିଲି. ରେ ସିଞ୍ଚନ କରନ୍ତୁ କିମ୍ବା ପ୍ରୋଫେନୋଫସ୍ 50 ପ୍ରତିଶତ ଇସି. ଲିଟର ପିଛା 2 ମିଲି. ରେ ସିଞ୍ଚନ କରନ୍ତୁ।"
         ]
      },
      "okra": {
         "advisory": [
            "ବର୍ତ୍ତମାନର ଗରମ ଏବଂ ଆର୍ଦ୍ର ପାଣିପାଗ ସ୍ଥିତି ଓକ୍ରାରେ ଏଫିଡ୍, ହ୍ୱାଇଟ୍ ଫ୍ଲାଇ ଏବଂ ଲିଫ୍ ହପର୍ ପରି କୀଟ ଶୋଷିବା ପାଇଁ ଅନୁକୂଳ | ଏହି ସ୍ପ୍ରେକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ ଇମିଡାକ୍ଲୋପ୍ରିଡ୍ <ଆଇ. ଡି. 1> ଏସ୍. ଏଲ୍. @50 ମିଲି/ଏକର କିମ୍ବା ଥିୟାମେଥୋକ୍ସାମ୍ 25 ପ୍ରତିଶତ ଡବ୍ଲୁ. ଜି. @40 ଗ୍ରାମ୍/ଏକରକୁ 200 ଲିଟର ପାଣିରେ ମିଶାଇ ବ୍ୟବହାର କରନ୍ତୁ।"
         ]
      },
      "tomato": {
         "advisory": [
            "ଏକ ଏକର ଜମିରେ ଟମାଟୋ ଚାଷ ପାଇଁ 200 ଗ୍ରାମ ଉନ୍ନତ କିସମ ଏବଂ 50 ଗ୍ରାମ ହାଇବ୍ରିଡ୍ ମଞ୍ଜି ଆବଶ୍ୟକ। ବୁଣିବାର ଦଶ ଦିନ ପୂର୍ବରୁ ପ୍ରତ୍ୟେକ ନର୍ସରୀ ଶଯ୍ୟାରେ 20 କିଲୋଗ୍ରାମ ସମ୍ପୂର୍ଣ୍ଣ ଅପଘଟିତ ଏଫ୍. ଆଇ. ଏମ୍. ଲଗାନ୍ତୁ। 1 କିଲୋଗ୍ରାମ ମଞ୍ଜି ବୁଣିବା ପୂର୍ବରୁ 2 ଗ୍ରାମ କାର୍ବେନଡାଜିମ୍ 50 ପ୍ରତିଶତ ଡବ୍ଲ୍ୟୁ. ପି. କିମ୍ବା କାର୍ବୋକ୍ସିନ୍ <ଆଇ. ଡି. 1> + ଥିରମ୍ <ଆଇ. ଡି. 1> ଡି. ଏସ୍. ସହିତ ଚିକିତ୍ସା କରନ୍ତୁ।"
         ]
      },
      "cowpea": {
         "advisory": [
            "ମଟରରେ ଗ୍ରାମ୍ ପ୍ୟାଡ୍ ବୋରର୍ ପରିଚାଳନା କରିବା ପାଇଁ 200 ଲିଟର ପାଣିରେ ମିଶ୍ରଣ କରି ଏକର ପିଛା 80 ଗ୍ରାମ୍ ଇମାମ୍ ଆକ୍ଟିନ୍ ବେନ୍ଜୋଏଟ୍ ସିଞ୍ଚନ କରନ୍ତୁ।"
         ]
      }
   },
   "date": "06-09-2024"
}