{
   "weather_details": {
      "10.09.2024": {
         "rainfall": 0,
         "t_max": 32,
         "t_min": 24,
         "rh_max": 85,
         "rh_min": 65,
         "wind_speed": 10,
         "wind_direction": 120,
         "cloud_cover": 3
      }
   },
   "names_of_crops": [
      "ଅରହର",
      "ତିଲ।",
      "ମାଟି ବାଦାମ",
      "ବାଇଗଣ",
      "ଟମାଟୋ",
      "ଲଙ୍କା",
      "କାକୁଡ଼ି",
      "କଦଳୀ",
      "ପେଁପେ",
      "କଦଳୀ",
      "ମତ୍ସ୍ୟଚାଷ"
   ],
   "general_advisory": "ପ୍ରବଳ ବର୍ଷା ପରିଲକ୍ଷିତ ହୋଇଛି, କ୍ଷେତରେ ଉପଯୁକ୍ତ ଜଳ ନିଷ୍କାସନ ନିଶ୍ଚିତ କରେ | ଦିଆଯାଇଥିବା ନିର୍ଦ୍ଦେଶାବଳୀ ଅନୁଯାୟୀ ଫସଲରେ କୀଟ ସଂକ୍ରମଣ ଏବଂ ରୋଗକୁ ନିୟନ୍ତ୍ରଣ କରନ୍ତୁ।",
   "crops_data": {
      "arhar": {
         "advisory": [
            "ଫୋଡ଼ା ବିଟଲ ଫୁଲ ଖାଆନ୍ତି, ହାତ ଦ୍ୱାରା କୀଟପତଙ୍ଗ ସଂଗ୍ରହ କରନ୍ତି ଏବଂ ନଷ୍ଟ କରନ୍ତି |"
         ]
      },
      "sesame": {
         "advisory": [
            "ସଂକ୍ରମିତ କ୍ୟାପସୁଲଗୁଡ଼ିକୁ ବାହାର କରି ଏବଂ ନିମ-ଆଧାରିତ କୀଟନାଶକ ବ୍ୟବହାର କରି ଗୁଲ ମାଛି ସଂକ୍ରମଣକୁ ପରିଚାଳନା କରନ୍ତୁ।"
         ]
      },
      "ground nut": {
         "advisory": [
            "ପ୍ରବଳ ବର୍ଷା ପରେ ଷ୍ଟେମ ରଟ୍ ହୋଇପାରେ, ପରିଚାଳନା ପାଇଁ କବକନାଶକ ସ୍ପ୍ରେ କରନ୍ତୁ |",
            "ସୁପାରିସ କରାଯାଇଥିବା କବକନାଶକଃ ବୈଧାମାଇସିନ୍ 3 ପ୍ରତିଶତ ଏଲ କିମ୍ବା କ୍ୟାପଟାନ 70 ପ୍ରତିଶତ + ହେକ୍ସାକୋନାଜୋଲ 5 ପ୍ରତିଶତ।"
         ]
      },
      "brinjal": {
         "advisory": [
            "ପ୍ରବଳ ବର୍ଷା ପରେ ଶୁଖିଯିବା ଏବଂ ମୂଳ କ୍ଷୟ ହେବା ଉପରେ ଧ୍ୟାନ ଦିଅନ୍ତୁ।",
            "ରୋଗ ପରିଚାଳନା ପାଇଁ ସ୍ଟ୍ରେପ୍ଟୋସାଇକ୍ଲିନ୍ ଏବଂ ମେଟାଲାକ୍ସିଲ୍ 8 ପ୍ରତିଶତ + ମାଙ୍କୋଜେବ୍ ଦ୍ରବଣ ବ୍ୟବହାର କରନ୍ତୁ।"
         ]
      },
      "tomato": {
         "advisory": [
            "ଶୁଖିଲା ଏବଂ ମୂଳ କ୍ଷୟ ସମସ୍ୟା ଉପରେ ନଜର ରଖନ୍ତୁ।",
            "ରୋଗ ପରିଚାଳନା ପାଇଁ ସ୍ଟ୍ରେପ୍ଟୋସାଇକ୍ଲିନ୍ ଏବଂ ମେଟାଲାକ୍ସିଲ୍ 8 ପ୍ରତିଶତ + ମାଙ୍କୋଜେବ୍ ଦ୍ରବଣ ବ୍ୟବହାର କରନ୍ତୁ।"
         ]
      },
      "chilli": {
         "advisory": [
            "ପ୍ରବଳ ବର୍ଷା ପରେ ଶୁଖିଲା ଏବଂ ମୂଳ କ୍ଷୟ ପାଇଁ ଯାଞ୍ଚ କରନ୍ତୁ |",
            "ରୋଗର ସମାଧାନ ପାଇଁ ସ୍ଟ୍ରେପ୍ଟୋସାଇକ୍ଲିନ୍ ଏବଂ ମେଟାଲାକ୍ସିଲ୍ 8 ପ୍ରତିଶତ + ମାଙ୍କୋଜେବ୍ ଦ୍ରବଣ ପ୍ରୟୋଗ କରନ୍ତୁ।"
         ]
      },
      "cucurbits": {
         "advisory": [
            "ପ୍ରବଳ ବର୍ଷା ପରେ କାକୁଡ଼ିରେ ଡାଉନି ମାଇଲ୍ଡ୍ୟୁ ସଂକ୍ରମଣ ପ୍ରତି ସତର୍କ ରୁହନ୍ତୁ।",
            "କପର୍ ହାଇଡ୍ରୋକ୍ସାଇଡ୍ 77 ପ୍ରତିଶତ ଡବ୍ଲ୍ୟୁ. ପି., ଫୋସାଇଟିଲ୍-ଏ. ଏଲ୍. 80 ପ୍ରତିଶତ ଡବ୍ଲ୍ୟୁ. ପି., କିମ୍ବା କାର୍ବେଣ୍ଡାଜିମ୍ 12 ପ୍ରତିଶତ + ମାନକୋଜେବ୍ 63 ପ୍ରତିଶତ ଡବ୍ଲ୍ୟୁ. ପି. ସହିତ ନିୟନ୍ତ୍ରଣ କରନ୍ତୁ।"
         ]
      },
      "cowpea": {
         "advisory": [
            "ଇମାମାକ୍ଟିନ୍ ବେନ୍ଜୋଏଟ୍ ସ୍ପ୍ରେ ଦ୍ୱାରା ଗ୍ରାମ୍ ପୋଡ୍ ବୋରର୍କୁ ନିୟନ୍ତ୍ରଣ କରନ୍ତୁ।"
         ]
      },
      "papaya": {
         "advisory": [
            "ଜଳ ନିଷ୍କାସନ ଏବଂ ଷ୍ଟେକ ପ୍ଲାଣ୍ଟ ସୁନିଶ୍ଚିତ କରନ୍ତୁ।",
            "କପର୍ ଅକ୍ସିକ୍ଲୋରାଇଡ୍, କାର୍ବେନଡାଜିମ୍, କିମ୍ବା ଥିଓଫାନେଟ୍ ମିଥାଇଲ ସ୍ପ୍ରେ ସହିତ ପିଆଜର କ୍ରାଉନ୍ ରଟ୍ ପରିଚାଳନା କରନ୍ତୁ |"
         ]
      },
      "banana": {
         "advisory": [
            "କ୍ଷେତରୁ ଅତିରିକ୍ତ ପାଣି ବାହାର କରନ୍ତୁ ଏବଂ ନୂତନ ଭାବରେ ରୋପଣ କରାଯାଇଥିବା କଦଳୀକୁ ମାଟି କରନ୍ତୁ।",
            "ସିଗଟୋକା ରୋଗ ନିୟନ୍ତ୍ରଣ ପାଇଁ, ମାନକୋଜେବ୍ 75 ପ୍ରତିଶତ ଡବ୍ଲ୍ୟୁ. ପି., ଜିନେବ୍ 75 ପ୍ରତିଶତ ଡବ୍ଲ୍ୟୁ. ପି., କିମ୍ବା କାର୍ବେଣ୍ଡାଜିମ୍ 12 ପ୍ରତିଶତ + ମାନକୋଜେବ୍ 63 ପ୍ରତିଶତ ଡବ୍ଲ୍ୟୁ. ପି. ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "fishery": {
         "advisory": [
            "ପ୍ରବଳ ବର୍ଷା ପରେ ଲବଣାକ୍ତତା ହ୍ରାସ ପାଇଲେ, ଆଲ୍କି-ଡାଇମିଥାଇଲ-ବେଞ୍ଜାଇଲ ଆମୋନିୟମ କ୍ଲୋରାଇଡକୁ ଜୀବାଣୁନାଶକ ଭାବେ ବ୍ୟବହାର କରନ୍ତୁ।"
         ]
      }
   },
   "date": "10-09-2024"
}