{
   "weather_details": {
      "2024-12-28": {
         "rainfall": 0,
         "t_max": 24,
         "t_min": 17,
         "rh_max": 88,
         "rh_min": 45,
         "wind_speed": 3,
         "wind_direction": 36,
         "cloud_cover": 1
      },
      "2024-12-29": {
         "rainfall": 0,
         "t_max": 24,
         "t_min": 17,
         "rh_max": 85,
         "rh_min": 49,
         "wind_speed": 2,
         "wind_direction": 14,
         "cloud_cover": 2
      },
      "2024-12-30": {
         "rainfall": 0,
         "t_max": 25,
         "t_min": 16,
         "rh_max": 86,
         "rh_min": 53,
         "wind_speed": 2,
         "wind_direction": 22,
         "cloud_cover": 2
      },
      "2024-12-31": {
         "rainfall": 0,
         "t_max": 26,
         "t_min": 16,
         "rh_max": 88,
         "rh_min": 50,
         "wind_speed": 2,
         "wind_direction": 11,
         "cloud_cover": 3
      },
      "2025-01-01": {
         "rainfall": 0,
         "t_max": 27,
         "t_min": 16,
         "rh_max": 90,
         "rh_min": 45,
         "wind_speed": 2,
         "wind_direction": 11,
         "cloud_cover": 1
      }
   },
   "names_of_crops": [
      "ଚାଉଳ",
      "ସୂର୍ଯ୍ୟମୁଖୀ",
      "ସୋରିଷ",
      "କପା",
      "ଲଙ୍କା",
      "ଟମାଟୋ",
      "ଆଳୁ",
      "ମେନାସିନାକାହି",
      "ସାଧାରଣ ମାଛ",
      "ଚିକ"
   ],
   "general_advisory": "ଗତ ସପ୍ତାହରେ ଗଜପତି ଜିଲ୍ଲାର ହାରାହାରି ସର୍ବାଧିକ ଦୈନିକ ତାପମାତ୍ରା 24 ଡିଗ୍ରୀ ସେଲସିୟସ୍ ଏବଂ ହାରାହାରି ସର୍ବନିମ୍ନ ଦୈନିକ ତାପମାତ୍ରା 17.3 ଡିଗ୍ରୀ ସେଲସିୟସ୍ ଥିଲା। ଗତ ସପ୍ତାହରେ ଜିଲ୍ଲାରେ 65.1 ମିଲିମିଟର ବର୍ଷା ହୋଇଥିଲା। ନିମ୍ନ ରାତି ତାପମାତ୍ରା ଏବଂ କୁହୁଡ଼ି ପରିସ୍ଥିତି ହେତୁ ରବି ଫସଲ ଏବଂ ପନିପରିବାରେ ଶୋଷକ କୀଟ, ପତ୍ର ରୋଗ, ପାଉଡର ଫଙ୍ଗୁର ସଂକ୍ରମଣ ହେବାର ସମ୍ଭାବନା ରହିବ। ଫସଲ ଏବଂ ପନିପରିବା ଉପରେ ନଜର ରଖନ୍ତୁ, ଯଦି ଲକ୍ଷଣ ଦେଖାଯାଏ, ଉପଯୁକ୍ତ ଉଦ୍ଭିଦ ସୁରକ୍ଷା ପଦକ୍ଷେପ ଗ୍ରହଣ କରନ୍ତୁ। ରବି ପନିପରିବାରେ ନିଡ଼ାଇ, ହୋଇଂ ଏବଂ ଅନ୍ୟାନ୍ୟ ଆନ୍ତଃସାଂସ୍କୃତିକ କାର୍ଯ୍ୟକଳାପ କରନ୍ତୁ | କୋଇଲା ଫସଲରେ, ମୃତ୍ତିକାର ଆର୍ଦ୍ରତା ଏବଂ ପାଣିପାଗ ସ୍ଥିତି ଉପରେ ନିର୍ଭର କରି 7ରୁ 8 ଦିନ ବ୍ୟବଧାନରେ ଜଳସେଚନ କରାଯିବା ଉଚିତ। ଶୀତଦିନେ କୃଷକମାନେ ଶୀତଳ ବାୟୁ ସହିତ ସିଧାସଳଖ ସମ୍ପର୍କକୁ ରୋକିବା ପାଇଁ ଗାଈଶାଳାର ଦ୍ୱାର, ଝରକା ଏବଂ ଖୋଲା ସ୍ଥାନକୁ ପଲିଥିନ୍ କିମ୍ବା ବ୍ୟାଗ ପର୍ଦ୍ଦା ଦ୍ୱାରା ଆଚ୍ଛାଦିତ ରଖିବା ଉଚିତ୍। ଶୀତ ଋତୁରେ କୁକୁଡ଼ା ପାଳିରେ ଉତ୍ତାପ ବଜାୟ ରଖିବା ପାଇଁ, ପାଳିରେ ହିଟର୍ ଲଗାନ୍ତୁ।",
   "crops_data": {
      "rice": {
         "advisory": [
            "ଗଚ୍ଛିତ ଶସ୍ୟ କୀଟପତଙ୍ଗର ସଂକ୍ରମଣ ଲକ୍ଷ୍ୟ କରିବାର ତୁରନ୍ତ ପରେ, ଆଲୁମିନିୟମ୍ ଫସଫାଇଡ୍ (ଘରେ ବ୍ୟବହାର କରନ୍ତୁ ନାହିଁ) ଟାବଲେଟ୍ @3 ଟାବଲେଟ୍/ଟନ୍ ଶସ୍ୟ (ମୋଟ 9 ଗ୍ରାମ୍ ଟାବଲେଟ୍) କୁ ମୋଟାମୋଟି ଏୟାରଟାଇଟ କଣ୍ଟେନରରେ ବ୍ୟବହାର କରନ୍ତୁ କିମ୍ବା ମୋଟା ତିରପାଲ ସହିତ ଆଚ୍ଛାଦନ କରନ୍ତୁ ଯାହା କୌଣସି ବ୍ୟବଧାନ ଛାଡି ନଥାଏ | ଟାବଲେଟ୍ଗୁଡ଼ିକୁ ଷ୍ଟାକ୍ରେ ରଖିବା ପୂର୍ବରୁ ସେଗୁଡ଼ିକୁ ସୂତା ପାଉଚରେ ବାନ୍ଧି ରଖିବା ଉଚିତ। ଗ୍ୟାସ୍ ଲିକ୍ ରୋକିବା ପାଇଁ ପ୍ଲାଷ୍ଟିକ୍ କଭର୍ର ସମସ୍ତ କୋଣକୁ 6 ଇଞ୍ଚ ମୋଟା ସ୍ତର କାଦୁଅ/ଆଡ଼େସିଭ୍ ଟେପ୍ ଦ୍ୱାରା ପ୍ଲାଷ୍ଟର କରାଯିବା ଉଚିତ। ସର୍ବନିମ୍ନ ଏକ୍ସପୋଜର ଅବଧି ପ୍ରାୟ 7-10 ଦିନ ପାଇଁ | ସତ୍ୟଭାମା, ସହଭାଗି ଧାନ, ମନ୍ଦାକିନୀ, ମାନସ୍ୱିନୀ, ଡି. ଆର୍. ଆର୍. 42, ଡି. ଆର୍. ଆର୍.-43, ଡି. ଆର୍. ଆର୍.-44, ବିନା 1, ଜି. ବି.-1, ଉନ୍ନତ ଲଲାଟ, ଏମ. ଟି. ୟୁ. 1010, ଏମ. ଟି. ୟୁ. 1001, ନବୀନ, ସ୍ୱର୍ଣ୍ଣ ଶ୍ରେୟା ଭଳି ଉନ୍ନତ ମାନର ଧାନ ମଞ୍ଜି ପ୍ରସ୍ତୁତ କରନ୍ତୁ, ଯାହା ଶୁଖିଲା ଋତୁରେ ଚାଷ କରାଯାଇପାରିବ। ଏହି କିସମଗୁଡ଼ିକ ପାଇଁ ଏକ ଏକର ଜମି ପାଇଁ ବୀଜ ହାର ହେଉଛି 20 କିଲୋଗ୍ରାମ। ନର୍ସରୀରେ ବୁଣିବା ପୂର୍ବରୁ ମଞ୍ଜିଗୁଡ଼ିକୁ କାର୍ବେନଡାଜିମ୍ 50 ପ୍ରତିଶତ ଡବ୍ଲୁ. ପି. @2-ଗ୍ରାମ/1-କିଲୋଗ୍ରାମ ମଞ୍ଜି କିମ୍ବା କାର୍ବୋକ୍ସିନ୍ 37.5% + ଥିରମ୍ 37.5% @3-ଗ୍ରାମ/1 କିଲୋଗ୍ରାମ ମଞ୍ଜି ସହିତ ଚିକିତ୍ସା କରନ୍ତୁ।"
         ]
      },
      "sunflower": {
         "advisory": [
            "ସୂର୍ଯ୍ୟମୁଖୀ ଫସଲ 25-30 ଦିନର ପର୍ଯ୍ୟାୟରେ ରହିଛି। ହଏଙ୍ଗ୍ ଏବଂ ଆଗାଛା କାଟିବା ଏବଂ ପତଳା କରିବା ପାଇଁ ଯାଆନ୍ତୁ ଏବଂ ଏନ୍-ସାର ଲଗାନ୍ତୁ।"
         ]
      },
      "mustard": {
         "advisory": [
            "ଶୀଘ୍ର ବୁଣାଯାଇଥିବା ସୋରିଷ ଫସଲରେ ଏଫିଡ୍ ସଂକ୍ରମଣ ହେବାର ସମ୍ଭାବନା ରହିଛି। ପ୍ରାରମ୍ଭିକ ପର୍ଯ୍ୟାୟରେ ଏଫିଡ୍ ପରିଚାଳନା କରିବାକୁ, ଏକର ପିଛା 8 ଟି ହଳଦିଆ ଷ୍ଟିକ୍ ଟ୍ରାପ୍ ଲଗାନ୍ତୁ | 200 ଲିଟର ପାଣିରେ ମିଶ୍ରଣ କରି ନିମ୍ବ-ଆଧାରିତ କୀଟନାଶକ 1500 ପିପିଏମ @600-ମିଲି/ଏକର ସ୍ପ୍ରେ କରନ୍ତୁ। ଯଦି ସଂକ୍ରମଣ ଗୁରୁତର ହୁଏ ତେବେ ରାସାୟନିକ କୀଟନାଶକ ଥିୟାମେଥୋକ୍ସାମ୍ 25 ପ୍ରତିଶତ ଡବ୍ଲୁଜି @40 ଗ୍ରାମ୍/ଏକର କିମ୍ବା ଏସିଟାମିପ୍ରିଡ୍ 20 ପ୍ରତିଶତ ଏସପି @50 ଗ୍ରାମ୍/ଏକରକୁ 200 ଲିଟର ପାଣିରେ ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "cotton": {
         "advisory": [
            "କୃଷକମାନଙ୍କୁ ସକାଳ 9ଟା ପରେ କିମ୍ବା ଫସଲ ପୃଷ୍ଠରୁ ଶିଶିର ଶୁଖିଗଲା ପରେ ସୂର୍ଯ୍ୟକିରଣ ଦିନଗୁଡ଼ିକରେ କପା ଉଠାଇବା ପାଇଁ ପରାମର୍ଶ ଦିଆଯାଇଛି। କପଡ଼ା ବ୍ୟାଗ କିମ୍ବା ପ୍ଲାଷ୍ଟିକ୍ ବାସ୍କେଟରେ ଥିବା ସୂତା ବୀଜକୁ ଉଠାନ୍ତୁ। କପାର ମଞ୍ଜିରୁ ଶୁଖିଲା ପତ୍ର ଏବଂ ଗଛର ଅନ୍ୟ ଅଂଶଗୁଡ଼ିକୁ ବାହାର କରିଦିଅନ୍ତୁ। ପ୍ରଥମେ ବୁଣିବା, ଦ୍ୱିତୀୟରେ ବୁଣିବା ଏବଂ ତୃତୀୟରେ ବୁଣିବା କପା। ଯଦି କପାର ଏକାଧିକ କିସମ କିମ୍ବା ହାଇବ୍ରିଡ୍ ଚାଷ କରାଯାଏ, ତେବେ ସେଗୁଡ଼ିକୁ ଅଲଗା ରଖନ୍ତୁ | ଏକ କଂକ୍ରିଟ୍ ଚଟାଣ କିମ୍ବା ତିରପାଲ ଉପରେ ବୀଜ କପଡ଼ାକୁ ସିଧାସଳଖ ସୂର୍ଯ୍ୟକିରଣରେ 2ରୁ 3 ଘଣ୍ଟା ଶୁଖାଇ ସଫା କପଡା ବ୍ୟାଗ୍ରେ ରଖନ୍ତୁ।"
         ]
      },
      "chilli": {
         "advisory": [
            "କୀଟ ସଂକ୍ରମଣର ପ୍ରାଥମିକ ପର୍ଯ୍ୟାୟରେ ଲଙ୍କାରେ ଏଫିଡ୍ ଏବଂ ଥ୍ରିପ୍ସକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ 200 ଲିଟର ପାଣିରେ ମିଶ୍ରଣ କରି ନିମ୍ବ-ଆଧାରିତ କୀଟନାଶକ 1500 ପିପିଏମ @600-ମିଲି/ଏକର ସ୍ପ୍ରେ କରନ୍ତୁ। ଥିୟାମେଥୋକ୍ସାମ୍ 25 ପ୍ରତିଶତ ଡବ୍ଲୁ. ଜି. @40 ଗ୍ରାମ୍/ଏକର କିମ୍ବା ଏସିଟାମିପ୍ରିଡ୍ 20 ପ୍ରତିଶତ ଏସ. ପି. @50 ଗ୍ରାମ୍/ଏକର କିମ୍ବା ପ୍ରୋଫେନୋଫସ୍ 40 ପ୍ରତିଶତ + ଫେନପାଇରୋକ୍ସିମେଟ୍ 2.5 ପ୍ରତିଶତ ଇ. ସି. @400-ମିଲି/ଏକର ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "tomato": {
         "advisory": [
            "ଟମାଟୋରେ ଫଳ ଛେଦକକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ, ପ୍ରଥମେ ପ୍ରଭାବିତ ଫଳ ଏବଂ ବୟସ୍କ ଲାର୍ଭା ସଂଗ୍ରହ କରି ନଷ୍ଟ କରନ୍ତୁ। ଏକର ପିଛା ହେଲିଲ୍ୟୁର୍ ଥିବା 20ଟି ଫେରୋମୋନ୍ ଫାନ୍ଦ ସ୍ଥାପନ କରନ୍ତୁ। ଯଦି 10 ପ୍ରତିଶତ ଫଳ ଛେଦକ ଦ୍ୱାରା ସଂକ୍ରମିତ, ତେବେ କୀଟନାଶକ ସିଞ୍ଚନ କରନ୍ତୁ। କ୍ଲୋରାଣ୍ଟ୍ରାନିଲିପ୍ରୋଲ 18.5% S. C. @80 ମିଲି/ଏକର କିମ୍ବା ଫ୍ଲୁବେଣ୍ଡିଆମାଇଡ୍ 39.5% M/M. S. C. @40 ମିଲି/ଏକର କିମ୍ବା ଇଣ୍ଡୋକ୍ସାକାର୍ବ 14.5% S. C. @200 ମିଲି/ଏକର ସ୍ପ୍ରେ କରନ୍ତୁ। ଉପରୋକ୍ତ ଯେ କୌଣସି କୀଟନାଶକକୁ 15 ଦିନର ବ୍ୟବଧାନରେ ବିକଳ୍ପ ଭାବେ ବ୍ୟବହାର କରନ୍ତୁ।"
         ]
      },
      "potato": {
         "advisory": [
            "ଶୀଘ୍ର ରୋପଣ କରାଯାଇଥିବା ଆଳୁ ଫସଲ 3 ସପ୍ତାହର ପର୍ଯ୍ୟାୟରେ ରହିଛି। ହୋଇଂ ଏବଂ ନିରାମୟ ପାଇଁ ଯାଆନ୍ତୁ ଏବଂ ଅବଶିଷ୍ଟ 30-45 Kg N/ଏକର ଲଗାନ୍ତୁ। ଆଲୁର ଉନ୍ନତ କନ୍ଦ ବୃଦ୍ଧି ପାଇଁ, ମାଟିର ତାପମାତ୍ରା 30 ଡିଗ୍ରୀ ସେଲସିୟସରୁ କମ୍ ରଖିବା ଉଚିତ। ତେଣୁ କୃଷକମାନଙ୍କୁ କ୍ଷେତକୁ ଜଳସେଚନ କରିବାକୁ ପରାମର୍ଶ ଦିଆଯାଇଛି। ଆଳୁ ଫସଲରେ ଲିଫ୍ ବ୍ଲାଇଟ୍ ରୋଗ ହେବାର ସମ୍ଭାବନା ରହିଛି। ଆଲୁର ପ୍ରାରମ୍ଭିକ ପତ୍ର ରୋଗ ନିୟନ୍ତ୍ରଣ ପାଇଁ ଏକର ପିଛା 600 ଗ୍ରାମ ପିଛା ମାନକୋଜେବ୍ 75 ପ୍ରତିଶତ ଡବ୍ଲୁ. ପି. କିମ୍ବା ଏକର ପିଛା 400 ଗ୍ରାମ ପିଛା କାର୍ବେଣ୍ଡାଜିମ୍ 12 ପ୍ରତିଶତ + ମାନକୋଜେବ୍ 63 ପ୍ରତିଶତ ଡବ୍ଲୁ. ପି. ସ୍ପ୍ରେ କରନ୍ତୁ। ଆଳୁରେ ବିଳମ୍ବରେ ହେଉଥିବା ରୋଗକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ 10 ଦିନର ବ୍ୟବଧାନରେ ମେଟାଲ୍ୟାକ୍ସିଲ 8 ପ୍ରତିଶତ + ମାନକୋଜେବ 64 ପ୍ରତିଶତ ୱୁପି @400-ଗ୍ରାମ/ଏକର ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "menacinakahi": {
         "advisory": [
            "କୀଟ ସଂକ୍ରମଣର ପ୍ରାଥମିକ ପର୍ଯ୍ୟାୟରେ ଲଙ୍କାରେ ଏଫିଡ୍ ଏବଂ ଥ୍ରୀପ୍ କୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ 200 ଲିଟର ପାଣିରେ ମିଶ୍ରଣ କରି ନିମ୍ବ-ଆଧାରିତ କୀଟନାଶକ 1500 ପିପିଏମ @600-ମିଲି/ଏକର ସ୍ପ୍ରେ କରନ୍ତୁ। ଥିୟାମେଥୋକ୍ସାମ୍ 25 ପ୍ରତିଶତ ଡବ୍ଲୁ. ଜି. @40 ଗ୍ରାମ୍/ଏକର କିମ୍ବା ଏସିଟାମିପ୍ରିଡ୍ 20 ପ୍ରତିଶତ ଏସ. ପି. @50 ଗ୍ରାମ୍/ଏକର କିମ୍ବା ପ୍ରୋଫେନୋଫସ୍ 40 ପ୍ରତିଶତ + ଫେନପାଇରୋକ୍ସିମେଟ୍ 2.5 ପ୍ରତିଶତ ଇ. ସି. @400-ମିଲି/ଏକର ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "common fish": {
         "advisory": [
            "ଶୀତ ଋତୁରେ, ମାଛରେ \"ଇ. ୟୁ. ଏସ୍\". ରୋଗ ହେବାର ସମ୍ଭାବନା ଥାଏ। ପ୍ରତିଷେଧକ ପଦକ୍ଷେପ ସ୍ୱରୂପ କୃଷକମାନଙ୍କୁ ଏକ ଏକର ପୋଖରୀ ଅଞ୍ଚଳରେ 40 ଲିଟର ପାଣି ସହିତ 400 ମିଲିଲିଟର ସିଫ୍ୟାକ୍ସ ଲଗାଇବାକୁ ପରାମର୍ଶ ଦିଆଯାଇଛି। ମାଛମାନଙ୍କୁ ସେମାନଙ୍କର ମୋଟ ଜୈବବସ୍ତୁର 2-3% ହାରରେ ପ୍ରତିଦିନ ତୈଳ କେକ୍ ବ୍ରାନ୍ ମିଶ୍ରଣ ସହିତ ଖୁଆଇବା ଉଚିତ୍ |"
         ]
      },
      "chick": {
         "advisory": [
            "ଶୀତଦିନେ, ଫିଡର ସଂଖ୍ୟା ବୃଦ୍ଧି କରାଯିବା ଉଚିତ। ଦିନସାରା ପକ୍ଷୀ ପାଇଁ ଖାଦ୍ୟ ଉପଲବ୍ଧ ରହିବା ଉଚିତ। ଶୀତ ଋତୁରେ ପକ୍ଷୀମାନେ କମ୍ ପାଣି ନିଅନ୍ତି, ଏ ପର୍ଯ୍ୟନ୍ତ ଶରୀରରେ ଜଳର ରକ୍ଷଣାବେକ୍ଷଣ, ତାଜା ଜଳର ନିରନ୍ତର ଯୋଗାଣ ଦେବା ଆବଶ୍ୟକ ଯାହା ପକ୍ଷୀ ଦ୍ୱାରା ନିଆଯାଇପାରେ | କୁକୁଡ଼ା ପାଳିରେ ଉତ୍ତାପ ବଜାୟ ରଖିବା ପାଇଁ, ପାଳିରେ ହିଟର୍ ଲଗାନ୍ତୁ। ଛୋଟ ଧରଣର କାର୍ଯ୍ୟରେ ଉତ୍ତାପ ସୃଷ୍ଟି କରିବା ପାଇଁ 200 ୱାଟ ବଲ୍ବ ବ୍ୟବହାର କରନ୍ତୁ। ଆବଶ୍ୟକ ସମୟରେ ଆବଶ୍ୟକ ଟିକା ନିଅନ୍ତୁ।"
         ]
      }
   },
   "date": "27-12-2024"
}