{
   "weather_details": {
      "2024-09-07": {
         "rainfall": 10,
         "t_max": 35,
         "t_min": 25,
         "rh_max": 93,
         "rh_min": 67,
         "wind_speed": 5,
         "wind_direction": 288,
         "cloud_cover": 7
      },
      "2024-09-08": {
         "rainfall": 15,
         "t_max": 33,
         "t_min": 25,
         "rh_max": 93,
         "rh_min": 68,
         "wind_speed": 6,
         "wind_direction": 288,
         "cloud_cover": 8
      },
      "2024-09-09": {
         "rainfall": 25,
         "t_max": 31,
         "t_min": 24,
         "rh_max": 95,
         "rh_min": 76,
         "wind_speed": 7,
         "wind_direction": 291,
         "cloud_cover": 8
      },
      "2024-09-10": {
         "rainfall": 15,
         "t_max": 33,
         "t_min": 24,
         "rh_max": 93,
         "rh_min": 76,
         "wind_speed": 8,
         "wind_direction": 292,
         "cloud_cover": 8
      },
      "2024-09-11": {
         "rainfall": 10,
         "t_max": 34,
         "t_min": 25,
         "rh_max": 90,
         "rh_min": 69,
         "wind_speed": 10,
         "wind_direction": 291,
         "cloud_cover": 7
      }
   },
   "names_of_crops": [
      "ମକା",
      "ଚାଉଳ",
      "ଫିଙ୍ଗର ମିଲେଟ୍",
      "କପା",
      "ପେଁପେ",
      "ବାଇଗଣ",
      "ସାଧାରଣ ମାଛ",
      "ଚିକେନ୍"
   ],
   "general_advisory": "ପାଣିପାଗ ପୂର୍ବାନୁମାନ ଅନୁଯାୟୀ, ସାର ଏବଂ ଉଦ୍ଭିଦ ସୁରକ୍ଷା ରାସାୟନିକ ପ୍ରୟୋଗ ବନ୍ଦ କରିବାକୁ କୃଷକମାନଙ୍କୁ ପରାମର୍ଶ ଦିଆଯାଇଛି। ଫସଲର ବୃଦ୍ଧି ପର୍ଯ୍ୟାୟ ଅନୁଯାୟୀ ସନ୍ତୁଳିତ ସାର ପ୍ରୟୋଗ କରନ୍ତୁ। ଅତ୍ୟଧିକ ନାଇଟ୍ରୋଜେନ୍ ଠାରୁ ଦୂରେଇ ରୁହନ୍ତୁ। କୀଟ ନିୟନ୍ତ୍ରଣ ପାଇଁ ଏକ ସମନ୍ୱିତ ଉପାୟ ଅବଲମ୍ବନ କରନ୍ତୁ।",
   "crops_data": {
      "maize": {
         "advisory": [
            "ଶରତ ଆର୍ମିୱର୍ମ କୀଟକୁ ପରିଚାଳନା କରିବା ପାଇଁ, ବାୟୋପେଷ୍ଟିସାଇଡ୍ ବେଉଭେରିଆ ବାସିଆନା ସ୍ପ୍ରେ କରନ୍ତୁ |",
            "ପକ୍ଷୀ ପର୍ଚ୍ ଏବଂ ବାଲି, ମାଟି ଏବଂ କାଠର ଛାଇର ଧୂଳି ମିଶ୍ରଣ ବ୍ୟବହାର କରନ୍ତୁ |"
         ]
      },
      "rice": {
         "advisory": [
            "ବିସ୍ଫୋରଣ ରୋଗକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ, ହେକ୍ସାକୋନାଜୋଲ କିମ୍ବା ଏଜୋକ୍ସିସ୍ଟ୍ରୋବିନ + ଡିଫେନୋକାନାଜୋଲ ସ୍ପ୍ରେ କରନ୍ତୁ।",
            "ଲିଫ୍ ଫୋଲ୍ଡର୍ ଏବଂ କେସ୍ ୱର୍ମ୍ କୀଟକୁ ପରିଚାଳନା କରିବା ପାଇଁ, ବାଇଫେନ୍ଥ୍ରିନ୍ କିମ୍ବା ଲାମ୍ବଡା ସାଇହାଲୋଥ୍ରିନ୍ ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "finger millet": {
         "advisory": [
            "ଗୋଲାପୀ କାଣ୍ଡ ଛେଦକକୁ ପରିଚାଳନା କରିବା ପାଇଁ, ଟ୍ରାଇକୋଗ୍ରାମ ଚିଲୋନିସ୍ କାର୍ଡ ବ୍ୟବହାର କରନ୍ତୁ ଏବଂ ବାସିଲସ୍ ଥାଇରିଙ୍ଗେନେସିସ୍ ସ୍ପ୍ରେ କରନ୍ତୁ |",
            "କୀଟ ନିୟନ୍ତ୍ରଣ ପାଇଁ ହାଣ୍ଡି-ଖାତା ସାର ଏବଂ ନିମାସ୍ତ୍ର ବ୍ୟବହାର କରନ୍ତୁ।"
         ]
      },
      "cotton": {
         "advisory": [
            "ଏଫିଡ୍ ଏବଂ ଜ୍ଯାସିଡ୍ ପରି ଶୋଷକ କୀଟ ପାଇଁ ନିୟମିତ ଭାବରେ ନିରୀକ୍ଷଣ କରନ୍ତୁ |",
            "ଯଦି ସଂକ୍ରମଣ ଇ. ଟି. ଏଲ୍. ଠାରୁ ଅଧିକ ହୋଇଥାଏ, ତେବେ ନିମ ଆଧାରିତ କୀଟନାଶକ କିମ୍ବା ରାସାୟନିକ ସ୍ପ୍ରେ ବ୍ୟବହାର କରନ୍ତୁ।"
         ]
      },
      "papaya": {
         "advisory": [
            "ଖାଦ୍ୟ କୀଟ ସଂକ୍ରମଣର ପରିଚାଳନା ପାଇଁ, ପ୍ରାରମ୍ଭିକ ପର୍ଯ୍ୟାୟରେ ନିମ୍ବ-ଆଧାରିତ କୀଟନାଶକ ସ୍ପ୍ରେ କରନ୍ତୁ।",
            "ଗୁରୁତର ସଂକ୍ରମଣ ପାଇଁ ପ୍ରୋଫେନୋଫସ୍ କିମ୍ବା ଥାୟାମେଥୋକ୍ସାମ୍ ବ୍ୟବହାର କରନ୍ତୁ।"
         ]
      },
      "brinjal": {
         "advisory": [
            "ଶୁଟ୍ ଏବଂ ଫଳ ଛେଦକ ପରିଚାଳନା ପାଇଁ ପ୍ରଭାବିତ ଟର୍ମିନାଲ୍ ଏବଂ ଫଳଗୁଡ଼ିକୁ ବାହାର କରନ୍ତୁ |",
            "ଫେରୋମୋନ୍ ଟ୍ରାପ୍ ସ୍ଥାପନ କରନ୍ତୁ ଏବଂ ବିକଳ୍ପ ଭାବରେ ରାସାୟନିକ ନିୟନ୍ତ୍ରଣ ବ୍ୟବହାର କରନ୍ତୁ |"
         ]
      },
      "common fish": {
         "advisory": [
            "ମାଛକୁ ଚିନାବାଦାମ ତେଲ କେକ୍ ଏବଂ ଚାଉଳ ଚୋପା ଖାଇବାକୁ ଦିଅନ୍ତୁ।",
            "ଷ୍ଟକ୍ କରିବା ପରେ ନିୟମିତ ଭାବେ ପିଏଚ୍ ଏବଂ ଜଳର ତାପମାତ୍ରା ଯାଞ୍ଚ କରନ୍ତୁ।"
         ]
      },
      "chicken": {
         "advisory": [
            "ପ୍ରତିଦିନ କୁକୁଡ଼ା ଘର ସଫା କରନ୍ତୁ ଏବଂ ବାରମ୍ବାର ଖାଦ୍ୟ ଏବଂ ପାଣି ବଦଳାନ୍ତୁ |",
            "ମୃତ କୁକୁଡ଼ା ପକ୍ଷୀମାନଙ୍କୁ ଠିକ୍ ଭାବେ କବର ଦିଅନ୍ତୁ ଏବଂ ପ୍ରଭାବିତ ଅଞ୍ଚଳରୁ ପକ୍ଷୀ କିମ୍ବା ଅଣ୍ଡା ଆଣନ୍ତୁ ନାହିଁ।"
         ]
      }
   },
   "date": "06-09-2024"
}