{
   "weather_details": {
      "2024-08-14": {
         "rainfall": 5.0,
         "t_max": 36,
         "t_min": 27,
         "rh_max": 89,
         "rh_min": 56,
         "wind_speed": 6,
         "wind_direction": 212,
         "cloud_cover": 6
      },
      "2024-08-15": {
         "rainfall": 4.0,
         "t_max": 36,
         "t_min": 27,
         "rh_max": 87,
         "rh_min": 62,
         "wind_speed": 5,
         "wind_direction": 212,
         "cloud_cover": 7
      },
      "2024-08-16": {
         "rainfall": 5.0,
         "t_max": 37,
         "t_min": 28,
         "rh_max": 90,
         "rh_min": 62,
         "wind_speed": 4,
         "wind_direction": 225,
         "cloud_cover": 7
      },
      "2024-08-17": {
         "rainfall": 6.0,
         "t_max": 37,
         "t_min": 28,
         "rh_max": 92,
         "rh_min": 61,
         "wind_speed": 5,
         "wind_direction": 207,
         "cloud_cover": 7
      },
      "2024-08-18": {
         "rainfall": 10.0,
         "t_max": 36,
         "t_min": 27,
         "rh_max": 88,
         "rh_min": 57,
         "wind_speed": 6,
         "wind_direction": 225,
         "cloud_cover": 6
      }
   },
   "names_of_crops": [
      "ଚାଉଳ",
      "ମକା",
      "କପା",
      "ଲଙ୍କା",
      "ବାଇଗଣ",
      "ଛେଳି।",
      "ସାଧାରଣ ମାଛ"
   ],
   "general_advisory": "ଗତ ସପ୍ତାହରେ ଗଜପତି ଜିଲ୍ଲାର ହାରାହାରି ସର୍ବାଧିକ ଦୈନିକ ତାପମାତ୍ରା 34.6 ଡିଗ୍ରୀ ସେଲସିଯ଼ସ୍ ଏବଂ ହାରାହାରି ସର୍ବନିମ୍ନ ଦୈନିକ ତାପମାତ୍ରା 25.7 ଡିଗ୍ରୀ ସେଲସିଯ଼ସ୍ ଥିଲା। ଗତ ସପ୍ତାହରେ ଜିଲ୍ଲାରେ 52.3 ମିଲିମିଟର ବର୍ଷା ହୋଇଥିଲା। ଆଇଏମଡିରୁ ମିଳିଥିବା ପୂର୍ବାନୁମାନ ଆଧାରରେ, କୃଷକମାନେ ବର୍ତ୍ତମାନ ଆନ୍ତଃସାଂସ୍କୃତିକ କାର୍ଯ୍ଯ଼, ଉର୍ବରକରଣ ଏବଂ ଆବଶ୍ଯ଼କତା ଅନୁଯାଯ଼ୀ ଷ୍ଟିକର ସହିତ ଉଦ୍ଭିଦ ସୁରକ୍ଷା ରାସାଯ଼ନିକ ସିଞ୍ଚନ ଆରମ୍ଭ କରିପାରିବେ। ଅନୁଭୂତ ଏବଂ ପ୍ରତ୍ଯାଶିତ ବର୍ଷାକୁ ଦୃଷ୍ଟିରେ ରଖି କୃଷକମାନଙ୍କୁ ଅଗଷ୍ଟ 15 ତାରିଖ ସୁଦ୍ଧା ଧାନ ରୋପଣ ଶେଷ କରିବାକୁ ପରାମର୍ଶ ଦିଆଯାଇଛି। ମୃତ୍ତିକାରେ ପର୍ଯ୍ଯ଼ାପ୍ତ ଆର୍ଦ୍ରତା ନଥିବା ବେଳେ ଧାନ କ୍ଷେତରେ ସାର ଏବଂ ତୃଣନାଶକ ପ୍ରଯ଼ୋଗ ନକରିବାକୁ କୃଷକମାନଙ୍କୁ ପରାମର୍ଶ ଦିଆଯାଇଛି। ଡାଲି, ମକା, ଚିନାବାଦାମ ଏବଂ ପନିପରିବା କ୍ଷେତରୁ ଅତିରିକ୍ତ ଜଳ ନିଷ୍କାସନ ପାଇଁ ବ୍ଯ଼ବସ୍ଥା କରନ୍ତୁ। ଉଚ୍ଚ ଆର୍ଦ୍ରତା ସହିତ ଜଡିତ ପ୍ରଚଳିତ ମେଘୁଆ ପାଣିପାଗ ହେତୁ ଫସଲରେ କୀଟପତଙ୍ଗ ଏବଂ ରୋଗ ଘଟଣା ପାଇଁ ନିଯ଼ମିତ ତଦାରଖ କରିବାକୁ ପରାମର୍ଶ ଦିଆଯାଇଛି। କୀଟ ସଂଖ୍ଯ଼ା ଉପରେ ନଜର ରଖିବା ପାଇଁ ଫସଲ କ୍ଷେତରେ ହାଲୁକା ଜାଲ ଲଗାନ୍ତୁ ଯାହା ଦ୍ୱାରା ସମଯ଼ୋଚିତ ନିଯ଼ନ୍ତ୍ରଣ ପଦକ୍ଷେପ ନିଆଯାଇପାରିବ।",
   "crops_data": {
      "rice": {
         "advisory": [
            "ଫସଲଟି ସକ୍ରିଯ଼ ଚାଷ ପର୍ଯ୍ଯ଼ାଯ଼ରେ ରହିଛି। ବର୍ଷା ଜଳ ହ୍ରାସ ପାଇବା ପରେ, 280 ଡିଗ୍ରୀ ସେଲସିଯ଼ସରୁ କମ୍ ତାପମାତ୍ରା ଏବଂ 70 ପ୍ରତିଶତରୁ ଅଧିକ ଆପେକ୍ଷିକ ଆର୍ଦ୍ରତା ଧାନରେ ସ୍ୱାର୍ମିଂ କ୍ଯ଼ାଟର୍ପିଲାର୍ ଏବଂ ହଳଦିଆ କାଣ୍ଡ ଛେଦକ ସଂକ୍ରମଣକୁ ପସନ୍ଦ କରେ |",
            "ସ୍ୱାର୍ମିଂ କ୍ଯ଼ାଟର୍ପିଲର ପରିଚାଳନା ପାଇଁ, ପ୍ରଥମେ କ୍ଷେତ ଏବଂ ବନ୍ଧରୁ ଆଗାଛା ଅପସାରଣ କରେ | ଯଦି ଫସଲ ବିଉଶାନିଙ୍ଗ ପର୍ଯ୍ଯ଼ାଯ଼ରେ ଥାଏ, ତେବେ ତୁରନ୍ତ ବିଉଶାନିଙ୍ଗ ସମ୍ପୂର୍ଣ୍ଣ କରନ୍ତୁ। ଯେତେବେଳେ ଇ. ଟି. ଏଲ୍. '1' କ୍ଷତିଗ୍ରସ୍ତ ଟିଲର୍/ହିଲ୍ କିମ୍ବା '2' ଲାର୍ଭା/ଏମ୍2 'ରେ ପହଞ୍ଚେ, ସେତେବେଳେ କ୍ଲୋରପିରିଫସ୍ 50 ପ୍ରତିଶତ + ସାଇପର୍ମେଥ୍ରିନ୍ 5 ପ୍ରତିଶତ ଇ. ସି. @400-ମିଲି/ଏକର କିମ୍ବା କ୍ୱିନାଲ୍ଫସ୍ 20 ପ୍ରତିଶତ ଇ. ସି. + ସାଇପର୍ମେଥ୍ରିନ୍ 3 ପ୍ରତିଶତ ଇ. ସି. @400-ମିଲି/ଏକର କିମ୍ବା ଲାମ୍ବଡା ସାଇହାଲୋଥ୍ରିନ୍ 5 ପ୍ରତିଶତ ଇ. ସି. @300 ମିଲି/ଏକରରେ ମଧ୍ଯ଼ାହ୍ନ ସମଯ଼ରେ ସ୍ପ୍ରେ କରନ୍ତୁ।",
            "ଫସଲର ପ୍ରାରମ୍ଭିକ ପର୍ଯ୍ଯ଼ାଯ଼ରେ ଧାନରେ କାଣ୍ଡ ଛେଦକକୁ ପରିଚାଳନା କରିବା ପାଇଁ, କାର୍ଟାପ୍ ହାଇଡ୍ରୋକ୍ଲୋରାଇଡ୍ 4% ଜି @8-କେଜି/ଏକର କିମ୍ବା କ୍ଲୋରାଣ୍ଟ୍ରାନିଲିପ୍ରୋଲେ 0.4% ଜିଆର @4-କେଜି/ଏକର କିମ୍ବା ଇମିଡାକ୍ଲୋପ୍ରିଡ୍ 0.3% ଜିଆର @6-କେଜି/ଏକର ବାଲିରେ 1:1 ଅନୁପାତରେ ମିଶ୍ରଣ କରି ପ୍ରଯ଼ୋଗ କରନ୍ତୁ।"
         ]
      },
      "maize": {
         "advisory": [
            "ଶରତ ଋତୁର ପରିଚାଳନା ପାଇଁ ସେନା କୃମି କୀଟ 200 ଲିଟର ପାଣିରେ ମିଶାଇ ଏକର ପିଛା 1200-ଗ୍ରାମ୍ ବାଯ଼ୋପଷ୍ଟିସାଇଡ୍ ବିଉଭେରିଆ ବାସିଆନା ସ୍ପ୍ରେ କରନ୍ତୁ। ଏକର ପିଛା 10-12 ପକ୍ଷୀ ପର୍ଚ୍ ବ୍ଯ଼ବହାର କରନ୍ତୁ ଏବଂ ଟାସେଲିଂ ପର୍ଯ୍ଯ଼ାଯ଼ ପୂର୍ବରୁ ସେଗୁଡ଼ିକୁ ବାହାର କରନ୍ତୁ | ପତ୍ର ଚକ୍ର ଭିତରେ ବାଲି, ମାଟି ଏବଂ କାଠର ଛାଇର ଧୂଳି ମିଶ୍ରଣ ଯାହା ଦ୍ୱାରା କ୍ଯ଼ାଟର୍ପିଲାର୍ମାନେ ପତ୍ରକୁ ଖାଇପାରିବେ ନାହିଁ |",
            "ରାସାଯ଼ନିକ ଉପାଯ଼ରେ ଏହି କୀଟକୁ ନିଯ଼ନ୍ତ୍ରଣ କରିବା ପାଇଁ ଇମାମେକ୍ଟିନ୍ ବେନ୍ଜୋଏଟ୍ 5 ପ୍ରତିଶତ ଏସ୍. ଜି. @80-ଗ୍ରାମ୍/ଏକର କିମ୍ବା ସ୍ପିନେଟୋରାମ୍ <ଆଇ. ଡି. 2> ଏସ୍. ସି. @100-ମିଲି/ଏକର କିମ୍ବା କ୍ଲୋରାଣ୍ଟ୍ରାନିଲିପ୍ରୋଲ୍ <ଆଇ. ଡି. 1> ଏସ୍. ସି. @80-ମିଲି/ଏକରକୁ 200-ଲିଟର ପାଣିରେ ମିଶାଇ ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "cotton": {
         "advisory": [
            "କପାରେ ଷ୍ଟେମ ୱିଭିଲକୁ ପରିଚାଳନା କରିବା ପାଇଁ, ମୃତ୍ତିକା ଉତ୍ତୋଳନ ସମଯ଼ରେ ପ୍ରସ୍ତାବିତ ସାର ସହିତ କାର୍ଟାପ୍ ହାଇଡ୍ରୋକ୍ଲୋରାଇଡ୍ 4ଜି @8-କେଜି/ଏକର କିମ୍ବା କ୍ଲୋରାଣ୍ଟ୍ରାନିଲିପ୍ରୋଲ୍ 0.4%G @4-କେଜି/ଏକର ପ୍ରଯ଼ୋଗ କରନ୍ତୁ।",
            "ଯଦି ଶୀଘ୍ର ବୁଣାଯାଇଥିବା କପା ଫସଲରେ ଏଫିଡ୍ ଏବଂ ଜ୍ଯାସିଡ୍ସର ସଂକ୍ରମଣ ହୁଏ, ତେବେ ନିମ-ଆଧାରିତ କୀଟନାଶକ (ନିମ୍ ତେଲ 1500 ପିପିଏମ୍ @600-ମିଲି/ଏକରକୁ 200 ଲିଟର ପାଣିରେ ମିଶାଇ) ସ୍ପ୍ରେ କରନ୍ତୁ।",
            "କପା କ୍ଷେତରେ ପାଣି ଜମିବା ଏଡ଼ାଇବା ପାଇଁ ପର୍ଯ୍ଯ଼ାପ୍ତ ଡ୍ରେନେଜ୍ ଚ୍ଯ଼ାନେଲ୍ ଯୋଗାଇ ଦିଅନ୍ତୁ |"
         ]
      },
      "chilli": {
         "advisory": [
            "ଲଙ୍କା ଫସଲ ଚାରା ରୋପଣ ପର୍ଯ୍ଯ଼ାଯ଼ରେ ରହିଛି। ଉଚ୍ଚ ମୃତ୍ତିକା ଆର୍ଦ୍ରତା ଏବଂ ମଧ୍ଯ଼ମ ମୃତ୍ତିକା ତାପମାତ୍ରା (<28 ଡିଗ୍ରୀ ସେଲସିଯ଼ସ୍), ଉଚ୍ଚ ଆର୍. ଏଚ୍., ଅଧିକ ବର୍ଷା ଏବଂ ଏହି ବର୍ଷା ଋତୁରେ ଖରାପ ଜଳ ନିଷ୍କାସନ, ଏଫ୍. ରୋଗର ଆର୍ଦ୍ରତା ସୃଷ୍ଟି କରିପାରେ।",
            "ମାଙ୍କୋଜେବ୍ @3 ଗ୍ରାମ୍/ଲିଟର କିମ୍ବା ମେଟାଲାକ୍ସିଲ୍ @2 ଗ୍ରାମ୍/ଲିଟର କିମ୍ବା ମେଟାଲାକ୍ସିଲ୍ + ମାଙ୍କୋଜେବ୍ @3 ଗ୍ରାମ୍/ଲିଟର ସହିତ ପତ୍ର ସ୍ପ୍ରେ ସହିତ ମାଟିକୁ ଭିଜାଇ ଦିଅନ୍ତୁ |"
         ]
      },
      "brinjal": {
         "advisory": [
            "ବାଇଗଣ ଫୁଲ ଫୁଟାଇବା ଠାରୁ ଆରମ୍ଭ କରି ଫଳ ଧାରଣ କରିବା ପର୍ଯ୍ଯ଼ନ୍ତ ପର୍ଯ୍ଯ଼ାଯ଼ରେ ରହିଛି। ବର୍ଷା ହ୍ରାସ ପାଇବା ପରେ ଏବଂ ଦିନ ଓ ରାତିର ତାପମାତ୍ରା ବୃଦ୍ଧି ହେବାର ସମ୍ଭାବନା ରହିଛି ଏବଂ ସକାଳ ଆପେକ୍ଷିକ ଆର୍ଦ୍ରତା 70 ପ୍ରତିଶତରୁ ଅଧିକ ବାଇଗଣରେ ଶୁଟ୍ ଏବଂ ଫଳ ଛେଦକକୁ ପସନ୍ଦ କରେ |",
            "କୀଟକୁ ପରିଚାଳନା କରିବା ପାଇଁ, ଛିଦ୍ର ଏବଂ ପ୍ରଭାବିତ ଫଳ ଦେଖାଇଥିବା ପ୍ରଭାବିତ ଟର୍ମିନାଲ୍ ଶୁଟ୍ ଅପସାରଣ କରନ୍ତୁ |",
            "ଏହି କୀଟକୁ ନିଯ଼ନ୍ତ୍ରଣ କରିବା ପାଇଁ, ଏକର ପିଛା ଲିଉସିନ୍ ଲ୍ଯ଼ୁର୍ ଥିବା 8ଟି ଫେରୋମୋନ୍ ଫାନ୍ଦ ଲଗାନ୍ତୁ। ରାସାଯ଼ନିକ ନିଯ଼ନ୍ତ୍ରଣ ବ୍ଯ଼ବହାର କରନ୍ତୁ ଯଦି ଟର୍ମିନାଲ୍ ଶୁଟର 4 ପ୍ରତିଶତ ଶୁଖିଲା ଅଛି କିମ୍ବା 14 ପ୍ରତିଶତ ଫଳ ବୋରର ଦ୍ୱାରା ସଂକ୍ରମିତ |",
            "ରାସାଯ଼ନିକ ନିଯ଼ନ୍ତ୍ରଣ ପାଇଁ ଏମାମେକ୍ଟିନ୍ ବେନ୍ଜୋଏଟ୍ 5 ପ୍ରତିଶତ ଏସ୍ଜି @80-ଗ୍ରାମ୍/ଏକର କିମ୍ବା କ୍ଲୋରାଣ୍ଟ୍ରାନିଲିପ୍ରୋଲ୍ 18.5% ଏସ୍ସି @80-ମିଲି/ଏକର କିମ୍ବା ସ୍ପିନେଟୋରାମ୍ 11.7% ଏସ୍ସି @200-ମିଲି/ଏକର ସ୍ପ୍ରେ କରନ୍ତୁ।",
            "କୀଟନାଶକ ପ୍ରଯ଼ୋଗ ଏବଂ ଅମଳ ମଧ୍ଯ଼ରେ 7-10 ଦିନର ବ୍ଯ଼ବଧାନ ରହିବା ଉଚିତ୍। ଉପରୋକ୍ତ ଯେ କୌଣସି କୀଟନାଶକକୁ 15 ଦିନର ବ୍ଯ଼ବଧାନରେ ବିକଳ୍ପ ଭାବେ ବ୍ଯ଼ବହାର କରନ୍ତୁ।"
         ]
      },
      "goat": {
         "advisory": [
            "ଚଟାଣ ଉପରେ ବାଲି ବ୍ଯ଼ବହାର କରି ଆମେ ଚଟାଣକୁ ଶୁଖିଲା ରଖିପାରିବା ଯାହା ଦ୍ୱାରା ପଶୁମାନଙ୍କୁ ବିଭିନ୍ନ ରୋଗରୁ ମୁକ୍ତ ରଖାଯାଇପାରିବ।",
            "ଏହି ସେଡର ବିଶେଷତ୍ୱ ହେଉଛି ଚଟାଣଟି ଇଟା ଏବଂ ସିମେଣ୍ଟରେ ନିର୍ମିତ ଏବଂ ନଦୀରୁ ବାଲି ଏହା ଉପରେ 4 ରୁ 6 ଇଞ୍ଚ ମୋଟା ଦ୍ୱାରା ବ୍ଯ଼ାପିଥାଏ |",
            "ବାଲି ପରିସ୍ରାକୁ ଭିଜାଇ ରଖେ, ଯାହାଦ୍ୱାରା ପଶୁମାନେ ତା 'ଉପରେ ଆରାମରେ ଶୋଇପାରିବେ।",
            "ବାଲିର ଚଟାଣ ଉପରେ ସାମଗ୍ରୀ ସଫା କରିବା ମଧ୍ଯ଼ ସହଜ।",
            "ବାଲିକୁ ଶୁଖିଲା ରଖିବା ପାଇଁ ଏହାକୁ 15-20 ଦିନ ବ୍ଯ଼ବଧାନରେ ଓଲଟପାଲଟ କରି ଦିଆଯାଏ।",
            "ଶିଶୁଙ୍କ ପାଇଁ ଚଟାଣ ସ୍ଥାନର ଆବଶ୍ଯ଼କତା 0.5, ବଯ଼ସ୍କଙ୍କ ପାଇଁ 1.2, ହରିଣ ପାଇଁ 2 ବର୍ଗ ମିଟର ଏବଂ ଗର୍ଭବତୀ ମହିଳାଙ୍କ ପାଇଁ 2 ବର୍ଗ ମିଟର ଚଟାଣ ସ୍ଥାନ ଆବଶ୍ଯ଼କ, ଯାହା ପ୍ରତ୍ଯ଼େକ ପ୍ରକାରର ଘର ପାଇଁ ଉପଯୁକ୍ତ।"
         ]
      },
      "common fish": {
         "advisory": [
            "ଦ୍ରୁତ ଗତିରେ ବଢ଼ୁଥିବା ରୋହୁ, କାଟଲା ଏବଂ ମ୍ରିଗଲ ଭଳି କାର୍ପକୁ 4ଃ3ଃ3 ଅନୁପାତରେ ମହଜୁଦ ରଖିବା ଉଚିତ, ଯାହାଦ୍ୱାରା ଏହାର ଲାଭ ବଢ଼ିପାରିବ।",
            "ସାଧାରଣତଃ, ହେକ୍ଟର ପିଛା 5,000 ଫିଙ୍ଗରଲିଙ୍ଗର ଘନତ୍ୱ ଏକ ମାନକ ଷ୍ଟକିଂ ଭାବରେ ରଖାଯାଏ |",
            "ଚିନାବାଦାମ ତେଲ କେକ୍ ଏବଂ ଚାଉଳ ଚୋପା ଷ୍ଟକିଂ ସାମଗ୍ରୀର ମୋଟ ବାଯ଼ୋମାସର 5 ପ୍ରତିଶତ ଅନୁପାତରେ ସମାନ ଅନୁପାତରେ ଦିଆଯାଏ |",
            "ପୁଷ୍କରିଣୀର ଗୁଣବତ୍ତା ବୃଦ୍ଧି ପାଇଁ ଗୋବର, ଯ଼ୁରିଆ ଏବଂ ସୁପର ଫସଫେଟ୍ ପ୍ରଯ଼ୋଗ କରାଯିବା ଉଚିତ।",
            "8-10 ମାସରେ, ମାଛମାନେ ସେମାନଙ୍କର ବିପଣନ ଯୋଗ୍ଯ଼ ଆକାରରେ ପହଞ୍ଚନ୍ତି |"
         ]
      }
   },
   "date": "13-08-2024"
}