{
   "weather_details": {
      "11-01-2025": {
         "rainfall": 0,
         "t_max": 26,
         "t_min": 8,
         "rh_max": 88,
         "rh_min": 34,
         "wind_speed": 2,
         "wind_direction": 301,
         "cloud_cover": 3
      },
      "12-01-2025": {
         "rainfall": 0,
         "t_max": 27,
         "t_min": 12,
         "rh_max": 86,
         "rh_min": 34,
         "wind_speed": 3,
         "wind_direction": 326,
         "cloud_cover": 2
      },
      "13-01-2025": {
         "rainfall": 0,
         "t_max": 27,
         "t_min": 9,
         "rh_max": 82,
         "rh_min": 36,
         "wind_speed": 2,
         "wind_direction": 11,
         "cloud_cover": 3
      },
      "14-01-2025": {
         "rainfall": 0,
         "t_max": 28,
         "t_min": 9,
         "rh_max": 86,
         "rh_min": 34,
         "wind_speed": 3,
         "wind_direction": 326,
         "cloud_cover": 3
      },
      "15-01-2025": {
         "rainfall": 0,
         "t_max": 28,
         "t_min": 10,
         "rh_max": 86,
         "rh_min": 34,
         "wind_speed": 3,
         "wind_direction": 326,
         "cloud_cover": 2
      }
   },
   "names_of_crops": [
      "ଧାନ।",
      "ଚିନାବାଦାମ",
      "ସବୁଜ ଚଣା",
      "କଳା ଚଣା",
      "ରସୁଣ",
      "ଫୁଲକୋବି",
      "କଦଳୀ",
      "ଟମାଟୋ",
      "ଲଙ୍କା",
      "ସୂର୍ଯ୍ୟମୁଖୀ",
      "ଗୋରୁ।",
      "ମଇଁଷି।",
      "ଛେଳି।",
      "ମେଣ୍ଢା",
      "ଚିକେନ୍",
      "ସାଧାରଣ ମାଛ"
   ],
   "general_advisory": "ରୋଗ ଏବଂ କୀଟପତଙ୍ଗର ପ୍ରକୋପକୁ କମ୍ କରିବା ପାଇଁ ଆପଣଙ୍କ ଫସଲ କ୍ଷେତ୍ରକୁ ଆଗାଛାରୁ ମୁକ୍ତ ରଖନ୍ତୁ | ଫସଲର ବୃଦ୍ଧି ପର୍ଯ୍ୟାୟ ଅନୁଯାୟୀ ସନ୍ତୁଳିତ ଏବଂ ଉପଯୁକ୍ତ ସାର ପ୍ରୟୋଗ କରନ୍ତୁ। କୀଟପତଙ୍ଗ ଏବଂ ରୋଗର ପ୍ରକୋପ ପାଇଁ ଫସଲର ନିୟମିତ ତଦାରଖ କରାଯିବା ଉଚିତ। ରାସାୟନିକ କୀଟନାଶକ ପ୍ରୟୋଗ ସମୟରେ ସୁରକ୍ଷା ପଦକ୍ଷେପ ଅନୁସରଣ କରନ୍ତୁ ଏବଂ ପବନର ଦିଗ ପ୍ରତି ଧ୍ୟାନ ଦେଇ ସଠିକ୍ ପଦ୍ଧତିରେ ସୁପାରିସ କରାଯାଇଥିବା ମାତ୍ରା ପ୍ରୟୋଗ କରନ୍ତୁ।",
   "crops_data": {
      "paddy": {
         "advisory": [
            "ଶୁଖିଲା ମାଟିରେ ବ୍ରଡକାଷ୍ଟିଂ କିମ୍ବା ଡ୍ରମ୍ ସିଡର ଦ୍ୱାରା ପୂର୍ବ-ଅଙ୍କୁରିତ ବିଶୋଧିତ ମଞ୍ଜି ଗୁଡ଼ିକର ସମ୍ପୂର୍ଣ୍ଣ ବୁଣିବା ଏବଂ ଚାରା ବୃଦ୍ଧି ପାଇଁ ଉପଯୁକ୍ତ ଜଳ ବଜାୟ ରଖିବା",
            "ପୋଡ଼୍ଲିଂ ସମୟରେ ଏକର ପିଛା 44 କିଲୋଗ୍ରାମ ଡିଏପି ଏବଂ 22 କିଲୋଗ୍ରାମ ଏମଓପି ମୂଳ ମାତ୍ରା ଭାବରେ ପ୍ରୟୋଗ କରନ୍ତୁ |"
         ]
      },
      "groundnut": {
         "advisory": [
            "ପ୍ରଚଳିତ ପାଣିପାଗ ସ୍ଥିତି ଏଫିଡ୍ ଏବଂ ଜ୍ଯାସିଡ୍ ପରି ଶୋଷକ କୀଟପତଙ୍ଗର ବିକାଶକୁ ସମର୍ଥନ କରେ |",
            "କୀଟ ସଂଖ୍ୟା ଉପରେ ନଜର ରଖିବା ପାଇଁ ହଳଦିଆ ଚଟପଟା ଜାଲ ଲଗାନ୍ତୁ"
         ]
      },
      "green gram": {
         "advisory": [
            "ଆଗାଛା ପରିଚାଳନା ପାଇଁ କୁଇଜଲଫପ୍-ଇଥାଇଲ 5 ପ୍ରତିଶତ ଇସି କିମ୍ବା ଇମାଜେଥାପାଇର୍ 10 ଏସ୍. ଏଲ୍. ପ୍ରୟୋଗ କରନ୍ତୁ।",
            "ପତ୍ର ଖାଉଥିବା ଶୁଆକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ ପ୍ରୋଫେନୋଫସ୍ 50 ଇସି ବ୍ୟବହାର କରନ୍ତୁ।"
         ]
      },
      "black gram": {
         "advisory": [
            "ସବୁଜ ଚଣା ପରି ସମାନ ଆଗାଛା ଏବଂ କୀଟ ପରିଚାଳନା ପ୍ରୟୋଗ କରନ୍ତୁ |"
         ]
      },
      "onion": {
         "advisory": [
            "ନିୟମିତ ବ୍ୟବଧାନରେ ଫସଲକୁ ଜଳସେଚନ କରନ୍ତୁ।",
            "ଉପଯୁକ୍ତ ପର୍ଯ୍ୟାୟରେ ହୋଇଂ, ନିଡ଼ାଇ, ଏବଂ ଉପର ଡ୍ରେସିଂ ଗ୍ରହଣ କରନ୍ତୁ"
         ]
      },
      "cauliflower": {
         "advisory": [
            "ଖୋଳିବା, ଘାସ କାଟିବା ଜାରି ରଖନ୍ତୁ, ଏବଂ ଆବଶ୍ୟକତା ଅନୁଯାୟୀ ୟୁରିଆ ଏବଂ ଏମଓପି ଲଗାନ୍ତୁ।",
            "ଆବଶ୍ୟକତା ଅନୁଯାୟୀ ହୀରା ବ୍ୟାକ୍ ମଥ୍ ଏବଂ ଅନ୍ୟାନ୍ୟ କୀଟପତଙ୍ଗକୁ ନିୟନ୍ତ୍ରଣ କରନ୍ତୁ"
         ]
      },
      "cabbage": {
         "advisory": [
            "ଫୁଲକୋବି ଭଳି ପୋଷକ ତତ୍ତ୍ୱ ପରିଚାଳନା ଅଭ୍ୟାସ ଅନୁସରଣ କରନ୍ତୁ।"
         ]
      },
      "tomato": {
         "advisory": [
            "ସମ୍ପୂର୍ଣ୍ଣ ହୋଇଂ, ନିଡ଼ାଇ, ଏବଂ ଆବଶ୍ୟକ ଅନୁଯାୟୀ ୟୁରିଆ ଲଗାନ୍ତୁ",
            "ଶୁଖିଲା ଏବଂ ଫଳ ଏବଂ ଶୁଟ୍ ବୋରର୍ ପାଇଁ ମନିଟର କରନ୍ତୁ"
         ]
      },
      "chilli": {
         "advisory": [
            "ଥ୍ରିପ୍ସ ନିୟନ୍ତ୍ରଣ ପାଇଁ ବ୍ଲୁ ଷ୍ଟିକି ଟ୍ରାପ୍ ସ୍ଥାପନ କରନ୍ତୁ",
            "କୀଟ ପରିଚାଳନା ପାଇଁ ନିମ ଆଧାରିତ କୀଟନାଶକ ପ୍ରୟୋଗ କରନ୍ତୁ।"
         ]
      },
      "sunflower": {
         "advisory": [
            "ସୁପାରିସ କରାଯାଇଥିବା ସ୍ପ୍ରେ ଦ୍ୱାରା ଶୋଷକ କୀଟ କମ୍ପ୍ଲେକ୍ସକୁ ନିୟନ୍ତ୍ରଣ କରନ୍ତୁ",
            "ଆବଶ୍ୟକ ଅନୁଯାୟୀ ପାଉଡର ଫଙ୍ଗୁର ଏବଂ ଅନ୍ୟାନ୍ୟ ରୋଗର ସମାଧାନ କରନ୍ତୁ।"
         ]
      },
      "cattle": {
         "advisory": [
            "ସ୍ତନ୍ୟପାନ ସମୟରେ ଶରୀରର ଅବସ୍ଥା ସ୍କୋର ଉପରେ ନଜର ରଖନ୍ତୁ",
            "ଉତ୍ତମ ଫଳାଫଳ ପାଇଁ ବାଛୁରୀ ଜନ୍ମ ଦେବା ପୂର୍ବରୁ ଖାଦ୍ୟ ପରିମାଣ ଧୀରେ ଧୀରେ ବୃଦ୍ଧି କରନ୍ତୁ।"
         ]
      },
      "buffalo": {
         "advisory": [
            "ଖାଦ୍ୟ ଏବଂ ସ୍ୱାସ୍ଥ୍ୟ ପରିଚାଳନା ସମ୍ବନ୍ଧରେ ଗୋରୁମାନଙ୍କ ପ୍ରତି ସମାନ ଯତ୍ନ"
         ]
      },
      "goat": {
         "advisory": [
            "ଥଣ୍ଡା ପବନ ଏବଂ ଥଣ୍ଡା ଚଟାଣରୁ ଛେଳିମାନଙ୍କୁ ରକ୍ଷା କରନ୍ତୁ।",
            "ସ୍ୱାସ୍ଥ୍ୟ ସମସ୍ୟା ପାଇଁ ପଶୁ ଚିକିତ୍ସକଙ୍କ ସହ ଯୋଗାଯୋଗ କରନ୍ତୁ।"
         ]
      },
      "sheep": {
         "advisory": [
            "ଥଣ୍ଡା ପାଗ ସମସ୍ୟା ପାଇଁ ଛେଳିମାନଙ୍କ ପ୍ରତି ସମାନ ଯତ୍ନ"
         ]
      },
      "chicken": {
         "advisory": [
            "କୁକୁଡ଼ା ପକ୍ଷୀମାନଙ୍କୁ ପ୍ରବଳ ଥଣ୍ଡା ପବନ ଏବଂ ଥଣ୍ଡା ଚଟାଣ ସଂସ୍ପର୍ଶରେ ଆସିବାକୁ ଦିଅନ୍ତୁ।",
            "ସୁରକ୍ଷା ପାଇଁ କୁକୁଡ଼ା ଘରକୁ ପଲିଥିନ୍ ଚାଦରରେ ଢାଙ୍କି ଦିଅନ୍ତୁ।"
         ]
      },
      "common fish": {
         "advisory": [
            "ଇ. ୟୁ. ଏସ୍. ରୋଗ ବିରୁଦ୍ଧରେ ପ୍ରତିଷେଧକ ପଦକ୍ଷେପ ଭାବେ ସିଫାକ୍ସ ପ୍ରୟୋଗ କରନ୍ତୁ।",
            "ଉପଯୁକ୍ତ ପୋଷଣ ପାଇଁ ମାଛମାନଙ୍କୁ ତୈଳ କେକ୍ ବ୍ରାନ୍ ମିଶ୍ରଣ ସହିତ ଖାଦ୍ୟ ଦିଅନ୍ତୁ"
         ]
      }
   },
   "date": "10-01-2025"
}