{
   "weather_details": {
      "18-01-2025": {
         "rainfall": 0,
         "t_max": 25,
         "t_min": 8,
         "rh_max": 88,
         "rh_min": 34,
         "wind_speed": 2,
         "wind_direction": 301,
         "cloud_cover": 2
      },
      "19-01-2025": {
         "rainfall": 0,
         "t_max": 25,
         "t_min": 11,
         "rh_max": 86,
         "rh_min": 34,
         "wind_speed": 3,
         "wind_direction": 326,
         "cloud_cover": 3
      },
      "20-01-2025": {
         "rainfall": 0,
         "t_max": 25,
         "t_min": 8,
         "rh_max": 82,
         "rh_min": 36,
         "wind_speed": 2,
         "wind_direction": 11,
         "cloud_cover": 2
      },
      "21-01-2025": {
         "rainfall": 0,
         "t_max": 25,
         "t_min": 9,
         "rh_max": 86,
         "rh_min": 34,
         "wind_speed": 3,
         "wind_direction": 326,
         "cloud_cover": 2
      },
      "22-01-2025": {
         "rainfall": 0,
         "t_max": 26,
         "t_min": 9,
         "rh_max": 86,
         "rh_min": 34,
         "wind_speed": 3,
         "wind_direction": 326,
         "cloud_cover": 3
      }
   },
   "names_of_crops": [
      "ଧାନ।",
      "କଳା ଗ୍ରାମ",
      "ସୂର୍ଯ୍ୟମୁଖୀ",
      "ସୋରିଷ",
      "ଲଙ୍କା",
      "ଫୁଲକୋବି",
      "କଦଳୀ",
      "ଟମାଟୋ",
      "ବାଇଗଣ",
      "ଆଳୁ",
      "ଗୋରୁ।",
      "ଛେଳି।",
      "ଚିକେନ୍",
      "ମାଛ।"
   ],
   "general_advisory": "ପ୍ରଚଳିତ ନିମ୍ନ ତାପମାତ୍ରାକୁ ଦୃଷ୍ଟିରେ ରଖି, ସକାଳେ ଠିଆ ହୋଇଥିବା ପନିପରିବା ଏବଂ ଫସଲକୁ ହାଲୁକା ଜଳସେଚନ ପ୍ରଦାନ କରନ୍ତୁ। କୃଷକମାନଙ୍କୁ ନର୍ସରୀ ଶଯ୍ୟା ପ୍ରସ୍ତୁତ କରିବାକୁ ଏବଂ ନର୍ସରୀରେ ବୁଣିବା ପୂର୍ବରୁ କାର୍ବେନଡାଜିମ୍ 50 ପ୍ରତିଶତ ଡବ୍ଲୁ. ପି. @2 ଗ୍ରାମ/1 କେଜି ମଞ୍ଜି କିମ୍ବା କାର୍ବୋକ୍ସିନ୍ 37.5% + ଥିରମ୍ 37.5% @3 ଗ୍ରାମ/1 କେଜି ମଞ୍ଜି ସହିତ ଚିକିତ୍ସା କରିବାକୁ ପରାମର୍ଶ ଦିଆଯାଇଛି। ମହୁମାଛିଙ୍କୁ ରକ୍ଷା କରିବା ପାଇଁ ଅପରାହ୍ନ 3ଟା ପରେ କୀଟନାଶକ ସିଞ୍ଚନ କରାଯିବ। ଥଣ୍ଡା ଆଘାତକୁ ଏଡ଼ାଇବା ପାଇଁ ଘାସ କିମ୍ବା ଅନ୍ୟାନ୍ୟ ମଲ୍ଚିଙ୍ଗ ସାମଗ୍ରୀ ସହିତ ପନିପରିବା ଚାରା ମାଲ୍ଚ କରନ୍ତୁ |",
   "crops_data": {
      "paddy": {
         "advisory": [
            "ସତ୍ୟଭାମା, ସହଭାଗି ଧାନ, ମନ୍ଦାକିନୀ, ମାନସ୍ୱିନୀ, ଡି. ଆର୍. ଆର୍. 42, ଡି. ଆର୍. ଆର୍.-43, ଡି. ଆର୍. ଆର୍.-44, ବିନା 11, ଜି. ବି.-1, ଉନ୍ନତ ଲଲାଟ, ଏମ. ଟି. ୟୁ. 1010, ଏମ. ଟି. ୟୁ. 1001, ନବୀନ, ସ୍ୱର୍ଣ୍ଣ ଶ୍ରେୟା ଭଳି ଉନ୍ନତ ମାନର ଧାନ ମଞ୍ଜି ପ୍ରସ୍ତୁତ କରନ୍ତୁ, ଯାହା ଶୁଖିଲା ଋତୁରେ ଚାଷ କରାଯାଇପାରିବ।",
            "ଏହି କିସମଗୁଡ଼ିକ ପାଇଁ ଏକ ଏକର ଜମି ପାଇଁ ବୀଜ ହାର ହେଉଛି 20 କିଲୋଗ୍ରାମ।",
            "ନର୍ସରୀରେ ବୁଣିବା ପୂର୍ବରୁ ମଞ୍ଜିଗୁଡ଼ିକୁ କାର୍ବେନଡାଜିମ୍ 50 ପ୍ରତିଶତ ଡବ୍ଲୁ. ପି. @2-ଗ୍ରାମ୍/1-କେଜି ମଞ୍ଜି କିମ୍ବା କାର୍ବୋକ୍ସିନ୍ 37.5% + ଥିରମ୍ 37.5% @3-ଗ୍ରାମ୍/1 କେଜି ମଞ୍ଜି ସହିତ ଚିକିତ୍ସା କରନ୍ତୁ।"
         ]
      },
      "blackgram": {
         "advisory": [
            "20-25 ଡିଏଏସରେ 200 ଲିଟର ପାଣି ସହିତ ଏକର ପିଛା 5 ପ୍ରତିଶତ ଇସି କିମ୍ବା ଇମାଜେଥାପାଇର୍ 10 ଏସଏଲ @300 ମିଲି ମିଶାନ୍ତୁ।"
         ]
      },
      "sunflower": {
         "advisory": [
            "ୟୁରିଆର ଅଧା ମାତ୍ରା (ଇନବ୍ରେଡ୍-6 କେଜି/ଏସି, ହାଇବ୍ରିଡ୍-12 କେଜି/ଏସି) + ଏମଓପିର ଅଧା ମାତ୍ରା (ଇନବ୍ରେଡ୍-10 କେଜି/ଏସି, ହାଇବ୍ରିଡ୍-20 କେଜି/ଏସି) ଦ୍ୱିତୀୟ ଜଳସେଚନ ସମୟରେ ଦ୍ୱିତୀୟ ଶୀର୍ଷ ଡ୍ରେସିଂ ଭାବରେ ପ୍ରୟୋଗ କରନ୍ତୁ।",
            "ଶୋଷକ କୀଟ କମ୍ପ୍ଲେକ୍ସ (ଏଫିଡ୍, ହପର୍, ଥ୍ରିପ୍ସ ଏବଂ ହ୍ୱାଇଟ୍ ମାଛି): ପ୍ରଚଳିତ ପାଣିପାଗ ସ୍ଥିତି ଶୋଷକ କୀଟଗୁଡ଼ିକର ବିକାଶକୁ ସମର୍ଥନ କରେ |"
         ]
      },
      "mustard": {
         "advisory": [
            "ଶୀଘ୍ର ବୁଣାଯାଇଥିବା ସୋରିଷ ଫସଲରେ ଏଫିଡ୍ ସଂକ୍ରମଣ ହେବାର ସମ୍ଭାବନା ରହିଛି।",
            "ପ୍ରାରମ୍ଭିକ ପର୍ଯ୍ୟାୟରେ ଏଫିଡ୍ ପରିଚାଳନା କରିବାକୁ, ଏକର ପିଛା 8 ଟି ହଳଦିଆ ଷ୍ଟିକ୍ ଟ୍ରାପ୍ ଲଗାନ୍ତୁ |"
         ]
      },
      "chilli": {
         "advisory": [
            "କୀଟ ସଂକ୍ରମଣର ପ୍ରାଥମିକ ପର୍ଯ୍ୟାୟରେ ଲଙ୍କାରେ ଏଫିଡ୍ ଏବଂ ଥ୍ରିପ୍ସକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ 200-ଲିଟର ପାଣିରେ ମିଶ୍ରଣ କରି ନିମ୍ବ-ଆଧାରିତ କୀଟନାଶକ 1500 ପିପିଏମ @600-ମିଲି/ଏକର ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "cauliflower": {
         "advisory": [
            "କୋଇଲା ଫସଲରେ ରୋପଣ ସମୟରେ ମାଟି ପ୍ରୟୋଗ ଭାବରେ ବୋରାକ୍ସ @4-କେଜି/ଏକର ପ୍ରୟୋଗ କରନ୍ତୁ ଯାହା ବ୍ରାଉନ୍ ରଟ୍ କୁ ରୋକିବା ପାଇଁ |",
            "ଯଦି ଚାରା ରୋପଣ ସମୟରେ ବୋରାକ୍ସ ପ୍ରୟୋଗ କରାଯାଇନଥାଏ, ତେବେ ବୋରାକ୍ସ @2.5-ଗ୍ରାମ/ଲିଟର କିମ୍ବା ଫୋଲିବୋର/ସଲ୍ୟୁବର @1.5 ଗ୍ରାମ/ଲିଟର ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "cabbage": {
         "advisory": [
            "ଶୀଘ୍ର ରୋପଣ କରାଯାଇଥିବା କୋଲ୍ ଫସଲରେ ଡିମଣ୍ଡ ବ୍ୟାକ୍ ମଥ୍ର ସଂକ୍ରମଣ ହେବାର ସମ୍ଭାବନା ରହିଛି।",
            "ଏହି କୀଟକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ, ଏକର ପିଛା 6-8ଟି ହାଲୁକା ଫାନ୍ଦ ଲଗାନ୍ତୁ।"
         ]
      },
      "tomato": {
         "advisory": [
            "ଟମାଟୋରେ ଫଳ ଛେଦକକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ, ପ୍ରଥମେ ପ୍ରଭାବିତ ଫଳ ଏବଂ ବିକଶିତ ଲାର୍ଭା ସଂଗ୍ରହ କରି ନଷ୍ଟ କରନ୍ତୁ।",
            "ଏକର ପିଛା ହେଲିଲ୍ୟୁର ବିଶିଷ୍ଟ 20ଟି ଫେରୋମୋନ୍ ଫାନ୍ଦ ସ୍ଥାପନ କରନ୍ତୁ।"
         ]
      },
      "brinjal": {
         "advisory": [
            "ବାଇଗଣ ଅଙ୍କୁର ଏବଂ ଫଳ ଛେଦକଙ୍କ ଲାର୍ଭା ପତ୍ରପତ୍ରିକା ଏବଂ କୋମଳ ଅଙ୍କୁରରେ ବୁଡିଥାଏ ଯାହାର ଫଳସ୍ୱରୂପ ଅନ୍ତିମ ଅଙ୍କୁରଗୁଡ଼ିକ ଶୁଖିଯାଏ, ପତ୍ରଗୁଡ଼ିକ ଖସିଯାଏ ଏବଂ ଫୁଲର କଳାଗୁଡ଼ିକ ଝଡ଼ିଥାଏ |",
            "କୀଟକୁ ପରିଚାଳନା କରିବା ପାଇଁ, ଛିଦ୍ର ଏବଂ ପ୍ରଭାବିତ ଫଳ ଦେଖାଇଥିବା ପ୍ରଭାବିତ ଟର୍ମିନାଲ୍ ଶୁଟ୍ ଅପସାରଣ କରନ୍ତୁ |"
         ]
      },
      "potato": {
         "advisory": [
            "ଶୀଘ୍ର ରୋପଣ କରାଯାଇଥିବା ଆଳୁ ଫସଲ ସପ୍ତାହ ପର୍ଯ୍ୟାୟରେ ରହିଛି।",
            "ହୋଇଂ ଏବଂ ଆଗାଛା କାଟିବା ପାଇଁ ଯାଆନ୍ତୁ ଏବଂ ଅବଶିଷ୍ଟ 30-45 କିଲୋଗ୍ରାମ ଏନ୍/ଏକର ଲଗାନ୍ତୁ |"
         ]
      },
      "cattle": {
         "advisory": [
            "ଉପଯୁକ୍ତ ଭେଣ୍ଟିଲେସନ୍ ସୁବିଧା ସହିତ ପଶୁମାନଙ୍କୁ ଉପଯୁକ୍ତ ଆଶ୍ରୟ ପ୍ରଦାନ କରନ୍ତୁ |",
            "ଚଟାଣ ସଫା, ଶୁଖିଲା ଏବଂ ଘାସ ସହିତ ବିଛଣା ହେବା ଉଚିତ ଯାହା ଉତ୍ତାପ ହ୍ରାସକୁ ପ୍ରତିରୋଧ ଏବଂ ପ୍ରତିରୋଧ ଭାବରେ କାର୍ଯ୍ୟ କରେ |"
         ]
      },
      "goat": {
         "advisory": [
            "ପିପିଆର ରୋଗ, ଯାହାକୁ 'ଛେଳି ପ୍ଲେଗ୍' ମଧ୍ୟ କୁହାଯାଏ, ଶୀତ ଋତୁରେ ସାଧାରଣ ହୋଇଥାଏ।",
            "ପଶୁମାନଙ୍କୁ ଟିକା ଦିଅନ୍ତୁ।"
         ]
      },
      "chicken": {
         "advisory": [
            "ଶୀତଦିନେ ଫିଡର ସଂଖ୍ୟା ବୃଦ୍ଧି କରାଯିବା ଉଚିତ।",
            "ଶୀତ ଋତୁରେ ପକ୍ଷୀମାନେ କମ୍ ପାଣି ନିଅନ୍ତି ତେଣୁ ଶରୀରରେ ଜଳର ରକ୍ଷଣାବେକ୍ଷଣ ପାଇଁ, ତାଜା ଜଳର ନିରନ୍ତର ଯୋଗାଣ କରିବା ଆବଶ୍ୟକ |"
         ]
      },
      "fish": {
         "advisory": [
            "ଶୀତ ଋତୁରେ, ମାଛରେ \"ଇ. ୟୁ. ଏସ୍\". ରୋଗ ହେବାର ସମ୍ଭାବନା ଥାଏ।",
            "ପ୍ରତିଷେଧକ ପଦକ୍ଷେପ ସ୍ୱରୂପ କୃଷକମାନଙ୍କୁ ଏକ ଏକର ପୋଖରୀ ଅଞ୍ଚଳରେ 40 ଲିଟର ପାଣି ସହିତ 400 ମିଲିଲିଟର ସିଫ୍ୟାକ୍ସ ଲଗାଇବାକୁ ପରାମର୍ଶ ଦିଆଯାଇଛି।"
         ]
      }
   },
   "date": "17-01-2025"
}