{
   "weather_details": {
      "2024-09-18": {
         "rainfall": 20,
         "t_max": 34,
         "t_min": 25,
         "rh_max": 93,
         "rh_min": 68,
         "wind_speed": 5,
         "wind_direction": 279,
         "cloud_cover": 8
      },
      "2024-09-19": {
         "rainfall": 15,
         "t_max": 34,
         "t_min": 25,
         "rh_max": 93,
         "rh_min": 66,
         "wind_speed": 3,
         "wind_direction": 202,
         "cloud_cover": 8
      },
      "2024-09-20": {
         "rainfall": 15,
         "t_max": 35,
         "t_min": 26,
         "rh_max": 92,
         "rh_min": 74,
         "wind_speed": 3,
         "wind_direction": 135,
         "cloud_cover": 8
      },
      "2024-09-21": {
         "rainfall": 10,
         "t_max": 35,
         "t_min": 26,
         "rh_max": 96,
         "rh_min": 67,
         "wind_speed": 5,
         "wind_direction": 90,
         "cloud_cover": 8
      },
      "2024-09-22": {
         "rainfall": 5,
         "t_max": 35,
         "t_min": 26,
         "rh_max": 97,
         "rh_min": 63,
         "wind_speed": 5,
         "wind_direction": 112,
         "cloud_cover": 6
      }
   },
   "names_of_crops": [
      "ଚାଉଳ",
      "ମକା",
      "କପା",
      "ବାଇଗଣ",
      "କଦଳୀ",
      "ଉଦ୍ଭିଦ ସୁରକ୍ଷା"
   ],
   "general_advisory": "ଏହି ଜିଲ୍ଲାରେ ସାଧାରଣତଃ ମେଘୁଆ ଆକାଶ ସହିତ ହାଲୁକା ରୁ ମଧ୍ଯ଼ମ ବର୍ଷା ହେବାର ସମ୍ଭାବନା ରହିଛି। ଆଗାମୀ ପାଞ୍ଚ ଦିନ ପର୍ଯ୍ଯ଼ନ୍ତ ପବନର ବେଗ ଘଣ୍ଟାପ୍ରତି 3 ରୁ 5 କିଲୋମିଟର ମଧ୍ଯ଼ରେ ରହିବ। ସର୍ବାଧିକ ଏବଂ ସର୍ବନିମ୍ନ ତାପମାତ୍ରା ଯଥାକ୍ରମେ 34°ସେ. ରୁ 35°ସେ. ଏବଂ 25°ସେ. ରୁ 26°ସେ. ମଧ୍ଯ଼ରେ ରହିପାରେ। ଆପେକ୍ଷିକ ଆର୍ଦ୍ରତା ସକାଳେ 92 ରୁ 97 ପ୍ରତିଶତ ଏବଂ ଅପରାହ୍ନରେ 63 ରୁ 74 ପ୍ରତିଶତ ମଧ୍ଯ଼ରେ ରହିବ।",
   "crops_data": {
      "rice": {
         "advisory": [
            "ଆର୍ଦ୍ର ଏବଂ ଆର୍ଦ୍ର ପରିସ୍ଥିତି ହେତୁ, ଉପଯୁକ୍ତ ସ୍ପ୍ରେ ସହିତ ହଳଦିଆ କାଣ୍ଡ ଛେଦକ ଏବଂ ପତ୍ର ଫୋଲଡର ପରି କୀଟପତଙ୍ଗ ପରିଚାଳନା କରନ୍ତୁ |",
            "ଫଳପ୍ରଦ ଆଗାଛା ନିୟନ୍ତ୍ରଣ ପାଇଁ ସୁପାରିସ କରାଯାଇଥିବା ମାତ୍ରା ଅନୁଯାୟୀ ତୃଣନାଶକ ପ୍ରୟୋଗ କରନ୍ତୁ।",
            "ଅଗଭୀର ତଳିଆ/ମଧ୍ୟମ ଧରଣର ଜମିରେ ଧାନ ରୋପଣ ସମୟରେ ଉପଯୁକ୍ତ ପରିମାଣର ୟୁରିଆ ପ୍ରୟୋଗ କରନ୍ତୁ।",
            "ଜିଙ୍କ ଅଭାବ ଥିବା ମୃତ୍ତିକା ପାଇଁ, ସୁପାରିସ କରାଯାଇଥିବା ବ୍ଯ଼ବଧାନରେ Zn-EDTA କିମ୍ବା ZnSO4 ଦ୍ରବଣ ପ୍ରଯ଼ୋଗ କରନ୍ତୁ।",
            "କୀଟପତଙ୍ଗ ଏବଂ ରୋଗ ପ୍ରବଣତା ପାଇଁ ଫସଲର ନିଯ଼ମିତ ତଦାରଖ ପାଇଁ ପରାମର୍ଶ ଦିଆଯାଇଛି।"
         ]
      },
      "maize": {
         "advisory": [
            "ଜୈବ କୀଟନାଶକ କିମ୍ବା ରାସାଯ଼ନିକ ସ୍ପ୍ରେ ବ୍ଯ଼ବହାର କରି ସେନା କୃମି କୀଟକୁ ପରିଚାଳନା କରନ୍ତୁ |",
            "ଶୁଆକୁ ନିଯ଼ନ୍ତ୍ରଣ କରିବା ପାଇଁ ପକ୍ଷୀ ପର୍ଚ୍ ଏବଂ ଧୂଳି ମିଶ୍ରଣ ବ୍ଯ଼ବହାର କରନ୍ତୁ |",
            "କୀଟ ପରିଚାଳନା ପାଇଁ ଇମାମେକ୍ଟିନ୍ ବେନ୍ଜୋଏଟ୍, ସ୍ପିନେଟୋରାମ୍, କିମ୍ବା କ୍ଲୋରାଣ୍ଟ୍ରାନିଲିପ୍ରୋଲ୍ ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "cotton": {
         "advisory": [
            "ଏଫିଡ୍ ଏବଂ ଜ୍ଯାସିଡ୍ ପରି କୀଟ ଶୋଷିବା ପାଇଁ କପା ଫସଲ ଉପରେ ନଜର ରଖନ୍ତୁ |",
            "କୀଟ ନିୟନ୍ତ୍ରଣ ପାଇଁ ନିମ ଆଧାରିତ କୀଟନାଶକ କିମ୍ବା ରାସାୟନିକ ସ୍ପ୍ରେ ବ୍ୟବହାର କରନ୍ତୁ।",
            "ଫଳପ୍ରଦ କୀଟ ପରିଚାଳନା ପାଇଁ ଫ୍ଲୋନିକାମିଡ୍, ଥାୟାମେଥୋକ୍ସାମ୍, କିମ୍ବା ଡାଇନୋଟେଫୁରାନ୍ ପ୍ରୟୋଗ କରନ୍ତୁ।"
         ]
      },
      "brinjal": {
         "advisory": [
            "ଶୁଟ୍ ଏବଂ ଫଳ ଛେଦକକୁ ପରିଚାଳନା କରିବା ପାଇଁ ପ୍ରଭାବିତ ଟର୍ମିନାଲ୍ ଅଙ୍କୁର ଏବଂ ଫଳଗୁଡ଼ିକୁ ବାହାର କରନ୍ତୁ |",
            "ଫେରୋମୋନ୍ ଫାନ୍ଦ ସ୍ଥାପନ କରନ୍ତୁ ଏବଂ ଆବଶ୍ଯ଼କ ଅନୁଯାଯ଼ୀ ରାସାଯ଼ନିକ ନିଯ଼ନ୍ତ୍ରଣ ବ୍ଯ଼ବହାର କରନ୍ତୁ।",
            "କୀଟନାଶକ ପ୍ରଯ଼ୋଗ ଏବଂ ଅମଳ ମଧ୍ଯ଼ରେ ବ୍ଯ଼ବଧାନ ବଜାଯ଼ ରଖନ୍ତୁ |"
         ]
      },
      "banana": {
         "advisory": [
            "ଷ୍ଟେମ ୱିଭିଲକୁ ପରିଚାଳନା କରିବା ପାଇଁ ଫେରୋମୋନ୍ ଟ୍ରାପ୍ ସ୍ଥାପନ କରନ୍ତୁ।",
            "ନିମ୍ବ-ଆଧାରିତ ଉତ୍ପାଦ ସହିତ ପ୍ରାକ୍-ରୋପଣ ଚିକିତ୍ସା ସୁପାରିଶ କରାଯାଏ |",
            "ଉତ୍ତମ ଉଦ୍ଭିଦ ସ୍ୱାସ୍ଥ୍ଯ଼ ପାଇଁ କଦଳୀ ବଗିଚାରେ ସ୍ୱଚ୍ଛତା ବଜାଯ଼ ରଖନ୍ତୁ |"
         ]
      },
      "plant protection": {
         "advisory": [
            "ହଳଦିଆ ଶିରା ମୋଜାଇକ ରୋଗର ବାହକମାନଙ୍କୁ ପରିଚାଳନା କରିବା ପାଇଁ ହଳଦିଆ ଚଟପଟା ଜାଲ ଲଗାନ୍ତୁ।",
            "ଗୁରୁତର ସଂକ୍ରମଣ ପାଇଁ ଥାଯ଼ାମେଥୋକ୍ସାମ୍ କିମ୍ବା ଏସିଟାମିପ୍ରିଡ୍ ବ୍ଯ଼ବହାର କରନ୍ତୁ।",
            "ଉପଯୁକ୍ତ ଡ୍ରେଞ୍ଚିଂ ଦ୍ରବଣ ସହିତ ପନିପରିବାରେ ଚାରା ପୋଡ଼ିବାର ସମାଧାନ କରନ୍ତୁ |"
         ]
      }
   },
   "date": "17-09-2024"
}