{
   "weather_details": {
      "2024-09-28": {
         "rainfall": 5,
         "t_max": 33,
         "t_min": 24,
         "rh_max": 98,
         "rh_min": 79,
         "wind_speed": 7,
         "wind_direction": 193,
         "cloud_cover": 8
      },
      "2024-09-29": {
         "rainfall": 10,
         "t_max": 34,
         "t_min": 24,
         "rh_max": 98,
         "rh_min": 69,
         "wind_speed": 6,
         "wind_direction": 212,
         "cloud_cover": 6
      },
      "2024-09-30": {
         "rainfall": 5,
         "t_max": 34,
         "t_min": 24,
         "rh_max": 96,
         "rh_min": 69,
         "wind_speed": 5,
         "wind_direction": 248,
         "cloud_cover": 8
      },
      "2024-10-01": {
         "rainfall": 5,
         "t_max": 35,
         "t_min": 25,
         "rh_max": 94,
         "rh_min": 72,
         "wind_speed": 5,
         "wind_direction": 214,
         "cloud_cover": 5
      },
      "2024-10-02": {
         "rainfall": 5,
         "t_max": 36,
         "t_min": 25,
         "rh_max": 92,
         "rh_min": 72,
         "wind_speed": 6,
         "wind_direction": 244,
         "cloud_cover": 5
      }
   },
   "names_of_crops": [
      "ଚାଉଳ",
      "ଚିନାବାଦାମ",
      "ପିଜନ୍ ମଟର",
      "କଦଳୀ",
      "ପେଁପେ",
      "ଫୁଲକୋବି",
      "ଫ୍ରେଞ୍ଚ ବିନ୍",
      "ଗାଈ।",
      "ସାଧାରଣ ମାଛ"
   ],
   "general_advisory": "ଗତ ସପ୍ତାହରେ ଗଜପତି ଜିଲ୍ଲାର ହାରାହାରି ସର୍ବାଧିକ ଦୈନିକ ତାପମାତ୍ରା 34.6 ଡିଗ୍ରୀ ସେଲସିଯ଼ସ୍ ଏବଂ ହାରାହାରି ସର୍ବନିମ୍ନ ଦୈନିକ ତାପମାତ୍ରା 24.5 ଡିଗ୍ରୀ ସେଲସିଯ଼ସ୍ ଥିଲା। ଗତ ସପ୍ତାହରେ ଜିଲ୍ଲାରେ 43.6 ମିଲିମିଟର ବର୍ଷା ହୋଇଥିଲା। ଧାନର ଏଚ. ୱାଇ. ଭି. ପାଇଁ ପି. ଆଇ. ପର୍ଯ୍ଯ଼ାଯ଼ରେ ଏକର ପିଛା 17 କିଲୋଗ୍ରାମ ଯ଼ୁରିଆ ପ୍ରଯ଼ୋଗ କରନ୍ତୁ। ହାଲୁକା ବାଲୁକାମଯ଼ ମାଟି କ୍ଷେତ୍ରରେ, ଏକର ପିଛା 17 କିଲୋଗ୍ରାମ ଯ଼ୁରିଆ ଏବଂ 15 କିଲୋଗ୍ରାମ ଏମଓପି ଲଗାନ୍ତୁ। ହାଇବ୍ରିଡ୍ ପାଇଁ ପି. ଆଇ. ପର୍ଯ୍ଯ଼ାଯ଼ରେ 20 କିଲୋଗ୍ରାମ ଯ଼ୁରିଆ ସହିତ 20 କିଲୋଗ୍ରାମ ଏମ୍. ଓ. ପି. ପ୍ରଯ଼ୋଗ କରନ୍ତୁ। ବିଭିନ୍ନ ସ୍ଥାଯ଼ୀ ଫସଲରେ ଫଙ୍ଗାଲ୍ ଏବଂ ବ୍ଯ଼ାକ୍ଟେରିଆ ରୋଗ (ପତ୍ର ବ୍ଲାଇଟ୍, ୱିଲ୍ଟ, ଏବଂ ରଟ୍) କୁ ପରିଚାଳନା କରିବା ପାଇଁ, ପ୍ଲାଣ୍ଟୋମାଇସିନ୍ ସହିତ ଲିଟର ପିଛା 2 ଗ୍ରାମ୍/ଲିଟର ପାଣି କିମ୍ବା (କାର୍ବେନଡାଜିମ୍ + ମାନକୋଜେବ୍) ଲିଟର ପିଛା 2 ଗ୍ରାମ୍/ଲିଟର ପାଣି ସ୍ପ୍ରେ କରନ୍ତୁ। କୁକୁଡ଼ା ଫାର୍ମକୁ ପରିଷ୍କାର ପରିଚ୍ଛନ୍ନ ରଖନ୍ତୁ, ଚାଷ ପାଇଁ ରୋଗମୁକ୍ତ ଛୁଆ ବାଛନ୍ତୁ ଏବଂ କୁକୁଡ଼ା ପକ୍ଷୀ ରୋଗରୁ ରକ୍ଷା ପାଇବା ପାଇଁ ପର୍ଯ୍ଯ଼ାପ୍ତ କୁକୁଡ଼ା ଖାଦ୍ଯ଼ ଏବଂ ସ୍ୱଚ୍ଛ ଜଳ ପ୍ରଦାନ କରନ୍ତୁ। କୀଟପତଙ୍ଗ ଏବଂ ରୋଗର ପ୍ରକୋପ ପାଇଁ ଫସଲର ନିଯ଼ମିତ ତଦାରଖ କରାଯିବା ଉଚିତ।",
   "crops_data": {
      "rice": {
         "advisory": [
            "ପ୍ରଚଳିତ ଆର୍ଦ୍ର ଏବଂ ଆର୍ଦ୍ର ପରିସ୍ଥିତି ହେତୁ ଫସଲରେ ହଳଦିଆ କାଣ୍ଡ ଛେଦକ ଏବଂ ପତ୍ର ଫୋଲଡର ପରି କୀଟପତଙ୍ଗର ଆକ୍ରମଣ ବୃଦ୍ଧି ପାଇପାରେ | ଧାନରେ ଲିଫ୍ ଫୋଲ୍ଡର୍ ଏବଂ କେସ୍ ୱର୍ମ୍ କୀଟପତଙ୍ଗ ପରିଚାଳନା ପାଇଁ ଏକର ପିଛା 200 ମିଲି. ରେ ବାଇଫେନ୍ଥ୍ରିନ 10 ପ୍ରତିଶତ ଇସି କିମ୍ବା ଏକର ପିଛା 200 ମିଲି. ରେ ଲାମ୍ବଡା ସାଇହାଲୋଥ୍ରିନ 5 ପ୍ରତିଶତ ଇସି କିମ୍ବା ଏକର ପିଛା 400 ମିଲି. ରେ ଫିପ୍ରୋନିଲ 5 ପ୍ରତିଶତ ଏସସି କିମ୍ବା ଏକର ପିଛା 60 ମିଲି. ରେ କ୍ଲୋରାଣ୍ଟ୍ରାନିଲିପ୍ରୋଲ 18.5% ଏସସି ସ୍ପ୍ରେ କରନ୍ତୁ। ହଳଦିଆ କାଣ୍ଡ ଛେଦକ ପରିଚାଳନାଃ ଫସଲର ପ୍ରାରମ୍ଭିକ ପର୍ଯ୍ୟାୟରେ ଧାନରେ କାଣ୍ଡ ଛେଦକକୁ ପରିଚାଳନା କରିବା ପାଇଁ, କାର୍ଟାପ୍ ହାଇଡ୍ରୋକ୍ଲୋରାଇଡ୍ 4 ପ୍ରତିଶତ ଜି @18.45-kg/ha କିମ୍ବା କ୍ଲୋରାଣ୍ଟ୍ରାନିଲିପ୍ରୋଲ୍ 0.4 ପ୍ରତିଶତ ଜିଆର @10 କିଲୋଗ୍ରାମ/ହେକ୍ଟର କିମ୍ବା ଇମିଡାକ୍ଲୋପ୍ରିଡ୍ 0.3 ପ୍ରତିଶତ ଜି @15 କିଲୋଗ୍ରାମ/ହେକ୍ଟର 1:1 ଅନୁପାତରେ ବାଲି ସହିତ ମିଶ୍ରଣ କରି ପ୍ରୟୋଗ କରନ୍ତୁ। ପତ୍ର ଫୋଲଡର ଏବଂ କେସ୍ କୃମି ପରିଚାଳନାଃ ପତ୍ର ଫୋଲଡର ଏବଂ କେସ୍ କୃମି ଦ୍ୱାରା ଆକ୍ରାନ୍ତ ଧାନ କ୍ଷେତରେ, ହେକ୍ଟର ପିଛା କିରୋସିନି ଏବଂ 50 କିଲୋଗ୍ରାମ ବାଲିର ମିଶ୍ରଣ ଲଗାନ୍ତୁ ଏବଂ ତା 'ପରେ କ୍ଷେତର ଉଭୟ ପାର୍ଶ୍ୱରେ ବିସ୍ତାର କରି ଧାନ ଫସଲ ଉପରେ ଏକ ସୂତା ଘୁଞ୍ଚାନ୍ତୁ | ଏହି ପଦ୍ଧତି ଦ୍ୱାରା, କୀଟପତଙ୍ଗର ଲାର୍ଭା ପାଣିରେ ପଡ଼ି ମରିଯାଏ। ଧାନ ସ୍ପ୍ରେରେ ଲିଫ୍ ଫୋଲ୍ଡର୍ ଏବଂ କେସ୍ ୱର୍ମ୍ କୀଟପତଙ୍ଗ ପରିଚାଳନା ପାଇଁ ଫିପ୍ରୋନିଲ୍ 5 ପ୍ରତିଶତ ଏସ୍ସି @1000-ମିଲି/ହେକ୍ଟର କିମ୍ବା ପ୍ରୋଫେନୋଫସ୍ 50 ପ୍ରତିଶତ ଇସି @1000-ମିଲି/ହେକ୍ଟର କିମ୍ବା କ୍ଲୋରାଣ୍ଟ୍ରାନିଲିପ୍ରୋଲ୍ 18.5% ଏସ୍ସି @200-ମିଲି/ହେକ୍ଟର ସ୍ପ୍ରେ କରନ୍ତୁ। ବ୍ୟାକ୍ଟେରିଆଲ୍ ଲିଫ୍ ବ୍ଲାଇଟ୍ଃ ବ୍ୟାକ୍ଟେରିଆଲ୍ ଲିଫ୍ ବ୍ଲାଇଟ୍ର ପରିଚାଳନା ପାଇଁ, କପର୍ ହାଇଡ୍ରୋକ୍ସାଇଡ୍ 53.8% DF 3g/ltr କିମ୍ବା କପର୍ ଅକ୍ସିକ୍ଲୋରାଇଡ୍ 50% WP 3.0 g/ltr ସ୍ପ୍ରେ କରନ୍ତୁ। ବିସ୍ଫୋରଣ ରୋଗ ନିୟନ୍ତ୍ରଣ ପାଇଁ ହେକ୍ଟର ପିଛା 400-ମିଲି ହେକ୍ସାକୋନାଜୋଲ 5 ପ୍ରତିଶତ ଏସ୍. ସି. କିମ୍ବା ଏକର ପିଛା 200-ମିଲି ଡିଫେନୋକୋନାଜୋଲ ଏସ୍. ସି. କିମ୍ବା ଏକର ପିଛା 50 ପ୍ରତିଶତ ଟିବୁକୋନାଜୋଲ, ଟ୍ରାଇଫ୍ଲୋକ୍ସିସ୍ଟ୍ରୋବିନ 25 ପ୍ରତିଶତ ଡବ୍ଲୁ. ଜି., ଏକର ପିଛା 80-ଗ୍ରାମ୍ ସ୍ପ୍ରେ କରନ୍ତୁ। ସିଥ୍ ବ୍ଲାଇଟ୍ ରୋଗକୁ ପରିଚାଳନା କରିବା ପାଇଁ ରାସାୟନିକ ଭାବରେ ଭାଲିଡାମାଇସିନ୍ 3 ପ୍ରତିଶତ ଏଲ @400-ମିଲି/ଏକର କିମ୍ବା ହେକ୍ସାକୋନାଜୋଲ୍ 5 ପ୍ରତିଶତ ଏସସି @400-ମିଲି/ଏକର କିମ୍ବା ଟେବୁକୋନାଜୋଲ୍ 50 ପ୍ରତିଶତ + ଟ୍ରାଇଫ୍ଲୋକ୍ସିସ୍ଟ୍ରୋବିନ୍ 25 ପ୍ରତିଶତ ଡବ୍ଲୁଜି @80-ଗ୍ରାମ/ଏକର ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "groundnut": {
         "advisory": [
            "ବର୍ଷା ପରେ ଏହି ରୋଗର ପ୍ରକୋପ ସର୍ବାଧିକ ହୋଇଥାଏ। ଏହି ରୋଗକୁ ରୋକିବା ପାଇଁ କାର୍ବେଣ୍ଡାଜିମ୍ 50 ପ୍ରତିଶତ ଡବ୍ଲ୍ୟୁ. ପି. @2-ଗ୍ରାମ୍/କି. ଗ୍ରା. ମଞ୍ଜି କିମ୍ବା କାରବକ୍ସିନ୍ <ଆଇ. ଡି. 1> + ଥିରାମ୍ <ଆଇ. ଡି. 1> ଡି. ଏସ୍. ଡବ୍ଲ୍ୟୁ. ପି. @3-ଗ୍ରାମ୍/କି. ଗ୍ରା. ମଞ୍ଜି ବ୍ୟବହାର କରି ମଞ୍ଜି ଚିକିତ୍ସା କରାଯିବା ଉଚିତ। ଚିନାବାଦାମରେ ଷ୍ଟେମ ରୋଟ୍ ରୋଗ ପରିଚାଳନା ପାଇଁ 3 ପ୍ରତିଶତ ଏଲ @400-ମିଲି/ଏକର କିମ୍ବା କ୍ୟାପଟାନ 70 ପ୍ରତିଶତ + ହେକ୍ସାକୋନାଜୋଲ 5 ପ୍ରତିଶତ @300-ଗ୍ରାମ/ଏକର ସ୍ପ୍ରେ କରନ୍ତୁ। ଏହି କବକନାଶକକୁ ସିଞ୍ଚନ କରିବା ପାଇଁ ଏକର ପିଛା 200 ଲିଟର ପାଣି ଆବଶ୍ୟକ ହୋଇଥାଏ।"
         ]
      },
      "pigeon pea": {
         "advisory": [
            "ଶୋଷକ କୀଟ (ଏଫିଡ୍, ଜାସିଡ୍, ଥ୍ରିପ୍ସ, ହ୍ୱାଇଟ୍ଫ୍ଲାଇ): ବର୍ତ୍ତମାନର ପାଣିପାଗ ପରିସ୍ଥିତିରେ ଶୋଷକ କୀଟ ସାଧାରଣତଃ ଅଧିକ ସକ୍ରିଯ଼ | ନିମ୍ବ-ଆଧାରିତ କୀଟନାଶକ (1500 ପିପିଏମ) ସଂକ୍ରମଣର ପ୍ରାରମ୍ଭିକ ପର୍ଯ୍ଯ଼ାଯ଼ରେ 3 ମିଲି/ଲିଟର ପାଣିରେ ସିଞ୍ଚନ କରାଯାଇପାରେ। ବିଲ୍ଟଃ ବର୍ଷା କମିବା ପରେ ବିଲ୍ଟିଂ ଦେଖାଯାଇପାରେ। ଏକ ନିଯ଼ନ୍ତ୍ରଣ ପଦକ୍ଷେପ ଭାବରେ ଗଛର ମୂଳ ଅଞ୍ଚଳରେ ମେଟିରାମ୍ 75 ପ୍ରତିଶତ WG @1.5g/liter ପ୍ରଯ଼ୋଗ କରନ୍ତୁ।"
         ]
      },
      "pumpkin": {
         "advisory": [
            "କାକୁଡ଼ିରେ ଏପିଲାକ୍ନା ବିଟଲ୍କୁ ପରିଚାଳନା କରିବା ପାଇଁ ସଂକ୍ରମଣର ପ୍ରାରମ୍ଭିକ ପର୍ଯ୍ଯ଼ାଯ଼ରେ ନିମ୍ବ-ଆଧାରିତ କୀଟନାଶକ (ନିମ୍ବ ତେଲ 1500 ପିପିଏମ) 3 ମିଲି/ଲିଟରରେ ପାଣି ସ୍ପ୍ରେ କରନ୍ତୁ। ଏପିଲାକ୍ନା ବିଟଲ୍ର ପରିଚାଳନା ପାଇଁ ରାସାଯ଼ନିକ ଉପାଯ଼ରେ କ୍ଲୋରପିରିଫସ୍ 20 ପ୍ରତିଶତ ଇସି @2 ମିଲି/ଲିଟର ପାଣି କିମ୍ବା ପ୍ରୋଫେନୋଫସ୍ 50 ପ୍ରତିଶତ ଇସି @2 ମିଲି/ଲିଟର ପାଣି ସିଞ୍ଚନ କରନ୍ତୁ।"
         ]
      },
      "papaya": {
         "advisory": [
            "ସଂକ୍ରମଣର ପ୍ରାରମ୍ଭିକ ପର୍ଯ୍ୟାୟରେ କ୍ଷୁଦ୍ର କୀଟକୁ ପରିଚାଳନା କରିବା ପାଇଁ ନିମ୍ବ-ଆଧାରିତ କୀଟନାଶକ (ନିମ୍ବ ତେଲ 1500 ପିପିଏମ @30-ମିଲି/10 ଲିଟର ପାଣି କିମ୍ବା କୀଟନାଶକ ସାବୁନ) ସ୍ପ୍ରେ କରନ୍ତୁ। ଗୁରୁତର ସଂକ୍ରମଣ କ୍ଷେତ୍ରରେ ପ୍ରୋଫେନ୍ଫସ୍ 50 ପ୍ରତିଶତ ଇସି @20-ମିଲି/10-ଲିଟର ପାଣି କିମ୍ବା ଥିୟାମେଥୋକ୍ସାମ୍ 25 ପ୍ରତିଶତ ଡବ୍ଲୁଜି @3-ଗ୍ରାମ୍/10-ଲିଟର ପାଣି ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "cauliflower": {
         "advisory": [
            "ଫୁଲକୋବି, ବନ୍ଧାକୋବି ଏବଂ ବ୍ରୋକୋଲି ପାଇଁ ଉନ୍ନତ କିସମ ପାଇଁ 200 ଗ୍ରାମ୍ ଏବଂ ହାଇବ୍ରିଡ୍ ମଞ୍ଜି ପାଇଁ 50 ଗ୍ରାମ୍ ମଞ୍ଜି ମୂଲ୍ଯ଼ ରହିଛି। ଏକ ଏକର ଚାଷ ପାଇଁ, 3 ମିଟର ଲମ୍ବ, 1 ମିଟର ଓସାର ଏବଂ 2 ସେ. ମି. ଉଚ୍ଚତା ବିଶିଷ୍ଟ ନର୍ସରୀ ଶଯ୍ଯ଼ା ପ୍ରସ୍ତୁତ କରନ୍ତୁ। ବୁଣିବାର ଦଶ ଦିନ ପୂର୍ବରୁ ପ୍ରତ୍ଯ଼େକ ନର୍ସରୀ ଶଯ୍ଯ଼ାରେ 20 କିଲୋଗ୍ରାମ ସମ୍ପୂର୍ଣ୍ଣ ଅପଘଟିତ ଏଫ୍. ଆଇ. ଏମ୍. ଲଗାନ୍ତୁ।"
         ]
      },
      "french bean": {
         "advisory": [
            "ବିନ୍ସରେ ପୋଡ୍ ବୋରର ପରିଚାଳନା କରିବା ପାଇଁ ଏକର ପିଛା 90-ଗ୍ରାମ୍ କିମ୍ବା କ୍ଲୋରାଣ୍ଟ୍ରାନିଲିପ୍ରୋଲେ <ଆଇ. ଡି. 2> ଏସ୍. ସି. @60-ମିଲି କିମ୍ବା ଫ୍ଲୁବେଣ୍ଡିଆମାଇଡ୍ <ଆଇ. ଡି. 1> ଏସ୍. ସି. @40-ମିଲି/ଏକରରେ ଏମାମେକ୍ଟିନ୍ ବେନ୍ଜୋଏଟ୍ ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "cow": {
         "advisory": [
            "ଏହି ରୋଗର ସାଧାରଣ ଲକ୍ଷଣଗୁଡ଼ିକ ହେଉଛି ଉଚ୍ଚ ଜ୍ୱର, କ୍ଷୁଧାହୀନତା, ପାଟି ଏବଂ ନାସାରନ୍ଧ୍ରରୁ ଲାଳ ବାହାରିବା, ବେକ ଏବଂ ଶ୍ୱାସକ୍ରିଯ଼ାରେ ପ୍ରଦାହ। ପ୍ରଭାବିତ ପଶୁ ଶ୍ୱାସକ୍ରିଯ଼ା ପାଇଁ ଯନ୍ତ୍ରଣା ଅନୁଭବ କରେ ଏବଂ ଏକ କର୍କଶ ଶବ୍ଦ ସୃଷ୍ଟି କରେ | ଯେହେତୁ ଏହା ଅତ୍ଯ଼ଧିକ ସଂକ୍ରାମକ ଏବଂ ଶ୍ୱାସକ୍ରିଯ଼ା ପଥକୁ ପ୍ରଭାବିତ କରିଥାଏ, ଚିକିତ୍ସା କରାଯାଇନଥିବା ପଶୁମାନଙ୍କର ମୃତ୍ଯ଼ୁ ହାର ବହୁତ ଅଧିକ ଏବଂ ପଶୁମାନେ 3 ରୁ 4 ଦିନ ମଧ୍ଯ଼ରେ ମୃତ୍ଯ଼ୁ ବରଣ କରନ୍ତି | ମଇଁଷିମାନଙ୍କ କ୍ଷେତ୍ରରେ ଏହି ରୋଗ ଅଧିକ ମାରାତ୍ମକ ହୋଇଥାଏ। କିନ୍ତୁ ଯଦି ପ୍ରାରମ୍ଭିକ ପର୍ଯ୍ଯ଼ାଯ଼ରେ ଚିକିତ୍ସା କରାଯାଏ ତେବେ ରୋଗାକ୍ରାନ୍ତ ପଶୁଟି ସୁସ୍ଥ ହୋଇପାରିବ। ପଶୁମାନଙ୍କୁ ସୁରକ୍ଷିତ ରଖିବା ପାଇଁ ବର୍ଷକୁ ଦୁଇଥର ପଶୁମାନଙ୍କୁ ଟିକା ଦେବାକୁ କୃଷକମାନଙ୍କୁ ପରାମର୍ଶ ଦିଆଯାଇଛି।"
         ]
      },
      "common fish": {
         "advisory": [
            "ପୋଖରୀରେ ଅମ୍ଳଜାନର ଅଭାବ ହେଲେ, ମାଛଗୁଡ଼ିକ ଭୂପୃଷ୍ଠ ଜଳ ଉପରକୁ ଆସି ସେମାନଙ୍କ ମୁହଁ ଦେଇ ଘୁଞ୍ଚିବାକୁ ଆରମ୍ଭ କରିବେ | ଆଦର୍ଶ ଦ୍ରବୀଭୂତ ଅମ୍ଳଜାନ ପ୍ରାୟ 5 ମି. ଗ୍ରା./ଲି.। ଏକ ଏରେଟର ବ୍ୟବହାର କରି ଏହାକୁ ବଜାୟ ରଖାଯାଇପାରିବ। ବାୟୁ ସଞ୍ଚାରଣର ଏକ ସରଳ ଉପାୟ ହେଉଛି ପୁଷ୍କରିଣୀର ଜଳ ସଞ୍ଚାଳନ କରିବା। ଏହା ଏକ ପମ୍ପ ବ୍ୟବହାର କରି କରାଯାଇପାରିବ ଯାହା ପୁଷ୍କରିଣୀର ତଳ ପୃଷ୍ଠରୁ ପାଣି ନେଇପାରିବ ଏବଂ ସେହି ପୋଖରୀରେ ଛିଞ୍ଚି ପାରିବ |"
         ]
      }
   },
   "date": "27-09-2024"
}