{
   "weather_details": {
      "2024-07-10": {
         "rainfall": 4,
         "t_max": 35,
         "t_min": 25,
         "rh_max": 92,
         "rh_min": 53,
         "wind_speed": 6,
         "wind_direction": 193,
         "cloud_cover": 7
      },
      "2024-07-11": {
         "rainfall": 3,
         "t_max": 36,
         "t_min": 25,
         "rh_max": 89,
         "rh_min": 56,
         "wind_speed": 7,
         "wind_direction": 204,
         "cloud_cover": 6
      },
      "2024-07-12": {
         "rainfall": 4,
         "t_max": 36,
         "t_min": 26,
         "rh_max": 87,
         "rh_min": 57,
         "wind_speed": 7,
         "wind_direction": 225,
         "cloud_cover": 7
      },
      "2024-07-13": {
         "rainfall": 5,
         "t_max": 35,
         "t_min": 26,
         "rh_max": 87,
         "rh_min": 61,
         "wind_speed": 8,
         "wind_direction": 270,
         "cloud_cover": 6
      },
      "2024-07-14": {
         "rainfall": 6,
         "t_max": 34,
         "t_min": 25,
         "rh_max": 88,
         "rh_min": 63,
         "wind_speed": 8,
         "wind_direction": 288,
         "cloud_cover": 7
      }
   },
   "names_of_crops": [
      "ଚାଉଳ",
      "କପା",
      "ପିଜନ୍ ମଟର",
      "ଫିଙ୍ଗର ମିଲେଟ୍",
      "ମକା",
      "ବାଇଗଣ",
      "କଦଳୀ",
      "ଗାଈ।",
      "ଛେଳି।",
      "ସାଧାରଣ ମାଛ"
   ],
   "general_advisory": "ଗତ ସପ୍ତାହରେ ଗଜପତି ଜିଲ୍ଲାର ହାରାହାରି ସର୍ବାଧିକ ଦୈନିକ ତାପମାତ୍ରା 35.4 ଡିଗ୍ରୀ ସେଲସିଯ଼ସ୍ ଏବଂ ହାରାହାରି ସର୍ବନିମ୍ନ ଦୈନିକ ତାପମାତ୍ରା 26° ସେଲସିଯ଼ସ୍ ଥିଲା। ଗତ ସପ୍ତାହରେ ଜିଲ୍ଲାରେ 49.3 ମିଲିମିଟର ବର୍ଷା ହୋଇଥିଲା। ଉପରୋକ୍ତ ପୂର୍ବାନୁମାନ ଅନୁଯାଯ଼ୀ, ଆଗାମୀ ପାଞ୍ଚ ଦିନ ପର୍ଯ୍ଯ଼ନ୍ତ ହାଲୁକା ବର୍ଷା ଜାରି ରହିପାରେ।",
   "crops_data": {
      "rice": {
         "advisory": [
            "ସୁନିଶ୍ଚିତ ଜଳସେଚିତ ଅଞ୍ଚଳରେ ଭଲ ଜଳ ନିଷ୍କାସନ ସୁବିଧା ସହିତ ଜଳସେଚନ ଜଳ ଉତ୍ସ ନିକଟରେ ଓଦା ଶଯ୍ଯ଼ା ନର୍ସରୀ ପାଇଁ ଜମି ଚଯ଼ନ କରନ୍ତୁ | ଗ୍ରାମ ସ୍ତରରେ ଗୋଷ୍ଠୀ ନର୍ସରୀ ଆଭିମୁଖ୍ଯ଼ ଅନୁସରଣ କରିବାକୁ ପରାମର୍ଶ ଦିଆଯାଇଛି। ନର୍ସରୀ ଅଞ୍ଚଳକୁ 1.5-metre-long, 10 ସେ. ମି. ଉଚ୍ଚତା ଏବଂ ସୁବିଧାଜନକ ଲମ୍ବ ବିଶିଷ୍ଟ ଛୋଟ ଛୋଟ ପ୍ଲଟରେ ବିଭକ୍ତ କରନ୍ତୁ। ଜଳସେଚନ/ଜଳ ନିଷ୍କାସନ ପାଇଁ ଶଯ୍ଯ଼ା ସହିତ 30 ସେ. ମି. ଓସାରର ଜଳସେଚନ ଚ୍ଯ଼ାନେଲ ନିର୍ମାଣ କରାଯିବା ଉଚିତ। ପ୍ରତ୍ଯ଼େକ ଧାଡ଼ି କିମ୍ବା ସିଧାସଳଖ ପ୍ରସାରଣ ମଧ୍ଯ଼ରେ 5 ସେ. ମି. ବ୍ଯ଼ବଧାନ ସହିତ ଧାଡ଼ି ବୁଣିବା ଦ୍ୱାରା ଅଙ୍କୁରିତ ବୀଜଗୁଡିକ ବୀଜ ଶଯ୍ଯ଼ାର @40-50 ଗ୍ରାମ୍/ମି2 ଅଞ୍ଚଳରେ ରୋପଣ କରାଯିବା ଉଚିତ ଏବଂ ମଞ୍ଜି ଉପରେ ଶୁଖିଲା କମ୍ପୋଷ୍ଟ ପକାଇବା ଉଚିତ।"
         ]
      },
      "cotton": {
         "advisory": [
            "ଚାଷ କରିବା ପୂର୍ବରୁ ମାଟି ଉପରେ ଏଫ. ୱାଇ. ଏମ୍. କିମ୍ବା କମ୍ପୋଷ୍ଟ @2 ଟନ୍/ଏକର କିମ୍ବା ଭର୍ମିକମ୍ପୋଷ୍ଟ <ଆଇ. ଡି. 1> ଟନ୍/ଏକର ସମାନ ଭାବେ ଲଗାନ୍ତୁ। କୃଷକମାନେ ପିଜନ୍ ମଟର (8ଃ2 ଧାଡ଼ି ଅନୁପାତ) ଏବଂ ସବୁଜ ଚଣା/କଳା ଚଣା (1:2 ଧାଡ଼ି ଅନୁପାତ) କୁ ଆନ୍ତଃଶସ୍ଯ଼ ଭାବେ ଚଯ଼ନ କରିପାରିବେ।"
         ]
      },
      "pigeon pea": {
         "advisory": [
            "ଚୂଡ଼ାନ୍ତ ଜମି ପ୍ରସ୍ତୁତି ସମଯ଼ରେ ଏକର ପିଛା 2-4 ଟନ୍ ଏଫ୍. ୱାଇ. ଏମ୍. ପ୍ରଯ଼ୋଗ କରନ୍ତୁ। ଦୀପର ସ୍ଥାନୀଯ଼ ଅଞ୍ଚଳରେ ଜମି ପ୍ରସ୍ତୁତ କରିବା ସମଯ଼ରେ କ୍ଲୋରୋପାଇରିଫୋସ୍ ଧୂଳି 1% @10 କି. ଗ୍ରା./ଏସି ପ୍ରଯ଼ୋଗ କରାଯାଇଥାଏ। ବୀଜ ଡ୍ରିଲ୍ କିମ୍ବା ଦେଶୀ ହଳ ଦ୍ୱାରା ଧାଡ଼ି ବୁଣିବା 60 ସେ. ମି. x 15 ସେ. ମି. ବ୍ଯ଼ବଧାନ ସହିତ ସୁପାରିଶ କରାଯାଏ |"
         ]
      },
      "finger millet": {
         "advisory": [
            "ଏବେ ନର୍ସରୀରେ ରାଗି ବୁଣିବା ସମଯ଼। ଅର୍ଜୁନ, ଦିବ୍ଯ଼ସିଂହ, ଏ. କେ. ପି.-2, ଏ. କେ. ପି.-3, ଏ. କେ. ପି.-7, ଗୋଦାବରୀ, ନୀଳଚଲ, ଭୈରବୀ, ଶୁଭ୍ରା ଏବଂ ଚିଲିକା ଭଳି ଅଧିକ ଉତ୍ପାଦନକ୍ଷମ କିସମ ଚାଷ କରନ୍ତୁ। ରୋପଣ ପାଇଁ ଏକର ପିଛା 2 ରୁ 2.5 କି. ଗ୍ରା. ମଞ୍ଜି ବ୍ଯ଼ବହାର କରନ୍ତୁ। ବୁଣିବା ପୂର୍ବରୁ ପ୍ରତି କିଲୋଗ୍ରାମ ମଞ୍ଜି ପିଛା 3 ଗ୍ରାମ୍ ଥିରମ୍ କିମ୍ବା 1 ଗ୍ରାମ୍ ଟ୍ରାଇସିକ୍ଲୋଜୋଲ୍ ଦେଇ ମଞ୍ଜି ଉପଚାର କରନ୍ତୁ। ପ୍ରତି ବର୍ଗ ମିଟର ନର୍ସରୀ ଶଯ୍ଯ଼ାରେ 10 ଗ୍ରାମ୍ ନାଇଟ୍ରୋଜେନ୍ ଏବଂ ଫୋଫରସ୍ ଲଗାନ୍ତୁ ଏବଂ ଏହାକୁ ଭଲ ଭାବେ ମିଶାନ୍ତୁ। ଶଯ୍ଯ଼ା ଉପରେ ସମାନ ଭାବରେ ମଞ୍ଜି ବୁଣନ୍ତୁ ଏବଂ ପାଉଡର ମାଟି ସହିତ ମଞ୍ଜିଗୁଡ଼ିକୁ ପତଳା ଭାବରେ ଆଚ୍ଛାଦନ କରନ୍ତୁ |"
         ]
      },
      "maize": {
         "advisory": [
            "ମକା ପାଇଁ ବିହନ ହାର ଏକର ପିଛା 6-7 କିଲୋଗ୍ରାମ। ଫଲ୍ ଆର୍ମି କୃମିର ସଂକ୍ରମଣରୁ ରକ୍ଷା ପାଇବା ପାଇଁ, 1-କିଲୋଗ୍ରାମ ମଞ୍ଜି 4-ମିଲି Cyantraniliprole19.8% + ଥାଯ଼ାମେଥୋକ୍ସାମ୍ 19.8% ଏଫ୍. ଏସ୍. ସହିତ ଚିକିତ୍ସା କରନ୍ତୁ। ଧାଡ଼ି ଠାରୁ ଧାଡ଼ି ମଧ୍ଯ଼ରେ ଦୂରତା 60 ସେ. ମି. ରଖନ୍ତୁ ଏବଂ ଗଛ ଲଗାଇବା ପାଇଁ 20 ସେ. ମି. ରଖନ୍ତୁ।"
         ]
      },
      "brinjal": {
         "advisory": [
            "20 କିଲୋଗ୍ରାମ ଯ଼ୁରିଆ, 52 କିଲୋଗ୍ରାମ ଡିଏପି ଏବଂ 20 କିଲୋଗ୍ରାମ ଏମଓପିକୁ ମୂଳ ସାର ଭାବେ ବ୍ଯ଼ବହାର କରନ୍ତୁ। ଧାଡ଼ି ଠାରୁ ଧାଡ଼ି ମଧ୍ଯ଼ରେ 75 ସେ. ମି. ବ୍ଯ଼ବଧାନ ରଖନ୍ତୁ ଏବଂ ଗଛ ଠାରୁ ଗଛ ମଧ୍ଯ଼ରେ 60 ସେ. ମି. ବ୍ଯ଼ବଧାନ ରଖନ୍ତୁ।"
         ]
      },
      "pumpkin": {
         "advisory": [
            "କାକୁଡ଼ିରେ ଡାଉନି ମାଇଲ୍ଡ୍ଯ଼ୁ ରୋଗ ପରିଚାଳନା ପାଇଁ କପର୍ ହାଇଡ୍ରୋକ୍ସାଇଡ୍ 77 ପ୍ରତିଶତ ଡବ୍ଲ୍ଯ଼ୁ. ପି. (ହାଇ-ଡାଇସ୍/କୋସାଇଡ୍) @3-ଗ୍ରାମ୍/ଲିଟର କିମ୍ବା ଫୋସେଟିଲ୍-ଏ. ଏଲ୍. 80 ପ୍ରତିଶତ ଡବ୍ଲ୍ଯ଼ୁ. ପି. (ଏଲିଟ୍) @3-ଗ୍ରାମ୍/ଲିଟର କିମ୍ବା କାର୍ବେନଡାଜିମ୍ 12 ପ୍ରତିଶତ + ମାନକୋଜେବ୍ 63 ପ୍ରତିଶତ ଡବ୍ଲ୍ଯ଼ୁ. ପି. (ସାଫ୍/ସିକ୍ସର୍) @2-ଗ୍ରାମ୍/ଲିଟର ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "cow": {
         "advisory": [
            "ଏଫ୍. ଏମ୍. ଡି., ଏଚ୍. ଏସ୍. ଏବଂ ବି. କ୍ଯ଼ୁ. ବିରୁଦ୍ଧରେ ପଶୁମାନଙ୍କର କୃମି ନିରାକରଣ ଏବଂ ଟୀକାକରଣ ସୁନିଶ୍ଚିତ କରାଯିବା ଉଚିତ କାରଣ ମୌସୁମୀ ଆରମ୍ଭ ହେବା ସହିତ (ବର୍ଷା ଋତୁରେ) ଏହା ପଶୁମାନଙ୍କ ମଧ୍ଯ଼ରେ ଦ୍ରୁତ ଗତିରେ ବ୍ଯ଼ାପିଥାଏ।"
         ]
      },
      "goat": {
         "advisory": [
            "ଆଭ୍ଯ଼ନ୍ତରୀଣ ପରଜୀବୀଗୁଡ଼ିକର ଭାର ହ୍ରାସ କରିବା ପାଇଁ ସେଗୁଡ଼ିକୁ ପତଳା କରନ୍ତୁ। ବାହ୍ଯ଼ ପରଜୀବୀ ବିରୁଦ୍ଧରେ ମେଣ୍ଢା କ୍ଷେତ୍ରରେ ଡିପିଂ କରାଯିବା ଉଚିତ୍ | ବର୍ଷା ସମଯ଼ରେ ପଶୁମାନଙ୍କୁ ଘର ଭିତରେ ରଖନ୍ତୁ ଏବଂ ସ୍ୱଚ୍ଛ ତଥା ସ୍ୱାସ୍ଥ୍ଯ଼କର ଜଳ ଯୋଗାଇ ଦିଅନ୍ତୁ।"
         ]
      },
      "common fish": {
         "advisory": [
            "ଦ୍ରୁତ ଗତିରେ ବଢ଼ୁଥିବା ରୋହୁ, କାଟଲା ଏବଂ ମ୍ରିଗଲ ଭଳି କାର୍ପକୁ 4ଃ3ଃ3 ଅନୁପାତରେ ମହଜୁଦ ରଖିବା ଉଚିତ, ଯାହାଦ୍ୱାରା ଏହାର ଲାଭ ବଢ଼ିପାରିବ। ସାଧାରଣତଃ, ହେକ୍ଟର ପିଛା 5,000 ଫିଙ୍ଗରଲିଙ୍ଗର ଘନତ୍ୱ ଏକ ମାନକ ଷ୍ଟକିଂ ଭାବରେ ରଖାଯାଏ | ଚିନାବାଦାମ ତେଲ କେକ୍ ଏବଂ ଚାଉଳ ଚୋପା ଷ୍ଟକିଂ ସାମଗ୍ରୀର ମୋଟ ବାଯ଼ୋମାସର 5 ପ୍ରତିଶତ ଅନୁପାତରେ ସମାନ ଅନୁପାତରେ ଦିଆଯାଏ | ପୁଷ୍କରିଣୀର ଗୁଣବତ୍ତା ବୃଦ୍ଧି ପାଇଁ ଗୋବର, ଯ଼ୁରିଆ ଏବଂ ସୁପର ଫସଫେଟ୍ ପ୍ରଯ଼ୋଗ କରାଯିବା ଉଚିତ।"
         ]
      }
   },
   "date": "09-07-2024"
}