{
   "weather_details": {
      "2024-12-10": {
         "rainfall": 0,
         "t_max": 27,
         "t_min": 17,
         "rh_max": 91,
         "rh_min": 48,
         "wind_speed": 3,
         "wind_direction": 21,
         "cloud_cover": 4
      },
      "2024-12-11": {
         "rainfall": 0,
         "t_max": 26,
         "t_min": 15,
         "rh_max": 85,
         "rh_min": 39,
         "wind_speed": 3,
         "wind_direction": 32,
         "cloud_cover": 2
      },
      "2024-12-12": {
         "rainfall": 0,
         "t_max": 26,
         "t_min": 14,
         "rh_max": 77,
         "rh_min": 31,
         "wind_speed": 3,
         "wind_direction": 21,
         "cloud_cover": 0
      },
      "2024-12-13": {
         "rainfall": 0,
         "t_max": 26,
         "t_min": 14,
         "rh_max": 64,
         "rh_min": 28,
         "wind_speed": 3,
         "wind_direction": 21,
         "cloud_cover": 0
      },
      "2024-12-14": {
         "rainfall": 0,
         "t_max": 26,
         "t_min": 13,
         "rh_max": 62,
         "rh_min": 24,
         "wind_speed": 4,
         "wind_direction": 17,
         "cloud_cover": 0
      }
   },
   "names_of_crops": [
      "ଚାଉଳ",
      "କଳା ଚଣା",
      "ଲଙ୍କା",
      "କଦଳୀ",
      "ଟମାଟୋ",
      "ଗାଈ।",
      "ସାଧାରଣ ମାଛ",
      "ଉଦ୍ଭିଦ ସୁରକ୍ଷା"
   ],
   "general_advisory": "ଗତ ସପ୍ତାହରେ ଗଜପତି ଜିଲ୍ଲାର ହାରାହାରି ସର୍ବାଧିକ ଦୈନିକ ତାପମାତ୍ରା 31.9 ଡିଗ୍ରୀ ସେଲସିୟସ୍ ଏବଂ ହାରାହାରି ସର୍ବନିମ୍ନ ଦୈନିକ ତାପମାତ୍ରା 18.6 ଡିଗ୍ରୀ ସେଲସିୟସ୍ ଥିଲା। ଗତ ସପ୍ତାହରେ ଜିଲ୍ଲାରେ 02.3 ମିଲିମିଟର ବର୍ଷା ହୋଇଥିଲା। କୁହୁଡ଼ି, ନିମ୍ନ ତାପମାତ୍ରା ଏବଂ ଆର୍ଦ୍ରତା ଚାପରୁ କ୍ଷତିକୁ ରୋକିବା ପାଇଁ ସକାଳ ସମୟରେ ଠିଆ ହୋଇଥିବା ପନିପରିବା ଏବଂ ଫସଲକୁ ହାଲୁକା ଜଳସେଚନ ପ୍ରଦାନ କରନ୍ତୁ |",
   "crops_data": {
      "rice": {
         "advisory": [
            "ଗଚ୍ଛିତ ଶସ୍ୟ କୀଟପତଙ୍ଗର ସଂକ୍ରମଣକୁ ଲକ୍ଷ୍ୟ କରିବାର ତୁରନ୍ତ ପରେ, ଆଲୁମିନିୟମ୍ ଫସଫାଇଡ୍ ଟାବଲେଟ୍ ବ୍ୟବହାର କରି (ଘରେ ବ୍ୟବହାର କରନ୍ତୁ ନାହିଁ) 3 ଟାବଲେଟ୍/ଟନ୍ ଶସ୍ୟ (ମୋଟ 9 ଗ୍ରାମ୍ ଟାବଲେଟ୍) ମୋଟାମୋଟି ବାୟୁ ଟାଇଟ କଣ୍ଟେନରରେ କିମ୍ବା ମୋଟା ତିରପାଲ ସହିତ ଆଚ୍ଛାଦନ କରି କୌଣସି ବ୍ୟବଧାନ ଛାଡି ବ୍ୟବହାର କରନ୍ତୁ | ଟାବଲେଟ୍ଗୁଡ଼ିକୁ ଷ୍ଟାକ୍ରେ ରଖିବା ପୂର୍ବରୁ ସେଗୁଡ଼ିକୁ ସୂତା ପାଉଚରେ ବାନ୍ଧି ରଖିବା ଉଚିତ। ଗ୍ୟାସ୍ ଲିକ୍ ରୋକିବା ପାଇଁ ପ୍ଲାଷ୍ଟିକ୍ କଭରର ସମସ୍ତ କୋଣକୁ 6 ଇଞ୍ଚ ମୋଟା ସ୍ତର କାଦୁଅ/ଆଡ଼େସିଭ୍ ଟେପ୍ ସହିତ ପ୍ଲାଷ୍ଟର କରାଯିବା ଉଚିତ୍ | ସର୍ବନିମ୍ନ ଏକ୍ସପୋଜର ଅବଧି ପ୍ରାୟ 7-10 ଦିନ ପାଇଁ |"
         ]
      },
      "black gram": {
         "advisory": [
            "କଳା ଚଣା ଏବଂ ସବୁଜ ଚଣା ଗୁଡ଼ିକରେ ପାଉଡର ଫଙ୍ଗୁର ରୋଗ ହେବାର ସମ୍ଭାବନା ରହିଛି। ଏହି ରୋଗକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ ସଲଫର୍ 80 ପ୍ରତିଶତ ଡବ୍ଲ୍ୟୁ. ପି. @800 ଗ୍ରାମ୍/ଏକର କିମ୍ବା ହେକ୍ସାକୋନାଜୋଲ୍ 5 ପ୍ରତିଶତ ଇ. ସି. @ଏକର ପିଛା 300 ମିଲି. ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "chilli": {
         "advisory": [
            "କୀଟ ସଂକ୍ରମଣର ପ୍ରାଥମିକ ପର୍ଯ୍ୟାୟରେ ଲଙ୍କାରେ ଏଫିଡ୍ ଏବଂ ଥ୍ରିପ୍ସକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ 200 ଲିଟର ପାଣିରେ ମିଶାଇ ଏକର ପିଛା 600-ମିଲି ପିଛା ନିମ୍ବ ଆଧାରିତ କୀଟନାଶକ 1500 ପିପିଏମ ସ୍ପ୍ରେ କରନ୍ତୁ। ଥିୟାମେଥୋକ୍ସାମ୍ 25 ପ୍ରତିଶତ ଡବ୍ଲୁ. ଜି. @40 ଗ୍ରାମ୍/ଏକର କିମ୍ବା ଏସିଟାମିପ୍ରିଡ୍ 20 ପ୍ରତିଶତ ଏସ. ପି. @50 ଗ୍ରାମ୍/ଏକର କିମ୍ବା ପ୍ରୋଫେନୋଫସ୍ 40 ପ୍ରତିଶତ + ଫେନପାଇରୋକ୍ସିମେଟ୍ 2.5 ପ୍ରତିଶତ ଇ. ସି. @400-ମିଲି/ଏକର ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "cabbage": {
         "advisory": [
            "ଡାଇମଣ୍ଡ ବ୍ୟାକ୍ ମଥ୍ର ପରିଚାଳନା ପାଇଁ ଏକର ପିଛା 6ରୁ 8ଟି ଲାଇଟ୍ ଟ୍ରାପ୍ ଲଗାନ୍ତୁ। କୀଟ ସଂକ୍ରମଣର ପ୍ରାଥମିକ ପର୍ଯ୍ୟାୟରେ 200 ଲିଟର ପାଣିରେ ମିଶ୍ରଣ କରି ନିମ୍ବ-ଆଧାରିତ କୀଟନାଶକ (ଆଜାଦିରାକ୍ଟିନ) 300 ପିପିଏମ @1 ଲିଟର/ଏକର ସ୍ପ୍ରେ କରନ୍ତୁ। ଟଲ୍ଫେନ୍ପାଇରାଡ୍ 15 ପ୍ରତିଶତ ଇସି @400-ମିଲି/ଏକର କିମ୍ବା ଫ୍ଲୁବେଣ୍ଡିଆମାଇଡ୍ 20 ପ୍ରତିଶତ ଡବ୍ଲୁଜି @20-ଗ୍ରାମ୍/ଏକର କିମ୍ବା ଇମାମେକ୍ଟିନ୍ ବେନ୍ଜୋଏଟ୍ 5 ପ୍ରତିଶତ ଏସ୍ଜି @@80-ଗ୍ରାମ୍/ଏକରକୁ 200 ଲିଟର ପାଣିରେ ମିଶାଇ ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "tomato": {
         "advisory": [
            "କୀଟପତଙ୍ଗମାନଙ୍କୁ ଆକର୍ଷିତ କରିବା ଏବଂ ମାରିବା ପାଇଁ @8-10 ଏକର ହଳଦିଆ ଚଟପଟା ଫାନ୍ଦ ବ୍ୟବହାର କରନ୍ତୁ। କୀଟ ସଂକ୍ରମଣର ପ୍ରାଥମିକ ପର୍ଯ୍ୟାୟରେ 200 ଲିଟର ପାଣିରେ ମିଶ୍ରଣ କରି ନିମ୍ବ-ଆଧାରିତ କୀଟନାଶକ (ଆଜାଦିରାକ୍ଟିନ) 1500 ପିପିଏମ @600 ମିଲି/ଏକର ସ୍ପ୍ରେ କରନ୍ତୁ। ଥିୟାମେଥୋକ୍ସାମ୍ 25 ପ୍ରତିଶତ ଡବ୍ଲୁ. ଜି. ଏକର ପିଛା 40 ଗ୍ରାମ କିମ୍ବା ପାଇରିପ୍ରୋକ୍ସିଫେନ୍ 10 ପ୍ରତିଶତ ଇ. ସି. ଏକର ପିଛା 200 ମିଲି କିମ୍ବା ସ୍ପାଇରୋମେସିଫେନ୍ 22.9% ଏସ୍. ସି. ଏକର ପିଛା 250 ମିଲି, 200 ଲିଟର ପାଣିରେ ମିଶାଇ ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "cow": {
         "advisory": [
            "ପଶୁମାନଙ୍କର ଘର ଏବଂ ତା 'ର ଚଟାଣ ଅଧିକ ସମୟ ପର୍ଯ୍ୟନ୍ତ ଓଦା ଏବଂ ଥଣ୍ଡା ରହିବା ଉଚିତ ନୁହେଁ। ଏହା ପଶୁମାନଙ୍କୁ, ବିଶେଷ କରି ସାନମାନଙ୍କୁ, ନିମୋନିଆ, ଜ୍ୱର, କୋକ୍ସିଡିଓସିସ୍, ତରଳ ଝାଡ଼ା ଏବଂ ଏପରିକି ଗୁରୁତର କ୍ଷେତ୍ରରେ ମୃତ୍ୟୁ ଭଳି ବିଭିନ୍ନ ରୋଗର ସମ୍ମୁଖୀନ କରାଇପାରେ। ଶୀତ ଋତୁରେ ଭଲ ଭେଣ୍ଟିଲେସନ୍ ସୁନିଶ୍ଚିତ କରାଯିବା ଆବଶ୍ୟକ।"
         ]
      },
      "common fish": {
         "advisory": [
            "ଶୀତ ଋତୁରେ ମାଛରେ 'ଇ. ୟୁ. ଏସ୍.' ରୋଗ ହେବାର ସମ୍ଭାବନା ରହିଛି। ପ୍ରତିଷେଧକ ପଦକ୍ଷେପ ସ୍ୱରୂପ କୃଷକମାନଙ୍କୁ ଏକ ଏକର ପୋଖରୀ ଅଞ୍ଚଳରେ 40 ଲିଟର ପାଣି ସହିତ 400 ମିଲିଲିଟର ସିଫ୍ୟାକ୍ସ ଲଗାଇବାକୁ ପରାମର୍ଶ ଦିଆଯାଇଛି। ମାଛମାନଙ୍କୁ ସେମାନଙ୍କର ମୋଟ ଜୈବବସ୍ତୁର 2-3% ହାରରେ ପ୍ରତିଦିନ ତୈଳ କେକ୍ ବ୍ରାନ୍ ମିଶ୍ରଣ ସହିତ ଖୁଆଇବା ଉଚିତ୍ |"
         ]
      },
      "plant protection": {
         "advisory": [
            "ବାଇଗଣ, ଫୁଲକୋବି, ବନ୍ଧାକୋବି, ଲଙ୍କା ଏବଂ ଟମାଟୋ ପରି ଶୀତକାଳୀନ ପନିପରିବାରେ ପତ୍ର ଖାଉଥିବା କ୍ୟାଟର୍ପିଲର ଏବଂ ଫଳ ଛେଦକକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ ଲିଟର ପିଛା 0.5 ଗ୍ରାମ ଇମାମେକ୍ଟିନ୍ ବେନ୍ଜୋଏଟ୍ କିମ୍ବା 0.4 ମିଲି ସ୍ପିନୋସାଦ୍ ଲଗାନ୍ତୁ।"
         ]
      }
   },
   "date": "10-12-2024"
}