{
   "weather_details": {
      "2025-01-04": {
         "rainfall": 0,
         "t_max": 24,
         "t_min": 16,
         "rh_max": 70,
         "rh_min": 31,
         "wind_speed": 4,
         "wind_direction": 318,
         "cloud_cover": 2
      },
      "2025-01-05": {
         "rainfall": 0,
         "t_max": 24,
         "t_min": 15,
         "rh_max": 75,
         "rh_min": 35,
         "wind_speed": 4,
         "wind_direction": 315,
         "cloud_cover": 3
      },
      "2025-01-06": {
         "rainfall": 0,
         "t_max": 24,
         "t_min": 16,
         "rh_max": 81,
         "rh_min": 35,
         "wind_speed": 4,
         "wind_direction": 315,
         "cloud_cover": 2
      },
      "2025-01-07": {
         "rainfall": 0,
         "t_max": 25,
         "t_min": 17,
         "rh_max": 84,
         "rh_min": 36,
         "wind_speed": 4,
         "wind_direction": 299,
         "cloud_cover": 1
      },
      "2025-01-08": {
         "rainfall": 0,
         "t_max": 25,
         "t_min": 17,
         "rh_max": 86,
         "rh_min": 35,
         "wind_speed": 4,
         "wind_direction": 294,
         "cloud_cover": 2
      }
   },
   "names_of_crops": [
      "ଚାଉଳ",
      "ସବୁଜ ଚଣା",
      "ପିଜନ୍ ମଟର",
      "ଗାଈ।",
      "ଚିକ"
   ],
   "general_advisory": "ବର୍ଷା ପରେ ସ୍ୱଚ୍ଛ ଆକାଶ, ଶୁଖିଲା ପାଗ ଏଫିଡ୍, ଜ୍ଯାସିଡ୍, ଥ୍ରୀପ୍ ଏବଂ ହ୍ୱାଇଟ୍ଫ୍ଲାଇ ପରି ଶୋଷକ କୀଟକୁ ପସନ୍ଦ କରେ | ସଂକ୍ରମଣର ପ୍ରାରମ୍ଭିକ ପର୍ଯ୍ୟାୟରେ ଏହି କୀଟପତଙ୍ଗକୁ ପରିଚାଳନା କରିବା ପାଇଁ, 200 ଲିଟର ପାଣିରେ ମିଶ୍ରଣ କରି ନିମ୍ବ-ଆଧାରିତ କୀଟନାଶକ (ନିମ୍ବ ତେଲ) 1500 ପିପିଏମ @600-ମିଲି/ଏକର ସ୍ପ୍ରେ କରନ୍ତୁ। ଏହି ଶୋଷକ କୀଟକୁ ରାସାୟନିକ ଉପାୟରେ ପରିଚାଳନା କରିବା ପାଇଁ, ଥିୟାମେଥୋକ୍ସାମ୍ 25 ପ୍ରତିଶତ ଡବ୍ଲୁ. ଜି.) @ଏକର ପିଛା 40 ଗ୍ରାମ୍ କିମ୍ବା ଏସିଟାମିପ୍ରିଡ୍ 20 ପ୍ରତିଶତ ଏସ. ପି. @ଏକର ପିଛା 50 ଗ୍ରାମ୍ କିମ୍ବା ଟଲ୍ଫେନପାଇରାଡ୍ 15 ପ୍ରତିଶତ ଇ. ସି. @ଏକର ପିଛା 400 ମିଲି. ଏହାକୁ 200 ଲିଟର ପାଣିରେ ମିଶାଇ ସ୍ପ୍ରେ କରନ୍ତୁ।",
   "crops_data": {
      "rice": {
         "advisory": [
            "ଯେହେତୁ ପାଗ ସ୍ୱଚ୍ଛ ରହିବ ବୋଲି ଆଶା କରାଯାଉଛି, ତେଣୁ ପରିପକ୍ୱ ଚାଉଳ ଅମଳ କରାଯାଇପାରିବ। ଆର୍ଦ୍ରତା ପରିମାଣକୁ 14 ପ୍ରତିଶତକୁ ହ୍ରାସ କରିବା ପାଇଁ 2ରୁ 3 ଦିନ ପାଇଁ ଶୁଣ୍ଡ୍ରି କରନ୍ତୁ।"
         ]
      },
      "green gram": {
         "advisory": [
            "ଫସଲର ପ୍ରାରମ୍ଭିକ ପର୍ଯ୍ୟାୟରେ ଶ୍ୱେତ ମାଛି ସଂକ୍ରମଣକୁ ପରିଚାଳନା କରିବା ପାଇଁ, 200 ଲିଟର ପାଣିରେ ମିଶ୍ରଣ କରି ନିମ୍ବ-ଆଧାରିତ କୀଟନାଶକ 1500 ପିପିଏମ @600-ମିଲି/ଏକର ସ୍ପ୍ରେ କରନ୍ତୁ। ଯଦି ସଂକ୍ରମଣ ଗୁରୁତର ହୁଏ ତେବେ 200 ଲିଟର ପାଣିରେ ମିଶାଇ ପ୍ରତି ଏକରରେ 40 ଗ୍ରାମ୍ ଥାଇମେଥୋକ୍ସାମ୍ କିମ୍ବା 50 ଗ୍ରାମ୍ ଏସିଟାମିପ୍ରିଡ୍ ଭଳି ରାସାୟନିକ କୀଟନାଶକ ବ୍ୟବହାର କରନ୍ତୁ।"
         ]
      },
      "pigeon pea": {
         "advisory": [
            "ଅରହରର କେତେକ ସ୍ଥାନରେ ଦାଗଯୁକ୍ତ ଶୁଆ ଛେଦକ ଦେଖିବାକୁ ମିଳିଛି। ନିୟନ୍ତ୍ରଣ ପାଇଁ, ପକ୍ଷୀ ପର୍ଚ୍ @50 ହେକ୍ଟର ବ୍ୟବହାର କରନ୍ତୁ, ଆଜାଦିରାକ୍ଟିନ 0.03% WSP ବ୍ୟବହାର କରନ୍ତୁ କିମ୍ବା NSKE 5 ପ୍ରତିଶତ କିମ୍ବା ନିମ ତେଲ 2 ପ୍ରତିଶତ ବ୍ୟବହାର କରନ୍ତୁ।"
         ]
      },
      "cow": {
         "advisory": [
            "ପଶୁମାନଙ୍କୁ ନିୟମିତ ଭାବରେ ଲୁଣ ସହିତ ଏକ ଖଣିଜ ମିଶ୍ରଣ ଦିଆଯିବା ଉଚିତ ଏବଂ ପଶୁମାନଙ୍କ ଶକ୍ତି ଆବଶ୍ୟକତାକୁ ପୂରଣ କରିବା ପାଇଁ ଶୀତ ଋତୁରେ ଦୈନିକ ରାସନରେ ଗହମ ଶସ୍ୟ, ଗୁଡ଼ ଇତ୍ୟାଦି @10%-20% ଯୋଗାଇ ଦିଆଯାଇପାରେ |"
         ]
      },
      "chick": {
         "advisory": [
            "ରାତିର ତାପମାତ୍ରା ହ୍ରାସ ପାଉଥିବାରୁ ସେଡ଼୍କୁ ଗରମ ରଖନ୍ତୁ। କୋଠରୀକୁ ଗରମ କରିବା ପାଇଁ ଏକ ବଲ୍ବ ଦିଅନ୍ତୁ।"
         ]
      }
   },
   "date": "03-01-2025"
}