{
   "weather_details": {
      "2025-01-22": {
         "rainfall": 0,
         "t_max": 31,
         "t_min": 15,
         "rh_max": 69,
         "rh_min": 25,
         "wind_speed": 3,
         "wind_direction": 306,
         "cloud_cover": 2
      },
      "2025-01-23": {
         "rainfall": 0,
         "t_max": 31,
         "t_min": 15,
         "rh_max": 80,
         "rh_min": 27,
         "wind_speed": 3,
         "wind_direction": 286,
         "cloud_cover": 2
      },
      "2025-01-24": {
         "rainfall": 0,
         "t_max": 32,
         "t_min": 16,
         "rh_max": 81,
         "rh_min": 29,
         "wind_speed": 3,
         "wind_direction": 286,
         "cloud_cover": 2
      },
      "2025-01-25": {
         "rainfall": 0,
         "t_max": 31,
         "t_min": 16,
         "rh_max": 75,
         "rh_min": 26,
         "wind_speed": 2,
         "wind_direction": 288,
         "cloud_cover": 3
      },
      "2025-01-26": {
         "rainfall": 0,
         "t_max": 31,
         "t_min": 16,
         "rh_max": 61,
         "rh_min": 21,
         "wind_speed": 4,
         "wind_direction": 307,
         "cloud_cover": 3
      }
   },
   "names_of_crops": [
      "ଚାଉଳ",
      "ପିଜନ୍ ମଟର",
      "ସବୁଜ ଚଣା",
      "ଟମାଟୋ"
   ],
   "general_advisory": "ମୃତ୍ତିକାର ଆର୍ଦ୍ରତା ଏବଂ ପାଣିପାଗ ସ୍ଥିତି ଉପରେ ନିର୍ଭର କରି 7ରୁ 8 ଦିନ ବ୍ୟବଧାନରେ ଜଳସେଚନ କରାଯିବା ଉଚିତ। ପ୍ରଚଳିତ ନିମ୍ନ ତାପମାତ୍ରାକୁ ଦୃଷ୍ଟିରେ ରଖି, ସକାଳ ସମୟରେ ଠିଆ ହୋଇଥିବା ପନିପରିବା ଏବଂ ଫସଲକୁ ହାଲୁକା ଜଳସେଚନ ପ୍ରଦାନ କରନ୍ତୁ। ଆଗାମୀ 5 ଦିନ ପାଇଁ ରବି ଡାଲି ଏବଂ ତୈଳବୀଜ ବୁଣିବା ବନ୍ଦ କରନ୍ତୁ।",
   "crops_data": {
      "rice": {
         "advisory": [
            "ସ୍ୱଚ୍ଛ ପାଗ ଯୋଗୁଁ ବର୍ତ୍ତମାନ ସୁଦ୍ଧା ଅମଳ ନକଲେ ପରିପକ୍ୱ ଧାନ ଅମଳ ହେବ ବୋଲି ଆଶା କରାଯାଉଛି। ଯଦି ଗଚ୍ଛିତ ଧାନରେ ଗଚ୍ଛିତ ଶସ୍ୟ କୀଟପତଙ୍ଗର ସଂକ୍ରମଣ ଦେଖାଯାଏ, ତେବେ ଆଲୁମିନିୟମ୍ ଫସଫାଇଡ୍ (ବାସ ଘରେ ବ୍ୟବହାର କରନ୍ତୁ ନାହିଁ) ଟାବଲେଟ୍ @3 ଟାବଲେଟ୍/ଟନ୍ ଶସ୍ୟ (ମୋଟ 9 ଗ୍ରାମ୍ ଟାବଲେଟ୍) କୁ ମୋଟାମୋଟି ବାୟୁ ଟାଇଟ କଣ୍ଟେନରରେ ବ୍ୟବହାର କରି କିମ୍ବା ମୋଟା ତିରପାଲ ଦ୍ୱାରା ଆଚ୍ଛାଦନ କରି କୌଣସି ବ୍ୟବଧାନ ନ ରଖି ଧୂମାୟିତ କରନ୍ତୁ | ଟାବଲେଟ୍ଗୁଡ଼ିକୁ ଷ୍ଟାକ୍ରେ ରଖିବା ପୂର୍ବରୁ ସେଗୁଡ଼ିକୁ ସୂତା ପାଉଚରେ ବାନ୍ଧି ରଖିବା ଉଚିତ। ଗ୍ୟାସ୍ ଲିକ୍ ରୋକିବା ପାଇଁ ପ୍ଲାଷ୍ଟିକ୍ କଭରର ସମସ୍ତ କୋଣକୁ 6 ଇଞ୍ଚ ମୋଟା ସ୍ତର କାଦୁଅ/ଆଡ଼େସିଭ୍ ଟେପ୍ ସହିତ ପ୍ଲାଷ୍ଟର କରାଯିବା ଉଚିତ୍ |"
         ]
      },
      "pigeon pea": {
         "advisory": [
            "ଯେତେବେଳେ ଚିଙ୍ଗୁଡ଼ିର 70-80% ବାଦାମୀ ହୋଇଯାଏ, ସେତେବେଳେ ରେଡ୍ ଗ୍ରାମ୍ ଫସଲ ଅମଳ କରନ୍ତୁ। ଅତ୍ୟଧିକ ପରିପକ୍ୱତା ମଞ୍ଜି ଭାଙ୍ଗିବାର କାରଣ ହୋଇପାରେ ଯାହା ଫଳସ୍ୱରୂପ କମ୍ ଉତ୍ପାଦନ ହୋଇଥାଏ। ଖୁଣ୍ଟ ବ୍ୟବହାର କରି ହାତ ଦ୍ୱାରା ଅମଳ କରାଯିବା ଉଚିତ୍। ଅମଳ ହୋଇଥିବା ଗଛଗୁଡ଼ିକୁ ଋତୁ ଅନୁସାରେ 3ରୁ 6 ଦିନ ପର୍ଯ୍ୟନ୍ତ ସୂର୍ଯ୍ୟାଲୋକରେ ଶୁଖାଇବା ପାଇଁ ମଳତ୍ୟାଗ ସ୍ଥାନରେ ରଖିବା ଉଚିତ।"
         ]
      },
      "green gram": {
         "advisory": [
            "ସବୁଜ ଗହମ/କଳା ଗହମରେ, ପତ୍ର ଖାଉଥିବା କ୍ୟାଟର୍ପିଲାର୍ ଏବଂ କଳା ମୁଣ୍ଡ ଥିବା କ୍ୟାଟର୍ପିଲାର୍ ସଂକ୍ରମଣ ହେବାର ସମ୍ଭାବନା ଅଛି | ପରିଚାଳନା ପାଇଁ ମଧ୍ୟାହ୍ନ ସମୟରେ ଏକର ପିଛା ଲିଟର ପିଛା 2 ମିଲି ପ୍ରୋଫେନୋଫସ୍ 50 ପ୍ରତିଶତ ଇସି କିମ୍ବା 2 ମିଲି କ୍ୱିନାଲଫସ୍ 25 ପ୍ରତିଶତ ଇସି କିମ୍ବା 1 ମିଲି ଡାଇକ୍ଲୋରୋଭସ୍ 76 ପ୍ରତିଶତ ଇସି ମିଶ୍ରଣ ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "tomato": {
         "advisory": [
            "ପ୍ରତିରୋପଣ କରାଯାଇଥିବା ଚାରା 6ରୁ 8 ସପ୍ତାହର ପର୍ଯ୍ୟାୟରେ ରହିଥାଏ। ଛଅ ସପ୍ତାହ ପର୍ଯ୍ୟାୟରେ ସମ୍ପୂର୍ଣ୍ଣ ହଏଙ୍ଗ୍, ଏବଂ ନିରାମୟ ଏବଂ 27 କେଜି ୟୁରିଆ ଲଗାନ୍ତୁ | ସାର ପ୍ରୟୋଗ ପରେ ଫସଲକୁ ଜଳସେଚନ କରନ୍ତୁ। ଯଦି ପତ୍ର କର୍ଲ ଜୀବାଣୁ ଦ୍ୱାରା ସଂକ୍ରମିତ ହୁଅନ୍ତି, ଇମିଦାକଲୋପ୍ରିଡ 17.8% ଏସଏଲ @0.5 ମିଲି କିମ୍ବା ଡାଇମେଥୋଏଟ 30 ପ୍ରତିଶତ ଇସି @1 ମିଲି/ଲିଟର 10 ପାଣି ପ୍ରତିରୋପଣର 15,25,45 ଦିନ ପରେ ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      }
   },
   "date": "21-01-2025"
}