{
   "weather_details": {
      "2024-07-10": {
         "rainfall": 4,
         "t_max": 31,
         "t_min": 26,
         "rh_max": 83,
         "rh_min": 52,
         "wind_speed": 12,
         "wind_direction": 180,
         "cloud_cover": 8
      },
      "2024-07-11": {
         "rainfall": 3,
         "t_max": 32,
         "t_min": 26,
         "rh_max": 80,
         "rh_min": 53,
         "wind_speed": 13,
         "wind_direction": 202,
         "cloud_cover": 8
      },
      "2024-07-12": {
         "rainfall": 4,
         "t_max": 33,
         "t_min": 27,
         "rh_max": 79,
         "rh_min": 50,
         "wind_speed": 12,
         "wind_direction": 212,
         "cloud_cover": 8
      },
      "2024-07-13": {
         "rainfall": 5,
         "t_max": 33,
         "t_min": 27,
         "rh_max": 75,
         "rh_min": 51,
         "wind_speed": 11,
         "wind_direction": 214,
         "cloud_cover": 8
      },
      "2024-07-14": {
         "rainfall": 10,
         "t_max": 32,
         "t_min": 26,
         "rh_max": 80,
         "rh_min": 53,
         "wind_speed": 10,
         "wind_direction": 259,
         "cloud_cover": 8
      }
   },
   "names_of_crops": [
      "ଚାଉଳ",
      "ଫିଙ୍ଗର ମିଲେଟ୍",
      "ଛେଳି।",
      "ସାଧାରଣ କାର୍ପ"
   ],
   "general_advisory": "ଜମି ପ୍ରସ୍ତୁତିର ଶେଷ ପର୍ଯ୍ଯ଼ାଯ଼ରେ ଭଲ ଭାବେ ସଙ୍କୁଚିତ ଫାର୍ମ ଯ଼ାର୍ଡର ସାର କିମ୍ବା ଗାଈ ଗୋବରକୁ ଏକର ପିଛା 8 କ୍ୱିଣ୍ଟାଲ ଲେଖାଏଁ ସିଧାସଳଖ ବିହନ ବୁଣାଯାଇଥିବା ଚାଉଳରେ ମିଶାନ୍ତୁ। ପର୍ଯ୍ଯ଼ାପ୍ତ ବର୍ଷା ଆଶା କରାଯାଉଥିବା ହେତୁ କୃଷକମାନେ ଖରିଫ ପନିପରିବା ବୁଣିବା ଏବଂ ନର୍ସରୀ ପ୍ରସ୍ତୁତି ପାଇଁ ଯାଇପାରିବେ।",
   "crops_data": {
      "rice": {
         "advisory": [
            "ସୁନିଶ୍ଚିତ ଜଳସେଚିତ ଅଞ୍ଚଳରେ ଭଲ ଜଳ ନିଷ୍କାସନ ସୁବିଧା ସହିତ ଜଳସେଚନ ଜଳ ଉତ୍ସ ନିକଟରେ ଓଦା ଶଯ୍ଯ଼ା ନର୍ସରୀ ପାଇଁ ଜମି ଚଯ଼ନ କରନ୍ତୁ | ଗ୍ରାମ ସ୍ତରରେ ଗୋଷ୍ଠୀ ନର୍ସରୀ ଆଭିମୁଖ୍ଯ଼ ଅନୁସରଣ କରିବାକୁ ପରାମର୍ଶ ଦିଆଯାଇଛି। ନର୍ସରୀ ଅଞ୍ଚଳକୁ 1.5-metre-long, 10 ସେ. ମି. ଉଚ୍ଚତା ଏବଂ ସୁବିଧାଜନକ ଲମ୍ବ ବିଶିଷ୍ଟ ଛୋଟ ଛୋଟ ପ୍ଲଟରେ ବିଭକ୍ତ କରନ୍ତୁ। ଜଳସେଚନ/ଜଳ ନିଷ୍କାସନ ପାଇଁ ଶଯ୍ଯ଼ା ସହିତ 30 ସେ. ମି. ଓସାରର ଜଳସେଚନ ଚ୍ଯ଼ାନେଲ ନିର୍ମାଣ କରାଯିବା ଉଚିତ। ପ୍ରତ୍ଯ଼େକ ଧାଡ଼ି କିମ୍ବା ସିଧାସଳଖ ପ୍ରସାରଣ ମଧ୍ଯ଼ରେ 5 ସେ. ମି. ବ୍ଯ଼ବଧାନ ସହିତ ଧାଡ଼ି ବୁଣିବା ଦ୍ୱାରା ଅଙ୍କୁରିତ ବୀଜଗୁଡିକ ବୀଜ ଶଯ୍ଯ଼ାର @40-50 ଗ୍ରାମ୍/ମି2 ଅଞ୍ଚଳରେ ରୋପଣ କରାଯିବା ଉଚିତ ଏବଂ ମଞ୍ଜି ଉପରେ ଶୁଖିଲା କମ୍ପୋଷ୍ଟ ପକାଇବା ଉଚିତ।"
         ]
      },
      "finger millet": {
         "advisory": [
            "ଅର୍ଜୁନ, କଲୁଆ, ଭୈରବୀ, ଚିଲିକା ଭଳି ଉନ୍ନତ ମାନର ମଞ୍ଜି ବ୍ଯ଼ବହାର କରନ୍ତୁ ଏବଂ ଏସ୍. ଏମ୍. ଆଇ. ପଦ୍ଧତିରେ 1.5 କି. ଗ୍ରା., ଲାଇନ ବୁଣିବା ପାଇଁ 2.5 କି. ଗ୍ରା. ଏବଂ ପ୍ରସାରଣ ପାଇଁ ଏସି. ପ୍ରତି 4 କି. ଗ୍ରା. ମଞ୍ଜି ବ୍ଯ଼ବହାର କରନ୍ତୁ। ପ୍ରତି ବର୍ଗ ମିଟର ନର୍ସରୀରେ 10 ଗ୍ରାମ୍ ଏନ୍ ଏବଂ 10 ଗ୍ରାମ୍ ପି ଲଗାନ୍ତୁ। ସିଧାସଳଖ ବୁଣିବା ପାଇଁ 4 ଟି <ଆଇ. ଡି. 1>, ଅପରାହ୍ନ 4ଟା 10 ମିନିଟ୍ରେ ଜିଲ୍ଲା ପରାମର୍ଶ ଆବେଦନ କରନ୍ତୁ।"
         ]
      },
      "goat": {
         "advisory": [
            "ଚଟାଣ ଉପରେ ବାଲି ବ୍ଯ଼ବହାର କରି ଆମେ ଚଟାଣକୁ ଶୁଖିଲା ରଖିପାରିବା ଯାହା ଦ୍ୱାରା ପଶୁମାନଙ୍କୁ ବିଭିନ୍ନ ରୋଗରୁ ମୁକ୍ତ ରଖାଯାଇପାରିବ। ଏହି ଛପର ବିଶେଷତ୍ୱ ହେଉଛି ଏହାର ଚଟାଣ ଇଟା ଏବଂ ସିମେଣ୍ଟରେ ତିଆରି ଏବଂ ନଦୀର ବାଲି ଏହା ଉପରେ 4ରୁ 6 ଇଞ୍ଚ ମୋଟା ହୋଇ ବ୍ଯ଼ାପ୍ତ। ବାଲି ପରିସ୍ରାକୁ ଭିଜାଇ ରଖେ, ଯାହାଦ୍ୱାରା ପଶୁମାନେ ତା 'ଉପରେ ଆରାମରେ ଶୋଇପାରିବେ। ବାଲିର ଚଟାଣ ଉପରେ ଥିବା ମଳ ପଦାର୍ଥକୁ ସଫା କରିବା ମଧ୍ଯ଼ ସହଜ। ବାଲିକୁ ଶୁଖିଲା ରଖିବା ପାଇଁ ଏହାକୁ 15-20 ଦିନ ବ୍ଯ଼ବଧାନରେ ଓଲଟପାଲଟ କରି ଦିଆଯାଏ। ଶିଶୁଙ୍କ ପାଇଁ ଚଟାଣ ସ୍ଥାନର ଆବଶ୍ଯ଼କତା 0.5, ବଯ଼ସ୍କଙ୍କ ପାଇଁ 1.2, ହରିଣ ପାଇଁ 2 ବର୍ଗ ମିଟର ଏବଂ ଗର୍ଭବତୀ ମହିଳାଙ୍କ ପାଇଁ 2 ବର୍ଗ ମିଟର ଚଟାଣ ସ୍ଥାନ ଆବଶ୍ଯ଼କ, ଯାହା ପ୍ରତ୍ଯ଼େକ ପ୍ରକାରର ଘର ପାଇଁ ଉପଯୁକ୍ତ।"
         ]
      },
      "common carp": {
         "advisory": [
            "ଦ୍ରୁତ ଗତିରେ ବଢ଼ୁଥିବା ରୋହୁ, କାଟଲା ଏବଂ ମ୍ରିଗଲ ଭଳି କାର୍ପକୁ 4ଃ3ଃ3 ଅନୁପାତରେ ମହଜୁଦ ରଖିବା ଉଚିତ, ଯାହାଦ୍ୱାରା ଏହାର ଲାଭ ବଢ଼ିପାରିବ। ସାଧାରଣତଃ, ହେକ୍ଟର ପିଛା 5,000 ଫିଙ୍ଗରଲିଙ୍ଗର ଘନତ୍ୱ ଏକ ମାନକ ଷ୍ଟକିଂ ଭାବରେ ରଖାଯାଏ | ଚିନାବାଦାମ ତେଲ କେକ୍ ଏବଂ ଚାଉଳ ଚୋପା ଷ୍ଟକିଂ ସାମଗ୍ରୀର ମୋଟ ବାଯ଼ୋମାସର 5 ପ୍ରତିଶତ ଅନୁପାତରେ ସମାନ ଅନୁପାତରେ ଦିଆଯାଏ | ପୁଷ୍କରିଣୀର ଗୁଣବତ୍ତା ବୃଦ୍ଧି ପାଇଁ ଗୋବର, ଯ଼ୁରିଆ ଏବଂ ସୁପର ଫସଫେଟ୍ ପ୍ରଯ଼ୋଗ କରାଯିବା ଉଚିତ। 8-10 ମାସରେ, ମାଛମାନେ ସେମାନଙ୍କର ବିପଣନ ଯୋଗ୍ଯ଼ ଆକାରରେ ପହଞ୍ଚନ୍ତି |"
         ]
      }
   },
   "date": "09-07-2024"
}