{
   "weather_details": {
      "2024-06-12": {
         "rainfall": 0,
         "t_max": 35,
         "t_min": 28,
         "rh_max": 74,
         "rh_min": 29,
         "wind_speed": 15,
         "wind_direction": 191,
         "cloud_cover": 6
      },
      "2024-06-13": {
         "rainfall": 0,
         "t_max": 35,
         "t_min": 28,
         "rh_max": 72,
         "rh_min": 34,
         "wind_speed": 18,
         "wind_direction": 204,
         "cloud_cover": 5
      },
      "2024-06-14": {
         "rainfall": 0,
         "t_max": 35,
         "t_min": 27,
         "rh_max": 65,
         "rh_min": 32,
         "wind_speed": 20,
         "wind_direction": 212,
         "cloud_cover": 6
      },
      "2024-06-15": {
         "rainfall": 0,
         "t_max": 35,
         "t_min": 27,
         "rh_max": 49,
         "rh_min": 28,
         "wind_speed": 18,
         "wind_direction": 236,
         "cloud_cover": 8
      },
      "2024-06-16": {
         "rainfall": 5,
         "t_max": 36,
         "t_min": 26,
         "rh_max": 58,
         "rh_min": 30,
         "wind_speed": 18,
         "wind_direction": 251,
         "cloud_cover": 7
      }
   },
   "names_of_crops": [
      "ଚାଉଳ",
      "ତିଲ।",
      "ଉଦ୍ଯ଼ାନ କୃଷି",
      "କୁକୁଡ଼ା ମାଂସ",
      "ଅନ୍ଯ଼ଗୁଡ଼ିକ (ମାଟି/ଜମି ପ୍ରସ୍ତୁତି)"
   ],
   "general_advisory": "ଆଗାମୀ ପାଞ୍ଚ ଦିନ ମଧ୍ଯ଼ରେ ହାଲୁକା ବର୍ଷା ହେବାର ସମ୍ଭାବନା ରହିଛି, ଯାହାଦ୍ୱାରା କୃଷକମାନେ ଠିଆ ହୋଇଥିବା ଫସଲରେ ଜଳସେଚନ ଜାରି ରଖିପାରିବେ। ଖରିଫ ଫସଲ ଯୋଜନା କରିବା ପୂର୍ବରୁ କୃଷକମାନେ ମୃତ୍ତିକା ପରୀକ୍ଷା କରିପାରିବେ। କ୍ଷେତର 8 ରୁ 10 ଟି ଭିନ୍ନ ଭିନ୍ନ ସ୍ଥାନର ମୃତ୍ତିକା ଗୁଡ଼ାଲ ଦ୍ୱାରା ଏକ ଭି ଆକୃତି ଭର୍ତ୍ତି କରି ଏବଂ ମୃତ୍ତିକାକୁ ମିଶ୍ରଣ କରି ନିଆଯାଇପାରେ | ସଫା କରିବା ଏବଂ ଛାଣିବା ପରେ ମୃତ୍ତିକାକୁ 4 ଭାଗରେ ବିଭକ୍ତ କରନ୍ତୁ ଏବଂ ବିପରୀତ 2ଟି ଭାଗ ନିଅନ୍ତୁ ଏବଂ ସେଗୁଡ଼ିକୁ ପଲିଥିନ୍ ରେ ରଖନ୍ତୁ ଏବଂ ପୂର୍ବରୁ ନିଆଯାଇଥିବା ପ୍ଲଟ୍ ନମ୍ବର ଏବଂ ଫସଲ ଲେଖନ୍ତୁ | ରିପୋର୍ଟ ପାଇଁ ଏହାକୁ ମୃତ୍ତିକା ପରୀକ୍ଷଣ ପରୀକ୍ଷାଗାରକୁ ପଠାନ୍ତୁ।",
   "crops_data": {
      "rice": {
         "advisory": [
            "ରୋପଣର 6-8 ସପ୍ତାହ ପୂର୍ବରୁ ମଧ୍ଯ଼ମ ଏବଂ ନିମ୍ନ ଭୂମି ସ୍ଥିତିରେ ସବୁଜ ସାର ଫସଲ ବୁଣାଯାଏ। ଏକର ପିଛା 10 କିଲୋଗ୍ରାମ ମଞ୍ଜି ବ୍ଯ଼ବହାର କରନ୍ତୁ। ଅନ୍ଯ଼ଥା ଧାନ ସହିତ ମିଶ୍ରିତ ରୋପଣ କ୍ଷେତ୍ରରେ ଏକର ପିଛା 6 କି. ଗ୍ରା.। ବୁଣିବା ସମଯ଼କୁ ଏପରି ଭାବରେ ସମାଯୋଜିତ କରାଯିବା ଉଚିତ ଯେ ଫସଲ ରୋପଣର ମାତ୍ର 7 ଦିନ ପୂର୍ବରୁ 5-ସପ୍ତାହ ପର୍ଯ୍ଯ଼ାଯ଼ରେ ପହଞ୍ଚିବ।",
            "ଧାନର ସମସ୍ତ ସୁପାରିସ କରାଯାଇଥିବା ଫସଫରସ୍ ମାତ୍ରା (100 କିଲୋଗ୍ରାମ ଏସ୍. ଏସ୍. ପି.) ବୁଣିବା ସମଯ଼ରେ କ୍ଷେତରେ ଲଗାନ୍ତୁ।"
         ]
      },
      "sesame": {
         "advisory": [
            "ତିଲ ଚାଷୀମାନଙ୍କ ମଧ୍ଯ଼ରେ ପୋଡର ବୋରର ସଂକ୍ରମଣକୁ ପରିଚାଳନା କରିବା ପାଇଁ ହେକ୍ଟର ପିଛା ସ୍ପିନୋସାଡ @165 ମିଲି ସିଞ୍ଚନ କରିପାରିବେ।"
         ]
      },
      "horticulture": {
         "advisory": [
            "ଆମ୍ବ, କଦଳୀ ଏବଂ ପଣସ ଭଳି ପରିପକ୍ୱ ଫଳଗୁଡ଼ିକୁ ଅମଳ କରନ୍ତୁ ଏବଂ ଗୁଣବତ୍ତା ଖରାପ ହେବା ପୂର୍ବରୁ ସେଗୁଡ଼ିକୁ ବିକ୍ରି କରନ୍ତୁ।",
            "କୁକୁଡ଼ା ପନିପରିବାରେ ଡାଉନି ମିଲ୍ଡିଉ ପାଇଁ ପାଗ ଅନୁକୂଳ | କାକୁଡ଼ିରେ ଏହି ରୋଗକୁ ନିଯ଼ନ୍ତ୍ରଣ କରିବା ପାଇଁ କପର୍ ହାଇଡ୍ରୋକ୍ସାଇଡ୍ 77 ପ୍ରତିଶତ ଡବ୍ଲ୍ଯ଼ୁ. ପି. @3-ଗ୍ରାମ୍/ଲିଟର କିମ୍ବା କାର୍ବେନଡାଜିମ୍ 12 ପ୍ରତିଶତ + ମାନକୋଜେବ୍ 63 ପ୍ରତିଶତ ଡବ୍ଲ୍ଯ଼ୁ. ପି. @2-ଗ୍ରାମ୍/ଲିଟର ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "poultry": {
         "advisory": [
            "କୁକୁଡ଼ା ଖାଦ୍ଯ଼ କିମ୍ବା ପାଣିରେ ଭିଟାମିନ୍ ସି ମିଶାନ୍ତୁ କାରଣ ଏହା ଛୁଆମାନଙ୍କଠାରେ ଡିହାଇଡ୍ରେସନ୍ ହ୍ରାସ କରିଥାଏ।"
         ]
      },
      "others (soil / land preparation)": {
         "advisory": [
            "ଆଗାମୀ ଖରିଫ ଫସଲରେ ଆଗାଛା, କୀଟପତଙ୍ଗ ଏବଂ ରୋଗ ହ୍ରାସ କରିବା ପାଇଁ ଗ୍ରୀଷ୍ମ ଚାଷ ଅଭ୍ଯ଼ାସ କରାଯିବା ଉଚିତ।"
         ]
      }
   },
   "date": "11-06-2024"
}