{
   "weather_details": {
      "28/12/2024": {
         "rainfall": 0,
         "t_max": 27,
         "t_min": 18,
         "rh_max": 76,
         "rh_min": 45,
         "wind_speed": 10,
         "wind_direction": 12,
         "cloud_cover": 1
      },
      "31/12/2024": {
         "rainfall": 0,
         "t_max": 28,
         "t_min": 14,
         "rh_max": 77,
         "rh_min": 43,
         "wind_speed": 9,
         "wind_direction": 7,
         "cloud_cover": 1
      }
   },
   "names_of_crops": [
      "ଧାନ।",
      "କଳା ଗ୍ରାମ",
      "ଗ୍ରୀନଗ୍ରାମ",
      "ଟମାଟୋ",
      "ଫୁଲକୋବି",
      "ଲଙ୍କା",
      "ମାରିଗୋଲ୍ଡ"
   ],
   "general_advisory": "ଧାନ ପାଇଁ ଆର୍ଦ୍ର ନର୍ସରୀ ମଞ୍ଜି ପ୍ରସ୍ତୁତ କରନ୍ତୁ। ବର୍ଷା ଜଳ ବ୍ୟବହାର କରି ନର୍ସରୀ ଶଯ୍ୟାଗୁଡ଼ିକ 2 ରୁ 3 ଥର ଜଳମଗ୍ନ ହୋଇପାରେ ଏବଂ ତା 'ପରେ ପ୍ଲାଙ୍କିଙ୍ଗ୍ ହୋଇପାରେ | ଶେଷ ପୁଡଲିଂ ସମୟରେ 200 କିଲୋଗ୍ରାମ ଏଫ୍. ଆଇ. ଏମ୍., 4 କିଲୋଗ୍ରାମ ଡି. ଏ. ପି., 2.5 କିଲୋଗ୍ରାମ ଏମ୍. ଓ. ପି. ଏବଂ 1 କିଲୋଗ୍ରାମ ଜିଙ୍କ୍ ସଲଫେଟ୍ ଲଗାନ୍ତୁ। ନର୍ସରୀ ଅଞ୍ଚଳକୁ ସୁବିଧାଜନକ ଦୈର୍ଘ୍ୟର ଛୋଟ ଛୋଟ ପ୍ଲଟରେ ବିଭକ୍ତ କରନ୍ତୁ। ଜଳସେଚନ/ଜଳ ନିଷ୍କାସନ ଉଦ୍ଦେଶ୍ୟରେ ଶଯ୍ୟା ସହିତ 30 ସେ. ମି. ପ୍ରସ୍ଥର ଜଳସେଚନ ଚ୍ୟାନେଲ ନିର୍ମାଣ କରାଯିବା ଉଚିତ। ପ୍ରତ୍ୟେକ ଧାଡ଼ି ମଧ୍ୟରେ 5 ସେ. ମି. ବ୍ୟବଧାନ ସହିତ ଧାଡ଼ି ବୁଣିବା ଦ୍ୱାରା ଅଙ୍କୁରିତ ମଞ୍ଜି ବୀଜ ଶଯ୍ୟାର @40-50 ଗ୍ରାମ୍/ମି2 ଅଞ୍ଚଳରେ ବୁଣାଯିବା ଉଚିତ। ନର୍ସରୀରେ ବୁଣିବା ପୂର୍ବରୁ ଧାନ ମଞ୍ଜି ଗୁଡ଼ିକୁ କାର୍ବେନଡାଜିମ୍ 50 ପ୍ରତିଶତ ଡବ୍ଲୁ. ପି. @1.5 ଗ୍ରାମ/1 କିଲୋ ମଞ୍ଜି କିମ୍ବା କାର୍ବୋକ୍ସିନ୍ 37.5% + ଥିରମ୍ 37.5% @3 ଗ୍ରାମ/1 କିଲୋ ମଞ୍ଜି ବ୍ୟବହାର କରନ୍ତୁ। ଭେକ୍ଟର ଧଳା ମାଛି ଦ୍ୱାରା ସୃଷ୍ଟ ହଳଦିଆ ମୋଜାଇକ ଜୀବାଣୁ ସଂକ୍ରମଣ ପାଇଁ ବର୍ତ୍ତମାନର ପାଣିପାଗ ସ୍ଥିତି ଅନୁକୂଳ | ଏହାକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ, ଏକର ପିଛା 400 ମି. ଲି. ହାରରେ ଟ୍ରାଇଆଜୋଫସ୍ ସିଞ୍ଚନ କରନ୍ତୁ। ଉଚ୍ଚ ଆର୍ଦ୍ର ଅବସ୍ଥାକୁ ଦୃଷ୍ଟିରେ ରଖି ଏହି ପର୍ଯ୍ୟାୟରେ ଶୁଷ୍କତା ଘଟିପାରେ। ମାନକୋଜେବକୁ 75 ପ୍ରତିଶତ ଡବ୍ଲ୍ୟୁ. ପି. ସ୍ପ୍ରେ କରନ୍ତୁ। କୀଟପତଙ୍ଗ ସଂଖ୍ୟା ଉପରେ ନଜର ରଖିବା ପାଇଁ ଏକର ପିଛା 8ନସ୍ ସଂଖ୍ୟାରେ ଫେରୋମୋନ୍ ଫାନ୍ଦ ଲଗାନ୍ତୁ। କୋଇଲା ଫସଲରେ ଆଲ୍ଟରନେରିଆ ଲିଫ୍ ସ୍ପଟ୍ ରୋଗକୁ ପରିଚାଳନା କରିବା ପାଇଁ 200 ଲିଟର ପାଣିରେ ମିଶାଇ ଏକର ପିଛା 600 ଗ୍ରାମ ପିଛା ମାନକୋଜେବ୍ 75 ପ୍ରତିଶତ ଡବ୍ଲ୍ୟୁ. ପି. କିମ୍ବା କାର୍ବେଣ୍ଡାଜିମ୍ 12 ପ୍ରତିଶତ + ମାନକୋଜେବ୍ 63 ପ୍ରତିଶତ ଡବ୍ଲ୍ୟୁ. ପି. 400 ଗ୍ରାମ ପିଛା ସ୍ପ୍ରେ କରନ୍ତୁ। କ୍ଷେତରୁ ଶୁଖିଲା ଗଛଗୁଡ଼ିକୁ ବାହାର କରି କ୍ଷେତରୁ ଦୂରକୁ ନଷ୍ଟ କରିଦିଅନ୍ତୁ। କ୍ଷେତରେ ଏଫିଡ୍ ଏବଂ ଜ୍ଯାସିଡ୍ ସଂକ୍ରମଣ ଦେଖାଯାଇପାରେ | ଏହାକୁ ପରିଚାଳନା କରିବା ପାଇଁ ଇମିଡାକ୍ଲୋପ୍ରିଡ୍ 17.8% ଏସଏଲ @1 ମିଲି/ଏଲଟି ସ୍ପ୍ରେ କରନ୍ତୁ। ପତ୍ର ଖାଉଥିବା କ୍ୟାଟର୍ପିଲାରକୁ ପରିଚାଳନା କରିବା ପାଇଁ ଜୈବିକ ଦୃଷ୍ଟିରୁ ଫେରୋମୋନ୍ ଟ୍ରାପ୍ ସ୍ପୋଡୋଲ୍ୟୁର୍ @6/ଏକର ବ୍ୟବହାର କରନ୍ତୁ କିମ୍ବା ଲାଇଟ୍ ଟ୍ରାପ୍ @5 ନମ୍ବର ସ୍ଥାପନ କରନ୍ତୁ। ବାସିଲସ୍ ଥୁରିନଜିଏନ୍ସିସ୍ 500 ଗ୍ରାମ୍/ଏକର କିମ୍ବା ବିଉଭେରିଆ ବାସିଆନା 1 କିଲୋଗ୍ରାମ୍/ଏକରରେ ଲଗାନ୍ତୁ। ରାସାୟନିକ ନିୟନ୍ତ୍ରଣ ପାଇଁ, କ୍ଲୋରପାଇରିଫୋସ୍ 50 ପ୍ରତିଶତ + ସାଇପର୍ମେଥ୍ରିନ୍ 5 ପ୍ରତିଶତ ଇସି @400 ମିଲି/ଏକର କିମ୍ବା ଲାମ୍ବଡା ସାଇହାଲୋଥ୍ରିନ୍ 5 ପ୍ରତିଶତ ଇସି @300 ମିଲି/ଏକରକୁ ମଧ୍ୟାହ୍ନ ସମୟରେ ମିଶ୍ରଣ କରି ସ୍ପ୍ରେ କରନ୍ତୁ। ଉନ୍ନତ କୃଷି ଲାଭ ପାଇଁ, 'ଓୟୁଏଟି କଳିଙ୍ଗ' ଉତ୍ପାଦ (ଚାରା, ଚାରା ଏବଂ କ୍ୟୁ. ପି. ଏମ୍., ଟିସ୍ୟୁ କଲ୍ଚର ପ୍ଲାଣ୍ଟ, ଫଳ ଏବଂ ପନିପରିବା, ମୂଲ୍ୟଯୁକ୍ତ ଉତ୍ପାଦ, ଆଙ୍ଗୁଳି/ବାର୍ଷିକ, କୁକୁଡ଼ା ଛୁଆ, ପ୍ରଜାତି, ଛତୁ ଏବଂ ସ୍ପାନ, ଜୈବ-ସାର, ଜୈବ-କୀଟନାଶକ, ବର୍ମି ଏବଂ ଓଡ଼ିଶାର ପାଣିପାଗ ସମ୍ବନ୍ଧୀୟ ପରାମର୍ଶ ଏବେ 'ମେଘଦୂତ' ମୋବାଇଲ ଆପରେ ଇଂରାଜୀ ଏବଂ ଓଡ଼ିଆ ଭାଷାରେ ଉପଲବ୍ଧ।",
   "crops_data": {
      "paddy": {
         "advisory": [
            "ବୁଣିବା ପୂର୍ବରୁ ନର୍ସରୀ ପରିଚାଳନା-ଧାନ ପାଇଁ ଓଦା ନର୍ସରୀ ମଞ୍ଜି ପ୍ରସ୍ତୁତ କରନ୍ତୁ। ବର୍ଷା ଜଳ ବ୍ୟବହାର କରି ନର୍ସରୀ ଶଯ୍ୟାଗୁଡ଼ିକ 2 ରୁ 3 ଥର କାଦୁଅ ହୋଇ ଯାଇପାରେ ଏବଂ ତା 'ପରେ ପ୍ଲାଙ୍କିଙ୍ଗ୍ ହୋଇପାରେ | ଶେଷ ପୁଡଲିଂ ସମୟରେ 200 କିଲୋଗ୍ରାମ ଏଫ୍. ଆଇ. ଏମ୍., 4 କିଲୋଗ୍ରାମ ଡି. ଏ. ପି., 2.5 କିଲୋଗ୍ରାମ ଏମ୍. ଓ. ପି. ଏବଂ 1 କିଲୋଗ୍ରାମ ଜିଙ୍କ୍ ସଲଫେଟ୍ ଲଗାନ୍ତୁ। ନର୍ସରୀ ଅଞ୍ଚଳକୁ ସୁବିଧାଜନକ ଦୈର୍ଘ୍ୟର ଛୋଟ ଛୋଟ ପ୍ଲଟରେ ବିଭକ୍ତ କରନ୍ତୁ। ଜଳସେଚନ/ଜଳ ନିଷ୍କାସନ ଉଦ୍ଦେଶ୍ୟରେ ଶଯ୍ୟା ସହିତ 30 ସେ. ମି. ଓସାରର ଜଳସେଚନ ଚ୍ୟାନେଲ ନିର୍ମାଣ କରାଯିବା ଉଚିତ। ପ୍ରତ୍ୟେକ ଧାଡ଼ି ମଧ୍ୟରେ 5 ସେ. ମି. ବ୍ୟବଧାନ ସହିତ ଧାଡ଼ି ବୁଣିବା ଦ୍ୱାରା ଅଙ୍କୁରିତ ମଞ୍ଜି ବୀଜ ଶଯ୍ୟାର @40-50 ଗ୍ରାମ୍/ମି2 ଅଞ୍ଚଳରେ ବୁଣାଯିବା ଉଚିତ। ବୀଜ ଉପଚାରଃ ନର୍ସରୀରେ ବୁଣିବା ପୂର୍ବରୁ ଧାନ ମଞ୍ଜି ଗୁଡ଼ିକୁ କାର୍ବେନଡାଜିମ୍ 50 ପ୍ରତିଶତ ଡବ୍ଲୁ. ପି. @1.5 ଗ୍ରାମ/1 କେଜି ମଞ୍ଜି ଦେଇ ଉପଚାର କରନ୍ତୁ। ନର୍ସରୀ ପରିଚାଳନା ରୋପଣ ପରେ-ଧାନ ଫସଲ ରୋପଣ ସମୟରେ ପର୍ଯ୍ୟାପ୍ତ ପରିମାଣର ପାଣି ଆବଶ୍ୟକ ହୋଇଥାଏ। କ୍ଷେତ୍ରକୁ ଇଣ୍ଟ୍ରେ ଭାଗ କରନ୍ତୁ।",
            "ଆତଙ୍କିତ ପର୍ଯ୍ୟାୟ ପରିଚାଳନା-ଧାନ ଫସଲ ଆତଙ୍କିତ ପର୍ଯ୍ୟାୟ ଆରମ୍ଭ ପର୍ଯ୍ୟାୟରେ ପହଞ୍ଚିଛି। ପାନିକଲ ଆରମ୍ଭ ପର୍ଯ୍ୟାୟରେ ଆଂଶିକ ଆକସ୍ମିକ ବନ୍ୟା ଆସିପାରେ। ବନ୍ୟା ଆସିଲେ, ଧାନର ପ୍ୟାନିକଲ୍କୁ ସିଧା ରଖିବା ପାଇଁ ବଣ୍ଡେଲରେ ବାନ୍ଧି ଦିଅନ୍ତୁ। ବନ୍ୟା ଜଳ ହ୍ରାସ ପାଇବା ପରେ କ୍ଷେତରୁ ପାଣି ବାହାର କରନ୍ତୁ।",
            "କୀଟପତଙ୍ଗ ଏବଂ ରୋଗ ପରିଚାଳନା-ଯେକୌଣସି କୀଟପତଙ୍ଗ ଏବଂ ରୋଗ ସଂକ୍ରମଣ ପାଇଁ ନିୟମିତ ଭାବରେ ଫସଲ ଉପରେ ନଜର ରଖନ୍ତୁ | ସେହି ଅନୁଯାୟୀ ଉପଯୁକ୍ତ ଉଦ୍ଭିଦ ସୁରକ୍ଷା ପଦକ୍ଷେପ ନିଅନ୍ତୁ। ବର୍ତ୍ତମାନର ପାଣିପାଗ ସ୍ଥିତିରେ, ଫଙ୍ଗାଲ୍ ଏବଂ ବ୍ୟାକ୍ଟେରିଆ ରୋଗ ଯେପରିକି ପତ୍ର ବ୍ଲାଇଟ୍, ୱିଲ୍ଟ ଏବଂ ରଟ୍ ହେବାର ସମ୍ଭାବନା ରହିଛି। ଏହି ରୋଗଗୁଡ଼ିକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ ମେଟାଲ୍ୟାକ୍ସିଲ + ମାନକୋଜେବ @2 ଗ୍ରାମ/ଲିଟର ପାଣି ସହିତ ପ୍ଲାଣ୍ଟୋମାଇସିନ @1 ଗ୍ରାମ/ଲିଟର ପାଣି ସିଞ୍ଚନ କରନ୍ତୁ।"
         ]
      },
      "blackgram": {
         "advisory": [
            "ଉଦ୍ଭିଦ ବୃଦ୍ଧି ପରିଚାଳନା-କଳା ଗହମ ଫସଲ ଉଦ୍ଭିଦ ବୃଦ୍ଧି ପର୍ଯ୍ୟାୟରେ ରହିଛି। ଏକର ପିଛା 400 ମିଲି କିମ୍ବା ଏସିଟାମାଇପ୍ରାଇଡ୍ରେ 40 ଗ୍ରାମ୍ ଟ୍ରାଇଆଜୋଫସ୍ ସିଞ୍ଚନ କରି ଧଳା ମାଛି ବାହକ ଦ୍ୱାରା ସୃଷ୍ଟି ହେଉଥିବା ହଳଦିଆ ମୋଜାଇକ ଭୂତାଣୁକୁ ନିୟନ୍ତ୍ରଣ କରନ୍ତୁ।"
         ]
      },
      "greengram": {
         "advisory": [
            "ଉଦ୍ଭିଦ ବୃଦ୍ଧି ପରିଚାଳନା-ଗ୍ରୀନଗ୍ରାମ ଫସଲ ଉଦ୍ଭିଦ ବୃଦ୍ଧି ପର୍ଯ୍ୟାୟରେ ରହିଛି। ଏକର ପିଛା 400 ମିଲି କିମ୍ବା ଏସିଟାମାଇପ୍ରାଇଡ୍ରେ 40 ଗ୍ରାମ୍ ଟ୍ରାଇଆଜୋଫସ୍ ସିଞ୍ଚନ କରି ଧଳା ମାଛି ବାହକ ଦ୍ୱାରା ସୃଷ୍ଟି ହେଉଥିବା ହଳଦିଆ ମୋଜାଇକ ଭୂତାଣୁକୁ ନିୟନ୍ତ୍ରଣ କରନ୍ତୁ।"
         ]
      },
      "tomato": {
         "advisory": [
            "ଫଳ ଧାରଣର ପର୍ଯ୍ୟାୟ ପରିଚାଳନାର ଉଦ୍ଭିଦ-ବିଲ୍ଟିଂଃ ଅଧିକ ଆର୍ଦ୍ର ଅବସ୍ଥାକୁ ଦୃଷ୍ଟିରେ ରଖି, ଏହି ପର୍ଯ୍ୟାୟରେ ବିଲ୍ଟିଂ ହୋଇପାରେ। ଯଦି ଲକ୍ଷଣ ଦେଖାଯାଏ, ତେବେ ମାନକୋଜେବ୍ 75 ପ୍ରତିଶତ ଡବ୍ଲ୍ୟୁ. ପି. @2 ଗ୍ରାମ/ଲିଟର ପାଣି ସ୍ପ୍ରେ କରନ୍ତୁ।",
            "ଫଳ ଏବଂ ଶୁଟ୍ ବୋରର୍ ପରିଚାଳନା-କୀଟପତଙ୍ଗ ସଂଖ୍ୟା ଉପରେ ନଜର ରଖିବା ପାଇଁ ଏକର ପିଛା 8ନସ୍ ସଂଖ୍ୟାରେ ଫେରୋମୋନ୍ ଫାନ୍ଦ ଲଗାନ୍ତୁ।"
         ]
      },
      "cauliflower": {
         "advisory": [
            "ଭେଜିଟେଟିଭ୍ ଟୁ ଦର୍ଡ ଫର୍ମେସନ୍ ଷ୍ଟେଜ୍ ମ୍ୟାନେଜମେଣ୍ଟ-କୋଲ ଫସଲରେ ଅଲ୍ଟରନେରିଆ ଲିଫ୍ ସ୍ପଟ୍ ରୋଗକୁ ପରିଚାଳନା କରିବା ପାଇଁ, 200 ଲିଟର ପାଣିରେ ମିଶାଇ ଏକର ପିଛା 600 ଗ୍ରାମ୍ରେ ମାନକୋଜେବ୍ 75 ପ୍ରତିଶତ ଡବ୍ଲୁ. ପି. କିମ୍ବା କାର୍ବେଣ୍ଡାଜିମ୍ 12 ପ୍ରତିଶତ + ମାନକୋଜେବ୍ 63 ପ୍ରତିଶତ ଡବ୍ଲୁ. ପି. @400 ଗ୍ରାମ୍ରେ ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "chilli": {
         "advisory": [
            "ଉଦ୍ଭିଦ/ଫୁଲର ପର୍ଯ୍ୟାୟ ପରିଚାଳନା-କ୍ଷେତରୁ ଶୁଖିଲା ଗଛଗୁଡ଼ିକୁ ବାହାର କରିଦିଅନ୍ତୁ। କ୍ଷେତରେ ଏଫିଡ୍ ଏବଂ ଜ୍ଯାସିଡ୍ ସଂକ୍ରମଣ ଦେଖାଯାଇପାରେ | ପରିଚାଳନା କରିବା ପାଇଁ, ଇମିଡାକ୍ଲୋପ୍ରିଡ୍ 17.8% ଏସଏଲ @1 ମିଲି/ଏଲଟି ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "marigold": {
         "advisory": [
            "ଉଦ୍ଭିଦ/ଫୁଲର ପର୍ଯ୍ୟାୟ ପରିଚାଳନା-ପତ୍ର ଖାଉଥିବା କ୍ୟାଟର୍ପିଲାରକୁ ଫେରୋମୋନ୍ ଟ୍ରାପ୍ ସ୍ପୋଡୋଲର୍ @6/ଏକର ବ୍ୟବହାର କରି ପରିଚାଳନା କରନ୍ତୁ କିମ୍ବା ଲାଇଟ୍ ଟ୍ରାପ୍ @5 ନମ୍ବର ସ୍ଥାପନ କରନ୍ତୁ। ବାସିଲସ୍ ଥୁରିନଜିଏନ୍ସିସ୍ 500 ଗ୍ରାମ୍/ଏକର କିମ୍ବା ବିଉଭେରିଆ ବାସିଆନା 1 କିଲୋଗ୍ରାମ୍/ଏକରରେ ଲଗାନ୍ତୁ। ରାସାୟନିକ ନିୟନ୍ତ୍ରଣ ପାଇଁ, କ୍ଲୋରପାଇରିଫୋସ୍ 50 ପ୍ରତିଶତ + ସାଇପର୍ମେଥ୍ରିନ୍ ଇ. ସି. @400 ମିଲି/ଏକରରେ 200 ଲିଟର ପାଣି ସହିତ ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      }
   },
   "date": "27-12-2024"
}