{
   "weather_details": {
      "11/12/2024": {
         "rainfall": 0,
         "t_max": 29,
         "t_min": 21,
         "rh_max": 76,
         "rh_min": 46,
         "wind_speed": 11,
         "wind_direction": 25,
         "cloud_cover": 4
      },
      "12/12/2024": {
         "rainfall": 0,
         "t_max": 28,
         "t_min": 20,
         "rh_max": 66,
         "rh_min": 32,
         "wind_speed": 14,
         "wind_direction": 18,
         "cloud_cover": 16
      }
   },
   "names_of_crops": [
      "ଧାନ।",
      "ବ୍ଲାକଗ୍ରାମ ଏବଂ ଗ୍ରୀନଗ୍ରାମ",
      "ଚିନାବାଦାମ",
      "ଆଳୁ",
      "ଟମାଟୋ",
      "ବାଇଗଣ",
      "ମାରିଗୋଲ୍ଡ",
      "ମତ୍ସ୍ୟଚାଷ"
   ],
   "general_advisory": "ଧାନଶସ୍ୟକୁ 3ରୁ 4 ଦିନ ପର୍ଯ୍ୟନ୍ତ ସୂର୍ଯ୍ୟକିରଣ ତଳେ ଶୁଖାଇବା ଆବଶ୍ୟକ, ବ୍ୟବହାର ପାଇଁ 14 ପ୍ରତିଶତ ଆର୍ଦ୍ରତା ଏବଂ ବୀଜ ଉଦ୍ଦେଶ୍ୟରେ 12 ପ୍ରତିଶତ ଆର୍ଦ୍ରତା ରହିବା ଆବଶ୍ୟକ। ରାତିର ତାପମାତ୍ରା କମ୍ ଥିବାରୁ ଫସଲ ଏବଂ ପନିପରିବାରେ ଶୋଷକ କୀଟପତଙ୍ଗ, ପତ୍ର ରୋଗ, ପାଉଡର ଫଙ୍ଗୁର ସଂକ୍ରମଣ ହେବାର ସମ୍ଭାବନା ରହିଛି। ଫସଲ ଏବଂ ପନିପରିବା ଉପରେ ନଜର ରଖନ୍ତୁ, ଯଦି ଲକ୍ଷଣ ଦେଖାଯାଏ, ଉପଯୁକ୍ତ ଉଦ୍ଭିଦ ସୁରକ୍ଷା ପଦକ୍ଷେପ ଗ୍ରହଣ କରନ୍ତୁ। ଶୀତକାଳୀନ ପନିପରିବା ଫସଲର ସମ୍ପୂର୍ଣ୍ଣ ରୋପଣ। କମ୍ ତାପମାତ୍ରା କାରଣରୁ କମ୍ ଅଙ୍କୁରୋଦଗମକୁ ଏଡ଼ାଇବା ପାଇଁ ପନିପରିବା ନର୍ସରୀ ଉପରେ କମ୍ ମୂଲ୍ୟର ପଲିଥିନ୍ କଭର ବ୍ୟବହାର କରନ୍ତୁ।",
   "crops_data": {
      "paddy": {
         "advisory": [
            "ଅମଳ ପରେ ପର୍ଯ୍ୟାୟ-ମୂଷା ଅଞ୍ଚଳଃ ଆଲୁମିନିୟମ୍ ଫସଫାଇଡ୍ କୁ କାଦୁଅ ସହିତ ରଖନ୍ତୁ ଯାହା ମୂଷାଙ୍କୁ ମାରିଦେବ |"
         ]
      },
      "blackgram and greengram": {
         "advisory": [
            "ଉଦ୍ଭିଦଗତ ପର୍ଯ୍ୟାୟ-ଏଫିଡ୍ଃ ନିମ୍ବ ଆଧାରିତ ପିପିଏମ @ଏକର ପିଛା 600 ମିଲି ସ୍ପ୍ରେ କରନ୍ତୁ। ତା 'ପରେ 200 ଲିଟର ପାଣିରେ ମିଶାଇ ଥିୟାମେଥୋକ୍ସାମ୍ 25 ପ୍ରତିଶତ ଡବ୍ଲୁ. ଜି. @40 ଗ୍ରାମ/ଏକର କିମ୍ବା ଏସିଟାମିପ୍ରିଡ୍ 20 ପ୍ରତିଶତ ଏସ. ପି. @50 ଗ୍ରାମ/ଏକର ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "groundnut": {
         "advisory": [
            "ଉଦ୍ଭିଦଗତ ପର୍ଯ୍ୟାୟ-ତମାଖୁ କ୍ୟାଟରପିଲରଃ ଫେରୋମୋନ୍ ଫାନ୍ଦ ସ୍ଥାପନ କରି ବୟସ୍କ ପତଙ୍ଗଙ୍କ ଉତ୍ଥାନ ଉପରେ ନଜର ରଖନ୍ତୁ | କୀଟନାଶକ ସିଞ୍ଚନ କରନ୍ତୁ।"
         ]
      },
      "potato": {
         "advisory": [
            "ଉଦ୍ଭିଦଗତ ପର୍ଯ୍ୟାୟଃ ହଏଙ୍ଗ୍ ଏବଂ ହାତ ଆଗାଛା କାଟିବା ପାଇଁ ଯାଆନ୍ତୁ। 7-8 ଦିନ ବ୍ୟବଧାନରେ ଫସଲକୁ ଜଳସେଚନ କରନ୍ତୁ। ଜଳସେଚନ ସମୟରେ, ରିଜର ଦୁଇ ତୃତୀୟାଂଶ ଅଂଶ ଜଳମଗ୍ନ ହେବା ଉଚିତ।"
         ]
      },
      "tomato": {
         "advisory": [
            "ଉଦ୍ଭିଦଗତ ପର୍ଯ୍ୟାୟଃ ବିଳମ୍ବରେ ରୋଗ ହୁଏ-ମଞ୍ଜି ଚିକିତ୍ସା ପାଇଁ ମେଟାଲ୍ୟାକ୍ସିଲ + ମାନକୋଜେବ ମିଶ୍ରଣ ସ୍ପ୍ରେ କରନ୍ତୁ। ଅତ୍ୟଧିକ ନାଇଟ୍ରୋଜେନ୍ ସାର ଏବଂ ଗଛର ନିକଟ ବ୍ୟବଧାନରୁ ଦୂରେଇ ରୁହନ୍ତୁ।"
         ]
      },
      "brinjal": {
         "advisory": [
            "ଫଳ ତିଆରି କରିବା ପାଇଁ ବନସ୍ପତି ପର୍ଯ୍ୟାୟଃ ଫଳ ଏବଂ ଶୁଟ୍ ବୋରର୍-କୀଟନାଶକ ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "marigold": {
         "advisory": [
            "ଫୁଲ ପାଇଁ ବନସ୍ପତିଃ ଥ୍ରୀପ୍ସ-ଫିପ୍ରୋନିଲ ଲଗାନ୍ତୁ। ଭୋଜନ ସମ୍ବନ୍ଧୀୟ ତ୍ରୁଟି-ପ୍ରୋଫେନୋଫସ୍ ପ୍ରୟୋଗ କରନ୍ତୁ।"
         ]
      },
      "fisheries": {
         "advisory": [
            "ଶୀତ ଋତୁରେ, 'ଇ. ୟୁ. ଏସ୍.' ରୋଗ ପାଇଁ ପ୍ରତିଷେଧକ ପଦକ୍ଷେପ ଭାବେ ସିଫାକ୍ସ ଲଗାନ୍ତୁ। ମାଛମାନଙ୍କୁ ତୈଳ କେକ୍ ବ୍ରାନ୍ ମିଶ୍ରଣ ସହିତ ଖାଦ୍ୟ ଦିଅନ୍ତୁ |"
         ]
      }
   },
   "date": "10-12-2024"
}