{
   "weather_details": {
      "31/07/2024": {
         "rainfall": 20,
         "t_max": 28,
         "t_min": 25,
         "rh_max": 80,
         "rh_min": 59,
         "wind_speed": 17,
         "wind_direction": 225,
         "cloud_cover": 8
      },
      "01/08/2024": {
         "rainfall": 25,
         "t_max": 28,
         "t_min": 25,
         "rh_max": 83,
         "rh_min": 65,
         "wind_speed": 19,
         "wind_direction": 249,
         "cloud_cover": 8
      },
      "02/08/2024": {
         "rainfall": 15,
         "t_max": 29,
         "t_min": 26,
         "rh_max": 82,
         "rh_min": 66,
         "wind_speed": 20,
         "wind_direction": 248,
         "cloud_cover": 8
      },
      "03/08/2024": {
         "rainfall": 10,
         "t_max": 32,
         "t_min": 25,
         "rh_max": 80,
         "rh_min": 63,
         "wind_speed": 18,
         "wind_direction": 238,
         "cloud_cover": 7
      },
      "04/08/2024": {
         "rainfall": 5,
         "t_max": 32,
         "t_min": 26,
         "rh_max": 79,
         "rh_min": 63,
         "wind_speed": 17,
         "wind_direction": 205,
         "cloud_cover": 6
      }
   },
   "names_of_crops": [
      "ଧାନ।",
      "କଳା ଚଣା",
      "ସବୁଜ ଚଣା",
      "କାକୁଡ଼ି",
      "କଦଳୀ",
      "ମତ୍ସ୍ଯ଼ଚାଷ"
   ],
   "general_advisory": "ପ୍ରବଳ ବର୍ଷା ହେଉଥିବା ଅଞ୍ଚଳରେ, ବର୍ତ୍ତମାନ ପାଇଁ ମଞ୍ଜି ବୁଣିବା ଏବଂ ସାର କିମ୍ବା ତୃଣନାଶକ ପଦାର୍ଥ ଉପରେ ଲଗାଇବା ବନ୍ଦ କରନ୍ତୁ। କ୍ଷେତରେ ବର୍ଷା ଜଳ ସଂରକ୍ଷଣ ପାଇଁ ବନ୍ଧ ତିଆରି କରିବାକୁ କୃଷକମାନଙ୍କୁ ପରାମର୍ଶ ଦିଆଯାଇଛି। ଜୁଲାଇର ଦ୍ୱିତୀଯ଼ ପନ୍ଦର ଦିନ ଶେଷ ସୁଦ୍ଧା ନର୍ସରୀ ବୁଣିବା ଶେଷ ହେବା ଉଚିତ। ବାଇଗଣ ଏବଂ ଓକ୍ରାରେ ଫଳ ଏବଂ ଶୁଟ୍ ଛେଦକକୁ ନିଯ଼ନ୍ତ୍ରଣ କରିବା ପାଇଁ, ଏକର ପିଛା 60 ଗ୍ରାମ ଇମାମେକ୍ଟିନ୍ ବେନ୍ଜୋଏଟ୍ କିମ୍ବା 70 ମିଲି ସ୍ପିନୋସାଡ୍ ଲଗାନ୍ତୁ। ଯେଉଁଠାରେ ମକା କିମ୍ବା ଡାଲି ଇତ୍ଯ଼ାଦି ରୋପଣ କରାଯାଇଛି, ସେଠାରେ ଜଳ ନିଷ୍କାସନ ବ୍ଯ଼ବସ୍ଥା କରନ୍ତୁ। ପ୍ରବଳ ବର୍ଷାରୁ ରକ୍ଷା ପାଇବା ପାଇଁ ପନିପରିବା ନର୍ସରୀକୁ ପଲିଥିନ୍ ଦ୍ୱାରା ଆଚ୍ଛାଦିତ କରନ୍ତୁ ଏବଂ ଜଳ ନିଷ୍କାସନ ବ୍ଯ଼ବସ୍ଥା କରନ୍ତୁ। ବିଦ୍ଯ଼ମାନ ମେଘୁଆ ପାଗ ଏବଂ ଉଚ୍ଚ ଆପେକ୍ଷିକ ଆର୍ଦ୍ରତା ସ୍ଥିତି ସ୍ଥାଯ଼ୀ ଫସଲରେ କୀଟ ଆକ୍ରମଣ ପାଇଁ ଅନୁକୂଳ | ନିଯ଼ମିତ ନିରୀକ୍ଷଣ ଏବଂ ଉପଯୁକ୍ତ ଉଦ୍ଭିଦ ସୁରକ୍ଷା ପଦକ୍ଷେପ ଗ୍ରହଣ କରାଯିବା ଉଚିତ।",
   "crops_data": {
      "paddy": {
         "advisory": [
            "ଆଗାଛା ପରିଚାଳନାଃ ଧାନ କ୍ଷେତରେ ଆଗାଛା ସଂକ୍ରମଣକୁ ନିଯ଼ନ୍ତ୍ରଣ କରିବା ପାଇଁ ପ୍ରାକ୍-ଉଦ୍ଭବ ହର୍ବିସାଇଡ୍ ପ୍ରିଟିଲାକ୍ଲୋର 37 ପ୍ରତିଶତ EW @600 ମିଲି/ଏକର କିମ୍ବା ଅକ୍ସାଡିଆର୍ଜିଲ 80 ପ୍ରତିଶତ WP @50 ଗ୍ରାମ୍/ଏକର କିମ୍ବା ପାଇରାଜୋସଲ୍ଫୁରନ୍ ଇଥାଇଲ 10 ପ୍ରତିଶତ WP @80 ଗ୍ରାମ୍/ଏକର 1-3 DAT ରେ ବ୍ଯ଼ବହାର କରନ୍ତୁ।",
            "ସାର ପରିଚାଳନାଃ ଅଧିକ ଉତ୍ପାଦନକ୍ଷମ ଧାନ କିସମ ପାଇଁ, ସକ୍ରିଯ଼ ଚାଷ ପର୍ଯ୍ଯ଼ାଯ଼ରେ ରୋପଣର 3 ସପ୍ତାହ ପରେ ଏକର ପିଛା 35 କିଲୋଗ୍ରାମ ଯ଼ୁରିଆ ଲଗାନ୍ତୁ। ହାଇବ୍ରିଡ୍ ପାଇଁ ସକ୍ରିଯ଼ ଚାଷ ପର୍ଯ୍ଯ଼ାଯ଼ରେ ରୋପଣର 3 ସପ୍ତାହ ପରେ ଏକର ପିଛା 42 କିଲୋଗ୍ରାମ ଯ଼ୁରିଆ ପ୍ରଯ଼ୋଗ କରନ୍ତୁ। ଦଯ଼ାକରି ନିଶ୍ଚିତ କରନ୍ତୁ ଯେ କ୍ଷେତରେ ଯ଼ୁରିଆ ଲଗାଇବା ପୂର୍ବରୁ ଆପଣ ଆଗାଛା ନିଯ଼ନ୍ତ୍ରଣ କାର୍ଯ୍ଯ଼ ସମ୍ପୂର୍ଣ୍ଣ କରିବା ଉଚିତ ଏବଂ କ୍ଷେତରୁ ଅତିରିକ୍ତ ପାଣି ବାହାର କରିବା ଉଚିତ।"
         ]
      },
      "black gram": {
         "advisory": [
            "ଉଭଯ଼ ଶ୍ୱେତ ମାଛି ସଂକ୍ରମଣ ଏବଂ ମଞ୍ଜି ବୁଣିବା ଠାରୁ ଆରମ୍ଭ କରି ୱାଇ. ଏମ୍. ଭି. ରୋଗର ପ୍ରକୋପକୁ ରୋକିବା ପାଇଁ ସମନ୍ୱିତ କୀଟ ପରିଚାଳନା ରଣନୀତି ଅନୁସରଣ କରାଯିବା ଉଚିତ।",
            "ପି. ଡି. ଏମ୍. 139, ପି. ଡି. ଏମ୍. 11, ଇତ୍ଯ଼ାଦି ଭଳି ୱାଇ. ଏମ୍. ଭି. ରୋଗ ପ୍ରତିରୋଧକ କିସମର ଚଯ଼ନ କରନ୍ତୁ।",
            "ଶ୍ୱେତ ମାଛି ସଂକ୍ରମଣକୁ ରୋକିବା ପାଇଁ ମଞ୍ଜି ବୁଣିବା ପୂର୍ବରୁ ଇମିଡାକ୍ଲୋପ୍ରିଡ୍ @5 ଗ୍ରାମ୍/କେଜି ମଞ୍ଜି ସହିତ ଚିକିତ୍ସା କରାଯିବା ଉଚିତ।",
            "ଫସଲର 2ରୁ 3ଟି ପତ୍ର ପର୍ଯ୍ଯ଼ାଯ଼ରୁ ଆରମ୍ଭ କରି ଶୁଆ ପରିପକ୍ୱ ହେବା ପର୍ଯ୍ଯ଼ନ୍ତ 10ଟି ହଳଦିଆ ଚଟପଟା ଜାଲ ଲଗାନ୍ତୁ। ଏହି ରୋଗର ଅଧିକ ବିସ୍ତାରକୁ ରୋକିବା ପାଇଁ ରୋଗାକ୍ରାନ୍ତ ଗଛଗୁଡ଼ିକୁ ବାହାର କରିଦେବା ଉଚିତ।"
         ]
      },
      "green gram": {
         "advisory": [
            "ଉଭଯ଼ ଶ୍ୱେତ ମାଛି ସଂକ୍ରମଣ ଏବଂ ମଞ୍ଜି ବୁଣିବା ଠାରୁ ଆରମ୍ଭ କରି ୱାଇ. ଏମ୍. ଭି. ରୋଗର ପ୍ରକୋପକୁ ରୋକିବା ପାଇଁ ସମନ୍ୱିତ କୀଟ ପରିଚାଳନା ରଣନୀତି ଅନୁସରଣ କରାଯିବା ଉଚିତ।",
            "ପି. ଡି. ଏମ୍. 139, ପି. ଡି. ଏମ୍. 11, ଇତ୍ଯ଼ାଦି ଭଳି ୱାଇ. ଏମ୍. ଭି. ରୋଗ ପ୍ରତିରୋଧକ କିସମର ଚଯ଼ନ କରନ୍ତୁ।",
            "ଶ୍ୱେତ ମାଛି ସଂକ୍ରମଣକୁ ରୋକିବା ପାଇଁ ମଞ୍ଜି ବୁଣିବା ପୂର୍ବରୁ ଇମିଡାକ୍ଲୋପ୍ରିଡ୍ @5 ଗ୍ରାମ୍/କେଜି ମଞ୍ଜି ସହିତ ଚିକିତ୍ସା କରାଯିବା ଉଚିତ।",
            "ଫସଲର 2ରୁ 3ଟି ପତ୍ର ପର୍ଯ୍ଯ଼ାଯ଼ରୁ ଆରମ୍ଭ କରି ଶୁଆ ପରିପକ୍ୱ ହେବା ପର୍ଯ୍ଯ଼ନ୍ତ 10ଟି ହଳଦିଆ ଚଟପଟା ଜାଲ ଲଗାନ୍ତୁ। ଏହି ରୋଗର ଅଧିକ ବିସ୍ତାରକୁ ରୋକିବା ପାଇଁ ରୋଗାକ୍ରାନ୍ତ ଗଛଗୁଡ଼ିକୁ ବାହାର କରିଦେବା ଉଚିତ।"
         ]
      },
      "cucurbits": {
         "advisory": [
            "ପ୍ରବଳ ବର୍ଷା ପରେ, ରିଜ୍ ଲାଉ ଏବଂ ସ୍ନେକ୍ ଗାର୍ଡ ପରି କୁକୁର୍ବିଟ୍ ରେ ସେମିଲୋପର୍ କୀଟ ଘଟଣା ସାଧାରଣ |",
            "ନିମ୍ବ ଆଧାରିତ କୀଟନାଶକ (ନିମ୍ବ ତେଲ 15000 ପିପିଏମ) ଆଜାଦିରାକ୍ଟିନ ପ୍ରତି ଏକରରେ 600 ମିଲି କିମ୍ବା ବାସିଲସ ଥୁରିଙ୍ଗିଯ଼େନ୍ସିସ ପ୍ରତି ଏକରରେ 400 ଗ୍ରାମକୁ 200 ଲିଟର ପାଣିରେ ମିଶାଇ ସିଞ୍ଚନ କରନ୍ତୁ।",
            "କୀଟକୁ ଜୈବିକ ଭାବରେ ପରିଚାଳନା କରିବା ପାଇଁ ପ୍ରତ୍ଯ଼େକ କାର୍ଡକୁ ପ୍ରଦତ୍ତ ଛିଦ୍ରରେ 12 ଖଣ୍ଡରେ ବିଭକ୍ତ କରି ସାପ୍ତାହିକ ବ୍ଯ଼ବଧାନରେ 5 ଥର ପାଇଁ ଟ୍ରାଇକୋଗ୍ରାମ ଚିଲିନିସ୍ କାର୍ଡ (50,000 ଅଣ୍ଡା/ହେକ୍ଟର) @1/ଏକର ବ୍ଯ଼ବହାର କରନ୍ତୁ।",
            "ରାସାଯ଼ନିକ ଉପାଯ଼ରେ ଏହି କୀଟକୁ ନିଯ଼ନ୍ତ୍ରଣ କରିବା ପାଇଁ ମଧ୍ଯ଼ାହ୍ନ ସମଯ଼ରେ ଏକର ପିଛା 50-ମିଲି ଆଲ୍ଫା-ସାଇହାଲୋଥ୍ରିନ୍ କିମ୍ବା ଏକର ପିଛା 120-ମିଲି ଥିଆକ୍ଲୋପ୍ରିଡ୍ ସ୍ପ୍ରେ କରନ୍ତୁ ଏବଂ ଏଥିରେ 200 ଲିଟର ପାଣି ମିଶାନ୍ତୁ।"
         ]
      },
      "banana": {
         "advisory": [
            "ଷ୍ଟାକିଂ ପ୍ରଦାନ କରନ୍ତୁ ଏବଂ ଡ୍ରେନେଜ୍ ପାଇଁ ବ୍ଯ଼ବସ୍ଥା କରନ୍ତୁ | ପାନାମା ୱିଲ୍ଟକୁ ପରିଚାଳନା କରିବା ପାଇଁ, ରୋଗ ମୁକ୍ତ ରୋପଣ ସାମଗ୍ରୀ ଏବଂ ବାଣ୍ଟାଲ, ରୋବଷ୍ଟା, ଚମ୍ପା, କାବୁଲି ଇତ୍ଯ଼ାଦି ପ୍ରତିରୋଧକ ଚାଷ ଚଯ଼ନ କରନ୍ତୁ |",
            "କଦଳୀ ଶୋଷକମାନଙ୍କୁ ରୋପଣ ପୂର୍ବରୁ 10-ଗ୍ରାମ୍/10-ଲିଟର ପାଣିରେ କାର୍ବେନଡାଜିମ୍ ଦ୍ରବଣରେ ବୁଡ଼ାଇବା ଉଚିତ ଏବଂ ରୋପଣର 5 ମାସ ପରେ ସିଉଡୋଷ୍ଟେମ୍ ଚାରିପାଖରେ ମାଟି ଦ୍ୱିମାସିକ ଭାବରେ ଭିଜାଇଦେବା ଉଚିତ୍ |"
         ]
      },
      "fishery": {
         "advisory": [
            "ପ୍ରବଳ ବର୍ଷା ଫଳରେ ପୋଖରୀରେ ଥିବା ଜଳର ଲବଣାକ୍ତତା ହ୍ରାସ ପାଇପାରେ। ବର୍ଷା ବନ୍ଦ ହେବା ପରେ ଆଲ୍କି-ଡାଇମିଥାଇଲ-ବେଞ୍ଜାଇଲ ଆମୋନିଯ଼ମ କ୍ଲୋରାଇଡ (3 ପିପିଏମ) କୁ କୀଟାଣୁନାଶକ ଭାବରେ ପ୍ରଯ଼ୋଗ କରିବାକୁ କୃଷକମାନଙ୍କୁ ପରାମର୍ଶ ଦିଆଯାଇଛି।",
            "ଅନାବଶ୍ଯ଼କ ମାଛର କ୍ଷତି ଏବଂ ପ୍ରବେଶକୁ ରୋକିବା ପାଇଁ ଇନଲେଟ୍ ଏବଂ ଆଉଟ୍ଲେଟ୍ ରେ ବାଉଁଶ କିମ୍ବା ନାଇଲନ୍ ଜାଲ ସ୍କ୍ରିନ୍ ସ୍ଥାପନ କରାଯିବା ଉଚିତ୍ |",
            "ଓଭରଫ୍ଲୋ ହେଉଥିବା ପାଣିରେ ମାଛର କ୍ଷଯ଼କୁ ରୋକିବା ପାଇଁ ବନ୍ଧ ଉପରେ ନାଇଲନ୍ ଜାଲ ଲଗାଯାଇପାରେ |"
         ]
      }
   },
   "date": "30-07-2024"
}