{
   "weather_details": {
      "30/10/2024": {
         "rainfall": 8,
         "t_max": 34,
         "t_min": 27,
         "rh_max": 92.9,
         "rh_min": 68,
         "wind_speed": 4,
         "wind_direction": 11,
         "cloud_cover": 8
      },
      "31/10/2024": {
         "rainfall": 0,
         "t_max": 34,
         "t_min": 24,
         "rh_max": 91,
         "rh_min": 58,
         "wind_speed": 5,
         "wind_direction": 256,
         "cloud_cover": 0
      },
      "01/11/2024": {
         "rainfall": 0,
         "t_max": 33,
         "t_min": 24,
         "rh_max": 90.5,
         "rh_min": 58,
         "wind_speed": 5,
         "wind_direction": 320,
         "cloud_cover": 0
      }
   },
   "names_of_crops": [
      "ସବୁଜ ଚଣା",
      "କଳା ଚଣା",
      "କଦଳୀ",
      "କ୍ଷେତ ମଟର",
      "ମସୁର ଡାଲି",
      "ଚିନାବାଦାମ",
      "ତୋରିଆ",
      "ସୂର୍ଯ୍ଯ଼ମୁଖୀ"
   ],
   "general_advisory": "କ୍ଷେତରେ ଉପଲବ୍ଧ ମୃତ୍ତିକା ଆର୍ଦ୍ରତାର ଉପଯୋଗ କରି ମଧ୍ଯ଼ମ/ଅଗଭୀର ତଳିଆ ଅଞ୍ଚଳରେ ସବୁଜ ଗହମ, କଳା ଗହମ, ମଟର, ମଟର, ଚିନାବାଦାମ, ତୋରିଆ ଏବଂ ସୂର୍ଯ୍ଯ଼ମୁଖୀ ଭଳି ସ୍ୱଳ୍ପକାଳୀନ ରବି ଫସଲ ଚାଷ କରିବାକୁ କୃଷକମାନଙ୍କୁ ପରାମର୍ଶ ଦିଆଯାଇଛି। କୀଟ ସଂକ୍ରମଣ ରୋକିବା ପାଇଁ କୃଷକମାନଙ୍କୁ ନିଯ଼ମିତ ଭାବେ ନିଜ ଫସଲ କ୍ଷେତ ପରିଦର୍ଶନ କରିବାକୁ ପରାମର୍ଶ ଦିଆଯାଇଛି।",
   "crops_data": {
      "paddy": {
         "advisory": [
            "କାନ ମୁଣ୍ଡ କ୍ଯ଼ାଟରପିଲର ପରିଚାଳନା ପାଇଁ, ଭଲ ଫଳାଫଳ ପାଇଁ ସନ୍ଧ୍ଯ଼ାରେ କ୍ଲୋରପିରିଫସ୍ 50 ପ୍ରତିଶତ + ସାଇପର୍ମେଥ୍ରିନ 5 ପ୍ରତିଶତ ଇସି @400 ମିଲି/ଏକର କିମ୍ବା ପ୍ରୋଫେନୋଫସ୍ 50 ପ୍ରତିଶତ ଇସି @400 ମିଲି/ଏକର ସ୍ପ୍ରେ କରନ୍ତୁ।",
            "ଗୁଣ୍ଡି ବଗ୍କୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ କ୍ଲୋରପିରିଫସ୍ 20 ପ୍ରତିଶତ ଇସି @400 ମିଲି/ଏକର କିମ୍ବା ମାଲାଥିଅନ୍ 50 ପ୍ରତିଶତ ଇସି @400 ମିଲି/ଏକରରେ ସକାଳ ସମୟରେ ସମାନ ଭାବରେ ସ୍ପ୍ରେ କରନ୍ତୁ।",
            "ଚିନାବାଦାମ ସଂରକ୍ଷଣ ପାଇଁ, ଫିଉଜଡ୍ କ୍ଯ଼ାଲସିଯ଼ମ୍ କ୍ଲୋରାଇଡ୍ ପରି ଡେସିକାଣ୍ଟ ସହିତ ପଲିଥିନ୍ ଲାଇନ୍ ହୋଇଥିବା ଗନ୍ନୀ ବ୍ଯ଼ାଗ୍ ବ୍ଯ଼ବହାର କରନ୍ତୁ |",
            "ଆଖୁ ଇଣ୍ଟର୍ନୋଡ୍ ବୋରର୍ ପରିଚାଳନା ପାଇଁ, ରାସାୟନିକ ନିୟନ୍ତ୍ରଣ ଭାବରେ ଟ୍ରାଇକୋଗ୍ରାମ ଚିଲିନିସ୍ କାର୍ଡକୁ ସପ୍ତାହକୁ 1/ଏକରରେ ବ୍ୟବହାର କରନ୍ତୁ କିମ୍ବା ଫିପ୍ରୋନିଲ୍ ସ୍ପ୍ରେକୁ 600 ମିଲି/ଏକରରେ ସ୍ପ୍ରେ କରନ୍ତୁ।",
            "କୁକୁଡ଼ା ଫଳ ମାଛି ପରିଚାଳନା ପାଇଁ, ମାଛିମାନଙ୍କୁ ଆକର୍ଷିତ କରିବା ଏବଂ ମାରିବା ପାଇଁ ପାଣିରେ ଗୁଡ଼ ଏବଂ ଡି. ଡି. ଭି. ପି. ସହିତ ଏକ ବିଷାକ୍ତ ଚାରା ପ୍ରସ୍ତୁତ କରନ୍ତୁ।"
         ]
      },
      "cole crop": {
         "advisory": [
            "ସାର ପରିଚାଳନା ପାଇଁ, ହୋଇଂ ଏବଂ ହ୍ଯ଼ାଣ୍ଡ ୱେଡିଂ ପରେ ଏକର ପିଛା 33 କିଲୋଗ୍ରାମ ଯ଼ୁରିଆ ଏବଂ 23 କିଲୋଗ୍ରାମ ଏମଓପି, 20 ଡିଏଟି ଏବଂ 33 କିଲୋଗ୍ରାମ ଯ଼ୁରିଆ ଏବଂ ଏକର ପିଛା 23 କିଲୋଗ୍ରାମ ଏମଓପି ପ୍ରଯ଼ୋଗ କରନ୍ତୁ।"
         ]
      },
      "marigold & rose": {
         "advisory": [
            "ରେଡ୍ ସ୍ପାଇଡର ମାଇଟ୍କୁ ପରିଚାଳନା କରିବା ପାଇଁ, ଓଦା ସଲଫର୍ 80 ପ୍ରତିଶତ ଡବ୍ଲ୍ଯ଼ୁ. ପି. @2 ଗ୍ରାମ/ଲିଟର ପାଣି କିମ୍ବା ପ୍ରୋପାର୍ଜାଇଟ୍ 57 ପ୍ରତିଶତ ଇ. ସି. @2 ମିଲି/ଲିଟର ପାଣି ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      }
   },
   "date": "29-10-2024",
   "ERROR": "ନିଯ଼ମିତ ତଥ୍ଯ଼ ମିଳୁନାହିଁ।"
}