{
   "weather_details": {
      "20/07/2024": {
         "rainfall": 15,
         "t_max": 33,
         "t_min": 27,
         "rh_max": 84,
         "rh_min": 70,
         "wind_speed": 13,
         "wind_direction": 158,
         "cloud_cover": 7
      },
      "21/07/2024": {
         "rainfall": 10,
         "t_max": 33,
         "t_min": 27,
         "rh_max": 84,
         "rh_min": 67,
         "wind_speed": 16,
         "wind_direction": 159,
         "cloud_cover": 7
      },
      "22/07/2024": {
         "rainfall": 5,
         "t_max": 34,
         "t_min": 28,
         "rh_max": 80,
         "rh_min": 64,
         "wind_speed": 22,
         "wind_direction": 214,
         "cloud_cover": 7
      },
      "23/07/2024": {
         "rainfall": 5,
         "t_max": 33,
         "t_min": 26,
         "rh_max": 75,
         "rh_min": 68,
         "wind_speed": 26,
         "wind_direction": 248,
         "cloud_cover": 6
      },
      "24/07/2024": {
         "rainfall": 5,
         "t_max": 33,
         "t_min": 26,
         "rh_max": 74,
         "rh_min": 61,
         "wind_speed": 30,
         "wind_direction": 248,
         "cloud_cover": 6
      }
   },
   "names_of_crops": [
      "ଧାନ।",
      "କଳା ଚଣା",
      "ସବୁଜ ଚଣା",
      "ବାଇଗଣ",
      "ପେଁପେ",
      "ନଡ଼ିଆ"
   ],
   "general_advisory": "ନିମ୍ନ ଭୂମିରେ, ମୁଖ୍ଯ଼ କ୍ଷେତରେ 21 ଦିନ ପାଇଁ ଧାନ ଚାରା ରୋପଣ କରନ୍ତୁ। ବର୍ଷା ଜଳକୁ ମୁଖ୍ଯ଼ ଧାନ କ୍ଷେତରେ ବନ୍ଧ କରି ରଖନ୍ତୁ, ଯାହାଦ୍ୱାରା ସମଯ଼ୋଚିତ ଭାବରେ ପାଣି ନିଷ୍କାସନ ଏବଂ ରୋପଣ କରାଯାଇପାରିବ। ବର୍ତ୍ତମାନ ଯେଉଁଠାରେ ପର୍ଯ୍ଯ଼ାପ୍ତ ବର୍ଷା ହୋଇଥିଲା, ସେଠାରେ ବିଉଶନିଂ କରାଯାଇପାରିବ। ପ୍ରବଳ ବର୍ଷା ହେଉଥିବା ଅଞ୍ଚଳରେ, ବର୍ତ୍ତମାନ ପାଇଁ ମଞ୍ଜି ବୁଣିବା ଏବଂ ସାର କିମ୍ବା ତୃଣନାଶକ ପଦାର୍ଥ ଉପରେ ଲଗାଇବା ବନ୍ଦ କରନ୍ତୁ। ଜୁଲାଇର ଦ୍ୱିତୀଯ଼ ପନ୍ଦର ଦିନ ଶେଷ ସୁଦ୍ଧା ନର୍ସରୀ ବୁଣିବା ଶେଷ ହେବା ଉଚିତ। ଯଦି ଧାନ ନର୍ସରୀରେ ଥ୍ରୀପ୍ସର ସଂକ୍ରମଣ ଦେଖାଯାଏ, ତେବେ ଏନ୍. ଏସ୍. କେ. ଇ. (ଆଜାଦିରାକ୍ଟିନ) @ଏକର ପିଛା 800 ମିଲି କିମ୍ବା ଲାମ୍ବଡା-ସିହାଲୋଥ୍ରିନ 5 ପ୍ରତିଶତ ଇ. ସି. @ଏକର ପିଛା 100 ମିଲି କିମ୍ବା ଥିଯ଼ାମେଥୋକ୍ସାମ 25 ପ୍ରତିଶତ ଡବ୍ଲୁ. ଜି. @ଏକର ପିଛା 40 ଗ୍ରାମ୍ ସ୍ପ୍ରେ କରନ୍ତୁ। ଯେଉଁଠାରେ ମକା କିମ୍ବା ଡାଲି ଇତ୍ଯ଼ାଦି ରୋପଣ କରାଯାଇଛି, ସେଠାରେ ଜଳ ନିଷ୍କାସନ ବ୍ଯ଼ବସ୍ଥା କରନ୍ତୁ। ପ୍ରବଳ ବର୍ଷାରୁ ରକ୍ଷା ପାଇବା ପାଇଁ ପନିପରିବା ନର୍ସରୀକୁ ପଲିଥିନ୍ ଦ୍ୱାରା ଢାଙ୍କି ଦିଅନ୍ତୁ ଏବଂ ଜଳ ନିଷ୍କାସନ ବ୍ଯ଼ବସ୍ଥା କରନ୍ତୁ।",
   "crops_data": {
      "paddy": {
         "advisory": [
            "ପ୍ରତି ଏକର ପିଛା 35 କିଲୋଗ୍ରାମ ଡିଏପି, 27 କିଲୋଗ୍ରାମ ପୋଟାଶ ଏବଂ 8 କିଲୋଗ୍ରାମ ଯ଼ୁରିଆ ପ୍ରଯ଼ୋଗ କରନ୍ତୁ। ବାଲୁକାମଯ଼ ମୃତ୍ତିକା ପାଇଁ ଏକର ପିଛା 35 କିଲୋଗ୍ରାମ ଡିଏପି, 15 କିଲୋଗ୍ରାମ ପୋଟାଶ ଏବଂ 8 କିଲୋଗ୍ରାମ ଯ଼ୁରିଆ ଲଗାନ୍ତୁ। 20x15 ସେ. ମି. ବ୍ଯ଼ବଧାନରେ <ଆଇ. ଡି. 1> ଦିନ ପୁରୁଣା ଚାରା ରୋପଣ କରାଯିବା ଉଚିତ, ଅଧିକ ଉତ୍ପାଦନକ୍ଷମ ପ୍ରଜାତି ପାଇଁ ପ୍ରତି ପାହାଡ଼ରେ 2ରୁ 3 ଚାରା ଲଗାଇବା ଉଚିତ। ପ୍ରାକ୍-ଉଦ୍ଭବ ହର୍ବିସାଇଡ୍ ପ୍ରିଟିଲାକ୍ଲୋର @800 ମିଲି/ଏକର କିମ୍ବା ଅକ୍ସାଡିଆର୍ଜିଲ 80 ପ୍ରତିଶତ ଡବ୍ଲ୍ଯ଼ୁ. ପି. @30 ଗ୍ରାମ୍/ଏକର କିମ୍ବା ପାଇରାଜୋସଲ୍ଫୁରନ୍ ଇଥାଇଲ 10 ପ୍ରତିଶତ ଡବ୍ଲ୍ଯ଼ୁ. ପି. @80 ଗ୍ରାମ୍/ଏକର 1-3 ଡିଏଟିରେ ବ୍ଯ଼ବହାର କରନ୍ତୁ। ଏକର ପିଛା 200 ଲିଟର ପାଣିରେ ହର୍ବିସାଇଡ୍ ମିଶାଇ ସ୍ପ୍ରେ କରନ୍ତୁ କିମ୍ବା 20 କେଜି ବାଲି ସହିତ ହର୍ବିସାଇଡ୍ ମିଶାନ୍ତୁ ଏବଂ ସମାନ ଭାବରେ ପ୍ରସାରଣ କରନ୍ତୁ | ତୃଣନାଶକ ସିଞ୍ଚନ ପାଇଁ ସର୍ବଦା ଫ୍ଲାଟ୍-ଫ୍ଯ଼ାନ୍ କିମ୍ବା ଫ୍ଲାଡ୍-ଜେଟ୍ ନୋଜଲ୍ ଏବଂ ସଫା ପାଣି ବ୍ଯ଼ବହାର କରନ୍ତୁ |"
         ]
      },
      "black gram": {
         "advisory": [
            "ବୁଣିବାଃ ଗହମ ଏବଂ ସବୁଜ ଗହମ ପାଇଁ କିପ ମଞ୍ଜି ହାର ଏକର ପିଛା 10 କିଲୋଗ୍ରାମ ରହିଛି। ବୁଣିବା ପୂର୍ବରୁ ମଞ୍ଜି ଚିକିତ୍ସା କରନ୍ତୁ। ବୁଣିବା ପୂର୍ବରୁ ଏକ ସପ୍ତାହ ପୂର୍ବରୁ ମଞ୍ଜିଗୁଡ଼ିକୁ କାର୍ବେନଡାଜିମ୍ 50 ପ୍ରତିଶତ ଡବ୍ଲ୍ଯ଼ୁ. ପି. @2 ଗ୍ରାମ୍/କେଜି ମଞ୍ଜି କିମ୍ବା କାର୍ବୋକ୍ସିନ୍ <ଆଇ. ଡି. 1> + ଥିରମ୍ <ଆଇ. ଡି. 1> ଡି. ଏସ୍. @3 ଗ୍ରାମ୍/କେଜି ମଞ୍ଜି ଦେଇ ଚିକିତ୍ସା କରନ୍ତୁ। ବୁଣିବା 1 ଘଣ୍ଟା ପୂର୍ବରୁ 20 ଗ୍ରାମ୍/କି. ଗ୍ରା. ମୂଲ୍ଯ଼ର ସୁପାରିଶ କରାଯାଇଥିବା ପ୍ରଜାତିର ରାଇଜୋବିଯ଼ମ୍ ବ୍ଯ଼ାକ୍ଟେରିଆ କଲ୍ଚର୍ର ମଞ୍ଜି ବ୍ଯ଼ବହାର କରନ୍ତୁ। ଶେଷ ଚାଷ ସମଯ଼ରେ 2 ଟନ୍ ଏଫ୍. ୱାଇ. ଏମ୍. କିମ୍ବା କମ୍ପୋଷ୍ଟ ସହିତ ଏକର ପିଛା 35 କି. ଗ୍ରା. ଡିଏ. ପି., 13 କି. ଗ୍ରା. ଏମ୍. ଓ. ପି., 4 କି. ଗ୍ରା. ଯ଼ୁରିଆ ମୂଳ ସାର ଭାବେ ପ୍ରଯ଼ୋଗ କରନ୍ତୁ। ମୁଖ୍ଯ଼ କ୍ଷେତରେ ବୁଣିବା ସମଯ଼ରେ ଧାଡ଼ି ଠାରୁ ଧାଡ଼ି ମଧ୍ଯ଼ରେ 30 ସେ. ମି. ଏବଂ ଚାରା ଲଗାଇବା ପାଇଁ 10 ସେ. ମି. ବ୍ଯ଼ବଧାନ ରଖନ୍ତୁ।"
         ]
      },
      "green gram": {
         "advisory": [
            "ବୁଣିବାଃ ଗହମ ଏବଂ ସବୁଜ ଗହମ ପାଇଁ କିପ ମଞ୍ଜି ହାର ଏକର ପିଛା 10 କିଲୋଗ୍ରାମ ରହିଛି। ବୁଣିବା ପୂର୍ବରୁ ମଞ୍ଜି ଚିକିତ୍ସା କରନ୍ତୁ। ବୁଣିବା ପୂର୍ବରୁ ଏକ ସପ୍ତାହ ପୂର୍ବରୁ ମଞ୍ଜିଗୁଡ଼ିକୁ କାର୍ବେନଡାଜିମ୍ 50 ପ୍ରତିଶତ ଡବ୍ଲ୍ଯ଼ୁ. ପି. @2 ଗ୍ରାମ୍/କେଜି ମଞ୍ଜି କିମ୍ବା କାର୍ବୋକ୍ସିନ୍ <ଆଇ. ଡି. 1> + ଥିରମ୍ <ଆଇ. ଡି. 1> ଡି. ଏସ୍. @3 ଗ୍ରାମ୍/କେଜି ମଞ୍ଜି ଦେଇ ଚିକିତ୍ସା କରନ୍ତୁ। ବୁଣିବା 1 ଘଣ୍ଟା ପୂର୍ବରୁ 20 ଗ୍ରାମ୍/କି. ଗ୍ରା. ମୂଲ୍ଯ଼ର ସୁପାରିଶ କରାଯାଇଥିବା ପ୍ରଜାତିର ରାଇଜୋବିଯ଼ମ୍ ବ୍ଯ଼ାକ୍ଟେରିଆ କଲ୍ଚର୍ର ମଞ୍ଜି ବ୍ଯ଼ବହାର କରନ୍ତୁ। ଶେଷ ଚାଷ ସମଯ଼ରେ 2 ଟନ୍ ଏଫ୍. ୱାଇ. ଏମ୍. କିମ୍ବା କମ୍ପୋଷ୍ଟ ସହିତ ଏକର ପିଛା 35 କି. ଗ୍ରା. ଡିଏ. ପି., 13 କି. ଗ୍ରା. ଏମ୍. ଓ. ପି., 4 କି. ଗ୍ରା. ଯ଼ୁରିଆ ମୂଳ ସାର ଭାବେ ପ୍ରଯ଼ୋଗ କରନ୍ତୁ। ମୁଖ୍ଯ଼ କ୍ଷେତରେ ବୁଣିବା ସମଯ଼ରେ ଧାଡ଼ି ଠାରୁ ଧାଡ଼ି ମଧ୍ଯ଼ରେ 30 ସେ. ମି. ଏବଂ ଚାରା ଲଗାଇବା ପାଇଁ 10 ସେ. ମି. ବ୍ଯ଼ବଧାନ ରଖନ୍ତୁ।"
         ]
      },
      "brinjal": {
         "advisory": [
            "ଯେଉଁ କୃଷକମାନେ ପୂର୍ବରୁ ମୁଖ୍ଯ଼ କ୍ଷେତରେ ବାଇଗଣ ରୋପଣ କରିସାରିଛନ୍ତି, ସେମାନେ 30 ଡିଏଟି ହାରରେ ଘାସ କାଟିବା ପରେ ଏକର ପିଛା 30 କିଲୋଗ୍ରାମ ଯ଼ୁରିଆ ଏବଂ 20 କିଲୋଗ୍ରାମ ଏମଓପି ଲଗାଇବା ଉଚିତ। ଅବଶିଷ୍ଟ 30-କିଲୋଗ୍ରାମ ଯ଼ୁରିଆ 45 ଡିଏଟି ରେ ଶେଷ ଟପ୍ ଡ୍ରେସିଙ୍ଗ୍ ସାର ଭାବରେ ପ୍ରଯ଼ୋଗ କରାଯିବା ଉଚିତ୍ |"
         ]
      },
      "papaya": {
         "advisory": [
            "ବୃକ୍ଷରୋପଣ ବର୍ତ୍ତମାନ ପାଗ ଆଳୁ ରୋପଣ ପାଇଁ ସର୍ବୋତ୍ତମ ଅଟେ। ପେଁପେ ପାଇଁ ଏଚୱାଇଭି ହେଉଛି ହନିଡିଉ, କୁର୍ଗ ହନିଡିଉ, ସିଓ-1, ସିଓ-2, ପୁସା ସୁସ୍ୱାଦୁ, ପୁସା ମ୍ଯ଼ାଜେଷ୍ଟି ଏବଂ ପୁସା ଜଏଣ୍ଟ | ଚାରା ଗୁଡ଼ିକୁ 2.5 x 2.5-meter ଦୂରତା ଏବଂ 0.5 x 0.5 x 0.5 ମିଟର ଗର୍ତ୍ତରେ ରୋପଣ କରନ୍ତୁ। ରୋଗ ପ୍ରତିରୋଧକ ଏବଂ ଟିସ୍ଯ଼ୁ କଲ୍ଚର ଚାରା ବ୍ଯ଼ବହାର କରାଯିବା ଉଚିତ।"
         ]
      },
      "coconut": {
         "advisory": [
            "ରୁଗୋଜ୍ ସର୍ପିଲିଂ ହ୍ୱାଇଟ୍ଫ୍ଲାଇକୁ ନିଯ଼ନ୍ତ୍ରଣ କରିବା ପାଇଁ, ସଂକ୍ରମିତ ଗଛର ପତ୍ରରେ ଭାରୀ ସୁଟି ଛାଞ୍ଚ ଜମା ହଟାଇବା ପାଇଁ ସ୍ଟାର୍ଚ ଦ୍ରବଣ @100-ଗ୍ରାମ୍/10-ଲିଟର ପାଣି ସ୍ପ୍ରେ କରନ୍ତୁ | ବଯ଼ସ୍କ ଧଳା ମାଛିମାନଙ୍କୁ ଧରିବା ପାଇଁ ହଳଦିଆ ଚଟପଟା ଜାଲ ବ୍ଯ଼ବହାର କରନ୍ତୁ। କୀଟ ସଂକ୍ରମଣର ପ୍ରାଥମିକ ପର୍ଯ୍ଯ଼ାଯ଼ରେ, ନିମ ଆଧାରିତ କୀଟନାଶକ (ଆଜାଦିରାକ୍ଟିନ) 1500 ପିପିଏମ @30 ମିଲି/10 ଲିଟର ପାଣି ସ୍ପ୍ରେ କରନ୍ତୁ। ରାସାଯ଼ନିକ ନିଯ଼ନ୍ତ୍ରଣ ପାଇଁ ସ୍ପିନୋସାଦ୍ 45 ପ୍ରତିଶତ ଏସ୍. ସି. @4-ମିଲି/10-ଲିଟର ପାଣି କିମ୍ବା ଇମାମେକ୍ଟିନ୍ ବେନ୍ଜୋଏଟ୍ 5 ପ୍ରତିଶତ ଏସ୍. ଜି. @4-ଗ୍ରାମ୍/10-ଲିଟର ପାଣି ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      }
   },
   "date": "19-07-2024"
}