{
   "weather_details": {
      "10-07-2024": {
         "rainfall": 10,
         "t_max": 34,
         "t_min": 25,
         "rh_max": 81,
         "rh_min": 48,
         "wind_speed": 15,
         "wind_direction": 201,
         "cloud_cover": 8
      },
      "11-07-2024": {
         "rainfall": 3,
         "t_max": 35,
         "t_min": 26,
         "rh_max": 80,
         "rh_min": 48,
         "wind_speed": 16,
         "wind_direction": 202,
         "cloud_cover": 7
      },
      "12-07-2024": {
         "rainfall": 4,
         "t_max": 35,
         "t_min": 26,
         "rh_max": 77,
         "rh_min": 44,
         "wind_speed": 14,
         "wind_direction": 204,
         "cloud_cover": 6
      },
      "13-07-2024": {
         "rainfall": 2,
         "t_max": 35,
         "t_min": 26,
         "rh_max": 74,
         "rh_min": 44,
         "wind_speed": 10,
         "wind_direction": 202,
         "cloud_cover": 6
      },
      "14-07-2024": {
         "rainfall": 12,
         "t_max": 34,
         "t_min": 25,
         "rh_max": 77,
         "rh_min": 43,
         "wind_speed": 10,
         "wind_direction": 153,
         "cloud_cover": 7
      }
   },
   "names_of_crops": [
      "ଚାଉଳ",
      "ଝୋଟ",
      "ଆଖୁ",
      "ପନିପରିବା",
      "ମତ୍ସ୍ଯ଼ଚାଷ",
      "ପଶୁପାଳନ"
   ],
   "general_advisory": "ଖରିଫ ଧାନ ଚାଷ ପାଇଁ ଭଲ ଗୁଣବତ୍ତା ବିଶିଷ୍ଟ ମଞ୍ଜି ବ୍ଯ଼ବହାର କରନ୍ତୁ, ଯେପରିକି-ମଧ୍ଯ଼ମ ଜମି ପାଇଁ-ସାଲାଣ୍ଡି, କଳିଙ୍ଗଧନ-1301, ପ୍ରତୀକ୍ଷା (120-130 ଦିନ), ଅଗଭୀର ମଧ୍ଯ଼ମ ଜମି ପାଇଁ-ସ୍ୱର୍ଣ୍ଣ, ରାଣୀଧନ, ମୃଣାଲିନୀ, ଏମଟିଯ଼ୁ-1140, କଳିଙ୍ଗଧନ 1401, ନିମ୍ନ ଜମି ପାଇଁ-କଳିଙ୍ଗଧନ 1502, କାଲଚମ୍ପା, କଳିଙ୍ଗଧନ-1501, ସିଆର-1009 (140-145 ଦିନ), ବନ୍ଯ଼ା ପ୍ରଭାବିତ ଅଞ୍ଚଳ ପାଇଁ-ସୁବର୍ଣ୍ଣ ଉପ 1, ସିଆର-1009 ଉପ 1।",
   "crops_data": {
      "rice": {
         "advisory": [
            "ପ୍ରଚଳିତ ପାଣିପାଗ ସ୍ଥିତି ଧାନରେ ନର୍ସରୀ ପର୍ଯ୍ଯ଼ାଯ଼ରେ ବିଏଲବି ଏବଂ ବିସ୍ଫୋରଣର ସମ୍ଭାବନାକୁ ବୃଦ୍ଧି କରିପାରେ ତେଣୁ ଟ୍ରାଇସାଇକ୍ଲାଜୋଲ୍ @1g ଲି କିମ୍ବା ପ୍ଲାଣ୍ଟୋମାଇସିନ୍ @1 ଗ୍ରାମ/ଲି ସୁପାରିଶ କରାଯାଏ |",
            "ଖରିଫ ଚାଉଳ ପାଇଁ ଭଲ ଭାବେ ଦଳି ହୋଇଥିବା ନର୍ସରୀ ଶଯ୍ଯ଼ା ପ୍ରସ୍ତୁତ କରନ୍ତୁ। ପ୍ରତି କିଲୋଗ୍ରାମ ମଞ୍ଜି ପିଛା 1 ଗ୍ରାମ ପ୍ଲାଣ୍ଟୋମାଇସିନ୍ ସହିତ କାର୍ବେନଡାଜିମ୍ @2 ଗ୍ରାମ ସହିତ ବୀଜ ଚିକିତ୍ସା ପରେ ପୂର୍ବ-ଉତ୍ପାଦିତ ମଞ୍ଜି ବୁଣିବା ଉଚିତ।"
         ]
      },
      "jute": {
         "advisory": [
            "ବର୍ତ୍ତମାନର ବର୍ଷା ପାଗ ସେମିଲୋପର୍, ବିହାରୀ ହେଯ଼ାର କ୍ଯ଼ାଟର୍ପିଲାର୍ ଏବଂ ଅନ୍ଯ଼ାନ୍ଯ଼ ପତ୍ର ଫିଡର୍ ପରି କୀଟପତଙ୍ଗ ଆକ୍ରମଣ ପାଇଁ ଅନୁକୂଳ | ଏହି କୀଟପତଙ୍ଗକୁ ନିଯ଼ନ୍ତ୍ରଣ କରିବା ପାଇଁ, ଲାମ୍ବା ସାଇହାଲୋଥ୍ରିନ୍ 4.9CS @250 ମିଲି/ଏକର ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "sugarcane": {
         "advisory": [
            "ମଧ୍ଯ଼ମ ଏବଂ ବିଳମ୍ବ ଅବଧି କିସମଗୁଡ଼ିକରେ ଫସଲ 4 ରୁ 5 ମାସ ପୁରୁଣା ହେବା ପରେ ରାପିଙ୍ଗ୍ ଏବଂ ପ୍ରୋପିଙ୍ଗ୍ କରାଯିବା ଉଚିତ୍ |",
            "ଆଖୁ ପତ୍ରର ଶୀଘ୍ର ଛେଦକକୁ ନିଯ଼ନ୍ତ୍ରଣ କରିବା ପାଇଁ ଫିପ୍ରୋନିଲ 5ଏସସି @400 ମିଲି/ଏକରର ସ୍ପ୍ରେ କରିବା ପାଇଁ ପରାମର୍ଶ ଦିଆଯାଇଛି।"
         ]
      },
      "vegetables": {
         "advisory": [
            "ୱିଲ୍ଟ୍କୁ ରୋକିବା ପାଇଁ, ଅନ୍ଯ଼ାନ୍ଯ଼ ଫଙ୍ଗାଲ୍ ଏବଂ ବ୍ଯ଼ାକ୍ଟେରିଆ ରୋଗଗୁଡିକ ମୁଖ୍ଯ଼ କ୍ଷେତରେ ଟେବୁକୋନାଜୋଲ୍ @1 ମିଲି/ଲି ପାଣି ସହିତ ପ୍ଲାଣ୍ଟୋମାଇସିନ୍ @1g ଲି ପାଣି ପ୍ରତିରୋପଣର 7 ଦିନ ପୂର୍ବରୁ ନର୍ସରୀ ଚିକିତ୍ସା ଭାବରେ ସୁପାରିଶ କରାଯାଏ |",
            "ପ୍ରଚଳିତ ପାଣିପାଗ ସ୍ଥିତି ବାଇଗଣ ଏବଂ ବାଇଗଣରେ ମିଳି ବଗ୍କୁ ବୃଦ୍ଧି କରିପାରେ ଯାହା ଥାଇମେଥୋକ୍ସାମ୍ର ଏହି ସିଞ୍ଚନକୁ ନିଯ଼ନ୍ତ୍ରଣ କରିପାରିବ | 0.40 ଗ୍ରାମ୍/ଲି.",
            "ବାଇଗଣରେ ଫଳ ଏବଂ ଶୁଟ୍ ଛେଦକକୁ ନିଯ଼ନ୍ତ୍ରଣ କରିବା ପାଇଁ, ଟମାଟୋ ଏବଂ ଓକ୍ରା ନିମ୍ବ ଆଧାରିତ କୀଟନାଶକକୁ ପ୍ରାରମ୍ଭିକ ପର୍ଯ୍ଯ଼ାଯ଼ରେ 1500 ପିପିଏମ @600ml ଏକରରେ ସ୍ପ୍ରେ କରନ୍ତୁ। ପରେ ସ୍ପିନୋସାଦ୍ 45 ଏସ୍. ସି. <ଆଇ. ଡି. 2> ଏକର କିମ୍ବା ଇମାମେକ୍ଟିନ୍ ବେନ୍ଜୋଏଟ୍ @<ଆଇ. ଡି. 1> ଗ୍ରାମ୍/ଏକର ଏବଂ <ଆଇ. ଡି. 3> ଲିଟର ପାଣିର ବିକଳ୍ପ ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "pisciculture": {
         "advisory": [
            "ରୋହୁ, କାଟଲା ଏବଂ ମୃଗାଲ୍ ପରି କାର୍ପ, ଯାହା ଦ୍ରୁତ ଗତିରେ ବଢିଥାଏ, ଲାଭ ବୃଦ୍ଧି ପାଇଁ 4:3:3 ର ଏକ ନିର୍ଦ୍ଦିଷ୍ଟ ଅନୁପାତରେ ଷ୍ଟକ୍ କରାଯିବା ଉଚିତ୍ |",
            "ସାଧାରଣତଃ, ହେକ୍ଟର ପିଛା 5,000 ଫିଙ୍ଗରଲିଙ୍ଗର ଘନତ୍ୱ ଏକ ମାନକ ଷ୍ଟକିଂ ଭାବରେ ରଖାଯାଏ |",
            "ଚିନାବାଦାମ ତେଲ କେକ୍ ଏବଂ ଚାଉଳ ଚୋପା ଷ୍ଟକିଂ ସାମଗ୍ରୀର ମୋଟ ବାଯ଼ୋମାସର 5 ପ୍ରତିଶତ ଅନୁପାତରେ ସମାନ ଅନୁପାତରେ ଦିଆଯାଏ | ପୁଷ୍କରିଣୀର ଗୁଣବତ୍ତା ବୃଦ୍ଧି ପାଇଁ ଗୋବର, ଯ଼ୁରିଆ ଏବଂ ସୁପରଫସଫେଟ୍ ପ୍ରଯ଼ୋଗ କରାଯିବା ଉଚିତ। 8-10 ମାସରେ, ମାଛମାନେ ସେମାନଙ୍କର ବିପଣନ ଯୋଗ୍ଯ଼ ଆକାରରେ ପହଞ୍ଚନ୍ତି |"
         ]
      },
      "livestock": {
         "advisory": [
            "ଯଦି ପଶୁମାନଙ୍କୁ ଏପର୍ଯ୍ଯ଼ନ୍ତ ଏଫ୍. ଏମ୍. ଡି., ରକ୍ତସ୍ରାବଜନିତ ସେପ୍ଟିସେମିଆ, ବ୍ଲାକ୍ କ୍ୱାର୍ଟର୍, ଏଣ୍ଟେରୋଟକ୍ସିମିଆ ଇତ୍ଯ଼ାଦି ବିରୁଦ୍ଧରେ ଟୀକାକରଣ କରାଯାଇ ନାହିଁ, ତେବେ ଏଗୁଡ଼ିକ କରିବା ଆବଶ୍ଯ଼କ |",
            "ପଶୁମାନଙ୍କୁ ନିଯ଼ମିତ ଭାବରେ ଲୁଣ ସହିତ ଏକ ଖଣିଜ ମିଶ୍ରଣ ଦିଆଯିବା ଉଚିତ ଏବଂ ପଶୁମାନଙ୍କ ଶକ୍ତି ଆବଶ୍ଯ଼କତାକୁ ପୂରଣ କରିବା ପାଇଁ ଶୀତ ଋତୁରେ ଦୈନିକ ରାସନରେ ଗହମ ଶସ୍ଯ଼, ଗୁଡ଼ ଇତ୍ଯ଼ାଦି ଯୋଗାଇ ଦିଆଯାଇପାରେ |"
         ]
      }
   },
   "date": "09-07-2024"
}