{
   "weather_details": {
      "14-08-2024": {
         "rainfall": 5,
         "t_max": 34,
         "t_min": 26,
         "rh_max": 84,
         "rh_min": 51,
         "wind_speed": 13,
         "wind_direction": 207,
         "cloud_cover": 6
      },
      "15-08-2024": {
         "rainfall": 6,
         "t_max": 35,
         "t_min": 27,
         "rh_max": 87,
         "rh_min": 71,
         "wind_speed": 10,
         "wind_direction": 204,
         "cloud_cover": 6
      },
      "16-08-2024": {
         "rainfall": 6,
         "t_max": 36,
         "t_min": 27,
         "rh_max": 88,
         "rh_min": 62,
         "wind_speed": 10,
         "wind_direction": 246,
         "cloud_cover": 7
      },
      "17-08-2024": {
         "rainfall": 7,
         "t_max": 36,
         "t_min": 27,
         "rh_max": 83,
         "rh_min": 48,
         "wind_speed": 12,
         "wind_direction": 248,
         "cloud_cover": 7
      },
      "18-08-2024": {
         "rainfall": 10,
         "t_max": 35,
         "t_min": 27,
         "rh_max": 81,
         "rh_min": 49,
         "wind_speed": 11,
         "wind_direction": 236,
         "cloud_cover": 7
      }
   },
   "names_of_crops": [
      "ଚାଉଳ",
      "ଝୋଟ",
      "ଆଖୁ",
      "ପନିପରିବା",
      "ଆମ୍ବ",
      "ମତ୍ସ୍ଯ଼ଚାଷ",
      "ପଶୁପାଳନ"
   ],
   "general_advisory": "କୃଷକମାନଙ୍କୁ ସର୍ବୋତ୍ତମ ଜଳ ସ୍ତର ବଜାଯ଼ ରଖିବାକୁ ଏବଂ ଧାନ ଫସଲରେ ହଳଦିଆ ଷ୍ଟେମ ବୋରର, ଲିଫ୍ ଫୋଲଡର ଏବଂ ମିଲି ବଗ୍ର ଘଟଣା ଉପରେ ନଜର ରଖିବାକୁ ପରାମର୍ଶ ଦିଆଯାଇଛି। ବର୍ଷା ଅଭାବ ସ୍ଥିତିରେ ଧାନ ଏବଂ ପନିପରିବା ଫସଲକୁ ଜଳସେଚନ ପାଇଁ ଆବଶ୍ଯ଼କ ବ୍ଯ଼ବସ୍ଥା କରନ୍ତୁ।",
   "crops_data": {
      "rice": {
         "advisory": [
            "ଧାନ ଫସଲ ପାଇଁ ଆବଶ୍ଯ଼କ ଜଳସେଚନ ବ୍ଯ଼ବସ୍ଥା କରନ୍ତୁ।",
            "ପ୍ରଚଳିତ ଶୁଖିଲା ସ୍ପେଲ୍ ଚାଉଳ ମିଲି ବଗ୍ର ସଂକ୍ରମଣ ବୃଦ୍ଧି କରିପାରେ, ତେଣୁ ଲାମ୍ବଡା ସାଯ଼ାହାଲୋଥ୍ରିନ୍ 4.9CS @250ml ଏକରର ପତ୍ର ସ୍ପ୍ରେ ପରାମର୍ଶ ଦିଆଯାଏ |",
            "ଗତ 3 ଦିନ ମଧ୍ଯ଼ରେ କମ୍ ବର୍ଷା ଏବଂ ଉଚ୍ଚ ତାପମାତ୍ରା ହେତୁ, ଯଦି ଷ୍ଟେମ ବୋରରର କ୍ଷତି ଇ. ଟି. ଏଲ୍. ଉପରେ ଦେଖାଯାଏ, ଅର୍ଥାତ୍ ଯଥାକ୍ରମେ 5 ପ୍ରତିଶତ ମୃତ ହୃଦଯ଼ ଏବଂ 10 ପ୍ରତିଶତ ପତ୍ର କ୍ଷତି, ରାଇନାକ୍ସିପାଇର୍ 0.4 <ଆଇ. ଡି. 1> କି. ଗ୍ରା./ଏକର କିମ୍ବା ଫ୍ଲୁବେଣ୍ଡିଆମାଇଡ୍ 0.7 ଜି. 5 କି. ଗ୍ରା./ଏକରର ମୃତ୍ତିକା ପ୍ରଯ଼ୋଗ ପରାମର୍ଶ ଦିଆଯାଏ।",
            "ରୋପଣର 21 ଦିନ ମଧ୍ଯ଼ରେ ଏକର ପିଛା 16 କିଲୋଗ୍ରାମ ନାଇଟ୍ରୋଜେନ୍ ସାରର ଉପର ଡ୍ରେସିଂ କରିବାକୁ ପରାମର୍ଶ ଦିଆଯାଇଛି।",
            "ଫଳପ୍ରଦ ଆଗାଛା ପରିଚାଳନା ପାଇଁ, ରୋପଣର 15-25 ଦିନ ମଧ୍ଯ଼ରେ ସୁପାରିଶ କରାଯାଇଥିବା ବିସ୍-ପାଇରିବିକ୍ Na @80ml ଏକର ସ୍ପ୍ରେ କରନ୍ତୁ।",
            "ବର୍ତ୍ତମାନର ପାଣିପାଗ ସ୍ଥିତି ଧାନ ନର୍ସରୀ ଏବଂ ମୁଖ୍ଯ଼ କ୍ଷେତରେ ବିସ୍ଫୋରଣ ଏବଂ ଜୀବାଣୁଜନିତ ରୋଗକୁ ପସନ୍ଦ କରେ | ଯଦି ବିସ୍ଫୋରଣ ଦେଖାଯାଏ, ତେବେ 120 ଗ୍ରାମ ଟ୍ରାଇସାଇକ୍ଲାଜୋଲ 75 ପ୍ରତିଶତ ଡବ୍ଲ୍ଯ଼ୁ. ପି. ଲଗାନ୍ତୁ ଏବଂ ବ୍ଯ଼ାକ୍ଟେରିଆଲ୍ ବ୍ଲାଇଟ୍ ପାଇଁ ଏକର ପିଛା 200 ଲିଟର ପାଣିରେ 200 ଗ୍ରାମ ପ୍ଲାଣ୍ଟୋମାଇସିନ୍ ସହିତ 500 ଗ୍ରାମ କପର ଅକ୍ସିକ୍ଲୋରାଇଡ୍ 50 ପ୍ରତିଶତ ଡବ୍ଲ୍ଯ଼ୁ. ପି. ଲଗାନ୍ତୁ।"
         ]
      },
      "jute": {
         "advisory": [
            "ବୃଦ୍ଧି ବଢ଼ାଇବା ପାଇଁ ଆନ୍ତଃ-ଫସଲ ସମଯ଼ରେ ଶାଖାଗୁଡ଼ିକୁ କାଟି ଦିଅନ୍ତୁ।",
            "ବର୍ତ୍ତମାନର ବର୍ଷା ପାଗ ସେମିଲୋପର୍, ବିହାରୀ ହେଯ଼ାର କ୍ଯ଼ାଟର୍ପିଲାର୍ ଏବଂ ଅନ୍ଯ଼ାନ୍ଯ଼ ପତ୍ର ଫିଡର୍ ପରି କୀଟପତଙ୍ଗ ଆକ୍ରମଣ ପାଇଁ ଅନୁକୂଳ | ଏହି କୀଟପତଙ୍ଗକୁ ନିଯ଼ନ୍ତ୍ରଣ କରିବା ପାଇଁ ଲାମ୍ବଡା ସାଇହାଲୋଥ୍ରିନ୍ 4.9CS @250 ମିଲି/ଏକର ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "sugarcane": {
         "advisory": [
            "ଛିଦ୍ରକାରୀ-ପ୍ରଭାବିତ ଟିଲର୍ ଏବଂ ବିଳମ୍ବରେ ଗଠିତ ଟିଲର୍ଗୁଡ଼ିକୁ ବାହାର କରନ୍ତୁ, ଦୁଇ କିମ୍ବା ତିନୋଟି ସହିତ ବେତ ଅଙ୍କୁରକୁ ଆଂଶିକ ଶୁଖିଲା ତଳ ପତ୍ର ସହିତ ବାନ୍ଧି ଦିଅନ୍ତୁ |",
            "ଆଖୁରେ ଟପ୍ ସଟ୍ ବୋରରକୁ ନିଯ଼ନ୍ତ୍ରଣ କରିବା ପାଇଁ ଫିପ୍ରୋନିଲ୍ 5ଏସସି @400 ମିଲି/ଏକରର ପତ୍ର ସ୍ପ୍ରେ କରିବାକୁ ପରାମର୍ଶ ଦିଆଯାଇଛି।"
         ]
      },
      "vegetables": {
         "advisory": [
            "ନିକଟ ଅତୀତରେ ବର୍ଷା ଅଭାବ ସ୍ଥିତିରେ ବାଇଗଣ, ଲଙ୍କା, ଧନିଆ, କାକୁଡ଼ି ଏବଂ ଧନିଆ ପାଇଁ ଆବଶ୍ଯ଼କ ଜଳସେଚନ କରାଯାଇଥାଏ।",
            "ପନିପରିବା ଗଛରେ ଶୁଖିଯିବା ଏବଂ ଆଂଶିକ ଶୁଖିଯିବା ପରିଚାଳନା ପାଇଁ, ଏମ୍. ଓ. ପି. ସହିତ ନିମ କିମ୍ବା କରଞ୍ଜା କେକ୍ ଲଗାନ୍ତୁ ଏବଂ ଟେବୁକୋନଜୋଲର ପତ୍ର ସ୍ପ୍ରେ @1 ମିଲି/ଲିଟର ସୁପାରିଶ କରାଯାଇପାରେ |"
         ]
      },
      "mango": {
         "advisory": [
            "ଜୁଲାଇ ଏବଂ ଅଗଷ୍ଟ ହେଉଛି ଆମ୍ବ ରୋପଣ ପାଇଁ ଉପଯୁକ୍ତ ସମଯ଼।",
            "ଉପଯୁକ୍ତ କିସମଗୁଡ଼ିକ ହେଉଛି ଆମ୍ରପାଲି, ଦଶହେରୀ, ଚୌସା, ବାଗାନପାଲି, ତୋତାପୁରୀ, ବମ୍ବେ ଗ୍ରୀନ୍, ସୁବର୍ଣ୍ଣରେଖା, ହିମସାଗର ଇତ୍ଯ଼ାଦି |",
            "10 ମିଟର x 10 ମିଟର ଦୂରରେ ଥିବା ଗର୍ତ୍ତରେ ଚାରା ଲଗାଇବା ଉଚିତ। ଏହି ଗର୍ତ୍ତର ଆକାର 1 ମି. x 1 ମି. x 1 ମି.। ଏକ ବର୍ଷ ପୁରୁଣା ସୁସ୍ଥ ଗ୍ରାଫ୍ଟେଡ ଗଛକୁ ପସନ୍ଦ କରାଯିବା ଉଚିତ। ରୋପଣ ସମଯ଼ରେ, ଦୁଇଟି ବାସ୍କେଟ କମ୍ପୋଷ୍ଟ, 80 ଗ୍ରାମ୍ ଏନ୍, 100 ଗ୍ରାମ୍ ପି 2 ଓ 5, ଏବଂ 60 ଗ୍ରାମ୍ କେ 2 ଓ ସାର ପ୍ରଯ଼ୋଗ କରାଯିବା ଉଚିତ।"
         ]
      },
      "pisciculture": {
         "advisory": [
            "ମାଛ ଉତ୍ପାଦନ କରୁଥିବା ଏକ ବିଶ୍ୱସନୀଯ଼ ପ୍ରତିଷ୍ଠାନରୁ ଏକର ପିଛା 3000 ଫିଙ୍ଗରଲିଙ୍ଗ ସଂଗ୍ରହ କରନ୍ତୁ।",
            "ଯଦି କେହି ତିନି ପ୍ରକାରର ମାଛ ଉତ୍ପାଦନ କରିବାକୁ ଚାହାଁନ୍ତି, ତେବେ 900 ବାକୁର୍, 1200 ରୋହି ଏବଂ 900 ମିରିକାଲି ଯମଜ ଛାଡ଼ନ୍ତୁ |"
         ]
      },
      "livestock": {
         "advisory": [
            "ପଶୁମାନଙ୍କୁ ପର୍ଯ୍ଯ଼ାପ୍ତ ପରିମାଣର ପାନୀଯ଼ ଜଳ ଦିଅନ୍ତୁ।",
            "ଯଦି ପଶୁମାନଙ୍କୁ ଏପର୍ଯ୍ଯ଼ନ୍ତ ଏଫ୍. ଏମ୍. ଡି., ରକ୍ତସ୍ରାବଜନିତ ସେପ୍ଟିସେମିଆ, ବ୍ଲାକ୍ କ୍ୱାର୍ଟର୍, ଏଣ୍ଟେରୋଟକ୍ସିମିଆ ଇତ୍ଯ଼ାଦି ବିରୁଦ୍ଧରେ ଟୀକାକରଣ କରାଯାଇ ନାହିଁ, ତେବେ ଏଗୁଡ଼ିକ କରିବା ଆବଶ୍ଯ଼କ |"
         ]
      }
   },
   "date": "13-08-2024"
}