{
   "weather_details": {
      "09-10-2024": {
         "rainfall": 3,
         "t_max": 34,
         "t_min": 25,
         "rh_max": 94,
         "rh_min": 63,
         "wind_speed": 7,
         "wind_direction": 199,
         "cloud_cover": 6
      },
      "10-10-2024": {
         "rainfall": 1,
         "t_max": 34,
         "t_min": 25,
         "rh_max": 92,
         "rh_min": 56,
         "wind_speed": 10,
         "wind_direction": 207,
         "cloud_cover": 6
      },
      "11-10-2024": {
         "rainfall": 0,
         "t_max": 34,
         "t_min": 25,
         "rh_max": 94,
         "rh_min": 55,
         "wind_speed": 9,
         "wind_direction": 202,
         "cloud_cover": 5
      },
      "12-10-2024": {
         "rainfall": 0,
         "t_max": 33,
         "t_min": 24,
         "rh_max": 92,
         "rh_min": 56,
         "wind_speed": 7,
         "wind_direction": 225,
         "cloud_cover": 4
      },
      "13-10-2024": {
         "rainfall": 0,
         "t_max": 33,
         "t_min": 24,
         "rh_max": 91,
         "rh_min": 65,
         "wind_speed": 5,
         "wind_direction": 225,
         "cloud_cover": 4
      }
   },
   "names_of_crops": [
      "ଚାଉଳ",
      "ଆଖୁ",
      "ପନିପରିବା",
      "ଫଳ",
      "ମତ୍ସ୍ଯ଼ଚାଷ",
      "ପଶୁପାଳନ"
   ],
   "general_advisory": "ନିଯ଼ମିତ କ୍ଷେତ୍ର ପରିଦର୍ଶନ ଦ୍ୱାରା ବି. ପି. ଏଚ୍. ଏବଂ ଡବ୍ଲ୍ଯ଼ୁ. ବି. ପି. ଏଚ୍. ର ଜନସଂଖ୍ଯ଼ାକୁ ନିରୀକ୍ଷଣ କରନ୍ତୁ ଯଦି ପ୍ରାରମ୍ଭିକ ପର୍ଯ୍ଯ଼ାଯ଼ରେ କୀଟପତଙ୍ଗ ସଂଖ୍ଯ଼ା ବୃଦ୍ଧି ପାଇଥାଏ, ପର୍ଯ୍ଯ଼ାଯ଼କ୍ରମେ କ୍ଷେତକୁ ଶୁଖାଇବା ଏବଂ ଆର୍ଦ୍ର କରିବା ଏବଂ ନିମ୍ବ-ଆଧାରିତ ସୂତ୍ର 1500 ପିପି. ଏମ୍. (600 ମିଲି./ଏକର) ର ପତ୍ର ପ୍ରଯ଼ୋଗ ସୁପାରିଶ କରାଯାଏ। ଯଦି ଧାନ ଫସଲ ପି. ଆଇ. ପର୍ଯ୍ଯ଼ାଯ଼ରେ ଅଛି, ତେବେ 17.5 କି. ଗ୍ରା. ଯ଼ୁରିଆ ଏବଂ 12 କି. ଗ୍ରା. ଏମ୍. ଓ. ପି./ଏକର ସୁପାରିଶ କରାଯାଇଥିବା ସାରର ଦ୍ୱିତୀଯ଼ ଶୀର୍ଷ ଡ୍ରେସିଙ୍ଗ୍ ପାଇଁ ଯାଆନ୍ତୁ ଏବଂ କ୍ଷେତରେ 2-3 ସେ. ମି. ପାଣି ଛିଡ଼ା କରି ରଖନ୍ତୁ। ବୁଧବାର ପର୍ଯ୍ଯ଼ନ୍ତ ଅଳ୍ପ ପରିମାଣର ବର୍ଷା ହେବାର ସମ୍ଭାବନା ରହିଛି। ଠିଆ ହୋଇଥିବା ଫସଲ ଏବଂ ପନିପରିବା ପାଇଁ କୃଷକମାନେ ଆବଶ୍ଯ଼କ ଜଳସେଚନ ଯୋଗାଇ ପାରିବେ। କୃଷକମାନେ ସିଞ୍ଚନ କାର୍ଯ୍ଯ଼ ଜାରି ରଖିପାରିବେ।",
   "crops_data": {
      "rice": {
         "advisory": [
            "ଯଦି ଧାନ ଫସଲ ପି. ଆଇ. ପର୍ଯ୍ୟାୟରେ ଅଛି, ତେବେ 17.5 କି. ଗ୍ରା. ୟୁରିଆ ଏବଂ 12 କି. ଗ୍ରା. ଏମ୍. ଓ. ପି./ଏକର ସୁପାରିଶ କରାଯାଇଥିବା ସାରର ଦ୍ୱିତୀୟ ଶୀର୍ଷ ଡ୍ରେସିଙ୍ଗ୍ ପାଇଁ ଯାଆନ୍ତୁ ଏବଂ କ୍ଷେତରେ 2-3 ସେ. ମି. ପାଣି ଛିଡ଼ା କରି ରଖନ୍ତୁ।",
            "ପ୍ରଚଳିତ ଉଷ୍ମ ଏବଂ ଆର୍ଦ୍ର ପାଗ ଧାନରେ ସିଥ୍ ବ୍ଲାଇଟ୍ ଏବଂ ବିସ୍ଫୋରଣ ରୋଗର ଘଟଣା ବୃଦ୍ଧି କରିପାରେ ତେଣୁ ପ୍ରଯ଼ୋଗ କରନ୍ତୁ (ଟେବୁକୋନାଜୋଲ୍ 50 ପ୍ରତିଶତ + ଟ୍ରାଇଫ୍ଲୋକ୍ସିସ୍ଟ୍ରୋବିନ୍ 25 ପ୍ରତିଶତ ଡବ୍ଲୁଜି) @400g ଲିଟର ପାଣି |",
            "ଯଦି ବିଏଲବି ଘଟଣା ବୃଦ୍ଧି ପାଏ, ତା \"ହେଲେ ପ୍ଲାଣ୍ଟୋମାଇସିନ୍ ସହିତ 500 ଗ୍ରାମ୍ ପ୍ରତି ଏକରରେ କପର ଅକ୍ସିକ୍ଲୋରାଇଡ୍ ସ୍ପ୍ରେ କରନ୍ତୁ କିମ୍ବା ଏକର ପିଛା 12 କି. ଗ୍ରା. ର ଅତିରିକ୍ତ ମାତ୍ରାର ମୃତ୍ତିକା ପ୍ରଯ଼ୋଗ ସୁପାରିଶ କରାଯାଏ।",
            "ନିଯ଼ମିତ କ୍ଷେତ୍ର ପରିଦର୍ଶନ ଦ୍ୱାରା ବି. ପି. ଏଚ୍. ଏବଂ ଡବ୍ଲ୍ଯ଼ୁ. ବି. ପି. ଏଚ୍. ର ଜନସଂଖ୍ଯ଼ାକୁ ନିରୀକ୍ଷଣ କରନ୍ତୁ, ଯଦି ପ୍ରାରମ୍ଭିକ ପର୍ଯ୍ଯ଼ାଯ଼ରେ କୀଟପତଙ୍ଗ ସଂଖ୍ଯ଼ା ବୃଦ୍ଧି ପାଇଥାଏ, ପର୍ଯ୍ଯ଼ାଯ଼କ୍ରମେ କ୍ଷେତକୁ ଶୁଖାଇବା ଏବଂ ଆର୍ଦ୍ର କରିବା ଏବଂ ନିମ୍ବ ଆଧାରିତ ଫର୍ମ୍ଯ଼ୁଲେସନ୍ 1500 ପି. ପି. ଏମ୍. (ଏକର ପିଛା 600 ମି. ଲି.) ର ପତ୍ର ପ୍ରଯ଼ୋଗ ସୁପାରିଶ କରାଯାଏ।",
            "ନିଯ଼ମିତ କ୍ଷେତ୍ର ପରିଦର୍ଶନ ଦ୍ୱାରା ଡବ୍ଲୁ. ବି. ପି. ଏଚ୍. ଏବଂ ବି. ପି. ଏଚ୍. ର ଜନସଂଖ୍ଯ଼ା ସ୍ତର ଉପରେ ନଜର ରଖନ୍ତୁ।"
         ]
      },
      "sugarcane": {
         "advisory": [
            "ପ୍ରଚଳିତ ପାଣିପାଗ ସ୍ଥିତି ଆଖୁରେ ମିଳି ବଗ ଏବଂ ସ୍କେଲ୍ କୀଟପତଙ୍ଗର ସଂକ୍ରମଣ ବୃଦ୍ଧି କରିପାରେ | ଏହି କୀଟ ସିଞ୍ଚନକୁ ନିଯ଼ନ୍ତ୍ରଣ କରିବା ପାଇଁ Thiamethoxam@80g ଏକର ଏବଂ ଲାମ୍ବଡା ସାଯ଼ାହାଲୋଥ୍ରିନ୍ @4.9CS @250ml ଏକର ସୁପାରିଶ କରାଯାଇଛି।"
         ]
      },
      "vegetables": {
         "advisory": [
            "ବାଇଗଣ-ପ୍ରାରମ୍ଭିକ ପର୍ଯ୍ଯ଼ାଯ଼ରେ 1500ppm @600ml ଏକର ଜମିରେ ବାଇଗଣ ସ୍ପ୍ରେ ନିମ ଆଧାରିତ କୀଟନାଶକରେ ଫଳ ଏବଂ ଅଙ୍କୁର ଛେଦକକୁ ନିଯ଼ନ୍ତ୍ରଣ କରିବା। ଯଦି କୀଟପତଙ୍ଗ ଇ. ଟି. ଏଲ୍. ଜାରି ରଖେ, ତେବେ 15 ଦିନ ବ୍ଯ଼ବଧାନରେ ସ୍ପିନେଟୁରାମ୍ @<ଆଇ. ଡି. 1> <ଆଇ. ଡି. 2> ମିଲି/ଏକର ଏବଂ ଇମାମେକ୍ଟିନ୍ ବେନ୍ଜୋଏଟ୍ @80 ଗ୍ରାମ୍/ଏକରର ବିକଳ୍ପ ସ୍ପ୍ରେ କରନ୍ତୁ।",
            "ଓକ୍ରା-(ମେଟାଲାକ୍ସିଲ + ମାନକୋଜେବ) @400g ଏକରର ଓକ୍ରା ସିଞ୍ଚନରେ ସେରକୋସ୍ପୋରା ପତ୍ର ଦାଗକୁ ନିଯ଼ନ୍ତ୍ରଣ କରିବା ପାଇଁ ସୁପାରିସ କରାଯାଏ।",
            "କଦଳୀ ଏବଂ କଦଳୀରେ ଡାଉନ୍ ଫଙ୍ଗୁକୁ ନିଯ଼ନ୍ତ୍ରଣ କରିବା ପାଇଁ ଆଜୋକ୍ସିସ୍ଟ୍ରୋବିନ୍ @100ml ଏକର ସ୍ପ୍ରେ କରିବା ସୁପାରିସ କରାଯାଏ।"
         ]
      },
      "fruit": {
         "advisory": [
            "ନଡ଼ିଆ-ଫେରୋମୋନ୍ ଫାନ୍ଦ ରଖି ଲାଲ ପାମ୍ ୱିଭିଲ ଏବଂ ଗଣ୍ଡା ଭୃଣର କାର୍ଯ୍ଯ଼କଳାପ ଉପରେ ନଜର ରଖନ୍ତୁ | ଗଣ୍ଡାର ଭୃଣର ବିକାଶଶୀଳ ପର୍ଯ୍ଯ଼ାଯ଼କୁ ମାରିବା ପାଇଁ ନିକଟସ୍ଥ ସାର ଗର୍ତ୍ତରେ ଲାମ୍ବଡା ସାଇହାଲୋଥ୍ରିନ୍ @1.2ml/lit ପାଣି ସ୍ପ୍ରେ କରନ୍ତୁ।",
            "ପେପା-ପେପା ଲିଫ୍ କର୍ଲ ଭାଇରସର ଭେକ୍ଟର (ହ୍ୱାଇଟ୍ଫ୍ଲାଇ) କୁ ଧରିବା ପାଇଁ ହଳଦିଆ ଷ୍ଟିକି ଫାନ୍ଦ ଲଗାନ୍ତୁ। ଶ୍ୱେତ ମାଛି ନିଯ଼ନ୍ତ୍ରଣ ପାଇଁ ନିମ୍ବ ତେଲ ଗଠନ 1500 ପିପିଏମ @3ml ଲିଟର ପାଣି ଏବଂ ଫ୍ଲୋନିକାମିଡ 50 ଡବ୍ଲୁଜି @0.3g/lit ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "pisciculture": {
         "advisory": [
            "ଯଦି କ୍ରମାଗତ ବର୍ଷା ପରେ ଜଳର ତାପମାତ୍ରା, ଅକ୍ସିଜେନ, ପିଏଚ୍, କ୍ଷାରତା ହଠାତ୍ ହ୍ରାସ ପାଇବ। ଏହା ମୃତ୍ଯ଼ୁ ହାରରେ ବୃଦ୍ଧି ଏବଂ ମାଛ ପ୍ରତି ଚାପ ସୃଷ୍ଟି କରିଥାଏ, ଯାହା ରୋଗ ଜୀବାଣୁ ପ୍ରତି ସମ୍ବେଦନଶୀଳତା ସୃଷ୍ଟି କରିଥାଏ। ମୃତ୍ଯ଼ୁହାରକୁ ରୋକିବା ପାଇଁ କୃଷକମାନଙ୍କୁ ଯଥାଶୀଘ୍ର ଜଳ ପରିମାପକ ଆକଳନ କରିବାକୁ ପରାମର୍ଶ ଦିଆଯାଇଛି।",
            "ଅପରିଷ୍କାର ଆଲୁମ @30kg ଏକରକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ, ରୋଗକୁ ରୋକିବା ପାଇଁ ଆକ୍ୱା ନିମ 10X @450ml ଏକର ଏବଂ ଅକ୍ସିଜେନ O2 ଜେନ @600 ଗ୍ରାମ/ଏକର ହ୍ରାସ ପ୍ରୟୋଗ କରାଯାଇପାରିବ।"
         ]
      },
      "livestock": {
         "advisory": [
            "ଯଦି ପଶୁମାନଙ୍କୁ ଏପର୍ଯ୍ଯ଼ନ୍ତ ଏଫ୍. ଏମ୍. ଡି., ରକ୍ତସ୍ରାବଜନିତ ସେପ୍ଟିସେମିଆ, ବ୍ଲାକ୍ କ୍ୱାର୍ଟର୍, ଏଣ୍ଟେରୋଟକ୍ସିମିଆ ଇତ୍ଯ଼ାଦି ବିରୁଦ୍ଧରେ ଟୀକାକରଣ କରାଯାଇ ନାହିଁ, ତେବେ ଏଗୁଡ଼ିକ କରିବା ଆବଶ୍ଯ଼କ |",
            "ପଶୁମାନଙ୍କୁ ରୋଗ ଏବଂ କୀଟପତଙ୍ଗରୁ ରକ୍ଷା କରିବା ପାଇଁ ପୋଡ଼ାକୁ ସଫା ଏବଂ ଶୁଖିଲା ରଖନ୍ତୁ |"
         ]
      }
   },
   "date": "08-10-2024"
}