{
   "weather_details": {
      "21-09-2024": {
         "rainfall": 2,
         "t_max": 37,
         "t_min": 26,
         "rh_max": 85,
         "rh_min": 56,
         "wind_speed": 4,
         "wind_direction": 202,
         "cloud_cover": 4
      },
      "22-09-2024": {
         "rainfall": 4,
         "t_max": 36,
         "t_min": 26,
         "rh_max": 82,
         "rh_min": 57,
         "wind_speed": 4,
         "wind_direction": 105,
         "cloud_cover": 4
      },
      "23-09-2024": {
         "rainfall": 6,
         "t_max": 36,
         "t_min": 26,
         "rh_max": 87,
         "rh_min": 57,
         "wind_speed": 5,
         "wind_direction": 144,
         "cloud_cover": 6
      },
      "24-09-2024": {
         "rainfall": 7,
         "t_max": 35,
         "t_min": 25,
         "rh_max": 88,
         "rh_min": 59,
         "wind_speed": 6,
         "wind_direction": 135,
         "cloud_cover": 6
      },
      "25-09-2024": {
         "rainfall": 10,
         "t_max": 35,
         "t_min": 25,
         "rh_max": 93,
         "rh_min": 59,
         "wind_speed": 9,
         "wind_direction": 90,
         "cloud_cover": 7
      }
   },
   "names_of_crops": [
      "ଚାଉଳ",
      "କପା",
      "ପନିପରିବା ଫସଲ",
      "ଗାଈ/ମଇଁଷି"
   ],
   "general_advisory": "ବର୍ଷା ନହୋଇଥିବା କ୍ଷେତ୍ରରେ କ୍ଷେତରେ ଆବଶ୍ଯ଼କତା ଆଧାରିତ ଜଳସେଚନ କରାଯାଇଥାଏ। ବଗିଚା ଏବଂ ପନିପରିବା କ୍ଷେତରେ ଭଲ ଜଳ ନିଷ୍କାସନ ବ୍ଯ଼ବସ୍ଥା ପାଇଁ ବ୍ଯ଼ବସ୍ଥା କରନ୍ତୁ। ପ୍ରଚଳିତ ପାଣିପାଗ ସ୍ଥିତି ସମସ୍ତ ପ୍ରକାରର ଫସଲରେ କ୍ଷୁଦ୍ର କୀଟ ଆକ୍ରମଣ ପାଇଁ ଅନୁକୂଳ, ତେଣୁ ଏହାର ନିଯ଼ମିତ ତଦାରଖ ପାଇଁ ପରାମର୍ଶ ଦିଆଯିବା ଉଚିତ। କୃଷକମାନେ ଫସଲରେ ନାଇଟ୍ରୋଜେନ୍ ସାରର ଅତ୍ଯ଼ଧିକ ବ୍ଯ଼ବହାରରୁ ଦୂରେଇ ରହିବା ଉଚିତ କାରଣ ଏହା ଉଦ୍ଭିଦ ବୃଦ୍ଧି ଅବଧିକୁ ବୃଦ୍ଧି କରିପାରେ ଏବଂ ବିଭିନ୍ନ କୀଟପତଙ୍ଗକୁ ମଧ୍ଯ଼ ଆକର୍ଷିତ କରିପାରେ।",
   "crops_data": {
      "rice": {
         "advisory": [
            "ସଠିକ ବୃଦ୍ଧି ପାଇଁ କୃଷକମାନେ ଧାନ କ୍ଷେତରେ 5 ସେ. ମି. ଜଳ ସ୍ତର ବଜାଯ଼ ରଖିବା ଉଚିତ।",
            "ବ୍ଯ଼ାକ୍ଟେରିଆଲ୍ ଲିଫ୍ ବ୍ଲାଇଟ୍ ଆକ୍ରମଣ କିଛି କ୍ଷେତରେ ଦେଖାଯାଏ, ତେଣୁ ସଫା ଏବଂ ଶାନ୍ତ ପାଗରେ ଏକର ପିଛା 200 ଲିଟର ପାଣିରେ କପର ଅକ୍ସିକ୍ଲୋରାଇଡ୍ 50 ପ୍ରତିଶତ ଡବ୍ଲ୍ଯ଼ୁ. ପି. @600 ଗ୍ରାମ୍ ଏବଂ ସ୍ଟ୍ରେପ୍ଟୋସାଇକ୍ଲିନ୍ @30 ଗ୍ରାମ୍ ସିଞ୍ଚନ କରିବାକୁ ପରାମର୍ଶ ଦିଆଯିବା ଉଚିତ।",
            "କେତେକ କୃଷକଙ୍କ କ୍ଷେତରେ କେସ୍ କୃମି ଆକ୍ରମଣ ଦେଖାଯାଏ ଏବଂ ଗୁରୁତର କ୍ଷେତ୍ରରେ କୃଷକମାନଙ୍କୁ ସଫା ପାଗରେ ଏକର ପିଛା 200 ଲିଟର ପାଣି ପିଛା 400 ମିଲିଲିଟରରେ ଫିପ୍ରୋନିଲ୍ 5 ପ୍ରତିଶତ ଏସ୍. ସି. କିମ୍ବା ପ୍ରୋଫେନୋଫସ୍ 50 ପ୍ରତିଶତ ଇ. ସି. ସ୍ପ୍ରେ କରିବାକୁ ପରାମର୍ଶ ଦିଆଯାଇଛି।",
            "ପୂର୍ବ ପାଣିପାଗ ସ୍ଥିତି ଧାନ କ୍ଷେତରେ ପିତ୍ତ ମିଜ୍ ଆକ୍ରମଣ ପାଇଁ ଅନୁକୂଳ ଥିଲା, ଯେଉଁଥିପାଇଁ ଏକ ପିଆଜ୍ ପତ୍ର କିମ୍ବା ରୂପା ଶୁଟ୍ ପରି ସଂରଚନା ଗଠନ କରାଯାଏ, ତେଣୁ ଏହାର ନିୟନ୍ତ୍ରଣ ପାଇଁ କୃଷକମାନେ ଥାଇମେଥୋକ୍ସାମ୍ 25 ପ୍ରତିଶତ ଡବ୍ଲୁଜି @40 ଗ୍ରାମ୍ କିମ୍ବା ଫିପ୍ରୋନିଲ୍ 5 ପ୍ରତିଶତ ଏସ୍ସି @400 ମିଲି କିମ୍ବା କ୍ଲୋରୋପାଇରିଫୋସ୍ 20 ଇସି @500 ମିଲି ଏକର ପିଛା 200 ଲିଟର ପାଣିରେ ସଫା ଏବଂ ଶାନ୍ତ ପାଣିପାଗ ସ୍ଥିତିରେ ସ୍ପ୍ରେ କରିବା ଉଚିତ୍ |"
         ]
      },
      "cotton": {
         "advisory": [
            "କପା ଫସଲରେ ଫୁଲ ହ୍ରାସକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ, ବୀଜ ବୁଣିବା ପରେ 60-65 ଦିନ ପରେ ଏକର ପିଛା 200 ଲିଟର ପାଣିରେ 90 ମିଲି ପ୍ଲାନୋଫିକ୍ସ ଲଗାନ୍ତୁ।",
            "କପା ଫସଲରେ ଶୋଷକ କୀଟପତଙ୍ଗ (ଏଫିଡ୍, ଥ୍ରିପ୍ ଇତ୍ଯ଼ାଦି) ଆକ୍ରମଣକୁ ନିଯ଼ନ୍ତ୍ରଣ କରିବା ପାଇଁ, ନିମ୍ବ ଆଧାରିତ କୀଟନାଶକ ଯେପରିକି ନିମ୍ବ ତେଲ @600-800 ml + 200 ଗ୍ରାମ୍ ଡିଟର୍ଜେଣ୍ଟ୍ ପାଉଡରକୁ ଏକର ପିଛା 200 ଲିଟର ପାଣି ସହିତ ମିଶାଇ ବ୍ଯ଼ବହାର କରିବା ଉଚିତ |",
            "ଫୁଲ ଫୁଟିବାର ପ୍ରାରମ୍ଭିକ ପର୍ଯ୍ୟାୟରେ କୃଷକମାନେ କପା ଫସଲରେ କୌଣସି ରାସାୟନିକ ପ୍ରୟୋଗରୁ ଦୂରେଇ ରହିବା ଉଚିତ୍।"
         ]
      },
      "vegetable crops": {
         "advisory": [
            "ବାଇଗଣ, ଟମାଟୋ, ଓକ୍ରା ଆଦିରେ ଫଳ ଏବଂ ଶୁଣ୍ଠି ଛେଦକକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ ପ୍ରାରମ୍ଭିକ ପର୍ଯ୍ୟାୟରେ ଏକର ପିଛା ନିମ୍ବ ଆଧାରିତ କୀଟନାଶକ 1500 ପିପିଏମ @600ml ସିଞ୍ଚନ କରିବାକୁ ପରାମର୍ଶ ଦିଆଯିବା ଉଚିତ। ଗୁରୁତର କ୍ଷେତ୍ରରେ, 15 ଦିନର ବ୍ୟବଧାନରେ ଏକର ପିଛା ସ୍ପିନୋସାଦ୍ 45 ପ୍ରତିଶତ ଏସ୍. ସି. @70 ମିଲି ଏବଂ ଇମାମେକ୍ଟିନ୍ ବେନ୍ଜୋଏଟ୍ @80 ଗ୍ରାମ୍ ବିକଳ୍ପ ସ୍ପ୍ରେ କରିବା ପାଇଁ ପରାମର୍ଶ ଦିଆଯିବା ଉଚିତ।",
            "ଯଦି ଶୋଷକ କୀଟ ଆକ୍ରମଣ ଲକ୍ଷ୍ୟ କରାଯାଏ, ତେବେ ଥାଇମେଥୋକ୍ସାମ୍ @0.20 ଗ୍ରାମ୍ କିମ୍ବା ଇମିଡାକ୍ଲୋପ୍ରିଡ୍ @0.33 ମିଲି ଲିଟର ପ୍ରତି ପାଣି ସିଞ୍ଚନ କରିବାକୁ ପରାମର୍ଶ ଦିଆଯିବା ଉଚିତ।",
            "ୱିଲ୍ଟ, ରୁଟ୍ ରଟ୍ ଇତ୍ୟାଦି କେତେକ ରୋଗକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ କୃଷକମାନେ ବିନା ବର୍ଷା ଅବସ୍ଥାରେ ଲିଟର ପିଛା 2 ଗ୍ରାମ୍ କାର୍ବେନଡାଜିମ୍ କିମ୍ବା 3 ମିଲି ଲିଟର କପର୍ ଅକ୍ସିକୋରାଇଡ୍ ବ୍ୟବହାର କରିବା ଉଚିତ।"
         ]
      },
      "cow/buffalo": {
         "advisory": [
            "ବର୍ତ୍ତମାନ ସ୍ଥିତିରେ କେତେକ ପଶୁମାନଙ୍କଠାରେ ମାସ୍ତାଇଟିସ୍ ରୋଗ ମଧ୍ଯ଼ ଦେଖାଯାଏ, ଯେଉଁ କାରଣରୁ କ୍ଷୀର ଉତ୍ପାଦନ ଏବଂ ଗୁଣବତ୍ତା ବାଧାପ୍ରାପ୍ତ ହୋଇପାରେ, ତେଣୁ କେତେକ ପ୍ରତିଷେଧକ ତଥା ନିଯ଼ନ୍ତ୍ରଣ ପଦକ୍ଷେପ ଯେପରିକି ଆଣ୍ଟିସେପ୍ଟିକ୍ ତରଳ ପଦାର୍ଥ ସହିତ ବୁଡ଼ାଇବା ପୂର୍ବରୁ ଏବଂ ପରେ, ଉପଯୁକ୍ତ ପରିମଳ, ଓଦା ଚଟାଣକୁ ରୋକିବା, କ୍ଷୀର ଦେବା ପରେ ଟିଟ୍ ସ୍ଫିଂକ୍ଟର୍ ବନ୍ଦ କରିବା ପୂର୍ବରୁ ପଶୁମାନଙ୍କୁ ବସିବା ଏଡ଼ାଇବା ପାଇଁ ଖାଦ୍ଯ଼ ଦେବା, ବିଶ୍ରାମ ଚଟାଣରେ ଚୂନ ପ୍ରଯ଼ୋଗ ଇତ୍ଯ଼ାଦି ଏହି ରୋଗକୁ ନିଯ଼ନ୍ତ୍ରଣ କରିବା ପାଇଁ ଗ୍ରହଣ କରାଯିବା ଉଚିତ | କ୍ଷେତରେ ମଧୁର ଜଳର ଉପଲବ୍ଧତା ସୁନିଶ୍ଚିତ କରାଯିବା ଉଚିତ। ଗୁରୁତର ସ୍ଥିତିରେ, ନିକଟସ୍ଥ ପଶୁ ସ୍ୱାସ୍ଥ୍ଯ଼ କେନ୍ଦ୍ରରୁ ଡାକ୍ତରଙ୍କ ପରାମର୍ଶ ନିଅନ୍ତୁ।"
         ]
      }
   },
   "date": "20-09-2024"
}