{
   "weather_details": {
      "28-12-2024": {
         "rainfall": 0,
         "t_max": 29,
         "t_min": 15,
         "rh_max": 77,
         "rh_min": 40,
         "wind_speed": 8,
         "wind_direction": 53,
         "cloud_cover": 1
      },
      "29-12-2024": {
         "rainfall": 5,
         "t_max": 29,
         "t_min": 15,
         "rh_max": 75,
         "rh_min": 45,
         "wind_speed": 6,
         "wind_direction": 58,
         "cloud_cover": 3
      },
      "30-12-2024": {
         "rainfall": 5,
         "t_max": 28,
         "t_min": 15,
         "rh_max": 81,
         "rh_min": 47,
         "wind_speed": 7,
         "wind_direction": 39,
         "cloud_cover": 2
      },
      "31-12-2024": {
         "rainfall": 0,
         "t_max": 29,
         "t_min": 14,
         "rh_max": 78,
         "rh_min": 38,
         "wind_speed": 8,
         "wind_direction": 40,
         "cloud_cover": 1
      },
      "01-01-2025": {
         "rainfall": 0,
         "t_max": 29,
         "t_min": 13,
         "rh_max": 73,
         "rh_min": 34,
         "wind_speed": 8,
         "wind_direction": 37,
         "cloud_cover": 1
      }
   },
   "names_of_crops": [
      "ଖରିଫ ଚାଉଳ",
      "ଗ୍ରୀଷ୍ମକାଳୀନ ଚାଉଳ",
      "ମାଟି ବାଦାମ",
      "କୋଲେ ଫସଲ",
      "ପଶୁପାଳନ",
      "କୁକୁଡ଼ା ମାଂସ"
   ],
   "general_advisory": "ସେହି ଅନୁଯାୟୀ ଅମଳ, ବୁଣିବା ଏବଂ ସିଞ୍ଚନ କାର୍ଯ୍ୟ କରିବାକୁ କୃଷକମାନଙ୍କୁ ପରାମର୍ଶ ଦିଆଯାଇଛି। ଫସଲ ଏବଂ ପଶୁମାନଙ୍କୁ ଥଣ୍ଡାରୁ ରକ୍ଷା କରିବା ପାଇଁ ଉପଯୁକ୍ତ ଯତ୍ନ ନେବାର ବ୍ୟବସ୍ଥା ମଧ୍ୟ ସେମାନେ କରିବା ଉଚିତ। ସୋରିଷ, ତିଲ, ଚଣା, ଚିନାବାଦାମ, ସବୁଜ ଚଣା/କଳା ଚଣା ଇତ୍ୟାଦି ରବି ଫସଲ ବୁଣିବା ଏବଂ ଜଳସେଚନ ସୁବିଧା ଉପଲବ୍ଧ ଥିବା ଗ୍ରୀଷ୍ମ ଧାନର ନର୍ସରୀ ବୁଣିବା ଆରମ୍ଭ କରିବା।",
   "crops_data": {
      "kharif rice": {
         "advisory": [
            "ଆଗାମୀ ଦିନର ପ୍ରଥମାର୍ଦ୍ଧରେ କିଛି ବର୍ଷା ହେବାର ସମ୍ଭାବନା ରହିଛି, ତେଣୁ କୃଷକମାନଙ୍କୁ ଅମଳ କାର୍ଯ୍ୟ ପାଇଁ ଅପେକ୍ଷା କରିବାକୁ ଏବଂ ଅଧିକ କ୍ଷତି ଏଡ଼ାଇବା ପାଇଁ ଅମଳ ହୋଇଥିବା ଧାନ ଫସଲକୁ ସୁରକ୍ଷିତ ସ୍ଥାନରେ ରଖିବା ପାଇଁ ବ୍ୟବସ୍ଥା କରିବାକୁ ପରାମର୍ଶ ଦିଆଯାଇଛି।",
            "ଅସମୟ ବର୍ଷା ଯୋଗୁଁ କ୍ଷୟକ୍ଷତି ଏଡ଼ାଇବା ପାଇଁ 'ସୁପର ଗ୍ରେନ୍ ବ୍ୟାଗ୍' ବ୍ୟବହାର କରନ୍ତୁ କିମ୍ବା ଅମଳ ହୋଇଥିବା ଧାନକୁ ସଠିକ୍ ଭାବରେ ବ୍ୟାଗ୍ ଏବଂ ଷ୍ଟ୍ୟାକ୍ କରନ୍ତୁ |"
         ]
      },
      "summer rice": {
         "advisory": [
            "ଏମ୍ଟିୟୁ 1010, ଏମ୍ଟିୟୁ 1156, ଏମ୍ଟିୟୁ 1001, ଲଲାଟ, ଉନ୍ନତ ଲଲାଟ, ଚନ୍ଦନ, ସ୍ୱର୍ଣ୍ଣ ଇତ୍ୟାଦି ଉନ୍ନତ କିସମ ବ୍ୟବହାର କରି ଗ୍ରୀଷ୍ମ ଋତୁ ଧାନ ଚାଷ ପାଇଁ କୃଷକମାନେ କ୍ଷେତ୍ର ପ୍ରସ୍ତୁତି ଆରମ୍ଭ କରିବା ଉଚିତ।"
         ]
      },
      "ground nut": {
         "advisory": [
            "ଚିନାବାଦାମ ଫସଲରେ ଶୋଷକ କୀଟ ଆକ୍ରମଣ ବିରୁଦ୍ଧରେ ନିୟମିତ ତଦାରଖ କରିବାକୁ ପରାମର୍ଶ ଦିଆଯାଇଛି, ଏବଂ ଯଦି ପର୍ଯ୍ୟବେକ୍ଷଣ କରାଯାଏ, ଆଜାଦିରାକ୍ଟିନ କିମ୍ବା ନିମ-ଆଧାରିତ କୀଟନାଶକ ସିଞ୍ଚନ କରିବାକୁ ପରାମର୍ଶ ଦିଆଯାଇଛି। ଜୈବିକ ନିୟନ୍ତ୍ରଣ ପାଇଁ ହଳଦିଆ ଚଟପଟା ଫାନ୍ଦ ଏବଂ ଟ୍ରାଇକୋଗ୍ରାମ ଚିଲିନିସ୍ କାର୍ଡ ବ୍ୟବହାର କରନ୍ତୁ।"
         ]
      },
      "cole crop": {
         "advisory": [
            "ଶୀତ ଋତୁରେ ମୃତ୍ତିକାର ଆର୍ଦ୍ରତା ଏବଂ ତାପମାତ୍ରା ବଜାୟ ରଖିବା ପାଇଁ ପନିପରିବା ଫସଲରେ ମଲ୍ଚିଙ୍ଗ ସାମଗ୍ରୀ ଭାବରେ ଷ୍ଟ୍ରା ବ୍ୟବହାର କରନ୍ତୁ |",
            "ଫୁଲକୋବିରେ ଡାଇମଣ୍ଡ ବ୍ୟାକ୍ ମଥ୍ର ନିୟମିତ ନିରୀକ୍ଷଣ କରାଯିବା ଉଚିତ ଏବଂ ବର୍ଷା ପରେ ନିମ୍ବ ତେଲ କିମ୍ବା ଇମାମେକ୍ଟିନ୍ ବେନ୍ଜୋଏଟ୍ ସିଞ୍ଚନ କରିବାକୁ ପରାମର୍ଶ ଦିଆଯାଇଛି।"
         ]
      },
      "livestock": {
         "advisory": [
            "ବିଛଣା ସାମଗ୍ରୀ ଭାବରେ ଝୋଟ ବସ୍ତା ଏବଂ ନଡ଼ିଆ ବ୍ୟବହାର କରି ପଶୁମାନଙ୍କୁ ଥଣ୍ଡାରୁ ରକ୍ଷା କରନ୍ତୁ | ଗୋରୁମାନଙ୍କୁ ସ୍ୱଚ୍ଛ ପାନୀୟ ଜଳ ଯୋଗାଇଦେବା ଏବଂ ପରିଷ୍କାର ଛପର ରକ୍ଷଣାବେକ୍ଷଣ କରିବା।",
            "ରୋଗ ଏବଂ ପାକସ୍ଥଳୀ କୃମିକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ ଟୀକାକରଣ ଏବଂ କୃମି ନିବାରଣ କରାଯିବା ଉଚିତ।"
         ]
      },
      "poultry": {
         "advisory": [
            "ତାଜା ବାୟୁ ପାଇଁ କୁକୁଡ଼ା ପାଳିରେ ଉପଯୁକ୍ତ ବାୟୁ ଚଳାଚଳ ଆବଶ୍ୟକ। ଛାଞ୍ଚକୁ ଉଷ୍ମ ଏବଂ ଶୁଖିଲା ରଖିବା ପାଇଁ ବାହ୍ୟ ଉତ୍ତାପ ଉତ୍ସ ବ୍ୟବହାର କରାଯିବା ଉଚିତ।",
            "ଜଳ ଗ୍ରହଣକୁ ପ୍ରୋତ୍ସାହିତ କରିବା ପାଇଁ ଉପଯୁକ୍ତ ତାପମାତ୍ରାରେ ପାନୀୟ ଜଳ ବଜାୟ ରଖନ୍ତୁ |"
         ]
      }
   },
   "date": "27-12-2024"
}