{
   "weather_details": {
      "20-11-2024": {
         "rainfall": 0,
         "t_max": 30,
         "t_min": 12,
         "rh_max": 70,
         "rh_min": 31,
         "wind_speed": 7,
         "wind_direction": 34,
         "cloud_cover": 1
      },
      "21-11-2024": {
         "rainfall": 0,
         "t_max": 30,
         "t_min": 11,
         "rh_max": 72,
         "rh_min": 33,
         "wind_speed": 6,
         "wind_direction": 45,
         "cloud_cover": 0
      },
      "22-11-2024": {
         "rainfall": 0,
         "t_max": 30,
         "t_min": 11,
         "rh_max": 73,
         "rh_min": 33,
         "wind_speed": 6,
         "wind_direction": 43,
         "cloud_cover": 1
      },
      "23-11-2024": {
         "rainfall": 0,
         "t_max": 29,
         "t_min": 11,
         "rh_max": 68,
         "rh_min": 31,
         "wind_speed": 5,
         "wind_direction": 36,
         "cloud_cover": 0
      },
      "24-11-2024": {
         "rainfall": 0,
         "t_max": 29,
         "t_min": 11,
         "rh_max": 63,
         "rh_min": 29,
         "wind_speed": 6,
         "wind_direction": 40,
         "cloud_cover": 2
      }
   },
   "names_of_crops": [
      "ଚାଉଳ",
      "କପା",
      "ସୋରିଷ",
      "ଓକ୍ରା",
      "କୋଲେ ଫସଲ"
   ],
   "general_advisory": "ଆଗାମୀ ସପ୍ତାହରେ ପାଗ ଶୁଖିଲା ଥିବାରୁ କୃଷକମାନଙ୍କୁ ବିଭିନ୍ନ ସ୍ଥାଯ଼ୀ ଫସଲକୁ ଜଳସେଚନ ପାଇଁ ବ୍ଯ଼ବସ୍ଥା କରିବାକୁ ପରାମର୍ଶ ଦିଆଯାଇଛି। ରାତିର ତାପମାତ୍ରା କମ୍ ଏବଂ ଆର୍ଦ୍ରତା ଅଧିକ ଥିବାରୁ ଉଭଯ଼ କ୍ଷେତ ତଥା ପନିପରିବା ଫସଲରେ ବିଭିନ୍ନ ରୋଗ ସଂକ୍ରମଣ ବୃଦ୍ଧି ହେବାର ସମ୍ଭାବନା ରହିଛି, ତେଣୁ ଏହି ରୋଗଗୁଡ଼ିକ ଉପରେ ନିଯ଼ମିତ ନଜର ରଖିବା ପାଇଁ ପରାମର୍ଶ ଦିଆଯିବା ଉଚିତ। ବର୍ତ୍ତମାନର ରାତ୍ରି ତାପମାତ୍ରାକୁ ଦୃଷ୍ଟିରେ ରଖି, କୃଷକମାନଙ୍କୁ ସେମାନଙ୍କ ଫସଲ ତଥା ପଶୁମାନଙ୍କୁ ଥଣ୍ଡାରୁ ରକ୍ଷା କରିବା ପାଇଁ ଉପଯୁକ୍ତ ଯତ୍ନ ନେବାକୁ ପରାମର୍ଶ ଦିଆଯାଇଛି। ରୋଗ ପ୍ରତିରୋଧକ ଶକ୍ତି ବୃଦ୍ଧି କରିବା ଏବଂ କୌଣସି କ୍ଷତିକାରକ ରୋଗରୁ ରକ୍ଷା କରିବା ପାଇଁ ପଶୁମାନଙ୍କୁ କୃମି ଦୂରୀକରଣ ଏବଂ ଟୀକାକରଣ ପରାମର୍ଶ ଦିଆଯିବା ଉଚିତ।",
   "crops_data": {
      "rice": {
         "advisory": [
            "ଯଦି ଧାନ ପରିପକ୍ୱତା ପର୍ଯ୍ଯ଼ାଯ଼ରେ ଅଛି, ଅମଳ ପୂର୍ବରୁ କ୍ଷେତରେ ଜଳସେଚନ ବନ୍ଦ କରନ୍ତୁ |",
            "ଯେତେବେଳେ 80-85% ଶସ୍ଯ଼ ପରିପକ୍ୱ ହୋଇଯାଏ ଏବଂ ଗଛ ଫିକା ହଳଦିଆ ରଙ୍ଗର ଦେଖାଯାଏ, ସେତେବେଳେ ଗଛଗୁଡ଼ିକୁ ଅମଳ କରନ୍ତୁ।",
            "ଧାନ ଅମଳ ପରେ, 2ରୁ 3 ଦିନ ପାଇଁ କ୍ଷେତରେ ଶୁଖାନ୍ତୁ ଏବଂ ତା 'ପରେ ଅମଳ କରିବା ଉଚିତ୍। ଚାଉଳକୁ 12 ପ୍ରତିଶତ ଆର୍ଦ୍ରତା ସ୍ତରରେ ରଖିବା ଉଚିତ।",
            "ନିମ୍ନ ରାତ୍ରି ତାପମାତ୍ରା ଏବଂ ଉଚ୍ଚ ଆର୍ଦ୍ରତା ହେତୁ, ବିଳମ୍ବରେ ପରିପକ୍ୱ ହେଉଥିବା ଧାନ କିସମଗୁଡ଼ିକରେ ଫାଲ୍ସ୍ ଏବଂ ନେକ/ପେନିକଲ୍ ବିସ୍ଫୋରଣର ଅଧିକ ସମ୍ଭାବନା ରହିପାରେ, ତେଣୁ ଏହାର ନିଯ଼ମିତ ତଦାରଖ ପାଇଁ ପରାମର୍ଶ ଦିଆଯିବା ଉଚିତ।"
         ]
      },
      "cotton": {
         "advisory": [
            "କପା ଫସଲରେ ବୋଲୱର୍ମ କମ୍ପ୍ଲେକ୍ସକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ, କୃଷକମାନଙ୍କୁ ସ୍ୱଚ୍ଛ ପାଗରେ ଇମାମେକ୍ଟିନ୍ ବେନ୍ଜୋଏଟ୍ 5 ପ୍ରତିଶତ ଏସ୍ଜି କିମ୍ବା ପ୍ରୋଫେନୋଫସ୍ 50 ପ୍ରତିଶତ ଇସି ସ୍ପ୍ରେ କରିବାକୁ ପରାମର୍ଶ ଦିଆଯାଇଛି।",
            "ପରିପକ୍ୱ ଶୁଆ ଅମଳ କରିବା ପାଇଁ ପରାମର୍ଶ ଦିଆଯିବା ଉଚିତ।"
         ]
      },
      "mustard": {
         "advisory": [
            "ଘନ ରୋପଣ କ୍ଷେତ୍ରରେ ସୋରିଷରେ ସର୍ବୋତ୍ତମ ଉଦ୍ଭିଦ ସଂଖ୍ୟା ବଜାୟ ରଖିବା ପାଇଁ ଗୋଟିଏ ପତଳା ଅପରେସନ ପରାମର୍ଶ ଦିଆଯିବା ଉଚିତ |",
            "15 ରୁ 20 ଦିନ ପୁରୁଣା ଫସଲ କ୍ଷେତ୍ରରେ ହୋଇଂ ଏବଂ ଆଗାଛା ସଫା କରିବା ପାଇଁ ପରାମର୍ଶ ଦିଆଯାଇଛି।"
         ]
      },
      "okra": {
         "advisory": [
            "ଓକ୍ରାରେ ଫଳ ଏବଂ ଶୁଟ୍ ଛେଦକକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ, ପ୍ରାରମ୍ଭିକ ପର୍ଯ୍ୟାୟରେ ନିମ୍ ଆଧାରିତ କୀଟନାଶକ ସିଞ୍ଚନ କରିବାକୁ ପରାମର୍ଶ ଦିଆଯିବା ଉଚିତ। ଗୁରୁତର କ୍ଷେତ୍ରରେ, 15 ଦିନର ବ୍ୟବଧାନରେ ସ୍ପିନୋସାଦ୍ ଏବଂ ଇମାମେକ୍ଟିନ୍ ବେନ୍ଜୋଏଟ୍ର ବିକଳ୍ପ ସ୍ପ୍ରେ ପରାମର୍ଶ ଦିଆଯିବା ଉଚିତ।",
            "ପରିପକ୍ୱ ଫସଲ ଅମଳ ପାଇଁ ପରାମର୍ଶ ଦିଆଯିବା ଉଚିତ।"
         ]
      },
      "cole crop": {
         "advisory": [
            "ନର୍ସରୀ ଶଯ୍ୟା 3 ମିଟର ଲମ୍ବ, 1 ମିଟର ଚଉଡ଼ା ଏବଂ 15-20 ସେ. ମି. ଉଚ୍ଚତା ସହିତ ପ୍ରସ୍ତୁତ ହେବା ଉଚିତ୍।",
            "ବୁଣିବା ପୂର୍ବରୁ, ପ୍ରତ୍ୟେକ ନର୍ସରୀ ଶଯ୍ୟାରେ ଭଲ ଭାବେ ସଙ୍କୁଚିତ ଏଫ୍. ୱାଇ. ଏମ୍. ଏବଂ କ୍ଲୋରପାଇରିଫୋସ୍ ଧୂଳି ଲଗାଇବାକୁ ପରାମର୍ଶ ଦିଆଯିବା ଉଚିତ।",
            "ଫୁଲକୋବିରେ ଡାଇମଣ୍ଡ ବ୍ଯ଼ାକ୍ ମଥ୍ର ଆକ୍ରମଣ ବିରୁଦ୍ଧରେ ନିଯ଼ମିତ ତଦାରଖ କରିବାକୁ ପରାମର୍ଶ ଦିଆଯିବା ଉଚିତ, ଏବଂ ଯଦି ସମ୍ଭବ, କୃଷକମାନେ ଏହି ଉଦ୍ଦେଶ୍ଯ଼ରେ କ୍ଷେତରେ ଫେରୋମୋନ୍ ଟ୍ରାପ୍ ବ୍ଯ଼ବହାର କରିବା ଉଚିତ୍ |"
         ]
      }
   },
   "date": "19-11-2024"
}