{
   "weather_details": {
      "15-06-2024": {
         "rainfall": 2,
         "t_max": 42,
         "t_min": 28,
         "rh_max": 56,
         "rh_min": 20,
         "wind_speed": 21,
         "wind_direction": 214,
         "cloud_cover": 5
      },
      "16-06-2024": {
         "rainfall": 0,
         "t_max": 42,
         "t_min": 27,
         "rh_max": 45,
         "rh_min": 22,
         "wind_speed": 22,
         "wind_direction": 248,
         "cloud_cover": 4
      },
      "17-06-2024": {
         "rainfall": 0,
         "t_max": 40,
         "t_min": 26,
         "rh_max": 52,
         "rh_min": 20,
         "wind_speed": 20,
         "wind_direction": 252,
         "cloud_cover": 4
      },
      "18-06-2024": {
         "rainfall": 3,
         "t_max": 39,
         "t_min": 26,
         "rh_max": 76,
         "rh_min": 27,
         "wind_speed": 19,
         "wind_direction": 236,
         "cloud_cover": 6
      },
      "19-06-2024": {
         "rainfall": 5,
         "t_max": 38,
         "t_min": 25,
         "rh_max": 70,
         "rh_min": 40,
         "wind_speed": 20,
         "wind_direction": 257,
         "cloud_cover": 7
      }
   },
   "names_of_crops": [
      "ଖରିଫ ଚାଉଳ",
      "କପା",
      "ପନିପରିବା ଫସଲ",
      "ଗାଈ/ମଇଁଷି",
      "କୁକୁଡ଼ା ମାଂସ"
   ],
   "general_advisory": "ଆଇଏମଡିର ବର୍ଦ୍ଧିତ ପରିସୀମା ପୂର୍ବାନୁମାନ ଅନୁଯାଯ଼ୀ, ବର୍ଷା ସ୍ୱାଭାବିକ ଏବଂ 2024 ଜୁନ୍ 19 ରୁ 25 ମଧ୍ଯ଼ରେ ଓଡ଼ିଶା ରାଜ୍ଯ଼ରେ ଉଭଯ଼ ସର୍ବାଧିକ ଏବଂ ସର୍ବନିମ୍ନ ତାପମାତ୍ରା ସ୍ୱାଭାବିକ ରହିବ ବୋଲି ଆଶା କରାଯାଉଛି ଏବଂ ଆଗାମୀ ସପ୍ତାହର ଦ୍ୱିତୀଯ଼ାର୍ଦ୍ଧରେ ଦକ୍ଷିଣ ପଶ୍ଚିମ ମୌସୁମୀ ଆରମ୍ଭ ହେବାର ସମ୍ଭାବନା ରହିଛି, ଖରିଫ ଫସଲ ଚାଷ ଦିଗରେ କୃଷକମାନଙ୍କୁ ଆବଶ୍ଯ଼କ ପଦକ୍ଷେପ ନେବାକୁ ପରାମର୍ଶ ଦିଆଯାଇଛି। ପ୍ରଚଳିତ ପାଣିପାଗ ସ୍ଥିତି ସମସ୍ତ ପ୍ରକାରର ଫସଲରେ କ୍ଷୁଦ୍ର କୀଟ ଆକ୍ରମଣ ପାଇଁ ଅନୁକୂଳ, ତେଣୁ ଏହାର ନିଯ଼ମିତ ତଦାରଖ ପାଇଁ ପରାମର୍ଶ ଦିଆଯିବା ଉଚିତ।",
   "crops_data": {
      "kharif rice": {
         "advisory": [
            "ଆଗାମୀ ସପ୍ତାହର ଦ୍ୱିତୀଯ଼ାର୍ଦ୍ଧରେ କିଛି ପରିମାଣର ବର୍ଷା ସହିତ ମୌସୁମୀ ଆରମ୍ଭ ହେବାର ସମ୍ଭାବନା ଥିବାରୁ ଧାନ ନର୍ସରୀ ବୁଣିବା ପାଇଁ ଜମି ପ୍ରସ୍ତୁତ କରିବାକୁ କୃଷକମାନଙ୍କୁ ପରାମର୍ଶ ଦିଆଯାଇଛି।",
            "କେତେକ ଉନ୍ନତ ଧାନ କିସମ ଯଥା-ଖଣ୍ଡଗିରି, ସହଭାଗି ଧାନ, ମନ୍ଦାକିନୀ, ନବୀନ ଇତ୍ଯ଼ାଦି ଉଚ୍ଚଭୂମି ପାଇଁ, ଏମ୍. ଟି. ଯ଼ୁ. 1156, ଏମ୍. ଟି. ଯ଼ୁ. 1153, ଲଲାଟ, ଉନ୍ନତ ଲଲାଟ, ଏମ୍. ଟି. ଯ଼ୁ.-1001, ଏମ୍. ଟି. ଯ଼ୁ.-1010 ମଧ୍ଯ଼ମ ଜମି ପାଇଁ ଏବଂ ପୂଜା, ପ୍ରତୀକ୍ଷା, ସ୍ୱର୍ଣ୍ଣ, ସ୍ୱର୍ଣ୍ଣ ସବ୍-1, ମୃଣାଲିନୀ, ହାସନ୍ତ, ରାଣୀ ଧନ, ଏମ୍. ଟି. ଯ଼ୁ.-1064 ଇତ୍ଯ଼ାଦି ନିମ୍ନ ଭୂମି ଅବସ୍ଥା ପାଇଁ ସୁପାରିଶ କରାଯିବା ଉଚିତ। ଗବେଷଣା କେନ୍ଦ୍ର, କେ. ଭି. କେ., କୃଷି କାର୍ଯ୍ଯ଼ାଳଯ଼ ଇତ୍ଯ଼ାଦି ଯେକୌଣସି ପ୍ରାମାଣିକ ଉତ୍ସରୁ ଏହି ମଞ୍ଜି କିଣାଯିବା ଉଚିତ।",
            "ବୁଣିବା ପୂର୍ବରୁ, କାର୍ବେଣ୍ଡାଜିମ୍ 50 ପ୍ରତିଶତ ଡବ୍ଲ୍ଯ଼ୁ. ପି. @2 ଗ୍ରାମ୍/କି. ଗ୍ରା. ମଞ୍ଜି କିମ୍ବା ଟ୍ରାଇକୋଡର୍ମା @10 ଗ୍ରାମ୍/କି. ଗ୍ରା. ମଞ୍ଜି ସହିତ ମଞ୍ଜି ଚିକିତ୍ସା କରାଯିବା ଉଚିତ।"
         ]
      },
      "cotton": {
         "advisory": [
            "କୃଷକମାନେ କପା ଚାଷ ପାଇଁ ଜମି ପ୍ରସ୍ତୁତି ଆରମ୍ଭ କରିବା ଉଚିତ।",
            "ବିହନ ଦରଃ ଏକର ପିଛା 800-1500 ଗ୍ରାମ୍।",
            "ବୀଜ ଚିକିତ୍ସାଃ ବୁଣିବା ପୂର୍ବରୁ, ଶୋଷକ କୀଟପତଙ୍ଗରୁ ସୁରକ୍ଷା ପାଇଁ ଇମିଡାକ୍ଲୋପ୍ରିଡ୍ 70 ଡବ୍ଲୁଜି @7 ଗ୍ରାମ୍/କେଜି ମଞ୍ଜି ସହିତ ମଞ୍ଜି ଚିକିତ୍ସା କରାଯିବା ଉଚିତ।"
         ]
      },
      "vegetable crops": {
         "advisory": [
            "ସମଯ଼ ସମଯ଼ରେ ମେଘୁଆ ଏବଂ ଉଜ୍ୱଳ ପରିସ୍ଥିତି ପନିପରିବା ଫସଲରେ କୀଟ ଆକ୍ରମଣକୁ ଶୋଷିବା ପାଇଁ ଅନୁକୂଳ, ତେଣୁ ଏହାର ନିଯ଼ମିତ ତଦାରଖ ପାଇଁ ପରାମର୍ଶ ଦିଆଯିବା ଉଚିତ। ଯଦି ସେହି କୀଟପତଙ୍ଗମାନଙ୍କର ଆକ୍ରମଣ ଲକ୍ଷ୍ଯ଼ କରାଯାଏ, ତେବେ ପ୍ରତି ଲିଟର ପାଣିରେ 25 ପ୍ରତିଶତ ଡବ୍ଲୁ. ଜି. @<ଆଇ. ଡି. 1> କିମ୍ବା ଇମିଡାକ୍ଲୋପ୍ରିଡ୍ <ଆଇ. ଡି. 3> ଏସ୍. ଏଲ୍. @<ଆଇ. ଡି. 2> ସିଞ୍ଚନ କରିବା ଉଚିତ।",
            "ଆଗାମୀ ଦିନରେ ବର୍ଷା ହେବାର ସମ୍ଭାବନା ଥିବାରୁ କୃଷକମାନଙ୍କୁ ସିଞ୍ଚନ କାର୍ଯ୍ଯ଼ କରିବା ସମଯ଼ରେ ଉପଯୁକ୍ତ ଯତ୍ନ ନେବାକୁ ପରାମର୍ଶ ଦିଆଯାଇଛି।"
         ]
      },
      "cow/buffalo": {
         "advisory": [
            "ଏଫ୍. ଏମ୍. ଡି., ଏଚ୍. ଏସ୍. ଏବଂ ବି. କ୍ଯ଼ୁ. ବିରୁଦ୍ଧରେ ପଶୁମାନଙ୍କର କୃମି ଦୂରୀକରଣ ଏବଂ ଟୀକାକରଣ ସୁନିଶ୍ଚିତ କରାଯିବା ଉଚିତ କାରଣ ମୌସୁମୀ ଆରମ୍ଭ ହେବା ସହିତ (ବର୍ଷା ଋତୁରେ) ଏହା ପଶୁମାନଙ୍କ ମଧ୍ଯ଼ରେ ଦ୍ରୁତ ଗତିରେ ବ୍ଯ଼ାପିଥାଏ।"
         ]
      },
      "poultry": {
         "advisory": [
            "ବର୍ଷା ଋତୁରେ, ଦିନରେ ପାର୍ଶ୍ୱ ପର୍ଦାର ଶୀର୍ଷରେ 1 ରୁ 2 ଫୁଟ ଖୋଲିବାକୁ ଅନୁମତି ଦେଇ ଉପଯୁକ୍ତ ଭେଣ୍ଟିଲେସନ୍ ନିଶ୍ଚିତ କରିବାକୁ ବ୍ଯ଼ବସ୍ଥା କରନ୍ତୁ ଏବଂ ଖାଲି ସେଡର ପାର୍ଶ୍ୱ କାନ୍ଥ ସମ୍ପୂର୍ଣ୍ଣ ପଲିଥିନ୍ ପର୍ଦ୍ଦା ଦ୍ୱାରା ଆଚ୍ଛାଦିତ ହେବା ଉଚିତ୍ | କୀଟପତଙ୍ଗ ଆକ୍ରମଣକୁ ଏଡ଼ାଇବା ପାଇଁ ସେଡ୍ ଚାରିପାଖରେ ଡ୍ରେନେଜ୍ ଗର୍ତ୍ତ ସଫା ହେବା ଉଚିତ ଏବଂ ଛାତରେ ପାର୍ଶ୍ୱ ଓଭରହାଙ୍ଗଗୁଡିକ ସର୍ବନିମ୍ନ 3 ରୁ 4 ଫୁଟ ହେବା ଉଚିତ ଯାହା ସିଧାସଳଖ ବର୍ଷା ଜଳ ସେଡ୍ ଭିତରକୁ ପ୍ରବେଶ କରିବ ନାହିଁ |",
            "ରାଣୀଖେତ୍ ରୋଗ ବିରୁଦ୍ଧରେ କୁକୁଡ଼ା ପକ୍ଷୀଙ୍କ କୃମି ଦୂରୀକରଣ ଏବଂ ଟୀକାକରଣ ନିଶ୍ଚିତ କରାଯିବା ଆବଶ୍ଯ଼କ।"
         ]
      }
   },
   "date": "14-06-2024"
}