{
   "weather_details": {
      "13-08-2024": {
         "rainfall": 0,
         "t_max": 36,
         "t_min": 28,
         "rh_max": 93,
         "rh_min": 59,
         "wind_speed": 9,
         "wind_direction": 0,
         "cloud_cover": 0
      },
      "14-08-2024": {
         "rainfall": 5,
         "t_max": 34,
         "t_min": 27,
         "rh_max": 90,
         "rh_min": 59,
         "wind_speed": 9,
         "wind_direction": 242,
         "cloud_cover": 7
      },
      "15-08-2024": {
         "rainfall": 4,
         "t_max": 36,
         "t_min": 27,
         "rh_max": 92,
         "rh_min": 69,
         "wind_speed": 12,
         "wind_direction": 248,
         "cloud_cover": 6
      },
      "16-08-2024": {
         "rainfall": 6,
         "t_max": 36,
         "t_min": 27,
         "rh_max": 93,
         "rh_min": 84,
         "wind_speed": 10,
         "wind_direction": 225,
         "cloud_cover": 6
      },
      "17-08-2024": {
         "rainfall": 6,
         "t_max": 36,
         "t_min": 28,
         "rh_max": 87,
         "rh_min": 73,
         "wind_speed": 11,
         "wind_direction": 243,
         "cloud_cover": 6
      },
      "18-08-2024": {
         "rainfall": 7,
         "t_max": 35,
         "t_min": 28,
         "rh_max": 90,
         "rh_min": 67,
         "wind_speed": 9,
         "wind_direction": 236,
         "cloud_cover": 8
      }
   },
   "names_of_crops": [
      "ଚାଉଳ",
      "ମକା",
      "ପନିପରିବା ଫସଲ",
      "କଦଳୀ",
      "ଗାଈ/ମଇଁଷି"
   ],
   "general_advisory": "ପୂର୍ବ ସପ୍ତାହ ତୁଳନାରେ ଆଗାମୀ ଦିନରେ ବୃଷ୍ଟିପାତର ପରିମାଣ ହ୍ରାସ ଏବଂ ତାପମାତ୍ରା ବୃଦ୍ଧି ହେବାର ସମ୍ଭାବନା ରହିଛି, ତେଣୁ କୃଷକମାନଙ୍କୁ ଫସଲ କ୍ଷେତରେ ଆବଶ୍ଯ଼କତା ଆଧାରିତ ଜଳସେଚନ କରିବାକୁ ପରାମର୍ଶ ଦିଆଯାଇଛି। ଯେତେବେଳେ ସ୍ୱାଭାବିକ ପବନର ବେଗ ସହିତ ଆକାଶ ସ୍ୱଚ୍ଛ ଥାଏ, ସେତେବେଳେ ବିନା ବର୍ଷା ଅବସ୍ଥାରେ କୀଟନାଶକ ଏବଂ ତୃଣନାଶକ ସିଞ୍ଚନ କରାଯିବା ଉଚିତ। ପ୍ରଚଳିତ ପାଣିପାଗ ସ୍ଥିତି ବିଭିନ୍ନ ରୋଗ ପାଇଁ ଅନୁକୂଳ ଏବଂ ବିଭିନ୍ନ ଫସଲରେ କୀଟପତଙ୍ଗ ଆକ୍ରମଣ କରନ୍ତି ତେଣୁ ଏହାର ନିଯ଼ମିତ ତଦାରଖ କରିବାକୁ ପରାମର୍ଶ ଦିଆଯିବା ଉଚିତ | କୌଣସି ଶୁଖିଲା ଋତୁରେ ଭବିଷ୍ଯ଼ତରେ ବ୍ଯ଼ବହାର ପାଇଁ ବ୍ଯ଼ାପକ ଏବଂ ଉନ୍ନତ ବନ୍ଧ ତିଆରି କରି ବର୍ଷା ଜଳକୁ ସଂରକ୍ଷଣ କରିବାକୁ କୃଷକମାନଙ୍କୁ ପରାମର୍ଶ ଦିଆଯାଇଛି।",
   "crops_data": {
      "rice": {
         "advisory": [
            "25-30 ଦିନର ପୁରୁଣା ଚାରା ଗୁଡ଼ିକର ପ୍ରତିରୋପଣ ଅଗଭୀର ଗଭୀରତାରେ 20x15 ସେ. ମି. ବ୍ଯ଼ବଧାନରେ ପୂର୍ବରୁ ପ୍ରସ୍ତୁତ ହୋଇଥିବା ଜମିରେ କରାଯିବା ଉଚିତ। ଅଧିକ ଉତ୍ପାଦନକ୍ଷମ ପ୍ରଜାତି ପାଇଁ ପ୍ରତି ପାହାଡ଼ରେ ମାତ୍ର 2ରୁ 3ଟି ଚାରା ବ୍ଯ଼ବହାର କରନ୍ତୁ। ହାଇବ୍ରିଡ୍ ପାଇଁ ପ୍ରତି ପାହାଡ଼ରେ 1ରୁ 2 ଚାରା ବ୍ଯ଼ବହାର କରନ୍ତୁ। ଉତ୍ତମ ଉଦ୍ଭିଦ ବୃଦ୍ଧି ପାଇଁ ଧାନ କ୍ଷେତରେ 5 ସେ. ମି. ଜଳ ରଖନ୍ତୁ।",
            "ଯ଼ୁରିଆ ସାରର ପ୍ରଥମ ଟପ୍ ଡ୍ରେସିଂ ପ୍ରତିରୋପଣର 20-25 ଦିନ ପରେ ପ୍ରଯ଼ୋଗ କରିବାକୁ ପରାମର୍ଶ ଦିଆଯିବା ଉଚିତ୍।",
            "ଆଗାଛାକୁ ନିଯ଼ନ୍ତ୍ରଣ କରିବା ପାଇଁ, ଘାସ ବାହାରିବାର କିଛି ଦିନ ପରେ (କିମ୍ବା ଯେତେବେଳେ ଆଗାଛା 2-3 ପତ୍ର ସ୍ତରରେ ଥାଏ) 4 କିଲୋଗ୍ରାମ ବାଲିରେ 4 କିଲୋଗ୍ରାମର ଦରରେ ଗ୍ରାନୁଲାର ହର୍ବିସାଇଡ୍ ବେନ୍ସଲ୍ଫୁରନ୍ ମିଥାଇଲ 0.6% + ପ୍ରିଟିଲାକ୍ଲୋର 6 ପ୍ରତିଶତ ଜିଆର ମିଶାନ୍ତୁ କିମ୍ବା 16 ଲିଟର କ୍ଷମତା ବିଶିଷ୍ଟ ସ୍ପ୍ରେଯ଼ରର 8ଟି ଟ୍ଯ଼ାଙ୍କରେ ଏକର ପିଛା 120 ମିଲିଲିଟର୍ ଦରରେ ବିସ୍ପିରିବାକ୍ ସୋଡ଼ିଅମ 10 ପ୍ରତିଶତ ଏସ୍. ସି. ଲଗାନ୍ତୁ।",
            "ବ୍ରାଉନ୍ ସ୍ପଟ୍ କ୍ଷେତ୍ରରେ, ପ୍ରୋପିକୋନାଜୋଲ୍ 25ଇସି (ଟିଲ୍ଟ/ଜେରୋକ୍ସ/ଧାନ/ବମ୍ପର) @1 ମିଲି କିମ୍ବା ମାନକୋଜେବ୍ 75 ଡବ୍ଲ୍ଯ଼ୁ. ପି. କିମ୍ବା କାର୍ବେଣ୍ଡାଜିମ୍ 64 ପ୍ରତିଶତ + ମାନକୋଜେବ୍ 8 ପ୍ରତିଶତ 75 ଡବ୍ଲ୍ଯ଼ୁ. ପି. (ସାଫ୍/ସେଫ/ସରାଫା) ଲିଟର ପିଛା 1.5 ଗ୍ରାମ୍ ପାଣି ସିଞ୍ଚନ କରିବା ଉଚିତ।",
            "କାଣ୍ଡ ଛେଦକ ଏବଂ ପତ୍ର ଫୋଲଡର ସଂକ୍ରମଣ ଉପରେ ନଜର ରଖିବା ପାଇଁ ଧାନ କ୍ଷେତରେ ଏକର ପିଛା 3ଟି ଫେରୋମୋନ୍ ଫାନ୍ଦ ରଖନ୍ତୁ। ଯେତେବେଳେ ପୁରୁଷ ପତଙ୍ଗ/ଫାନ୍ଦ ସଂଖ୍ଯ଼ା 4 କିମ୍ବା 5ରେ ପହଞ୍ଚିବ, ସେତେବେଳେ ଏକର ପିଛା 800 ମି. ଲି. ରେ ଆଜାଦିରାକ୍ଟିନ ଇ. ସି. ଲଗାନ୍ତୁ କିମ୍ବା ଏକର ପିଛା 4 କି. ଗ୍ରା. ରେ କ୍ଲୋରାଣ୍ଟ୍ରାନିଲିପ୍ରୋଲେ.......................................................................।"
         ]
      },
      "maize": {
         "advisory": [
            "ମକା ଫସଲରେ କାଣ୍ଡ ଛେଦକ ଆକ୍ରମଣକୁ ନିଯ଼ନ୍ତ୍ରଣ କରିବା ପାଇଁ, ସ୍ୱଚ୍ଛ ପାଣିପାଗ ପରିସ୍ଥିତିରେ ଲିଟର ପିଛା 0.40 ଗ୍ରାମ୍ ଇମାମେକ୍ଟିନ୍ ବେନ୍ଜୋଏଟ୍ କିମ୍ବା କ୍ଲୋରାଣ୍ଟ୍ରାନିଲିପ୍ରୋଲେ 18.5% ଏସ୍ସି @0.3 ମିଲି ପାଣି ସିଞ୍ଚନ କରିବାକୁ ପରାମର୍ଶ ଦିଆଯିବା ଉଚିତ।"
         ]
      },
      "vegetable crops": {
         "advisory": [
            "ପ୍ରଚଳିତ ପାଣିପାଗ ସ୍ଥିତି ବିଭିନ୍ନ ରୋଗ ଏବଂ ପନିପରିବା ଫସଲରେ କୀଟ ଆକ୍ରମଣ ପାଇଁ ଅନୁକୂଳ, ତେଣୁ ଏହାର ନିଯ଼ମିତ ତଦାରଖ ପାଇଁ ପରାମର୍ଶ ଦିଆଯିବା ଉଚିତ।",
            "ଯଦି ଶୋଷକ କୀଟ ଆକ୍ରମଣ ଲକ୍ଷ୍ଯ଼ କରାଯାଏ, ତେବେ ଥାଇମେଥୋକ୍ସାମ୍ @0.20 ଗ୍ରାମ୍ କିମ୍ବା ଇମିଡାକ୍ଲୋପ୍ରିଡ୍ @0.33 ମିଲି ଲିଟର ପ୍ରତି ପାଣି ସିଞ୍ଚନ କରିବାକୁ ପରାମର୍ଶ ଦିଆଯିବା ଉଚିତ।",
            "ୱିଲ୍ଟ, ରୁଟ୍ ରଟ୍ ଇତ୍ଯ଼ାଦି ଭଳି କେତେକ ରୋଗକୁ ନିଯ଼ନ୍ତ୍ରଣ କରିବା ପାଇଁ କୃଷକମାନେ ବିନା ବର୍ଷା ଅବସ୍ଥାରେ ଲିଟର ପିଛା କାର୍ବେନଡାଜିମ୍ @2 ଗ୍ରାମ୍ କିମ୍ବା କପର୍ ଅକ୍ସିକ୍ଲୋରାଇଡ୍ @3 ମିଲି ବ୍ଯ଼ବହାର କରିବା ଉଚିତ।"
         ]
      },
      "banana": {
         "advisory": [
            "ଅତୀତର ପାଣିପାଗ ସ୍ଥିତି (ଉଚ୍ଚ ଆର୍ଦ୍ରତା/ଆର୍ଦ୍ରତା ଏବଂ ଉଚ୍ଚ ପବନର ବେଗ) ଛିଡ଼ା ହୋଇଥିବା କଦଳୀ ଫସଲରେ ବିଭିନ୍ନ ସଂକ୍ରାମକ ରୋଗ ବିସ୍ତାର କରିବା ପାଇଁ ଅନୁକୂଳ, ଯେପରିକି ସିଗାଟୋକା କିମ୍ବା କଳା ପତ୍ର ଷ୍ଟ୍ରିକ୍, ମୂଳ କ୍ଷଯ଼, ପତ୍ର ସ୍ପଟ୍ ଇତ୍ଯ଼ାଦି, ତେଣୁ ଏହାର ନିଯ଼ମିତ ନିରୀକ୍ଷଣ ପରାମର୍ଶ ଦିଆଯିବା ଉଚିତ |"
         ]
      },
      "cow/buffalo": {
         "advisory": [
            "ଏଫ୍. ଏମ୍. ଡି., ଏଚ୍. ଏସ୍., ବି. କ୍ଯ଼ୁ., ଏଣ୍ଟେରୋକ୍ସେମିଆ ଇତ୍ଯ଼ାଦି ବିରୁଦ୍ଧରେ ପଶୁମାନଙ୍କର କୃମି ଦୂରୀକରଣ ଏବଂ ଟୀକାକରଣ ସୁନିଶ୍ଚିତ କରାଯିବା ଉଚିତ। ବର୍ତ୍ତମାନର ଅବସ୍ଥାରେ କେତେକ ପଶୁମାନଙ୍କଠାରେ ମାସ୍ତାଇଟିସ୍ ରୋଗ ମଧ୍ଯ଼ ଦେଖାଯାଏ, ଯେଉଁ କାରଣରୁ ଦୁଗ୍ଧ ଉତ୍ପାଦନ ଏବଂ ଗୁଣବତ୍ତା ବାଧାପ୍ରାପ୍ତ ହୋଇପାରେ, ତେଣୁ ଏହି ରୋଗକୁ ନିଯ଼ନ୍ତ୍ରଣ କରିବା ପାଇଁ କେତେକ ପ୍ରତିଷେଧକ ତଥା ନିଯ଼ନ୍ତ୍ରଣ ପଦକ୍ଷେପ ଯଥା ଆଣ୍ଟିସେପ୍ଟିକ୍ ତରଳ ପଦାର୍ଥ ସହିତ ବୁଡ଼ାଇବା ପୂର୍ବରୁ ଏବଂ ପରେ, ଉପଯୁକ୍ତ ପରିମଳ, ଓଦା ଚଟାଣକୁ ରୋକିବା, କ୍ଷୀର ଦୋଇବା ସମଯ଼ରେ ଏବଂ ଠିକ୍ ପରେ ଖୁଆଇବା, ଟିଟ୍ ସ୍ଫିଂକ୍ଟର୍ ବନ୍ଦ କରିବା ପୂର୍ବରୁ ପଶୁମାନଙ୍କୁ ବସିବା ଏଡ଼ାଇବା ପାଇଁ, ବିଶ୍ରାମ ଚଟାଣରେ ଚୂନ ଲଗାଇବା, ସକାଳେ ଏବଂ ସନ୍ଧ୍ଯ଼ାରେ 1 ଲିଟର ପାଣିରେ 2 ଲେମ୍ବୁ ଏବଂ 200 ଗ୍ରାମ୍ ଚିନି ମିଶ୍ରଣ ପ୍ରଦାନ କରିବା ଇତ୍ଯ଼ାଦି ଗ୍ରହଣ କରାଯିବା ଉଚିତ। କ୍ଷେତରେ ମଧୁର ଜଳର ଉପଲବ୍ଧତା ସୁନିଶ୍ଚିତ କରାଯିବା ଉଚିତ।"
         ]
      }
   },
   "date": "13-08-2024"
}