{
   "weather_details": {
      "30-10-2024": {
         "rainfall": 5,
         "t_max": 30,
         "t_min": 22,
         "rh_max": 95,
         "rh_min": 62,
         "wind_speed": 3,
         "wind_direction": 90,
         "cloud_cover": 6
      },
      "31-10-2024": {
         "rainfall": 3,
         "t_max": 30,
         "t_min": 23,
         "rh_max": 94,
         "rh_min": 61,
         "wind_speed": 3,
         "wind_direction": 168,
         "cloud_cover": 6
      },
      "01-11-2024": {
         "rainfall": 1,
         "t_max": 30,
         "t_min": 23,
         "rh_max": 93,
         "rh_min": 54,
         "wind_speed": 3,
         "wind_direction": 173,
         "cloud_cover": 5
      },
      "02-11-2024": {
         "rainfall": 0,
         "t_max": 31,
         "t_min": 22,
         "rh_max": 91,
         "rh_min": 49,
         "wind_speed": 3,
         "wind_direction": 164,
         "cloud_cover": 4
      },
      "03-11-2024": {
         "rainfall": 0,
         "t_max": 31,
         "t_min": 22,
         "rh_max": 88,
         "rh_min": 41,
         "wind_speed": 2,
         "wind_direction": 154,
         "cloud_cover": 4
      }
   },
   "names_of_crops": [
      "ଧାନ।",
      "କପା",
      "ସୋରିଷ",
      "ତୋରିଆ",
      "ଅରହର",
      "ସଂକର ମକା",
      "ବାଇଗଣ",
      "ଲଙ୍କା",
      "ଗୋରୁ ଏବଂ ମଇଁଷି",
      "ଛେଳି ଏବଂ ମେଣ୍ଢା",
      "କୁକୁଡ଼ା ମାଂସ"
   ],
   "general_advisory": "ଆଇଏମଡିରୁ ମିଳିଥିବା ଉପରୋକ୍ତ ପାଞ୍ଚ ଦିନିଆ ପାଣିପାଗ ପୂର୍ବାନୁମାନ ଆଧାରରେ, କୃଷକମାନଙ୍କୁ ଆଗାମୀ 2 ରୁ 3 ଦିନ ପାଇଁ ଜଳସେଚନ ଏବଂ ରାସାଯ଼ନିକ ସିଞ୍ଚନ ବନ୍ଦ କରିବାକୁ ପରାମର୍ଶ ଦିଆଯାଇଛି। ଲଙ୍କା, ଟମାଟୋ, ପିଆଜ୍, କୋଲ୍ ଫସଲ ଏବଂ ବାଇଗଣ ଇତ୍ଯ଼ାଦି ପନିପରିବା ନର୍ସରୀକୁ ପ୍ଲାଷ୍ଟିକ୍ କିମ୍ବା ପଲିଥିନ୍ ଚାଦରରେ ଢାଙ୍କି ବର୍ଷାରୁ ରକ୍ଷା କରନ୍ତୁ | ପରିପକ୍ୱ ହୋଇଥିବା ପନିପରିବା ଏବଂ ଡାଲି ଅମଳ କରନ୍ତୁ ଏବଂ ଏକ ସୁରକ୍ଷିତ ସ୍ଥାନରେ ଷ୍ଟୋର୍ କରନ୍ତୁ | ରବି ଫସଲ ପାଇଁ କ୍ଷେତ ପ୍ରସ୍ତୁତି ଆରମ୍ଭ କରାଯିବା ଉଚିତ। ବନ୍ଧ, କେନାଲ, ଚାଷ ନହୋଇଥିବା କ୍ଷେତ ଏବଂ ପଡ଼ିଆ ରାସ୍ତାଗୁଡ଼ିକୁ ଆଗାଛା ବାହାର କରି ସଫା କରାଯିବା ଉଚିତ। ସୋରିଷ, ସାରସନ୍, ସୂର୍ଯ୍ଯ଼ମୁଖୀ, କ୍ଷେତ ମଟର, ଗାଜର, ମୂଳା ଇତ୍ଯ଼ାଦି ବୁଣିବା ପାଇଁ ବର୍ତ୍ତମାନ ଉପଯୁକ୍ତ ସମଯ଼ | ତେଣୁ କୃଷକମାନଙ୍କୁ ସେହି ଅନୁଯାଯ଼ୀ କାର୍ଯ୍ଯ଼ କରିବାକୁ ପରାମର୍ଶ ଦିଆଯାଇଛି। ଡାଲି/କଳା ଚଣା/ସବୁଜ ଚଣା ଭଳି ଡାଲି ଗୁଡ଼ିକୁ ଅମଳ କରିବାର ଏକ ସପ୍ତାହ ପୂର୍ବରୁ ଠିଆ ହୋଇଥିବା ପରିପକ୍ୱ ଫସଲ (ଧାନ) ରେ ପ୍ରସାରଣ କରାଯାଇପାରିବ, ଯାହାଦ୍ୱାରା ଉପଯୁକ୍ତ ଅଞ୍ଚଳରେ ମାଟିରେ ଅବଶିଷ୍ଟ ଆର୍ଦ୍ରତାର ଉପଯୋଗ କରାଯାଇପାରିବ। ସ୍ୱଚ୍ଛ ପାଗ ସମଯ଼ରେ ଫୁଲକୋବି, ବନ୍ଧାକୋବି, ବ୍ରୋକୋଲି, ଟମାଟୋ ଇତ୍ଯ଼ାଦି ପରିପକ୍ୱ ଚାରା (35-40 ଦିନ ପୁରୁଣା) ଉଠାଯାଇଥିବା ଶଯ୍ଯ଼ାରେ ରୋପଣ କରିବାକୁ କୃଷକମାନଙ୍କୁ ପରାମର୍ଶ ଦିଆଯାଇଛି।",
   "crops_data": {
      "paddy": {
         "advisory": [
            "ଶୀଘ୍ର ପରିପକ୍ୱ ହେଉଥିବା କିସମଗୁଡ଼ିକରେ, ଫସଲ ଅମଳ କରନ୍ତୁ ଯେତେବେଳେ 80 -85% ଶସ୍ଯ଼ ହାତ ଦ୍ୱାରା ହାତୁଡ଼ି ଦ୍ୱାରା କିମ୍ବା କମ୍ବାଇନ୍ ହାରଭେଷ୍ଟର କିମ୍ବା ରିପ୍ପର୍ ବ୍ଯ଼ବହାର କରି ପରିପକ୍ୱ ହୁଏ | ବ୍ଯ଼ବହାର ଉଦ୍ଦେଶ୍ଯ଼ରେ ଧାନ ଶସ୍ଯ଼କୁ 14 ପ୍ରତିଶତ ଆର୍ଦ୍ରତା ପର୍ଯ୍ଯ଼ନ୍ତ ସୂର୍ଯ୍ଯ଼ାଲୋକରେ ଶୁଖାଇବା ଆବଶ୍ଯ଼କ ଏବଂ ଉନ୍ନତ ସ୍ୱଯ଼ଂ-ଜୀବନ ପାଇଁ ବୀଜ ଉଦ୍ଦେଶ୍ଯ଼ରେ ଏହାକୁ 12 ପ୍ରତିଶତ ଆର୍ଦ୍ରତା ପର୍ଯ୍ଯ଼ନ୍ତ ଶୁଖାଇବା ଆବଶ୍ଯ଼କ।",
            "ଦକ୍ଷିଣ-ପଶ୍ଚିମ ମୌସୁମୀ ବାଯ଼ୁ ପୂର୍ବରୁ ଓଡ଼ିଶାରୁ ପ୍ରତ୍ଯ଼ାହାର କରିନେଇଛି। ଯେହେତୁ ଅଧିକାଂଶ ଅଞ୍ଚଳରେ ଫସଲ ପ୍ରଜନନ ପର୍ଯ୍ଯ଼ାଯ଼ରେ ଅଛି, ଅନୁପୂରକ ଜଳସେଚନ ପ୍ରଦାନ କରିବାକୁ ଚେଷ୍ଟା କରନ୍ତୁ | ଯଦି ସମ୍ଭବ, କେ. ଏନ୍. ଓ. 3 @5 ଗ୍ରାମ୍/ଲିଟର ଜଳ କିମ୍ବା ଜଳରେ ଦ୍ରବଣୀଯ଼ ସାର ଯେପରିକି <ଆଇ. ଡି. 2> 5 ଗ୍ରାମ୍/ଲିଟର ଜଳରେ କିମ୍ବା <ଆଇ. ଡି. 1> 5 ଗ୍ରାମ୍/ଲିଟର ଜଳରେ ଅଜକ଼ବିକ ଚାପ ପ୍ରତି ଉଦ୍ଭିଦର ପ୍ରତିରୋଧକୁ ଉନ୍ନତ କରିବା ପାଇଁ ପତ୍ର ସ୍ପ୍ରେ ପ୍ରଯ଼ୋଗ କରନ୍ତୁ।"
         ]
      },
      "cotton": {
         "advisory": [
            "ରାସାଯ଼ନିକ ନିଯ଼ନ୍ତ୍ରଣ ପାଇଁ, ଅଣ-ବି. ଟି. କପା ଅଞ୍ଚଳରେ ଆମେରିକୀଯ଼ ବୋଲୱର୍ମକୁ ନିଯ଼ନ୍ତ୍ରଣ କରିବା ପାଇଁ 10 ଲିଟର ପାଣି ସହିତ ଏମାମେକ୍ଟିନ୍ ବେନ୍ଜୋଏଟ୍ 5 ପ୍ରତିଶତ ଏସ୍. ଜି. @4ଜି କିମ୍ବା ପ୍ରୋଫେନୋଫସ୍ 50 ପ୍ରତିଶତ ଇ. ସି. @30 ମିଲି. ମିଶ୍ରଣ କରନ୍ତୁ।",
            "ବ୍ୟାକ୍ଟେରିଆଲ୍ ଲିଫ୍ ବ୍ଲାଇଟ୍ଃ ନିୟନ୍ତ୍ରଣ ପଦକ୍ଷେପ ଭାବରେ ଷ୍ଟ୍ରେପ୍ଟୋସାଇକ୍ଲିନ୍ 1.5 ଗ୍ରାମ୍ + କପର ଅକ୍ସିକ୍ଲୋରାଇଡ୍ 50 ପ୍ରତିଶତ ଡବ୍ଲ୍ୟୁ. ପି. @25 ଗ୍ରାମ୍ ପ୍ରତି 10 ଲିଟର ପାଣି ଲଗାନ୍ତୁ।",
            "ଧୂସର ଫଙ୍ଗୁର ସଂକ୍ରମଣକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ 10 ଲିଟର ପାଣିରେ କପର୍ ଅକ୍ସିକ୍ଲୋରାଇଡ୍ 25 ଗ୍ରାମ୍ + ପ୍ଲାଣ୍ଟୋମାଇସିନ୍ 10 ଗ୍ରାମ୍ ମିଶାଇ ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "mustard": {
         "advisory": [
            "ଅକ୍ଟୋବର ମଧ୍ଯ଼ଭାଗରୁ ନଭେମ୍ବର ମଧ୍ଯ଼ଭାଗ ପର୍ଯ୍ଯ଼ନ୍ତ ବୁଣିବା ପାଇଁ ଉପଯୁକ୍ତ ସମଯ଼। ବୀଜ ବୁଣିବା ପୂର୍ବରୁ ଥିରମ୍ @2.5g/kg କିମ୍ବା ବାଭିଷ୍ଟିନ୍ @2 ଗ୍ରାମ୍/କେଜି ମଞ୍ଜି ବ୍ଯ଼ବହାର କରନ୍ତୁ।",
            "ସୋରିଷର ବିହନ ହାର ଏକର ପିଛା 2.5-3 କି. ଗ୍ରା. ଏବଂ ତୋରିଆ ପାଇଁ ଏକର ପିଛା 1.5-2.0 କି. ଗ୍ରା.।",
            "ଉପଯୁକ୍ତ କିସମଃ ସୋରିଷ-ପୁସା ବୋଲ୍ଡ, ପୁସା ଜୟକିସାନ, ଜେଡି-6। ତୋରିଆ-ଏମ୍ 29, ଅନୁରାଧା, ପାର୍ବତୀ।"
         ]
      },
      "toria": {
         "advisory": [
            "ଅକ୍ଟୋବର ମଧ୍ଯ଼ଭାଗରୁ ନଭେମ୍ବର ମଧ୍ଯ଼ଭାଗ ପର୍ଯ୍ଯ଼ନ୍ତ ବୁଣିବା ପାଇଁ ଉପଯୁକ୍ତ ସମଯ଼। ବୀଜ ବୁଣିବା ପୂର୍ବରୁ ଥିରମ୍ @2.5g/kg କିମ୍ବା ବାଭିଷ୍ଟିନ୍ @2 ଗ୍ରାମ୍/କେଜି ମଞ୍ଜି ବ୍ଯ଼ବହାର କରନ୍ତୁ।",
            "ସୋରିଷର ବିହନ ହାର ଏକର ପିଛା 2.5-3 କି. ଗ୍ରା. ଏବଂ ତୋରିଆ ପାଇଁ ଏକର ପିଛା 1.5-2.0 କି. ଗ୍ରା.।",
            "ଉପଯୁକ୍ତ କିସମଃ ସୋରିଷ-ପୁସା ବୋଲ୍ଡ, ପୁସା ଜୟକିସାନ, ଜେଡି-6। ତୋରିଆ-ଏମ୍ 29, ଅନୁରାଧା, ପାର୍ବତୀ।"
         ]
      },
      "arhar": {
         "advisory": [
            "ଲିଫ୍ ୱେବର୍/ଲିଫ୍ ଫୋଲ୍ଡର୍/ଡିଫୋଲିଏଟର୍ଃ ଏହି ପର୍ଯ୍ଯ଼ାଯ଼ରେ ଏହି କୀଟପତଙ୍ଗ ଦେଖିବାକୁ ମିଳିପାରେ। ନିଯ଼ନ୍ତ୍ରଣ ପାଇଁ ପ୍ରୋଫେନୋଫସ୍ 50 ପ୍ରତିଶତ ଇସି କିମ୍ବା କ୍ଲୋରପାଇରିଫସ୍ 50 ପ୍ରତିଶତ + ସାଇପର୍ମେଥ୍ରିନ୍ 5 ପ୍ରତିଶତ ଇସି @2 ମିଲି/ଲିଟର @2 ମିଲି/ଲିଟର ପାଣି ସ୍ପ୍ରେ କରନ୍ତୁ।",
            "ପୋଡ୍ ବୋରର୍ଃ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ, ନିମ୍ବ-ଆଧାରିତ କୀଟନାଶକ ଆଜାଦିରାକ୍ଟିନ୍ 0.03% (300 ପିପିଏମ୍) @5 ମିଲି/ଲିଟର ଜଳ ପ୍ରୟୋଗ କରନ୍ତୁ।"
         ]
      },
      "hybrid maize": {
         "advisory": [
            "ଆମେରିକୀଯ଼ କୋବ୍ ବୋରର୍ଃ ଆମେରିକୀଯ଼ କୋବ୍ ବୋରର୍ ସଂକ୍ରମଣକୁ ନିଯ଼ନ୍ତ୍ରଣ କରିବା ପାଇଁ 10 ଲିଟର ପାଣି ସହିତ ଫ୍ଲୁବେଣ୍ଡିଆମାଇଡ୍ 39.35% SC @4 ମିଲି ମିଶାନ୍ତୁ।"
         ]
      },
      "brinjal": {
         "advisory": [
            "ଛେଦକ କୀଟ ଉପରେ ନଜର ରଖିବା ପାଇଁ, କୃଷକମାନଙ୍କୁ ଏକର ପିଛା 8 ହାରରେ ଫେରୋମୋନ୍ ଫାନ୍ଦ ବ୍ଯ଼ବହାର କରିବାକୁ ପରାମର୍ଶ ଦିଆଯାଇଛି। ରାସାଯ଼ନିକ ନିଯ଼ନ୍ତ୍ରଣ ପାଇଁ, ସ୍ପିନୋସାଦ୍ 45 ପ୍ରତିଶତ ଏସ୍. ସି. @1.5 ମିଲି/4 ଲିଟର ପାଣି କିମ୍ବା ଏମାମେକ୍ଟିନ୍ ବେନ୍ଜୋଏଟ୍ 5 ପ୍ରତିଶତ ଏସ୍. ଜି. @4 ଗ୍ରାମ୍/10 ଲିଟର ପାଣି କିମ୍ବା ଥିଓଡିକାର୍ବ 75 ପ୍ରତିଶତ ଡବ୍ଲ୍ଯ଼ୁ. ପି. @2 ମିଲି/ଲିଟର ପାଣି ସିଞ୍ଚନ କରନ୍ତୁ।"
         ]
      },
      "chilli": {
         "advisory": [
            "ଥ୍ରୀପ୍ସର ସଂକ୍ରମଣ ପରିଲକ୍ଷିତ ହୋଇଛି। ଯଦି ପତ୍ରଗୁଡ଼ିକ ଉପରକୁ ଘୁଞ୍ଚିଯାଏ ତେବେ ଗଛଗୁଡ଼ିକ ଥ୍ରୀପ୍ ଦ୍ୱାରା ପ୍ରଭାବିତ ହୁଅନ୍ତି |",
            "ଥ୍ରିପ୍ସ ସଂକ୍ରମଣକୁ ପରିଚାଳନା କରିବା ପାଇଁ ବ୍ଲୁ ଷ୍ଟିକି ଟ୍ରାପ୍ @8 nos./acre ସ୍ଥାପନ କରନ୍ତୁ। ରାସାଯ଼ନିକ ନିଯ଼ନ୍ତ୍ରଣ ପାଇଁ ଇମାମେକ୍ଟିନ୍ ବେନ୍ଜୋଏଟ୍ 5 ପ୍ରତିଶତ ଏସ୍. ଜି. @4 ଗ୍ରାମ/ଲିଟର କିମ୍ବା ଫିପ୍ରୋନିଲ୍ 5 ପ୍ରତିଶତ ଏସ୍. ସି. @2 ମିଲି/ଲିଟର କିମ୍ବା ଇମିଡାକ୍ଲୋପ୍ରିଡ୍ <ଆଇ. ଡି. 1> ଏସ୍. ଏଲ୍. 0.35 ମିଲି/ଲିଟର ପାଣି ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "cattle & buffalo": {
         "advisory": [
            "ନିଯ଼ମିତ ବ୍ଯ଼ବଧାନରେ ଗୋରୁ ଏବଂ ମଇଁଷିକୁ କୃମି ମୁକ୍ତ କରନ୍ତୁ ଏବଂ ସେମାନଙ୍କୁ ଟୀକାକରଣ ମଧ୍ଯ଼ କରନ୍ତୁ। 4 ବର୍ଷ ପରେ ମଧ୍ଯ଼ ଯଦି ପଶୁଟି ଗରମ ହେଉନାହିଁ, ତେବେ ପଶୁ ଚିକିତ୍ସକଙ୍କ ସହ ପରାମର୍ଶ କରନ୍ତୁ ଏବଂ ଯୌବନ ଆରମ୍ଭ କରିବା ପାଇଁ ଡାକ୍ତରଙ୍କ ପରାମର୍ଶ ଅନୁସରଣ କରନ୍ତୁ।"
         ]
      },
      "goat & sheep": {
         "advisory": [
            "ନିର୍ଜଲୀକରଣ, ଉତ୍ତାପ ଚାପ ଏବଂ ପରଜୀବୀ ସଂକ୍ରମଣର ଲକ୍ଷଣ ପାଇଁ ନିୟମିତ ଭାବରେ ପଶୁମାନଙ୍କୁ ଯାଞ୍ଚ କରନ୍ତୁ | ଆବଶ୍ୟକ ଅନୁଯାୟୀ କୃମି ପଶୁମାନଙ୍କୁ ଛାଡ଼ନ୍ତୁ ଏବଂ ସେମାନଙ୍କୁ ପାଦ ଏବଂ ପାଟି ରୋଗ, ପିପିଆର ପରି ସାଧାରଣ ରୋଗ ବିରୁଦ୍ଧରେ ଟୀକାକରଣ କରନ୍ତୁ |"
         ]
      },
      "poultry": {
         "advisory": [
            "କୁକୁଡ଼ା ଘରେ ଉଠାଯାଇଥିବା ପ୍ଲାଟଫର୍ମ ଏବଂ ଗଭୀର ଆବର୍ଜନା ବ୍ଯ଼ବସ୍ଥା ସ୍ୱଚ୍ଛତା ଏବଂ ତାପମାତ୍ରା ନିଯ଼ନ୍ତ୍ରଣ ବଜାଯ଼ ରଖିବାରେ ସାହାଯ୍ଯ଼ କରେ | ବର୍ଷା ପରେ ଅତ୍ଯ଼ଧିକ ଆର୍ଦ୍ରତା ପରିସ୍ଥିତିରେ ଜୀବାଣୁ ସୃଷ୍ଟି ନହେବା ପାଇଁ ନିଯ଼ମିତ ଭାବରେ ଘରକୁ ସଫା ଏବଂ ଜୀବାଣୁମୁକ୍ତ କରନ୍ତୁ | ଚାପ ହ୍ରାସ କରିବା ଏବଂ ଅତ୍ଯ଼ଧିକ ଉତ୍ତାପକୁ ରୋକିବା ପାଇଁ ଉପଯୁକ୍ତ ଷ୍ଟକିଂ ଘନତ୍ୱ ବଜାଯ଼ ରଖନ୍ତୁ |"
         ]
      }
   },
   "date": "29-10-2024"
}