{
   "weather_details": {
      "18-01-2025": {
         "rainfall": 0,
         "t_max": 27,
         "t_min": 12,
         "rh_max": 73,
         "rh_min": 26,
         "wind_speed": 4,
         "wind_direction": 175,
         "cloud_cover": 3
      },
      "19-01-2025": {
         "rainfall": 0,
         "t_max": 27,
         "t_min": 12,
         "rh_max": 66,
         "rh_min": 24,
         "wind_speed": 2,
         "wind_direction": 166,
         "cloud_cover": 2
      },
      "20-01-2025": {
         "rainfall": 0,
         "t_max": 27,
         "t_min": 12,
         "rh_max": 62,
         "rh_min": 27,
         "wind_speed": 2,
         "wind_direction": 127,
         "cloud_cover": 3
      },
      "21-01-2025": {
         "rainfall": 0,
         "t_max": 28,
         "t_min": 13,
         "rh_max": 66,
         "rh_min": 24,
         "wind_speed": 2,
         "wind_direction": 166,
         "cloud_cover": 3
      },
      "22-01-2025": {
         "rainfall": 0,
         "t_max": 28,
         "t_min": 13,
         "rh_max": 66,
         "rh_min": 24,
         "wind_speed": 2,
         "wind_direction": 166,
         "cloud_cover": 2
      }
   },
   "names_of_crops": [
      "ଧାନ।",
      "ଅରହର",
      "ଗ୍ରୀନଗ୍ରାମ/ବ୍ଲାକଗ୍ରାମ",
      "ଚିନାବାଦାମ",
      "ସୋରିଷ",
      "ସୂର୍ଯ୍ୟମୁଖୀ",
      "ରସୁଣ",
      "ଫୁଲକୋବି ଏବଂ ବନ୍ଧାକୋବି",
      "ଟମାଟୋ",
      "ଲଙ୍କା",
      "ଗୋରୁ ଏବଂ ମଇଁଷି",
      "ଛେଳି ଏବଂ ମେଣ୍ଢା",
      "କୁକୁଡ଼ା ମାଂସ"
   ],
   "general_advisory": "ରୋଗ ଏବଂ କୀଟପତଙ୍ଗର ପ୍ରକୋପକୁ କମ୍ କରିବା ପାଇଁ ଆପଣଙ୍କ ଫସଲ କ୍ଷେତ୍ରକୁ ଆଗାଛାରୁ ମୁକ୍ତ ରଖନ୍ତୁ | ଫସଲର ବୃଦ୍ଧି ପର୍ଯ୍ୟାୟ ଅନୁଯାୟୀ ସନ୍ତୁଳିତ ଏବଂ ଉପଯୁକ୍ତ ସାର ପ୍ରୟୋଗ କରନ୍ତୁ। ବନସ୍ପତି ପର୍ଯ୍ୟାୟରେ ପନିପରିବାରେ ଧଳା ମାଛି, ଏଫିଡ୍, ଜ୍ଯାସିଡ୍ ଏବଂ ଥର୍ପସ୍ ପରି ଶୋଷକ କୀଟ ଉପରେ ନଜର ରଖିବା ପାଇଁ ହଳଦିଆ ଚଟପଟା ଜାଲ ଲଗାନ୍ତୁ |",
   "crops_data": {
      "paddy": {
         "advisory": [
            "ନିଡ୍ ମ୍ୟାନେଜମେଣ୍ଟଃ ରୋପଣର 3ରୁ 5 ଦିନ ପରେ ଗ୍ରାନୁଲାର ହର୍ବିସାଇଡ୍ ବେନ୍ସଲ୍ଫୁରନ୍-ମିଥାଇଲ 0.6% ଲଗାନ୍ତୁ।"
         ]
      },
      "arhar": {
         "advisory": [
            "ଯେତେବେଳେ ଦୁଇ ତୃତୀୟାଂଶରୁ ତିନି ଚତୁର୍ଥାଂଶ ଶୁଆ ବାଦାମୀ ରଙ୍ଗରେ ପରିବର୍ତ୍ତିତ ହୋଇଥାଏ, ସେତେବେଳେ ଅମଳ କରନ୍ତୁ।",
            "3ରୁ 5 ଦିନ ପାଇଁ ସୂର୍ଯ୍ୟାଲୋକରେ ଶୁଖିଲା ଅମଳ ହୋଇଥିବା ଗଛ।",
            "ଏକ ଲାଠିରେ ଶୁଣ୍ଠି ମାରି କିମ୍ବା ପୁଲମ୍ୟାନ୍ ଥ୍ରେସର ବ୍ୟବହାର କରି ମଞ୍ଜି ଫିଙ୍ଗି ଦିଅନ୍ତୁ |"
         ]
      },
      "greengram/blackgram": {
         "advisory": [
            "ଆଗାଛା ପରିଚାଳନାଃ 20-25 DAS ରେ କୁଇଜଲଫପ୍-ଇଥାଇଲ 5 ପ୍ରତିଶତ ଇ. ସି. କିମ୍ବା ଇମାଜେଥାପାଇର୍ 10 SL ପ୍ରୟୋଗ କରନ୍ତୁ।",
            "କୀଟ ପରିଚାଳନାଃ ପତ୍ର ଖାଉଥିବା ଶୁଆ ପାଇଁ ପ୍ରୋଫେନୋଫସ୍ 50 ଇସି ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "groundnut": {
         "advisory": [
            "କୀଟ ପରିଚାଳନାଃ ଯଦି ଟିକ୍କା ଲକ୍ଷଣ ଦେଖାଯାଏ, କ୍ଲୋରୋଥାଲୋନିଲ୍ 75 ପ୍ରତିଶତ ଡବ୍ଲ୍ୟୁ. ପି. କିମ୍ବା ହେକ୍ସାକୋନାଜୋଲ୍ 5 ପ୍ରତିଶତ ଇ. ସି. କିମ୍ବା ମାନକୋଜେବ୍ 75 ପ୍ରତିଶତ ଡବ୍ଲ୍ୟୁ. ପି. ଲଗାନ୍ତୁ।"
         ]
      },
      "mustard": {
         "advisory": [
            "କୀଟ ପରିଚାଳନାଃ ଧଳା ରଷ୍ଟ୍ ପାଇଁ ମେଟାଲାକ୍ସିଲ୍ ଏମ୍ 4 ପ୍ରତିଶତ + ମାନକୋଜେବ୍ 64 ପ୍ରତିଶତ ଡବ୍ଲ୍ୟୁ. ପି. କିମ୍ବା କପର ଅକ୍ସିକ୍ଲୋରାଇଡ୍ 50 ପ୍ରତିଶତ ଡବ୍ଲ୍ୟୁ. ପି. ଲଗାନ୍ତୁ।"
         ]
      },
      "sunflower": {
         "advisory": [
            "କୀଟ ପରିଚାଳନାଃ ଏସିଟାମିପ୍ରିଡ୍ 20 ପ୍ରତିଶତ ଏସ୍. ପି. କିମ୍ବା ଇମିଡାକ୍ଲୋପ୍ରିଡ୍ 17.8% ଏସ୍. ଏଲ୍. ର ଆବଶ୍ୟକତା-ଆଧାରିତ ସ୍ପ୍ରେ କୀଟ କମ୍ପ୍ଲେକ୍ସ (ଏଫିଡ୍, ହପର୍, ଥ୍ରିପ୍ସ ଏବଂ ହ୍ୱାଇଟ୍ ମାଛି) କୁ ଶୋଷିବା ପାଇଁ।",
            "ପାଉଡର ଫଙ୍ଗୁରଃ 0.2% ଆର୍ଦ୍ର ସଲଫର୍ ସ୍ପ୍ରେ କରନ୍ତୁ।",
            "କେପିଟୁଲମ୍ ବୋରର୍ଃ ବେସିଲସ୍ ଥୁରିଙ୍ଗିଏନ୍ସିସ୍ ବାର୍ କୁର୍ଷ୍ଟାକି 5 ପ୍ରତିଶତ ଡବ୍ଲ୍ୟୁ. ପି. ସ୍ପ୍ରେ କରନ୍ତୁ।",
            "ହେଡ୍ ରୋଟ୍ଃ 0.40% ତମ୍ବା ଅକ୍ସିକ୍ଲୋରାଇଡ୍ 50% ଡବ୍ଲ୍ୟୁ. ପି. ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "onion": {
         "advisory": [
            "ନିୟମିତ ବ୍ୟବଧାନରେ ଫସଲକୁ ଜଳସେଚନ କରନ୍ତୁ।",
            "4-ସପ୍ତାହ ପର୍ଯ୍ୟାୟରେ 45 କିଲୋଗ୍ରାମ ୟୁରିଆ ସହିତ ହୋଇଂ, ଆଗାଛା କାଟିବା ଏବଂ ପ୍ରଥମ ଶୀର୍ଷ ଡ୍ରେସିଂ ଗ୍ରହଣ କରନ୍ତୁ |"
         ]
      },
      "cauliflower & cabbage": {
         "advisory": [
            "ପୋଷକ ତତ୍ତ୍ୱ ପରିଚାଳନାଃ ଛଅରୁ ସାତ ସପ୍ତାହ ପର୍ଯ୍ୟାୟରେ 27 କିଲୋଗ୍ରାମ ୟୁରିଆ + 25 କିଲୋଗ୍ରାମ ଏମଓପି ପ୍ରୟୋଗ କରନ୍ତୁ।",
            "କୀଟ ପରିଚାଳନାଃ ବିଭିନ୍ନ କୀଟ ପାଇଁ ଫାଇପ୍ରୋନିଲ୍ 5 ପ୍ରତିଶତ ଏସ୍. ସି. କିମ୍ବା କ୍ଲୋରପାଇରିଫସ୍ 20 ପ୍ରତିଶତ ଇ. ସି. ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "tomato": {
         "advisory": [
            "ପୋଷକ ତତ୍ତ୍ୱ ପରିଚାଳନାଃ ଛଅ ସପ୍ତାହର ପର୍ଯ୍ୟାୟରେ 27 କିଲୋଗ୍ରାମ ୟୁରିଆ ଲଗାନ୍ତୁ।",
            "କୀଟ ପରିଚାଳନାଃ ଲକ୍ଷଣଗୁଡ଼ିକ ଶୁଖିଯିବା ପାଇଁ ମାନକୋଜେବ୍ 75 ପ୍ରତିଶତ ଡବ୍ଲ୍ୟୁ. ପି. ସ୍ପ୍ରେ କରନ୍ତୁ।",
            "ଫଳ ଏବଂ ଶୁଟ୍ ବୋରର୍ଃ କୀଟ ସଂଖ୍ୟା ଉପରେ ନଜର ରଖିବା ପାଇଁ ଫେରୋମୋନ୍ ଫାନ୍ଦ ଲଗାନ୍ତୁ।"
         ]
      },
      "chilli": {
         "advisory": [
            "କୀଟ ପରିଚାଳନାଃ ମାଇଟ୍ ସଂକ୍ରମଣ ପାଇଁ ଇଥିଅନ୍ 50 ପ୍ରତିଶତ ଇସି କିମ୍ବା ପ୍ରୋପାର୍ଜାଇଟ୍ 57 ପ୍ରତିଶତ ଇସି ପ୍ରୟୋଗ କରନ୍ତୁ।"
         ]
      },
      "cattle & buffalo": {
         "advisory": [
            "ଦୁଗ୍ଧ ଉତ୍ପାଦନରେ ଉନ୍ନତି ଆଣିବା ପାଇଁ ବାଛୁରୀ ଜନ୍ମର ଦୁଇ ମାସ ପୂର୍ବରୁ ଧୀରେ ଧୀରେ ଖାଦ୍ୟରେ ଏକାଗ୍ରତା ବୃଦ୍ଧି କରନ୍ତୁ।"
         ]
      },
      "goat & sheep": {
         "advisory": [
            "ରୋଗରୁ ରକ୍ଷା ପାଇବା ପାଇଁ ପଶୁମାନଙ୍କୁ ଥଣ୍ଡା ପବନ ଏବଂ ଚଟାଣରୁ ରକ୍ଷା କରନ୍ତୁ। ଯଦି ନାକରୁ ପାଣି ବୋହିବା ଏବଂ କାଶ ଭଳି ଲକ୍ଷଣ ଦେଖାଯାଏ, ତେବେ ପଶୁ ଚିକିତ୍ସକଙ୍କ ସହ ଯୋଗାଯୋଗ କରନ୍ତୁ।"
         ]
      },
      "poultry": {
         "advisory": [
            "ମୃତ୍ୟୁହାରକୁ ରୋକିବା ପାଇଁ କୁକୁଡ଼ା ପକ୍ଷୀମାନଙ୍କୁ ପ୍ରବଳ ଥଣ୍ଡା ପବନ ଏବଂ ଥଣ୍ଡା ଚଟାଣରୁ ରକ୍ଷା କରନ୍ତୁ |",
            "ଥଣ୍ଡା ପବନରୁ ରକ୍ଷା ପାଇବା ପାଇଁ କୁକୁଡ଼ା ଘରକୁ ମୋଟା ପଲିଥିନ୍ ଚାଦରରେ ଢାଙ୍କି ଦିଅନ୍ତୁ।",
            "ପକ୍ଷୀମାନଙ୍କୁ ଗରମ ରଖିବା ପାଇଁ ଚଟାଣରେ ଆବର୍ଜନା ସାମଗ୍ରୀର ଯତ୍ନ ନିଅନ୍ତୁ।"
         ]
      }
   },
   "date": "17-01-2025"
}