{
   "weather_details": {
      "20-07-2024": {
         "rainfall": 35,
         "t_max": 30,
         "t_min": 24,
         "rh_max": 90,
         "rh_min": 62,
         "wind_speed": 8,
         "wind_direction": 202,
         "cloud_cover": 8
      },
      "21-07-2024": {
         "rainfall": 30,
         "t_max": 30,
         "t_min": 24,
         "rh_max": 91,
         "rh_min": 67,
         "wind_speed": 10,
         "wind_direction": 245,
         "cloud_cover": 8
      },
      "22-07-2024": {
         "rainfall": 15,
         "t_max": 32,
         "t_min": 25,
         "rh_max": 88,
         "rh_min": 74,
         "wind_speed": 14,
         "wind_direction": 243,
         "cloud_cover": 7
      },
      "23-07-2024": {
         "rainfall": 5,
         "t_max": 33,
         "t_min": 25,
         "rh_max": 83,
         "rh_min": 68,
         "wind_speed": 20,
         "wind_direction": 248,
         "cloud_cover": 6
      },
      "24-07-2024": {
         "rainfall": 5,
         "t_max": 33,
         "t_min": 26,
         "rh_max": 81,
         "rh_min": 61,
         "wind_speed": 20,
         "wind_direction": 248,
         "cloud_cover": 6
      }
   },
   "names_of_crops": [
      "ସିଧାସଳଖ ବିହନ ବୁଣାଯାଇଥିବା ଧାନ",
      "ରୋପଣ କରାଯାଇଥିବା ଧାନ",
      "କପା",
      "ଅରହର",
      "ସଂକର ମକା",
      "ବାଇଗଣ ଏବଂ ଲଙ୍କା",
      "ଓକ୍ରା",
      "ରସୁଣ",
      "ଆମ୍ବ",
      "ପେଁପେ",
      "କୁକୁଡ଼ା ମାଂସ",
      "ଛେଳି ଏବଂ ମେଣ୍ଢା"
   ],
   "general_advisory": "ଆଇଏମଡି ଦ୍ୱାରା ପାଣିପାଗ ପୂର୍ବାନୁମାନକୁ ଦୃଷ୍ଟିରେ ରଖି କୃଷକମାନଙ୍କୁ ବର୍ତ୍ତମାନ ପାଇଁ ବୁଣିବା କାର୍ଯ୍ଯ଼ ବନ୍ଦ କରିବାକୁ ଏବଂ ଉପଲବ୍ଧ ମୃତ୍ତିକା ଆର୍ଦ୍ରତା ବ୍ଯ଼ବହାର କରି ବର୍ଷା ହ୍ରାସ ପାଇବା ପରେ ଶୀଘ୍ର ବୁଣିବା ଆରମ୍ଭ କରିବାକୁ ପରାମର୍ଶ ଦିଆଯାଇଛି। ଉପରୋକ୍ତ ପୂର୍ବାନୁମାନକୁ ଦୃଷ୍ଟିରେ ରଖି ବର୍ଷା ହ୍ରାସ ନହେବା ପର୍ଯ୍ଯ଼ନ୍ତ ଠିଆ ହୋଇଥିବା ଫସଲରେ ସାର ଏବଂ କୀଟନାଶକ ପ୍ରଯ଼ୋଗରୁ ଦୂରେଇ ରହିବାକୁ କୃଷକମାନଙ୍କୁ ପରାମର୍ଶ ଦିଆଯାଇଛି। ମକା, ଅରହର, ଚିନାବାଦାମ ଏବଂ ପନିପରିବା କ୍ଷେତରୁ ଅତିରିକ୍ତ ଜଳ ନିଷ୍କାସନ ପାଇଁ ବ୍ଯ଼ବସ୍ଥା କରନ୍ତୁ। ଆସନ୍ନ ବର୍ଷା ପୂର୍ବରୁ ପରିପକ୍ୱ ପନିପରିବା ଅମଳ କରନ୍ତୁ | ନର୍ସରୀ ଶଯ୍ଯ଼ା ଉପରେ ପ୍ଲାଷ୍ଟିକ୍ କିମ୍ବା ପଲିଥିନ୍ ଚାଦରରେ ଢାଙ୍କି ନର୍ସରୀରେ ଥିବା ପନିପରିବା ଚାରା ଗୁଡ଼ିକୁ ପ୍ରବଳ ବର୍ଷାରୁ ରକ୍ଷା କରନ୍ତୁ |",
   "crops_data": {
      "direct seeded paddy": {
         "advisory": [
            "ନିଡ୍ ମ୍ଯ଼ାନେଜମେଣ୍ଟଃ ଯଦି ପ୍ରାକ୍-ଉଦ୍ଭବ ହର୍ବିସାଇଡ୍ ପ୍ରଯ଼ୋଗ କରାଯାଇନଥାଏ, ତେବେ 15-20 DAS ରେ 200 ଲିଟର ପାଣି ସହିତ ମିଶ୍ରଣ କରି ବିସ୍ପିରିବାକ୍ ସୋଡ଼ିଅମ୍ 10 ପ୍ରତିଶତ SC (ମନୋନୀତ ସୁନା) @120 ମିଲି/ଏକର ଲଗାନ୍ତୁ କିମ୍ବା ଫେନାକ୍ସାପ୍ରପ୍-ପି-ଇଥାଇଲ 10 ପ୍ରତିଶତ ଇସି (ହ୍ୱିପ୍ସୁପର) @240-260 ମିଲି/ଏକର ଲଗାନ୍ତୁ |",
            "ପୋଷକ ତତ୍ତ୍ୱ ପରିଚାଳନାଃ ଉଚ୍ଚଭୂମିରେ ଘାସ କାଟିବା ପରେ ଏକର ପିଛା 26 କି. ଗ୍ରା. ଯ଼ୁରିଆ ଏବଂ ମଧ୍ଯ଼ମ ଏବଂ ନିମ୍ନ ଭୂମିରେ ଶୁଖିଲା ପରେ ଏକର ପିଛା 36 କି. ଗ୍ରା. ଯ଼ୁରିଆ ପ୍ରଯ଼ୋଗ କରନ୍ତୁ।"
         ]
      },
      "transplanted paddy": {
         "advisory": [
            "ଜମି ପ୍ରସ୍ତୁତିଃ ମୁଖ୍ଯ଼ କ୍ଷେତରେ 7-10 ଦିନ ବ୍ଯ଼ବଧାନରେ ଦୁଇଥର ପୁଡଲିଂ କରାଯିବା ଉଚିତ ଏବଂ ତା 'ପରେ ସମାନ ଫସଲ ଷ୍ଟାଣ୍ଡ ପାଇଁ ଜମି ସମତଳ କରାଯିବା ଉଚିତ। ମୁଖ୍ଯ଼ କ୍ଷେତର ପ୍ରାରମ୍ଭିକ ଜଳ ନିଷ୍କାସନ ସମଯ଼ରେ ଧାଇଞ୍ଚା ସବୁଜ ସାର ଫସଲକୁ ସାମିଲ କରନ୍ତୁ। ଅନ୍ତିମ ଜମି ପ୍ରସ୍ତୁତି ସମଯ଼ରେ ଭଲ ଭାବେ ଅପଘଟିତ ଏଫ୍. ୱାଇ. ଏମ୍. @8 କ୍ଯ଼ୁ/ଏକରକୁ ସାମିଲ କରନ୍ତୁ।",
            "ସାରର ସୁପାରିସ କରାଯାଇଥିବା ମାତ୍ରା-ଉଚ୍ଚଭୂମିରେ 26 କିଲୋଗ୍ରାମ ଡିଏପି + 10 କିଲୋଗ୍ରାମ ଏମଓପି + 10 କିଲୋଗ୍ରାମ ଜେଡଏନଏସଓ4 ଏବଂ ମଧ୍ଯ଼ମ ଏବଂ ନିମ୍ନ ଭୂମିରେ ଏକର ପିଛା 35 କିଲୋଗ୍ରାମ ଡିଏପି + 13 କିଲୋଗ୍ରାମ ଏମଓପି + 10 କିଲୋଗ୍ରାମ ଜେଡଏନଏସଓ4 ପ୍ରଯ଼ୋଗ କରନ୍ତୁ। ବୋରନ ଅଭାବ ଥିବା ମୃତ୍ତିକାରେ ଅନ୍ତିମ ଭୂମି ପ୍ରସ୍ତୁତି ସମଯ଼ରେ borax@2kg AC ପ୍ରଯ଼ୋଗ କରନ୍ତୁ।"
         ]
      },
      "cotton": {
         "advisory": [
            "ଅତିରିକ୍ତ ବର୍ଷା ଜଳ ନିଷ୍କାସନ ପାଇଁ ଡ୍ରେନେଜ୍ ଚ୍ଯ଼ାନେଲ୍ ତିଆରି କରନ୍ତୁ।",
            "ତିନି-ସପ୍ତାହର ପର୍ଯ୍ଯ଼ାଯ଼ କପାର ପରେ ହୋଇଂ, ନିଡ଼ାଇ ଏବଂ ପ୍ରଥମ ଉପର ଡ୍ରେସିଂ ଗ୍ରହଣ କରନ୍ତୁ। 26 କି. ଗ୍ରା. ଯ଼ୁରିଆ ସହିତ 20 କି. ଗ୍ରା. ଏମ୍. ଓ. ପି. ହାଇବ୍ରିଡ୍ ଏବଂ 20 କି. ଗ୍ରା. ଯ଼ୁରିଆ ସହିତ 15 କି. ଗ୍ରା. ଏମ୍. ଓ. ପି. ଉଚ୍ଚ ଉତ୍ପାଦନକାରୀ କିସମର ପ୍ରଯ଼ୋଗ କରନ୍ତୁ।"
         ]
      },
      "arhar": {
         "advisory": [
            "ଅତିରିକ୍ତ ବର୍ଷା ଜଳ ନିଷ୍କାସନ ପାଇଁ ଡ୍ରେନେଜ୍ ଚ୍ଯ଼ାନେଲ୍ ସୃଷ୍ଟି କରନ୍ତୁ।",
            "ତିନି ସପ୍ତାହର ପର୍ଯ୍ଯ଼ାଯ଼ରେ ହଏଇଂ, ନିଡ଼ାଇ ଓ ତା 'ପରେ ମୃତ୍ତିକା ଉତ୍ତୋଳନ କରାଯିବା ଉଚିତ।"
         ]
      },
      "hybrid maize": {
         "advisory": [
            "ଅତ୍ଯ଼ଧିକ ବର୍ଷା କାରଣରୁ ପାଣି ଜମିବା ପରିସ୍ଥିତିକୁ ଏଡ଼ାଇବା ପାଇଁ ଜଳ ନିଷ୍କାସନ ବ୍ଯ଼ବସ୍ଥାର ବିକାଶ କରନ୍ତୁ।",
            "ତିନି ସପ୍ତାହର ପର୍ଯ୍ଯ଼ାଯ଼ରେ ହୋଇଂ, ନିଡିଂ ଏବଂ ପ୍ରଥମ ଟପ୍ ଡ୍ରେସିଂ ପରେ ଆର୍ଥିଂ ଅପ୍ କରନ୍ତୁ | ପ୍ରଥମ ଶୀର୍ଷ ଡ୍ରେସିଂ ଭାବରେ 75 କେଜି ଯ଼ୁରିଆ ଲଗାନ୍ତୁ |"
         ]
      },
      "brinjal & chilli": {
         "advisory": [
            "ସମଯ଼ୋଚିତ ରୋପଣ ପାଇଁ ବାଇଗଣ, ଲଙ୍କା ଇତ୍ଯ଼ାଦି ଖରିଫ ପନିପରିବା ପାଇଁ ଉଠାଯାଇଥିବା ଶଯ୍ଯ଼ା ନର୍ସରୀ ପ୍ରସ୍ତୁତ କରନ୍ତୁ |",
            "ବିହନ ହାର-200-250 ଗ୍ରାମ୍/ଏକର।",
            "ମୁଖ୍ଯ଼ କ୍ଷେତରେ 30-45 ଦିନର ପୁରୁଣା ଚାରା ରୋପଣ କରନ୍ତୁ।",
            "ଜଳାବଦ୍ଧ ଅବସ୍ଥାକୁ ରୋକିବା ପାଇଁ ଆବଶ୍ଯ଼କ ଡ୍ରେନେଜ୍ ଚ୍ଯ଼ାନେଲ୍ ତିଆରି କରନ୍ତୁ |",
            "ଉଦ୍ଭିଦ ସଂଖ୍ଯ଼ାକୁ ବଜାଯ଼ ରଖିବା ପାଇଁ ମୁଖ୍ଯ଼ କ୍ଷେତରେ ଥିବା ଶୂନ୍ଯ଼ସ୍ଥାନଗୁଡ଼ିକୁ ଚିହ୍ନଟ କରନ୍ତୁ ଏବଂ ପୂରଣ କରନ୍ତୁ।"
         ]
      },
      "okra": {
         "advisory": [
            "ଅଧିକ ଉତ୍ପାଦନ ପାଇବା ପାଇଁ ଜୁଲାଇ ଶେଷ ସୁଦ୍ଧା ବୁଣିବା ଶେଷ ହେବା ଉଚିତ।",
            "ଜମି ପ୍ରସ୍ତୁତ କରିବା ସମଯ଼ରେ ଭଲ ଭାବେ ଅପଘଟିତ ଏଫ୍. ୱାଇ. ଏମ୍. @2t/ଏକର ଲଗାନ୍ତୁ।",
            "ବିହନ ହାର-ଏକର ପିଛା 4 କିଲୋଗ୍ରାମ। ଶୁଖିଲା ରୋଗରୁ ରକ୍ଷା ପାଇବା ପାଇଁ ବୁଣିବା ପୂର୍ବରୁ 2 ଗ୍ରାମ/କିଲୋଗ୍ରାମର ବାଭିଷ୍ଟିନ୍ ସହିତ ବୀଜ ଚିକିତ୍ସା କରାଯିବା ଉଚିତ।",
            "ପ୍ରବଳ ବର୍ଷା କାରଣରୁ ପାଣି ଜମିବା ପରିସ୍ଥିତିକୁ ଏଡ଼ାଇବା ପାଇଁ ଜଳ ନିଷ୍କାସନ ସୁବିଧା ପ୍ରଦାନ କରନ୍ତୁ।"
         ]
      },
      "onion": {
         "advisory": [
            "ଭୀମ ରାଜ, ଭୀମ ଡାର୍କ ରେଡ୍, ଭୀମ ସୁପର ଇତ୍ଯ଼ାଦି ଉପଯୁକ୍ତ କିସମର ଚଯ଼ନ କରାଯିବା ଉଚିତ।",
            "ଖରିଫ ପନିପରିବା ପାଇଁ ଏକ ଓଭରହେଡ୍-ସୁରକ୍ଷିତ ଢାଞ୍ଚା ଅଧୀନରେ ଉଠାଯାଇଥିବା ନର୍ସରୀ ଶଯ୍ଯ଼ା ପ୍ରସ୍ତୁତ କରାଯିବା ଉଚିତ୍ |",
            "ଭଲ ଚାରା ପାଇବା ପାଇଁ ବୀଜ ଚିକିତ୍ସା, ବୁଣିବା, ଏବଂ ତା 'ପରେ ଧାନର ନଡ଼ିଆ ଘାସ ଲଗାଇବା ପରାମର୍ଶ ଦିଆଯାଏ |",
            "ୱାର୍ମାଇଟ୍ ସଂକ୍ରମଣକୁ ରୋକିବା ପାଇଁ କ୍ଲୋରୋପାଇରିଫସ୍ @1 ମିଲି/ଲିଟର ପାଣି ଲଗାନ୍ତୁ |"
         ]
      },
      "mango": {
         "advisory": [
            "ଆମ୍ବ ରୋପଣ ପାଇଁ ଉପଯୁକ୍ତ ସମଯ଼ ହେଉଛି ଜୁଲାଇରୁ ଅଗଷ୍ଟ।",
            "ଉପଯୁକ୍ତ କିସମ ଯଥା, ବଙ୍ଗନପଲ୍ଲୀ, ତୋତାପୁରୀ, ବମ୍ବେ ଗ୍ରୀନ୍, ସୁବର୍ଣ୍ଣରେଖା, ନୀଲମ, ହିମସାଗର, ଲାଙ୍ଗ୍ରା, ଦଶେରୀ, ଆମ୍ରପାଲି, ମଲ୍ଲିକା, ରତ୍ନା, ରାମକେଲ୍ଲା, ରୁମ୍ମାନି, ସିନ୍ଧୁ, ଆଲ୍ଫାନ୍ସୋ ଏବଂ କେଶର ଇତ୍ଯ଼ାଦି ଚଯ଼ନ କରନ୍ତୁ। ସୁସ୍ଥ ଶାଖାବିହୀନ ଗ୍ରାଫ୍ଟେଡ ଚାରା ବ୍ଯ଼ବହାର କରନ୍ତୁ।",
            "10 ମିଟର x 10 ମିଟର ଦୂରତାରେ 1 ମିଟର x 1 ମିଟର x 1 ମିଟର ଗର୍ତ୍ତରେ ଚାରା ରୋପଣ କରନ୍ତୁ। ରୋପଣ ପୂର୍ବରୁ 5 କି. ଗ୍ରା. ଏଫ. ୱାଇ. ଏମ୍./ଗର୍ତ୍ତ ଲଗାନ୍ତୁ।"
         ]
      },
      "papaya": {
         "advisory": [
            "କଦଳୀ ଗଛ ଲଗାଇବା ପାଇଁ ଏହା ଉପଯୁକ୍ତ ସମଯ଼।",
            "ପେଁପେ ପାଇଁ ଏଚୱାଇଭି ହେଉଛି ହନିଡିଉ, କୁର୍ଗ ମହୁ ଶିଶିର, ସିଓ-1, ସିଓ-2, ପୁସା ସୁସ୍ୱାଦୁ, ପୁସା ମହିମା ଏବଂ ପୁସା ଜଏଣ୍ଟ |",
            "ଚାରା ଗୁଡ଼ିକୁ 2.5 ମି. x 2.5 ମି. ଦୂରତା ଏବଂ 0.5 ମି. x 0.5 ମି. x 0.5 ମି. ଗର୍ତ୍ତରେ ରୋପଣ କରନ୍ତୁ। ରୋଗ ପ୍ରତିରୋଧକ ଏବଂ ଟିସ୍ଯ଼ୁ କଲ୍ଚର ଚାରା ବ୍ଯ଼ବହାର କରାଯିବା ଉଚିତ। ରୋପଣ ପୂର୍ବରୁ ଗର୍ତ୍ତରେ ଉପର ମାଟି ଏବଂ ଭଲ ଭାବେ ସଡି ଯାଇଥିବା ଏଫ୍. ଆଇ. ଏମ୍. ର ମିଶ୍ରଣ ଲଗାନ୍ତୁ।"
         ]
      },
      "poultry": {
         "advisory": [
            "ବର୍ଷା ପାଣି ଭିତରକୁ ପ୍ରବେଶ କରିବାରୁ ରୋକିବା ପାଇଁ କୁକୁଡ଼ା ଘର ମରାମତି କରନ୍ତୁ | ଆବର୍ଜନା ସାମଗ୍ରୀକୁ ଓଦା ହେବାକୁ ଦିଅନ୍ତୁ ନାହିଁ।",
            "ଖାଦ୍ଯ଼ ସାମଗ୍ରୀକୁ ଓଦା ହେବାରୁ ରୋକନ୍ତୁ ଯାହା ଖାଦ୍ଯ଼ରେ ଫଙ୍ଗସ୍ ବୃଦ୍ଧି କରିପାରେ |"
         ]
      },
      "goat & sheep": {
         "advisory": [
            "ଆଭ୍ଯ଼ନ୍ତରୀଣ ପରଜୀବୀଗୁଡ଼ିକର ଭାର ହ୍ରାସ କରିବା ପାଇଁ ସେଗୁଡ଼ିକୁ ପତଳା କରନ୍ତୁ।",
            "ବାହ୍ଯ଼ ପରଜୀବୀ ବିରୁଦ୍ଧରେ ମେଣ୍ଢା କ୍ଷେତ୍ରରେ ଡିପିଂ କରାଯିବା ଉଚିତ୍ |",
            "ବର୍ଷା ସମଯ଼ରେ ପଶୁମାନଙ୍କୁ ଘର ଭିତରେ ରଖନ୍ତୁ ଏବଂ ସ୍ୱଚ୍ଛ ତଥା ସ୍ୱାସ୍ଥ୍ଯ଼କର ଜଳ ଯୋଗାଇ ଦିଅନ୍ତୁ।"
         ]
      }
   },
   "date": "19-07-2024"
}