{
   "weather_details": {
      "15-06-2024": {
         "rainfall": 5,
         "t_max": 36,
         "t_min": 26,
         "rh_max": 77,
         "rh_min": 25,
         "wind_speed": 14,
         "wind_direction": 248,
         "cloud_cover": 7
      },
      "16-06-2024": {
         "rainfall": 0,
         "t_max": 36,
         "t_min": 27,
         "rh_max": 62,
         "rh_min": 36,
         "wind_speed": 10,
         "wind_direction": 225,
         "cloud_cover": 4
      },
      "17-06-2024": {
         "rainfall": 5,
         "t_max": 36,
         "t_min": 27,
         "rh_max": 75,
         "rh_min": 31,
         "wind_speed": 14,
         "wind_direction": 214,
         "cloud_cover": 6
      },
      "18-06-2024": {
         "rainfall": 10,
         "t_max": 35,
         "t_min": 26,
         "rh_max": 77,
         "rh_min": 55,
         "wind_speed": 8,
         "wind_direction": 202,
         "cloud_cover": 7
      },
      "19-06-2024": {
         "rainfall": 15,
         "t_max": 34,
         "t_min": 25,
         "rh_max": 86,
         "rh_min": 41,
         "wind_speed": 10,
         "wind_direction": 248,
         "cloud_cover": 8
      }
   },
   "names_of_crops": [
      "ଖରିଫ ଧାନ",
      "କପା",
      "ଅରହର",
      "ସଂକର ମକା"
   ],
   "general_advisory": "କ୍ଷେତ୍ର ପ୍ରସ୍ତୁତି ପାଇଁ ଆବଶ୍ଯ଼କ ବ୍ଯ଼ବସ୍ଥା କରନ୍ତୁ କାରଣ ମୌସୁମୀ ଆମ ରାଜ୍ଯ଼ରେ ପ୍ରବେଶ କରିସାରିଛି ଏବଂ ସପ୍ତାହ ଶେଷରେ ହାଲୁକା ବର୍ଷା ହୋଇପାରେ | ଠିଆ ହୋଇଥିବା ଫସଲକୁ ଆବଶ୍ଯ଼କ ଜଳସେଚନ କରିବା ଏବଂ ନିଜ କ୍ଷେତକୁ ଆଗାଛାରୁ ମୁକ୍ତ ରଖିବା ପାଇଁ କୃଷକମାନଙ୍କୁ ପରାମର୍ଶ ଦିଆଯାଉଛି। କୀଟପତଙ୍ଗର ପ୍ରକୋପ ଉପରେ ନିଯ଼ମିତ ନଜର ରଖିବା ଉଚିତ ଏବଂ ପାଣିପାଗ ପୂର୍ବାନୁମାନ ଉପରେ ନଜର ରଖି କୀଟନାଶକ ପ୍ରଯ଼ୋଗ କରାଯିବା ଉଚିତ। ଖରିଫ ଫସଲ ପାଇଁ ଜମି ପ୍ରସ୍ତୁତ କରିବା ପୂର୍ବରୁ କୃଷକମାନଙ୍କୁ ସେମାନଙ୍କ ଫସଲ କ୍ଷେତ୍ରର ମୃତ୍ତିକା ଉର୍ବରତା ସ୍ଥିତି ଜାଣିବା ପାଇଁ ମୃତ୍ତିକା ପରୀକ୍ଷା କରିବାକୁ ପରାମର୍ଶ ଦିଆଯାଇଛି। ଜମି ପ୍ରସ୍ତୁତିରେ ବ୍ଯ଼ବହାର ପାଇଁ ବର୍ଷା ଜଳକୁ ସଂରକ୍ଷଣ କରନ୍ତୁ, ବନ୍ଧ ତିଆରି କରି ଏବଂ କ୍ଷେତ ଭିତରେ ଥିବା ଛିଦ୍ରଗୁଡ଼ିକୁ ବନ୍ଦ କରିଦିଅନ୍ତୁ।",
   "crops_data": {
      "kharif paddy": {
         "advisory": [
            "ଗବେଷଣା ପ୍ରତିଷ୍ଠାନ, କେଭିକେ, ଓଯ଼ୁଏଟି, ବ୍ଲକ କୃଷି କାର୍ଯ୍ଯ଼ାଳଯ଼ ଇତ୍ଯ଼ାଦି ବିଶ୍ୱସନୀଯ଼ ଉତ୍ସରୁ ଧାନର ପ୍ରମାଣିତ ମଞ୍ଜି ବ୍ଯ଼ବସ୍ଥା କରିବାକୁ କୃଷକମାନଙ୍କୁ ପରାମର୍ଶ ଦିଆଯାଇଛି।",
            "ବୀଜ ହାରଃ ଧାନ ରୋପଣ ପାଇଁ ଏସି ପିଛା 20 କି. ଗ୍ରା., ହସ୍ତଚାଳିତ ପ୍ରତ୍ଯ଼କ୍ଷ ବିହନ ବୁଣିବା ପାଇଁ ଏସି ପିଛା 1 କି. ଗ୍ରା. ଏବଂ ଯାନ୍ତ୍ରିକ ପ୍ରତ୍ଯ଼କ୍ଷ ବିହନ ବୁଣିବା ପାଇଁ ଏସି ପିଛା 10 କି. ଗ୍ରା.।",
            "ଉପଯୁକ୍ତ ପ୍ରକାରଃ",
            "ଉଚ୍ଚଭୂମି ସ୍ଥିତିଃ ଖଣ୍ଡଗିରି, ସହଭାଗି, ଜ୍ଯ଼ୋତିର୍ମଯ଼ୀ, ମନ୍ଦାକିନୀ, ଫାଲ୍ଗୁନୀ, ବନ୍ଦନା, ଅଞ୍ଜଳି ଇତ୍ଯ଼ାଦି। (100-110 ଦିନ)",
            "ମଧ୍ଯ଼ମ ଧରଣର ଜମି ସ୍ଥିତିଃ ଉନ୍ନତ ଲଲାଟ, ଏମ୍ଟିଯ଼ୁ-1010, ନବୀନ, ଏମ୍ଟିଯ଼ୁ-1001, ପ୍ରତିଭା, ପ୍ରଦୀପ, ହିରଣ୍ମଯ଼ୀ, ତେଜସ୍ୱିନୀ ଇତ୍ଯ଼ାଦି। (120-130 ଦିନ)",
            "ନିମ୍ନ ଭୂମି ସ୍ଥିତିଃ ଏମ୍ଟିଯ଼ୁ-7029, ପୂଜା, ପ୍ରତୀକ୍ଷା, ହସନ୍ତ, ମୃଣଲିନୀ, ଆଶୁତୋଷ, ମୌଦାମନୀ, ସ୍ୱର୍ଣ୍ଣ, ସ୍ୱର୍ଣ୍ଣ ସବ୍-1, କାଲଚମ୍ପା ଇତ୍ଯ଼ାଦି। (140-150 ଦିନ)",
            "ପ୍ରତ୍ଯ଼କ୍ଷ ବିହନଯୁକ୍ତ ଚାଉଳଃ ଜମି ପ୍ରସ୍ତୁତିର ଅନ୍ତିମ ପର୍ଯ୍ଯ଼ାଯ଼ରେ ଏକର ପିଛା 8 କ୍ଯ଼ୁ. ମି. ରେ ଭଲ ଭାବେ ସଙ୍କୁଚିତ ହୋଇଥିବା ଧାନକୁ ମିଶାନ୍ତୁ।",
            "ବୀଜ ଚିକିତ୍ସାଃ ବୀଜ ଏବଂ ମୃତ୍ତିକା ଜନିତ ରୋଗକୁ ନିଯ଼ନ୍ତ୍ରଣ କରିବା ପାଇଁ ଘଣ୍ଟାପ୍ରତି 10 ଗ୍ରାମ/କିଲୋଗ୍ରାମ ମଞ୍ଜି କିମ୍ବା କାର୍ବେନଡାଜିମ୍ 50 ପ୍ରତିଶତ ଡବ୍ଲ୍ଯ଼ୁ. ପି. @2 ଗ୍ରାମ/କିଲୋଗ୍ରାମ ମଞ୍ଜି ବ୍ଯ଼ବହାର କରି ଟ୍ରାଇକୋଡର୍ମା ପାଉଡର ପ୍ରସ୍ତୁତ କରି ମଞ୍ଜି ଚିକିତ୍ସା କରାଯିବା ଉଚିତ।",
            "ସାରର ସୁପାରିସ କରାଯାଇଥିବା ମାତ୍ରା-ଉଚ୍ଚଭୂମି କ୍ଷେତ୍ରରେ 26 କିଲୋଗ୍ରାମ ଡିଏପି + 10 କିଲୋଗ୍ରାମ ଏମଓପି + 10 କିଲୋଗ୍ରାମ ଜେଡଏନଏସଓ4 ଏବଂ ମଧ୍ଯ଼ମ ଏବଂ ନିମ୍ନ ଭୂମି କ୍ଷେତ୍ରରେ ଏକର ପିଛା 35 କିଲୋଗ୍ରାମ ଡିଏପି + 13 କିଲୋଗ୍ରାମ ଏମଓପି + 10 କିଲୋଗ୍ରାମ ଜେଡଏନଏସଓ4 ପ୍ରଯ଼ୋଗ କରନ୍ତୁ।"
         ]
      },
      "cotton": {
         "advisory": [
            "ଅଧିକ ଉତ୍ପାଦନ ପାଇବା ପାଇଁ ଜୁନ୍ ଶେଷ ସୁଦ୍ଧା ବୁଣିବା ଶେଷ ହେବା ଉଚିତ। କପା, ଓଯ଼ୁଏଟି ଏବଂ ସାର୍ଟିଫାଏଡ୍ ଡିଲର୍ ଇତ୍ଯ଼ାଦି ଉପରେ ଏ. ଆଇ. ସି. ଆର୍. ପି. ଭଳି ବିଶ୍ୱସନୀଯ଼ ଉତ୍ସରୁ ଭଲ ଗୁଣବତ୍ତା ବିଶିଷ୍ଟ ମଞ୍ଜି ବ୍ଯ଼ବସ୍ଥା କରନ୍ତୁ।",
            "ଚାଷ କରିବା ପୂର୍ବରୁ ମାଟି ଉପରେ ଏଫ. ୱାଇ. ଏମ୍. କିମ୍ବା କମ୍ପୋଷ୍ଟ @2 ଟନ୍/ଏକର କିମ୍ବା ଭର୍ମିକମ୍ପୋଷ୍ଟ <ଆଇ. ଡି. 1> ଟନ୍/ଏକର ସମାନ ଭାବେ ଲଗାନ୍ତୁ।",
            "କୃଷକମାନେ ପିଜନ୍ ମଟର (8ଃ2 ଧାଡ଼ି ଅନୁପାତ) ଏବଂ ସବୁଜ ଚଣା/କଳା ଚଣା (1:2 ଧାଡ଼ି ଅନୁପାତ) କୁ ଆନ୍ତଃଶସ୍ଯ଼ ଭାବେ ଚଯ଼ନ କରିପାରିବେ।",
            "ପ୍ରତି ପିଟ୍ରେ 3ରୁ 5 ସେ. ମି. ଗଭୀରତାରେ ଗୋଟିଏ ଲେଖାଏଁ ବୀଜକୁ ଧାଡ଼ିରେ କାଟି ଦିଅନ୍ତୁ ଏବଂ ମଞ୍ଜିକୁ ମାଟିରେ ଢାଙ୍କି ଦିଅନ୍ତୁ। ସାଧାରଣ ରୋପଣରେ 90 ସେ. ମି. x 60 ସେ. ମି. ଏବଂ ଉଚ୍ଚ ଘନତ୍ୱ ରୋପଣ ପ୍ରଣାଳୀ ପାଇଁ 60 ସେ. ମି. x 10 ସେ. ମି. ବ୍ଯ଼ବଧାନ ପ୍ରଦାନ କରନ୍ତୁ।",
            "ଯଥାସମ୍ଭବ ସାରା ଗ୍ରାମରେ ଗୋଟିଏ କିସମ ଚାଷ କରନ୍ତୁ ଏବଂ କୀଟ ଆକ୍ରମଣକୁ ରୋକିବା ପାଇଁ 10-15 ଦିନ ମଧ୍ଯ଼ରେ ବୁଣିବା ସମ୍ପୂର୍ଣ୍ଣ କରି ଆପଣଙ୍କ ଗ୍ରାମରେ ବୁଣିବା ସମଯ଼କୁ ସମନ୍ୱିତ କରନ୍ତୁ |",
            "ଶୋଷକ କୀଟପତଙ୍ଗରୁ ସୁରକ୍ଷା ପାଇଁ ବୀଜକୁ ଇମିଡାକ୍ଲୋପ୍ରିଡ୍ 70 ଡବ୍ଲୁଜି @7 ଗ୍ରାମ୍/କେଜି ସହିତ ଚିକିତ୍ସା କରାଯିବା ଉଚିତ୍।",
            "ସାଧାରଣ ରୋପଣ ପାଇଁ ବୀଜ ହାର-ଏକର ପିଛା 1 କି. ଗ୍ରା. ଏବଂ ଉଚ୍ଚ ଘନତ୍ୱ ରୋପଣ ବ୍ଯ଼ବସ୍ଥା ପାଇଁ ଏକର ପିଛା 5 କି. ଗ୍ରା.।",
            "ଉପଯୁକ୍ତ କିସମଃ ହାଇବ୍ରିଡ୍ କିସମଃ ଜେ. କେ.-ଦୁର୍ଗା, ଅଟଳ, ଧାନୋ, ଗାବର, ଶ୍ରୀ ତୁଳସୀ, ଭାଗ୍ଯ଼, ଆକ୍କା, ଚନ୍ଦ୍ରମୁଖୀ, ଉଚ୍ଚ ଉତ୍ପାଦନକାରୀ କିସମଃ ବି. ଏସ୍. 30, ବି. ଏସ୍. 279, ସୁରଭୀ, ଏମ୍. ସି. ଯ଼ୁ.-5, ଉଚ୍ଚ ଘନତ୍ୱ ରୋପଣଃ ସୁରଜ, ସୁପ୍ରିଯ଼ା, ପି. କେ. ଭି.-081, ଏନ୍. ଏଚ୍.-615, ଏଚ୍. ଡି.-123, ବି. ଏସ୍. 30",
            "ସାରର ସୁପାରିସ କରାଯାଇଥିବା ମାତ୍ରା-ଡି. ଏ. ପି. @120 କି. ଗ୍ରା./ଏସି. + ଏମଓ. ପି. @24 କି. ଗ୍ରା./ଏସି. ହାଇବ୍ରିଡ୍ କିସମର ପ୍ରଯ଼ୋଗ କରନ୍ତୁ ଏବଂ ଡି. ଏ. ପି. @90 କି. ଗ୍ରା./ଏସି. + ଏମଓ. ପି. @18 କି. ଗ୍ରା./ଏସି. ଅଧିକ ଉତ୍ପାଦନକ୍ଷମ କିସମର ପ୍ରଯ଼ୋଗ କରନ୍ତୁ, ତଥାପି, ମୃତ୍ତିକା ପରୀକ୍ଷା ରିପୋର୍ଟ ଅନୁଯାଯ଼ୀ ସାରର ଆବଶ୍ଯ଼କ ମାତ୍ରା ପ୍ରଯ଼ୋଗ କରନ୍ତୁ।"
         ]
      },
      "arhar": {
         "advisory": [
            "ଗବେଷଣା ପ୍ରତିଷ୍ଠାନ, କେ. ଭି. କେ., ଓ. ଯ଼ୁ. ଏ. ଟି., ବ୍ଲକ କୃଷି କାର୍ଯ୍ଯ଼ାଳଯ଼ ଇତ୍ଯ଼ାଦି ବିଶ୍ୱସନୀଯ଼ ଉତ୍ସରୁ ଉତ୍ତମ ମାନର ମଞ୍ଜି ବ୍ଯ଼ବସ୍ଥା କରନ୍ତୁ। ଅଧିକ ଉତ୍ପାଦନ ପାଇବା ପାଇଁ ଜୁନ୍ ଶେଷ ସୁଦ୍ଧା ବୁଣିବା ଶେଷ ହେବା ଉଚିତ।",
            "ଉଇପୋକା ସ୍ଥାନୀଯ଼ ଅଞ୍ଚଳରେ କ୍ଲୋରୋପାଇରିଫୋସ୍ ଧୂଳି ପ୍ରଯ଼ୋଗ ଭୂମି ପ୍ରସ୍ତୁତି ସମଯ଼ରେ 10 କି. ଗ୍ରା./ଏ. ସି. ରେ 1%",
            "ଚୂଡ଼ାନ୍ତ ଜମି ପ୍ରସ୍ତୁତି ସମଯ଼ରେ ଏକର ପିଛା 2-4 ଟନ୍ ଏଫ୍. ୱାଇ. ଏମ୍. ପ୍ରଯ଼ୋଗ କରନ୍ତୁ।",
            "ବୀଜ ଡ୍ରିଲ୍ କିମ୍ବା ଦେଶୀ ହଳ ଦ୍ୱାରା ଧାଡ଼ି ବୁଣିବା 60 ସେ. ମି. x 15 ସେ. ମି. ବ୍ଯ଼ବଧାନ ସହିତ ସୁପାରିଶ କରାଯାଏ |",
            "ଏହି ବୀଜକୁ ଥିରମ୍ (2 ଗ୍ରାମ୍) + କାର୍ବେନଡାଜିମ୍ (1 ଗ୍ରାମ୍) କିମ୍ବା ଥିରମ୍ @3 ଗ୍ରାମ୍ କିମ୍ବା ଟ୍ରାଇକୋଡର୍ମା ଭିର୍ଡି 5-7 ଗ୍ରାମ୍/କେଜି ମଞ୍ଜି ସହିତ ଉପଚାର କରନ୍ତୁ। ସଂସ୍କୃତିଃ ରାଇଜୋବିଯ଼ମ୍ ଏବଂ ପି. ଏସ୍. ବି. ସଂସ୍କୃତି <ଆଇ. ଡି. 1> ଗ୍ରାମ୍/କେଜି.",
            "ବିହନ ହାର-ଏକର ପିଛା 8 କିଲୋଗ୍ରାମ",
            "ଉପଯୁକ୍ତ କିସମଃ ଯ଼ୁ. ପି. ଏ. ଏସ୍.-120, ପୁସା-855, ପ୍ରଗତି (ଆଇ. ସି. ପି. ଏଲ୍.-87), ଦୁର୍ଗା, ସି.-11, ଆଇ. ସି. ପି. ଏଲ୍.-88039 @<ଆଇ. ଡି. 2> ଦିନର ଅବଧି, ଆଶା (ଆଇ. ସି. ପି. ଏଲ୍.-87119), ଲକ୍ଷ୍ମୀ @<ଆଇ. ଡି. 1> ଦିନର ଅବଧି",
            "ସାରର ସୁପାରିସ କରାଯାଇଥିବା ମାତ୍ରା-ବୁଣିବା ସମଯ଼ରେ ଡିଏପି 35 କି. ଗ୍ରା./ଏସି + ଏମଓପି 13 କି. ଗ୍ରା./ଏସି + ଯ଼ୁରିଆ 5 କି. ଗ୍ରା./ଏସି + 60 କି. ଗ୍ରା. ଜିପ୍ସମ୍/ଫସଫୋ-ଜିପ୍ସମ୍ ପ୍ରଯ଼ୋଗ କରନ୍ତୁ, କିନ୍ତୁ ମୃତ୍ତିକା ପରୀକ୍ଷା ରିପୋର୍ଟ ଅନୁଯାଯ଼ୀ ଆବଶ୍ଯ଼କ ପରିମାଣର ସାର ପ୍ରଯ଼ୋଗ କରନ୍ତୁ।"
         ]
      },
      "hybrid maize": {
         "advisory": [
            "ଗବେଷଣା ପ୍ରତିଷ୍ଠାନ, କେ. ଭି. କେ., ଓ. ଯ଼ୁ. ଏ. ଟି., ବ୍ଲକ କୃଷି କାର୍ଯ୍ଯ଼ାଳଯ଼ ଇତ୍ଯ଼ାଦି ବିଶ୍ୱସନୀଯ଼ ଉତ୍ସରୁ ଭଲ ଗୁଣବତ୍ତା ବିଶିଷ୍ଟ ମଞ୍ଜି ବ୍ଯ଼ବସ୍ଥା କରନ୍ତୁ। ଜୁନ୍ ମାସରୁ ଜୁଲାଇ ମାସର ପ୍ରଥମ ପନ୍ଦର ଦିନ ପର୍ଯ୍ଯ଼ନ୍ତ ବୁଣା ଯାଇପାରିବ। ତେବେ, ଯଦି ଜଳସେଚନ ସୁବିଧା ଉପଲବ୍ଧ ଥାଏ, ତେବେ ମୌସୁମୀ ଆରମ୍ଭ ହେବାର କିଛି ଦିନ ପୂର୍ବରୁ ଯଥାଶୀଘ୍ର ବୁଣିବା ଦ୍ୱାରା ଉତ୍ପାଦକତା ବୃଦ୍ଧି ପାଇଥାଏ।",
            "ଉଇପୋକା ସ୍ଥାନୀଯ଼ ଅଞ୍ଚଳରେ କ୍ଲୋରୋପାଇରିଫୋସ୍ ଧୂଳି ପ୍ରଯ଼ୋଗ ଭୂମି ପ୍ରସ୍ତୁତି ସମଯ଼ରେ 10 କି. ଗ୍ରା./ଏ. ସି. ରେ 1%",
            "ଚୂଡ଼ାନ୍ତ ଜମି ପ୍ରସ୍ତୁତି ସମଯ଼ରେ ଏକର ପିଛା 2-4 ଟନ୍ ଏଫ୍. ୱାଇ. ଏମ୍. ପ୍ରଯ଼ୋଗ କରନ୍ତୁ।",
            "ଜଳସେଚନ ସ୍ଥିତି ପାଇଁ 60 ସେ. ମି. x 25 ସେ. ମି. ଏବଂ ବର୍ଷା ଆଧାରିତ ସ୍ଥିତି ପାଇଁ 75 ସେ. ମି. x 25 ସେ. ମି. ବ୍ଯ଼ବଧାନ ସହିତ ବୀଜ ଡ୍ରିଲ୍ କିମ୍ବା ଦେଶୀ ହଳ ଦ୍ୱାରା ଧାଡ଼ି ବୁଣିବା ସୁପାରିଶ କରାଯାଏ |",
            "ମୃତ୍ତିକା-ବାହିତ ରୋଗ ଏବଂ କୀଟ-କୀଟ ଆକ୍ରମଣରୁ ଫସଲକୁ ରୋକିବା ପାଇଁ ଉପଯୁକ୍ତ କବକନାଶକ ଏବଂ କୀଟନାଶକ ସହିତ ବୀଜ ଚିକିତ୍ସା ଆବଶ୍ଯ଼କ | 1 କି. ଗ୍ରା. ମଞ୍ଜି 2 ଗ୍ରାମ୍ (ବାଭିଷ୍ଟିନ୍ + କ୍ଯ଼ାପଟେନ୍ 1:1 ଅନୁପାତରେ) ଏବଂ 4 ଗ୍ରାମ୍ ଇମିଡାକ୍ଲୋପ୍ରିଡ୍ ସହିତ ଉପଚାର କରନ୍ତୁ।",
            "ବିହନ ହାର-ଏକର ପିଛା 8 କିଲୋଗ୍ରାମ",
            "ଉପଯୁକ୍ତ କିସମଃ ସାଧାରଣ ମକାଃ କଳିଙ୍ଗ ରାଜ (ଓଏମଏଚ 14-27), ଏଚଏମ 9, ଏଚଏମ 4, ବିବେକ ମକା ସଂକର-27, ବିବେକ ମକା ସଂକର-17, ପି 3441, ପି 3501, ବାଯ଼ୋ 9544, ସିଏମଏଚ 08-287, ସିଏମଏଚ 08-292, ଡିଏମଏଚ 121, ଏଲଜି 32.81 (ଯୁବରାଜ ଗୋଲ୍ଡ) ଇତ୍ଯ଼ାଦି। ମିଠା ମକାଃ ମାଧୁରୀ ମିଠା ମକା, ପ୍ରିଯ଼ା ମିଠା ମକା, ମିସ୍ତି",
            "ସାରର ସୁପାରିସ କରାଯାଇଥିବା ମାତ୍ରା-ବୁଣିବା ସମଯ଼ରେ ଡିଏପି 50 କେଜି/ଏସି + ଏମଓପି 40 କେଜି/ଏସି ପ୍ରଯ଼ୋଗ କରନ୍ତୁ, କିନ୍ତୁ ମୃତ୍ତିକା ପରୀକ୍ଷା ରିପୋର୍ଟ ଅନୁଯାଯ଼ୀ ସାରର ଆବଶ୍ଯ଼କ ମାତ୍ରା ପ୍ରଯ଼ୋଗ କରନ୍ତୁ। ଯଦି ମାଟିରେ Zn କିମ୍ବା Bo ର ଅଭାବ ଥାଏ, ତେବେ 10 କିଲୋଗ୍ରାମ ଜିଙ୍କ୍ ସଲଫେଟ୍ @10kg ଏକର କିମ୍ବା ବୋରନ୍ @4 କିଲୋଗ୍ରାମ/ଏକରକୁ ବେସାଲ୍ ଭାବରେ ଲଗାନ୍ତୁ।"
         ]
      }
   },
   "date": "14-06-2024"
}