{
   "weather_details": {
      "07-09-2024": {
         "rainfall": 15,
         "t_max": 32,
         "t_min": 23,
         "rh_max": 87,
         "rh_min": 56,
         "wind_speed": 8,
         "wind_direction": 198,
         "cloud_cover": 6
      },
      "08-09-2024": {
         "rainfall": 20,
         "t_max": 30,
         "t_min": 22,
         "rh_max": 94,
         "rh_min": 64,
         "wind_speed": 9,
         "wind_direction": 69,
         "cloud_cover": 8
      },
      "09-09-2024": {
         "rainfall": 25,
         "t_max": 29,
         "t_min": 21,
         "rh_max": 92,
         "rh_min": 64,
         "wind_speed": 8,
         "wind_direction": 90,
         "cloud_cover": 8
      },
      "10-09-2024": {
         "rainfall": 20,
         "t_max": 31,
         "t_min": 21,
         "rh_max": 93,
         "rh_min": 59,
         "wind_speed": 6,
         "wind_direction": 75,
         "cloud_cover": 8
      },
      "11-09-2024": {
         "rainfall": 10,
         "t_max": 32,
         "t_min": 22,
         "rh_max": 93,
         "rh_min": 67,
         "wind_speed": 7,
         "wind_direction": 285,
         "cloud_cover": 7
      }
   },
   "names_of_crops": [
      "ଧାନ।",
      "ମକା",
      "ଗ୍ରୀନଗ୍ରାମ",
      "ମହିଳା ଆଙ୍ଗୁଠି",
      "ଲଙ୍କା",
      "କଦଳୀ",
      "କଦଳୀ ଗୁଣ୍ଡ",
      "କଦଳୀ",
      "ପେଁପେ"
   ],
   "general_advisory": "ଓଡ଼ିଶା ଉପକୂଳରେ ସ୍ୱଳ୍ପ ଚାପ ସୃଷ୍ଟି ହେବା କାରଣରୁ ଆଗାମୀ ଦିନରେ ବର୍ଷା ଗତିବିଧି ବୃଦ୍ଧି ପାଇପାରେ। ବର୍ଷାଜଳ ସଞ୍ଚୟ କରିବା ଏବଂ କ୍ଷେତରୁ ଅତିରିକ୍ତ ଜଳ ହଟାଇବା ପାଇଁ ବନ୍ଧ ତିଆରି କରିବାକୁ କୃଷକମାନଙ୍କୁ ପରାମର୍ଶ ଦିଆଯାଇଛି। ରୋଗ ଏବଂ କୀଟପତଙ୍ଗ ପାଇଁ ନିୟମିତ ଭାବରେ କ୍ଷେତ୍ର ଉପରେ ନଜର ରଖନ୍ତୁ | କୀଟନାଶକ ଏବଂ କୀଟନାଶକ ସ୍ପ୍ରେ ପୁଣି ଆରମ୍ଭ କରାଯାଇପାରିବ। ସିଞ୍ଚନ କାର୍ଯ୍ୟକଳାପ ସକାଳେ କିମ୍ବା ସନ୍ଧ୍ୟାରେ କରାଯିବା ଉଚିତ୍ | ଉଜ୍ଜ୍ୱଳ ସୂର୍ଯ୍ୟକିରଣ ସମୟରେ ସ୍ପ୍ରେ କରନ୍ତୁ ନାହିଁ।",
   "crops_data": {
      "paddy": {
         "advisory": [
            "ଉଚ୍ଚଭୂମିରେ, ଶୀର୍ଷ ପର୍ଯ୍ୟାୟ ପୂର୍ବରୁ, ଏକର ପିଛା 16 କିଲୋଗ୍ରାମ ୟୁରିଆ ଏବଂ 10 କିଲୋଗ୍ରାମ ପୋଟାଶ ଲଗାନ୍ତୁ ଏବଂ ମଧ୍ୟମ ଏବଂ ନିମ୍ନ ଜମିରେ, ସାରର ଦ୍ୱିତୀୟ ମାତ୍ରା ଭାବରେ ଏକର ପିଛା 20 କିଲୋଗ୍ରାମ ୟୁରିଆ ଏବଂ 13 କିଲୋଗ୍ରାମ ପୋଟାଶ ଲଗାନ୍ତୁ। ଯଦି ଷ୍ଟେମ ବୋରର ଆକ୍ରମଣ ଦେଖାଯାଏ, ତେବେ ୟୁରିଆର ପ୍ରୟୋଗ ବନ୍ଦ କରନ୍ତୁ। ନିମ୍ବ ତେଲକୁ 1500 ପିପିଏମ @1.5 ମିଲି/ଲିଟରରେ ସ୍ପ୍ରେ କରନ୍ତୁ। ଗୁରୁତର ସଂକ୍ରମଣ କ୍ଷେତ୍ରରେ, ପ୍ରତିରୋପଣର 20-25 ଦିନ ମଧ୍ୟରେ 4 କି. ଗ୍ରା./ଏକର ପିଛା 4% GR କିମ୍ବା 4 କି. ଗ୍ରା./ଏକର ପିଛା 0.6% GR ପ୍ରୟୋଗ କରନ୍ତୁ। ଝାଉଁଳା ଶୁଆ ଗଛର ପ୍ରକୋପକୁ କମ୍ କରିବା ପାଇଁ, ଏକର ପିଛା 200 ଲିଟର ପାଣିରେ କ୍ଲୋରୋପାଇରିଫସ୍ 20 ଇସି @500 ମିଲି କିମ୍ବା କ୍ୱିନାଲୋଫସ୍ 25% ଇସି @800 ମିଲି ସ୍ପ୍ରେ କରନ୍ତୁ। ବିପିଏଚ ଆକ୍ରମଣକୁ ପରିଚାଳନା ଏବଂ ହ୍ରାସ କରିବା ପାଇଁ, ଏକ ଏକରରେ 200 ଲିଟର ପାଣିରେ ପାଇରେମେଟ୍ରିଜିନ 50 ପ୍ରତିଶତ ଡବ୍ଲୁଜି @120 ଗ୍ରାମ କିମ୍ବା ଇମିଡାକ୍ଲୋପ୍ରିଡ 17.8% ଏସଏଲ @50 ମିଲି ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "maize": {
         "advisory": [
            "ପରିପକ୍ୱ ଫଳଗୁଡ଼ିକୁ ଅମଳ କରି ସୁରକ୍ଷିତ ସ୍ଥାନରେ ରଖିବା ଉଚିତ। କେନ୍ଦୁଝର ଜିଲ୍ଲାରେ ଏଫ. ଏ. ଡବ୍ଲ୍ୟୁ. ସଂକ୍ରମଣ ଉଦ୍ବେଗଜନକ ଭାବେ ବୃଦ୍ଧି ପାଉଛି। ଫଲ୍ ଆର୍ମି କୃମିର ଆକ୍ରମଣକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ, ଇମାମେକ୍ଟିନ୍ ବେନ୍ଜୋଏଟ୍ 5 ପ୍ରତିଶତ ଏସ୍ଜି @4 ଗ୍ରାମ୍/10ଲିଟ୍ ପାଣି କିମ୍ବା ଡ୍ରମ୍ (15ଲିଟ୍ ପାଣି) ରେ 8 ଗ୍ରାମ୍ ସ୍ପ୍ରେ କରନ୍ତୁ। ଏଫିଡ୍ ଏବଂ ଅନ୍ୟାନ୍ୟ ଶୋଷକ ବଗ୍ ପରିଚାଳନା ପାଇଁ, ଇମିଡାକ୍ଲୋପ୍ରିଡ୍ 17.8% SL @2 ମିଲି/ଲିଟର ସ୍ପ୍ରେ କରନ୍ତୁ। କଣ୍ଟା ତାରର ବାଡ଼ ଲଗାଇ ମାଙ୍କଡ଼ମାନଙ୍କ ଠାରୁ ମକା ଫସଲକୁ ରକ୍ଷା କରନ୍ତୁ।"
         ]
      },
      "greengram": {
         "advisory": [
            "ପରିପକ୍ୱ ଶୁଆଗୁଡ଼ିକୁ ଅମଳ କରନ୍ତୁ। ଏହାର ଆର୍ଦ୍ରତା ପ୍ରତିଶତ ହ୍ରାସ କରିବା ପାଇଁ ଏହାକୁ ସୂର୍ଯ୍ୟ ତଳେ ଶୁଖାଇ ଦିଅନ୍ତୁ। ଶୋଷକ କୀଟ ଆକ୍ରମଣକୁ ହ୍ରାସ କରିବା ପାଇଁ, ପ୍ରୋଗ୍ରେସ୍ ପ୍ଲସ୍ (ପ୍ରୋଫେନୋଫସ୍ + ସାଇପର୍ମେଥ୍ରିନ୍) @1 ମିଲି/ଲିଟର ସ୍ପ୍ରେ କରନ୍ତୁ। ସବୁଜ ଚଣା ଏବଂ କଳା ଚଣା ଫସଲରେ ଶୁଆ ଛେଦକ ସଂକ୍ରମଣ ହ୍ରାସ କରିବା ପାଇଁ, ହେକ୍ଟର ପିଛା 500 ଲିଟର ପାଣିରେ ଫ୍ଲୁବେଣ୍ଡିଆମାଇଡ୍ 20 ପ୍ରତିଶତ @150 ଗ୍ରାମ୍ କିମ୍ବା କ୍ଲୋରାଣ୍ଟ୍ରିନିଲିପୋଲ୍ 0.4 ପ୍ରତିଶତ ଜି @10 ଗ୍ରାମ୍ ଲଗାନ୍ତୁ।"
         ]
      },
      "lady finger": {
         "advisory": [
            "ପରିପକ୍ୱ ଫଳଗୁଡ଼ିକୁ ଅମଳ କରନ୍ତୁ ଏବଂ ସେଗୁଡ଼ିକୁ ସୁରକ୍ଷିତ ସ୍ଥାନରେ ରଖନ୍ତୁ। ହଳଦିଆ ଶିରା ମୋଜାଇକ ଜୀବାଣୁ ଧଳା ମାଛି ମାଧ୍ୟମରେ ବିସ୍ତାର ହୋଇପାରେ | ଏହାକୁ ପରିଚାଳନା କରିବା ପାଇଁ, କ୍ୱିନାଲଫସ୍ 25ଇସି @ହେକ୍ଟର ପିଛା 2 ଲିଟର ସ୍ପ୍ରେ କରନ୍ତୁ। ଇମାମେକ୍ଟିନ୍ ବେନ୍ଜୋଏଟ୍ @4 ଗ୍ରାମ/10 ଲିଟର ସିଞ୍ଚନ ଦ୍ୱାରା ଫଳ ଏବଂ ଶୁଟ୍ ବୋରରକୁ ନିୟନ୍ତ୍ରଣ କରାଯାଇପାରିବ |"
         ]
      },
      "chilli": {
         "advisory": [
            "ପରିପକ୍ୱ ଲଙ୍କା ଅମଳ କରନ୍ତୁ ଏବଂ ସୂର୍ଯ୍ୟାଲୋକରେ ଶୁଖାଇବା ମାଧ୍ୟମରେ ଏହାର ଆର୍ଦ୍ରତା ହ୍ରାସ କରନ୍ତୁ। ଧଳା ମାଛି ଏବଂ ଥ୍ରିପ୍ସକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ, ମାଲାଥିଅନ୍ @1 ମିଲି/ଲିଟର କିମ୍ବା ମେଟାସିସ୍ଟକ୍ସ @2 ମିଲି/ଲିଟର ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "pumpkin": {
         "advisory": [
            "ଫଳକୁ ମାଟି ଛୁଇଁବାକୁ ଦିଅନ୍ତୁ ନାହିଁ କାରଣ ଏହା ଫଳ ନଷ୍ଟ ହେବାର କାରଣ ହୋଇପାରେ। ଫଳ ତଳେ କିଛି ବସ୍ତା କିମ୍ବା ପଲିଥିନ୍ ରଖନ୍ତୁ ଏବଂ ଏହାକୁ ବଢିବାକୁ ଦିଅନ୍ତୁ। ଆଲ୍ଟରନେରିଆ ଲିଫ୍ ବ୍ଲାଇଟ୍କୁ କାର୍ବେନଡାଜିମ୍ କିମ୍ବା ମାନକୋଜେବ୍ @2 ଗ୍ରାମ୍/ଲିଟର ସିଞ୍ଚନ ଦ୍ୱାରା ପରିଚାଳନା କରାଯାଇପାରିବ। ଗଛ ପାଖରେ ବଢୁଥିବା ଆଗାଛାକୁ ବାହାର କରିଦିଅନ୍ତୁ।"
         ]
      },
      "bitter gourd": {
         "advisory": [
            "ହଡ୍ଡା ଭୃଣ ପତ୍ରର ସ୍କ୍ରାପିଂ ଏବଂ ଏହାର ଡିଫୋଲିଏସନ୍ ସୃଷ୍ଟି କରିପାରେ | କାର୍ବାରିଲ୍ 50 ଡବ୍ଲ୍ୟୁ. ପି. @3 ଗ୍ରାମ୍/ଏଲ. ଟି. ସ୍ପ୍ରେ କରନ୍ତୁ। ଫଳ ମାଛି ସଂକ୍ରମଣକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ ଏଣ୍ଡୋସଲ୍ଫାନ୍ ସ୍ପ୍ରେ @6 ମିଲି/4.5 ଲିଟର। ଏଫିଡ୍ ଜନସଂଖ୍ୟାର ପରିଚାଳନା ପାଇଁ, ମାଲାଥିଅନ୍ @1 ମିଲି/ଲିଟର କିମ୍ବା ମେଟାସିସ୍ଟକ୍ସ @2 ମିଲି/ଲିଟର ସହିତ ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "banana": {
         "advisory": [
            "ଏଫ. ୱାଇ. ଏମ. ଏବଂ ଭର୍ମିକମ୍ପୋଷ୍ଟର ପ୍ରୟୋଗ ଉଦ୍ଭିଦର ଉନ୍ନତ ଅଭିବୃଦ୍ଧିରେ ସହାୟକ ହେବ। କ୍ଲୋରୋପାଇରିଫୋସ୍ କିମ୍ବା କାର୍ବୋଫୁରାନ୍ 3ଜି ର ବ୍ୟବହାର କୀଟପତଙ୍ଗର ପିମ୍ପୁଡ଼ି ଏବଂ ଲାର୍ଭା ମାରିବାରେ ସାହାଯ୍ୟ କରିବ | କଦଳୀରେ ହଳଦିଆ ସିଗାଟୋକା ରୋଗ ପରିଚାଳନା ପାଇଁ ପତ୍ରରେ ପ୍ରୋପିକୋନାଜୋଲ୍ @0.1% ସ୍ପ୍ରେ କରନ୍ତୁ। ଯଦି ବୃଷ୍ଟିପାତର ଅଭାବ ଥାଏ ଏବଂ ଜଳସେଚନ ସମ୍ଭବ ହୁଏ, ତେବେ ଗୋଟିଏ ଜଳସେଚନ କରାଯାଇପାରିବ।"
         ]
      },
      "papaya": {
         "advisory": [
            "ପେଁପେ ଗଛ ପାଣି ଜମା ହେବା ପ୍ରତି ସମ୍ବେଦନଶୀଳ। ତେଣୁ, ମୂଳ କ୍ଷେତ୍ରରୁ ଅତିରିକ୍ତ ଜଳ ବାହାର କରନ୍ତୁ। ଉନ୍ନତ ପୋଷକ ତତ୍ତ୍ୱର ଉପଲବ୍ଧତା ପାଇଁ ମାଟିରେ ଭର୍ମିକମ୍ପୋଷ୍ଟ ମିଶାନ୍ତୁ କିମ୍ବା ଲଗାନ୍ତୁ। ଧଳା ମାଛି ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ, ମାଲାଥିଅନ୍ @1 ମିଲି/ଲିଟର କିମ୍ବା ମେଟାସିସ୍ଟକ୍ସ @2 ମିଲି/ଲିଟର ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      }
   },
   "date": "06-09-2024"
}