{
   "weather_details": {
      "15/06/2024": {
         "rainfall": 2,
         "t_max": 38,
         "t_min": 26,
         "rh_max": 58,
         "rh_min": 31,
         "wind_speed": 30,
         "wind_direction": 238,
         "cloud_cover": 6
      },
      "16/06/2024": {
         "rainfall": 0,
         "t_max": 37,
         "t_min": 26,
         "rh_max": 68,
         "rh_min": 36,
         "wind_speed": 30,
         "wind_direction": 212,
         "cloud_cover": 4
      },
      "17/06/2024": {
         "rainfall": 3,
         "t_max": 37,
         "t_min": 26,
         "rh_max": 65,
         "rh_min": 42,
         "wind_speed": 26,
         "wind_direction": 207,
         "cloud_cover": 5
      },
      "18/06/2024": {
         "rainfall": 5,
         "t_max": 36,
         "t_min": 25,
         "rh_max": 75,
         "rh_min": 46,
         "wind_speed": 28,
         "wind_direction": 204,
         "cloud_cover": 7
      },
      "19/06/2024": {
         "rainfall": 10,
         "t_max": 35,
         "t_min": 24,
         "rh_max": 71,
         "rh_min": 44,
         "wind_speed": 17,
         "wind_direction": 212,
         "cloud_cover": 7
      }
   },
   "names_of_crops": [
      "ଧାନ।",
      "ମକା",
      "ଚିନାବାଦାମ",
      "ଯ଼ାମ୍",
      "ବାଇଗଣ",
      "ଓକ୍ରା",
      "କାର୍ପ୍"
   ],
   "general_advisory": "ନର୍ସରୀ ଶଯ୍ଯ଼ା ପ୍ରସ୍ତୁତ କରନ୍ତୁ ଏବଂ ବର୍ଷା ଉପରେ ନିର୍ଭରଶୀଳ ଧାନ ରୋପଣ ଅଞ୍ଚଳରେ ମୌସୁମୀ ବର୍ଷା ପରେ ବୁଣିବା କରାଯାଇପାରିବ। ଏକ ଏକର ଜମିରେ ଧାନ ରୋପଣ ପାଇଁ 400 ମି. 2 (10 ଦଶମିକ) ଆକାରର ଜମି ଆବଶ୍ଯ଼କ। ପିମ୍ପୁଡ଼ିମାନଙ୍କୁ ଏଡ଼ାଇବା ପାଇଁ, ନର୍ସରୀ ପ୍ରସ୍ତୁତି ସମଯ଼ରେ, ନର୍ସରୀ ଶଯ୍ଯ଼ା ଚାରିପାଖରେ ଧୂଳି କ୍ଲୋରୋପାଇରିଫୋସ୍ ପାଉଡର ଲଗାନ୍ତୁ | ଧାନ ଚାଷ ପାଇଁ ସର୍ବଦା ପ୍ରମାଣିତ ମଞ୍ଜି ବ୍ଯ଼ବହାର କରନ୍ତୁ। ବୁଣିବା ପୂର୍ବରୁ ଅଙ୍କୁରୋଦଗମ ପରୀକ୍ଷା କରିବା ଉଚିତ। ବଗିଚା ଫସଲରେ ମାଟିରୁ ବାଷ୍ପୀକରଣ ହ୍ରାସ କରିବାକୁ ମଲ୍ଚିଙ୍ଗ ପରାମର୍ଶ ଦିଆଯାଇଛି | ଅଧିକ ତାପମାତ୍ରା ଏଡ଼ାଇବା ପାଇଁ ତାଜା ପ୍ରସ୍ତୁତ ପନିପରିବା ନର୍ସରୀକୁ ପଲିଥିନ୍ କିମ୍ବା ଷ୍ଟ୍ରା ଦ୍ୱାରା ଘୋଡାଇ ଦିଅନ୍ତୁ। ଜମି ପ୍ରସ୍ତୁତିର ଶେଷ ପର୍ଯ୍ଯ଼ାଯ଼ରେ ଭଲ ଭାବେ ସଙ୍କୁଚିତ ଫାର୍ମ ଯ଼ାର୍ଡର ସାର କିମ୍ବା ଗାଈ ଗୋବରକୁ ଏକର ପିଛା 8 କ୍ୱିଣ୍ଟାଲ ଲେଖାଏଁ ସିଧାସଳଖ ବିହନ ବୁଣାଯାଇଥିବା ଚାଉଳରେ ମିଶାନ୍ତୁ।",
   "crops_data": {
      "paddy": {
         "advisory": [
            "ଆର୍ଦ୍ର ନର୍ସରୀ କ୍ଷେତ ପ୍ରସ୍ତୁତି-ନର୍ସରୀ କ୍ଷେତରେ ଜଳସେଚନ କରାଯିବା ଉଚିତ ଏବଂ ଏହାକୁ 2 ରୁ 3 ଥର ପୋଖରୀରେ ପକାଇ ଦେବା ପରେ ପ୍ଲାଙ୍କିଙ୍ଗ କରିବା ଉଚିତ। ଶେଷ ପୁଡଲିଂ ସମଯ଼ରେ 200 କିଲୋଗ୍ରାମ ଏଫ୍. ଆଇ. ଏମ୍., 4 କିଲୋଗ୍ରାମ ଡି. ଏ. ପି., 2.5 କିଲୋଗ୍ରାମ ଏମ୍. ଓ. ପି. ଏବଂ 1 କିଲୋଗ୍ରାମ ଜିଙ୍କ୍ ସଲଫେଟ୍ ଲଗାନ୍ତୁ। ନର୍ସରୀ ଅଞ୍ଚଳକୁ 1.5-metre-long, 10 ସେ. ମି. ଉଚ୍ଚତା ଏବଂ ସୁବିଧାଜନକ ଲମ୍ବ ବିଶିଷ୍ଟ ଛୋଟ ଛୋଟ ପ୍ଲଟରେ ବିଭକ୍ତ କରନ୍ତୁ। ଜଳସେଚନ/ଜଳ ନିଷ୍କାସନ ପାଇଁ ଶଯ୍ଯ଼ା ସହିତ 30 ସେ. ମି. ଓସାରର ଜଳସେଚନ ଚ୍ଯ଼ାନେଲ ନିର୍ମାଣ କରାଯିବା ଉଚିତ। ପ୍ରତ୍ଯ଼େକ ଧାଡ଼ି କିମ୍ବା ସିଧାସଳଖ ପ୍ରସାରଣ ମଧ୍ଯ଼ରେ 5 ସେ. ମି. ବ୍ଯ଼ବଧାନ ସହିତ ଧାଡ଼ି ବୁଣିବା ଦ୍ୱାରା ଅଙ୍କୁରିତ ବୀଜଗୁଡିକ @40-50 ଗ୍ରାମ୍/ମି2 ଅଞ୍ଚଳରେ ବୀଜ ବିଛାଇବା ଉଚିତ ଏବଂ ମଞ୍ଜି ଉପରେ ଶୁଖିଲା କମ୍ପୋଷ୍ଟ ପକାଇବା ଉଚିତ | ବିଶେଷ କରି ସନ୍ଧ୍ଯ଼ାରେ ନର୍ସରୀ ଅଞ୍ଚଳରେ ହାଲୁକା ଜଳସେଚନ କରନ୍ତୁ, ଯାହାଦ୍ୱାରା କ୍ଷେତ ଓଦା ରହିବ ଏବଂ ପାଣି ଛିଡ଼ା ହୋଇ ରହିବ ନାହିଁ।"
         ]
      },
      "maize": {
         "advisory": [
            "ବୀଜ ଚିକିତ୍ସା-ଫଲ୍ ଆର୍ମିର ସଂକ୍ରମଣକୁ ଏଡ଼ାଇବା ପାଇଁ କୃମି ବୀଜ ଚିକିତ୍ସା ବାଧ୍ଯ଼ତାମୂଳକ ଯାହା ଫସଲ ବୃଦ୍ଧିର ପ୍ରାରମ୍ଭିକ ପର୍ଯ୍ଯ଼ାଯ଼ରେ ଉଦ୍ଭିଦକୁ କୀଟ ଆକ୍ରମଣରୁ ରକ୍ଷା କରେ | 1-କିଲୋଗ୍ରାମ ମଞ୍ଜି 4-ମିଲି Cyantraniliprole19.8% + Thiomethoxam19.8% ଏଫ୍. ଏସ୍. ସହିତ ଚିକିତ୍ସା କରନ୍ତୁ।"
         ]
      },
      "groundnut": {
         "advisory": [
            "ଉପଯୁକ୍ତ ପ୍ରକାରର ଚିନାବାଦାମ ବ୍ଯ଼ବହାର କରନ୍ତୁ ଯେପରିକି ଦେବୀ (ଆଇ. ସି. ଜି. ଭି.-91114), କାଦ୍ରି-6, କାଦ୍ରି-9, ଟି. ଜି.-37ଏ, ଟି. ଏ. ଜି.-51, ଟି. ଏ. ଜି.-38, ଟି. ଏ. ଜି.-24, ସ୍ମୃତି, ସି. ଓ.-7, ଧରଣୀ ଇତ୍ଯ଼ାଦି। ବୁଣିବା 1 ଘଣ୍ଟା ପୂର୍ବରୁ 20 ଗ୍ରାମ୍/କି. ଗ୍ରା. ମୂଲ୍ଯ଼ର ସୁପାରିଶ କରାଯାଇଥିବା ପ୍ରଜାତିର ରାଇଜୋବିଯ଼ମ୍ ବ୍ଯ଼ାକ୍ଟେରିଆ କଲ୍ଚର୍ର ମଞ୍ଜି ବ୍ଯ଼ବହାର କରନ୍ତୁ।"
         ]
      },
      "yam": {
         "advisory": [
            "ମେ 'ରୁ ଜୁନ୍ ମାସ ହେଉଛି ଯମ୍ ରୋପଣ ପାଇଁ ସର୍ବୋତ୍ତମ ସମଯ଼। ସ୍ଥାନୀଯ଼ କିସମ ଯଥାଃ ଶ୍ରୀକୀର୍ତି, ଶ୍ରୀରୁପା, ହାଥିଖୋଜ, ଶ୍ରୀଶିଲ୍ପି, ଛୋଟ ଯ଼ାମଃ ଶ୍ରୀଲତା, ଶ୍ରୀକଲା ପରି ଉପଯୁକ୍ତ ଉଚ୍ଚ ଉତ୍ପାଦନକାରୀ କିସମ ଚାଷ କରନ୍ତୁ | ଧଳା ଯାମ୍ଃ ଶ୍ରୀସୁବ୍ରା, ଶ୍ରୀପ୍ରିଯ଼ା, ଶ୍ରୀଧନ୍ଯ଼ା। ଏକ ଏକର ଜମିରେ ଚାରା ଲଗାଇବା ପାଇଁ 8-10 କ୍ୱିଣ୍ଟାଲ ଯମର ଆବଶ୍ଯ଼କତା ରହିଛି। ପ୍ରତ୍ଯ଼େକ ଯମ୍କୁ 150-200 g ଖଣ୍ଡରେ କାଟନ୍ତୁ। 1. 5 ଫୁଟ ବ୍ଯ଼ାସ ଏବଂ 1.5ft ଗଭୀର ଗର୍ତ୍ତଗୁଡ଼ିକୁ 3X3 ଫୁଟ ବ୍ଯ଼ବଧାନରେ ଖୋଳନ୍ତୁ। ଅନ୍ତିମ ଭୂମି ପ୍ରସ୍ତୁତି ସମଯ଼ରେ 5 ଟନ୍ ଏଫ. ୱାଇ. ଏମ୍. ପ୍ରଯ଼ୋଗ କରନ୍ତୁ। ସୁପାରିସ କରାଯାଇଥିବା ସାର ମାତ୍ରା 32:24:32 କେଜି NPK/ଏକରର ସମ୍ପୂର୍ଣ୍ଣ P କୁ ଆଧାର ଭାବରେ ପ୍ରଯ଼ୋଗ କରନ୍ତୁ। ବୀଜ ସାମଗ୍ରୀକୁ 5-10 ସେ. ମି. ଗଭୀରତାରେ ରୋପଣ କରନ୍ତୁ। ଶଯ୍ଯ଼ାକୁ 5 ସେ. ମି. ଉଚ୍ଚତା ବିଶିଷ୍ଟ ଷ୍ଟ୍ରା ମଲ୍ଚରେ ଢାଙ୍କି ଦିଅନ୍ତୁ।"
         ]
      },
      "brinjal": {
         "advisory": [
            "ରୋଗକୁ ହ୍ରାସ କରିବା-ନର୍ସରୀରେ ବାଇଗଣ ଗଛର ରୋଗକୁ ହ୍ରାସ କରିବା ପାଇଁ, 10 ଲିଟର ପାଣିରେ 20 ଗ୍ରାମ୍ ମେଟାଲ୍ଯ଼ାକ୍ସିଲ୍ 4 ପ୍ରତିଶତ + ମାଙ୍କନ୍ଜେବ୍ 64 ପ୍ରତିଶତ ଦ୍ରବଣ ସହିତ ଶଯ୍ଯ଼ା ମାଟିକୁ ଭିଜାଇ ଦିଅନ୍ତୁ | ବାଇଗଣ ଚାରା ରୋପଣର 25-30 ଦିନ ପରେ ରୋପଣ ପାଇଁ ପ୍ରସ୍ତୁତ ହୋଇଯାଏ। ରୋପଣ ପାଇଁ ଚାରା ଉପୁଡ଼ିବା ପୂର୍ବରୁ ଗୋଟିଏ ଦିନ ସନ୍ଧ୍ଯ଼ାରେ, 10 ଲିଟର ପାଣିରେ 25 ଗ୍ରାମ୍ କପର ଅକ୍ସିକ୍ଲୋରାଇଡ୍ ଏବଂ 1 ଗ୍ରାମ୍ ସ୍ଟ୍ରେପ୍ଟୋସାଇକ୍ଲିନ୍ ଦ୍ୱାରା ପ୍ରସ୍ତୁତ ଦ୍ରବଣରେ ନର୍ସରୀ ଶଯ୍ଯ଼ା ମାଟିକୁ ଭିଜାଇ ଦିଅନ୍ତୁ।"
         ]
      },
      "okra": {
         "advisory": [
            "ଓକ୍ରାରେ ଏଫିଡ୍, ଜ୍ଯାସିଡ୍, ଥ୍ରିପ୍ ଏବଂ ହ୍ୱାଇଟ୍ଫ୍ଲାଇ ପରି କୀଟ ଶୋଷିବାର ସମ୍ଭାବନା ଅଛି | ସଂକ୍ରମଣର ପ୍ରାରମ୍ଭିକ ପର୍ଯ୍ଯ଼ାଯ଼ରେ 200 ଲିଟର ପାଣିରେ ମିଶ୍ରଣ କରି ନିମ୍ବ ଆଧାରିତ କୀଟନାଶକ (ନିମ୍ବ ତେଲ 1500 ପିପିଏମ @600 ମିଲି/ଏକର) ସ୍ପ୍ରେ କରନ୍ତୁ। ଥିଯ଼ାମେଥୋକ୍ସାମ୍ 25 ପ୍ରତିଶତ ଡବ୍ଲୁ. ଜି. ଏକର ପିଛା 40 ଗ୍ରାମ୍ କିମ୍ବା ଏସିଟାମିପ୍ରିଡ୍ 20 ପ୍ରତିଶତ ଏସ୍. ପି. ଏକର ପିଛା 50 ଗ୍ରାମ୍ କିମ୍ବା ଟଲ୍ଫେନ୍ପିରାଡ୍ 15 ପ୍ରତିଶତ ଇ. ସି. ଏକର ପିଛା 400 ମିଲି, 200 ଲିଟର ପାଣିରେ ମିଶାଇ ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "carp": {
         "advisory": [
            "ଦ୍ରୁତ ଗତିରେ ବଢ଼ୁଥିବା ରୋହୁ, କାଟଲା ଏବଂ ମ୍ରିଗଲ ଭଳି କାର୍ପକୁ 4ଃ3ଃ3 ଅନୁପାତରେ ମହଜୁଦ ରଖିବା ଉଚିତ, ଯାହାଦ୍ୱାରା ଏହାର ଲାଭ ବଢ଼ିପାରିବ। ସାଧାରଣତଃ, ହେକ୍ଟର ପିଛା 5,000 ଫିଙ୍ଗରଲିଙ୍ଗର ଘନତ୍ୱ ଏକ ମାନକ ଷ୍ଟକିଂ ଭାବରେ ରଖାଯାଏ | ଚିନାବାଦାମ ତେଲ କେକ୍ ଏବଂ ଚାଉଳ ଚୋପା ଷ୍ଟକିଂ ସାମଗ୍ରୀର ମୋଟ ବାଯ଼ୋମାସର 5 ପ୍ରତିଶତ ଅନୁପାତରେ ସମାନ ଅନୁପାତରେ ଦିଆଯାଏ | ପୁଷ୍କରିଣୀର ଗୁଣବତ୍ତା ବୃଦ୍ଧି ପାଇଁ ଗୋବର, ଯ଼ୁରିଆ ଏବଂ ସୁପର ଫସଫେଟ୍ ପ୍ରଯ଼ୋଗ କରାଯିବା ଉଚିତ। 8-10 ମାସରେ, ମାଛମାନେ ସେମାନଙ୍କର ବିପଣନ ଯୋଗ୍ଯ଼ ଆକାରରେ ପହଞ୍ଚନ୍ତି |"
         ]
      }
   },
   "date": "14-06-2024"
}