{
   "weather_details": {
      "30/10/2024": {
         "rainfall": 8,
         "t_max": 33,
         "t_min": 26,
         "rh_max": 93.9,
         "rh_min": 69.2,
         "wind_speed": 4,
         "wind_direction": 90,
         "cloud_cover": 7
      },
      "31/10/2024": {
         "rainfall": 0.1,
         "t_max": 33,
         "t_min": 25,
         "rh_max": 91.7,
         "rh_min": 67.7,
         "wind_speed": 5,
         "wind_direction": 260,
         "cloud_cover": 6
      },
      "01/11/2024": {
         "rainfall": 0,
         "t_max": 33,
         "t_min": 24,
         "rh_max": 91.1,
         "rh_min": 61.3,
         "wind_speed": 6,
         "wind_direction": 261,
         "cloud_cover": 6
      }
   },
   "names_of_crops": [
      "ଧାନ।",
      "ରବି ଡାଲି",
      "ତୈଳବୀଜ",
      "ପନିପରିବା",
      "ସବୁଜ ଚଣା",
      "କଳା ଚଣା",
      "କଦଳୀ",
      "କ୍ଷେତ ମଟର",
      "ମସୁର ଡାଲି",
      "ଚିନାବାଦାମ",
      "ତୋରିଆ",
      "ସୂର୍ଯ୍ଯ଼ମୁଖୀ"
   ],
   "general_advisory": "କ୍ଷେତରେ ଉପଲବ୍ଧ ମୃତ୍ତିକା ଆର୍ଦ୍ରତାର ଉପଯୋଗ କରି ମଧ୍ଯ଼ମ/ଅଗଭୀର ତଳିଆ ଅଞ୍ଚଳରେ ସବୁଜ ଗହମ, କଳା ଗହମ, ମଟର, ମଟର, ଚିନାବାଦାମ, ତୋରିଆ ଏବଂ ସୂର୍ଯ୍ଯ଼ମୁଖୀ ଭଳି ସ୍ୱଳ୍ପକାଳୀନ ରବି ଫସଲ ଚାଷ କରିବାକୁ କୃଷକମାନଙ୍କୁ ପରାମର୍ଶ ଦିଆଯାଇଛି। କୀଟ ସଂକ୍ରମଣ ରୋକିବା ପାଇଁ କୃଷକମାନଙ୍କୁ ନିଯ଼ମିତ ଭାବେ ନିଜ ଫସଲ କ୍ଷେତ ପରିଦର୍ଶନ କରିବାକୁ ପରାମର୍ଶ ଦିଆଯାଇଛି।",
   "crops_data": {
      "paddy": {
         "advisory": [
            "ଶାରୀରିକ ପରିପକ୍ୱତା ପର୍ଯ୍ୟାୟରେ ଫୁଲ ଆସିବା-କାନ ମୁଣ୍ଡ କ୍ୟାଟରପିଲରଃ 400 ମିଲି/ଏକର କିମ୍ବା ପ୍ରୋଫେନୋଫସ୍ 50 ପ୍ରତିଶତ ଇସି @400 ମିଲି/ଏକର। ଯେହେତୁ କୀଟ ଆଚରଣରେ ନିଶାଚର, ଉତ୍ତମ ଫଳାଫଳ ପାଇଁ ସନ୍ଧ୍ୟାରେ କୀଟନାଶକ ସିଞ୍ଚନ କରାଯିବା ଉଚିତ୍ | ଗୁଣ୍ଡି ବଗ ମ୍ୟାନେଜମେଣ୍ଟଃ 200 ଲିଟର ପାଣିରେ ମିଶାଇ ଏକର ପିଛା 400 ମିଲିଲିଟରରେ 50 ପ୍ରତିଶତ ଇ. ସି."
         ]
      },
      "groundnut": {
         "advisory": [
            "ଫିଜିଓଲୋଜିକାଲ୍ ପରିପକ୍ୱତା ପର୍ଯ୍ଯ଼ାଯ଼/ଅମଳ ପର୍ଯ୍ଯ଼ାଯ଼-ସଂରକ୍ଷଣଃ ଚିନାବାଦାମକୁ ପଲିଥିନ୍ ଲାଇନ୍ ହୋଇଥିବା ଗନ୍ନୀ ବ୍ଯ଼ାଗ୍ରେ ଫିଉଜଡ୍ କ୍ଯ଼ାଲସିଯ଼ମ୍ କ୍ଲୋରାଇଡ୍ @250-ଗ୍ରାମ୍/30 ବକ୍ସ ପରି ଡେସିକାଣ୍ଟ ସହିତ ସଂରକ୍ଷଣ କରାଯିବା ଉଚିତ୍ |"
         ]
      },
      "sugarcane": {
         "advisory": [
            "ପରିପକ୍ୱତା ପର୍ଯ୍ୟାୟ-ଇଣ୍ଟର୍ନୋଡ୍ ବୋରର୍ ପରିଚାଳନାଃ ପ୍ରତ୍ୟେକ କାର୍ଡକୁ 12 ଖଣ୍ଡରେ ବିଭକ୍ତ କରି 6 ଥର ପାଇଁ ସାପ୍ତାହିକ ବ୍ୟବଧାନ | ରାସାୟନିକ ଭାବରେ କୀଟକୁ ପରିଚାଳନା କରିବା ପାଇଁ, 200 ଲିଟରରେ ମିଶ୍ରଣ କରି ଏକର ପିଛା 600-ମିଲି କିମ୍ବା କ୍ଲୋରାଣ୍ଟ୍ରାନିଲିପ୍ରୋଲ 0.4 ଜିଆର @4 କେଜି ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "cucurbits": {
         "advisory": [
            "ଫଳ ଦେବା ପାଇଁ ଉଦ୍ଭିଦ-ଫଳ ମାଛିଃ ମାଲାଥିଅନ୍ ମାଛିମାନେ ଏହା ପ୍ରତି ଆକର୍ଷିତ ହେବେ ଏବଂ ଶେଷରେ ବିଷାକ୍ତ ବିଟ୍ ରେ ପଡ଼ି ମୃତ୍ଯ଼ୁବରଣ କରିବେ |"
         ]
      },
      "cole crop": {
         "advisory": [
            "ଉଦ୍ଭିଦ ସ୍ତର-ସାର ପରିଚାଳନାଃ ଏକର ପିଛା 20 ଡିଏଟି ଏବଂ 33 କେଜି ଯ଼ୁରିଆ ଏବଂ 23 କେଜି ଏମଓପି। ପ୍ରତିରୋପଣର ଦୁଇ ସପ୍ତାହ ପରେ ଏବଂ ଦହି ତିଆରି ହେବାର ଦୁଇ ସପ୍ତାହ ପୂର୍ବରୁ ବୋରନ ମାଇକ୍ରୋ ନ୍ଯ଼ୁଟ୍ରିଏଣ୍ଟ ସିଞ୍ଚନ କରାଯିବା ଉଚିତ।"
         ]
      },
      "marigold & rose": {
         "advisory": [
            "ମାରିଗୋଲ୍ଡ ଏବଂ ଗୋଲାପ ପରି ଫୁଲରେ ରେଡ୍ ସ୍ପାଇଡର ମାଇଟ୍କୁ ପରିଚାଳନା କରିବା ପାଇଁ ୱେଟେବଲ୍ ସଲଫର୍ 80 ପ୍ରତିଶତ ଡବ୍ଲ୍ୟୁ. ପି. @2 ମିଲି/ଲିଟର ପାଣି କିମ୍ବା ଫେନପାଇରୋକ୍ସିମେଟ୍ 5 ପ୍ରତିଶତ ଇସି @2 ମିଲି/ଲିଟର ପାଣି ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      }
   },
   "date": "29-10-2024",
   "ERROR": "ନିଯ଼ମିତ ତଥ୍ଯ଼ ମିଳୁନାହିଁ।"
}