{
   "weather_details": {
      "30/11/2024": {
         "rainfall": 5,
         "t_max": 26,
         "t_min": 21,
         "rh_max": 80,
         "rh_min": 56,
         "wind_speed": 16,
         "wind_direction": 28,
         "cloud_cover": 8
      },
      "01/12/2024": {
         "rainfall": 4,
         "t_max": 27,
         "t_min": 20,
         "rh_max": 80,
         "rh_min": 62,
         "wind_speed": 14,
         "wind_direction": 29,
         "cloud_cover": 26
      },
      "02/12/2024": {
         "rainfall": 2,
         "t_max": 27,
         "t_min": 20,
         "rh_max": 82,
         "rh_min": 60,
         "wind_speed": 13,
         "wind_direction": 26,
         "cloud_cover": 16
      },
      "03/12/2024": {
         "rainfall": 1,
         "t_max": 29,
         "t_min": 18,
         "rh_max": 78,
         "rh_min": 55,
         "wind_speed": 11,
         "wind_direction": 28,
         "cloud_cover": 16
      }
   },
   "names_of_crops": [
      "ଧାନ।",
      "ଚିନାବାଦାମ",
      "ଲଙ୍କା",
      "କୋଇଲା ଫସଲ",
      "କଦଳୀ",
      "କୁକୁଡ଼ା ମାଂସ"
   ],
   "general_advisory": "ଶୀତକାଳୀନ ପନିପରିବା ଫସଲର ସମ୍ପୂର୍ଣ୍ଣ ରୋପଣ। କମ୍ ତାପମାତ୍ରା କାରଣରୁ କମ୍ ଅଙ୍କୁରୋଦଗମକୁ ଏଡ଼ାଇବା ପାଇଁ ପନିପରିବା ନର୍ସରୀ ଉପରେ କମ୍ ମୂଲ୍ୟର ପଲିଥିନ୍ କଭର ବ୍ୟବହାର କରନ୍ତୁ। କୋଲ୍ ଫସଲରେ ଶୀଘ୍ର ଏବଂ ସର୍ବାଧିକ ଉତ୍ପାଦନ ପାଇଁ ଗିବ୍ବେରେଲିକ୍ ଏସିଡ୍ 0.001% L ସ୍ପ୍ରେ କରନ୍ତୁ। ନିୟମିତ ଭାବରେ କୀଟପତଙ୍ଗ ଏବଂ ରୋଗ ପାଇଁ ଉପଯୁକ୍ତ କ୍ଷେତ୍ର ତଦାରଖ କରନ୍ତୁ | ଶୀତଦିନେ ଥଣ୍ଡା କିମ୍ବା ରାତି ସମୟରେ, କୃଷକମାନେ ଶୀତଳ ବାୟୁ ସହିତ ସିଧାସଳଖ ଯୋଗାଯୋଗକୁ ରୋକିବା ପାଇଁ ଦ୍ୱାର, ଝରକା ଏବଂ ଖୋଲା ସ୍ଥାନକୁ ଆଚ୍ଛାଦିତ ରଖିବା ଉଚିତ୍ |",
   "crops_data": {
      "paddy": {
         "advisory": [
            "ଅମଳ ପରବର୍ତ୍ତୀ ପର୍ଯ୍ୟାୟ ପରାମର୍ଶଃ ଯଦି 'ମୂଷା/ମୂଷା' ସମସ୍ୟା ଦେଖାଯାଏ, ତେବେ ଫସଲ କ୍ଷେତ ଏବଂ ଆଖପାଖ ଅଞ୍ଚଳରେ ମୂଷା ଗର୍ତ୍ତକୁ ଚିହ୍ନଟ କରନ୍ତୁ। ମୂଷାଙ୍କୁ ମାରିବା ପାଇଁ ଆଲୁମିନିୟମ୍ ଫସଫାଇଡ୍ 6 ପ୍ରତିଶତ ଟାବଲେଟ୍ ରଖନ୍ତୁ |"
         ]
      },
      "groundnut": {
         "advisory": [
            "ଉଦ୍ଭିଦଗତ ପର୍ଯ୍ୟାୟ ପରାମର୍ଶଃ ତମାଖୁ କ୍ୟାଟରପିଲର ପରିଚାଳନା ପାଇଁ, ଫେରୋମୋନ୍ ଟ୍ରାପ୍ ବ୍ୟବହାର କରନ୍ତୁ ଏବଂ ଉପଯୁକ୍ତ କୀଟନାଶକ ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "chilli": {
         "advisory": [
            "ଉଦ୍ଭିଦ ପର୍ଯ୍ୟାୟ ପରାମର୍ଶଃ ଏଫିଡ୍ ଏବଂ ଥ୍ରିପ୍ସ ସଂକ୍ରମଣ ପାଇଁ, ନିମ-ଆଧାରିତ କୀଟନାଶକ ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "cole crops": {
         "advisory": [
            "ଉଦ୍ଭିଦଗତ ପର୍ଯ୍ୟାୟ ପରାମର୍ଶଃ ଡାଇମଣ୍ଡ ବ୍ୟାକ୍ ମଥ ସଂକ୍ରମଣର ପରିଚାଳନା ପାଇଁ, ନିମ-ଆଧାରିତ କୀଟନାଶକ ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "banana": {
         "advisory": [
            "ବୃକ୍ଷରୋପଣ ପରାମର୍ଶଃ ବାମନ କିସମର କଦଳୀ ରୋପଣ ପାଇଁ ନଭେମ୍ବର ହେଉଛି ସର୍ବୋତ୍ତମ ସମୟ। ବାମନ କ୍ୟାଭେଣ୍ଡିଶ୍ ଏବଂ ରୋବଷ୍ଟା କିସମ ବ୍ୟବହାର କରନ୍ତୁ।"
         ]
      },
      "poultry": {
         "advisory": [
            "ବିଶେଷ କରି ରାତି ସମୟରେ ଛୁଆମାନଙ୍କୁ ଉତ୍ତାପ ଯୋଗାଇବା ପାଇଁ ଆବଶ୍ୟକ ବ୍ୟବସ୍ଥା କରନ୍ତୁ। କୁକୁଡ଼ା ଘର ସଫା ରଖନ୍ତୁ।"
         ]
      }
   },
   "date": "29-11-2024"
}