{
   "weather_details": {
      "20/07/2024": {
         "rainfall": 30,
         "t_max": 32,
         "t_min": 26,
         "rh_max": 89,
         "rh_min": 65,
         "wind_speed": 11,
         "wind_direction": 99,
         "cloud_cover": 8
      },
      "21/07/2024": {
         "rainfall": 15,
         "t_max": 33,
         "t_min": 26,
         "rh_max": 85,
         "rh_min": 61,
         "wind_speed": 12,
         "wind_direction": 155,
         "cloud_cover": 8
      },
      "22/07/2024": {
         "rainfall": 10,
         "t_max": 34,
         "t_min": 27,
         "rh_max": 83,
         "rh_min": 67,
         "wind_speed": 13,
         "wind_direction": 243,
         "cloud_cover": 7
      },
      "23/07/2024": {
         "rainfall": 5,
         "t_max": 34,
         "t_min": 27,
         "rh_max": 78,
         "rh_min": 67,
         "wind_speed": 18,
         "wind_direction": 248,
         "cloud_cover": 7
      },
      "24/07/2024": {
         "rainfall": 5,
         "t_max": 33,
         "t_min": 27,
         "rh_max": 79,
         "rh_min": 57,
         "wind_speed": 21,
         "wind_direction": 248,
         "cloud_cover": 6
      }
   },
   "names_of_crops": [
      "ଡାଲିଗୁଡ଼ିକ",
      "ମକା",
      "ପନିପରିବା",
      "ଆଖୁ"
   ],
   "general_advisory": "ନିମ୍ନ ଭୂମିରେ, ମୁଖ୍ଯ଼ କ୍ଷେତରେ 21 ଦିନ ପାଇଁ ଧାନ ଚାରା ରୋପଣ କରନ୍ତୁ। ବର୍ଷା ଜଳକୁ ମୁଖ୍ଯ଼ ଧାନ କ୍ଷେତରେ ବନ୍ଧ କରି ରଖନ୍ତୁ, ଯାହାଦ୍ୱାରା ଠିକ୍ ସମଯ଼ରେ ପାଣି ନିଷ୍କାସନ ଏବଂ ରୋପଣ କରାଯାଇପାରିବ। ବର୍ତ୍ତମାନ ଯେଉଁଠାରେ ପର୍ଯ୍ଯ଼ାପ୍ତ ବର୍ଷା ହୋଇଥିଲା, ସେଠାରେ ବିଉଶନିଂ କରାଯାଇପାରିବ। ପ୍ରବଳ ବର୍ଷା ହେଉଥିବା ଅଞ୍ଚଳରେ, ବର୍ତ୍ତମାନ ପାଇଁ ମଞ୍ଜି ବୁଣିବା ଏବଂ ସାର କିମ୍ବା ତୃଣନାଶକ ପଦାର୍ଥ ଉପରେ ଲଗାଇବା ବନ୍ଦ କରନ୍ତୁ। ଜୁଲାଇର ଦ୍ୱିତୀଯ଼ ପନ୍ଦର ଦିନ ଶେଷ ସୁଦ୍ଧା ନର୍ସରୀ ବୁଣିବା ଶେଷ ହେବା ଉଚିତ। ଯଦି ଧାନ ନର୍ସରୀରେ ଥ୍ରୀପ୍ସର ସଂକ୍ରମଣ ଦେଖାଯାଏ, ତେବେ ଏନ୍. ଏସ୍. କେ. ଇ. (ଆଜାଦିରାକ୍ଟିନ) @ଏକର ପିଛା 800 ମିଲି କିମ୍ବା ଲାମ୍ବଡା-ସାଇଯ଼ାଲୋଥ୍ରିନ 5 ପ୍ରତିଶତ ଇ. ସି. @ଏକର ପିଛା 100 ମିଲି କିମ୍ବା ଥିଯ଼ାମେଥୋକ୍ସାମ 25 ପ୍ରତିଶତ ଡବ୍ଲୁ. ଜି. @ଏକର ପିଛା 40 ଗ୍ରାମ୍ ସ୍ପ୍ରେ କରନ୍ତୁ। ଯଦି ଚାରା ରୋଗ ଦେଖାଯାଏ, ତେବେ ପ୍ରୋପିକୋନାଜୋଲ୍ @1 ମିଲି/ଲିଟର ପାଣି ଲଗାନ୍ତୁ। ଯେଉଁଠାରେ ମକା କିମ୍ବା ଡାଲି ଇତ୍ଯ଼ାଦି ରୋପଣ କରାଯାଇଛି, ସେଠାରେ ଜଳ ନିଷ୍କାସନ ବ୍ଯ଼ବସ୍ଥା କରନ୍ତୁ। ପ୍ରବଳ ବର୍ଷାରୁ ରକ୍ଷା ପାଇବା ପାଇଁ ପନିପରିବା ନର୍ସରୀକୁ ପଲିଥିନ୍ ଦ୍ୱାରା ଢାଙ୍କି ଦିଅନ୍ତୁ ଏବଂ ଜଳ ନିଷ୍କାସନ ବ୍ଯ଼ବସ୍ଥା କରନ୍ତୁ।",
   "crops_data": {
      "pulses": {
         "advisory": [
            "କଳା ଚଣା ଏବଂ ସବୁଜ ଚଣା ପାଇଁ ବିହନ ହାର ଏକର ପିଛା 10 କିଲୋଗ୍ରାମ ରଖନ୍ତୁ।",
            "ବୁଣିବା ପୂର୍ବରୁ ମଞ୍ଜି ଚିକିତ୍ସା କରନ୍ତୁ।"
         ]
      },
      "maize": {
         "advisory": [
            "ଯେଉଁଠାରେ ମକା ରୋପଣ କରାଯାଇଛି, ସେଠାରେ ଜଳ ନିଷ୍କାସନ ପାଇଁ ବ୍ଯ଼ବସ୍ଥା କରନ୍ତୁ।"
         ]
      },
      "vegetables": {
         "advisory": [
            "ପ୍ରବଳ ବର୍ଷାରୁ ରକ୍ଷା ପାଇବା ପାଇଁ ପନିପରିବା ନର୍ସରୀକୁ ପଲିଥିନ୍ ଦ୍ୱାରା ଢାଙ୍କି ଦିଅନ୍ତୁ।"
         ]
      },
      "sugarcane": {
         "advisory": [
            "ଆଖୁ ଫସଲରେ ମିଳି ବଗ୍ ପରିଚାଳନା କରିବା ପାଇଁ, ଇମିଡାକ୍ଲୋପ୍ରିଡ୍ 17.8% ଏସ୍. ଏଲ୍. @ଏକର ପିଛା 60 ମିଲି କିମ୍ବା ଥିଯ଼ାମେଥୋକ୍ସାମ୍ 25 ପ୍ରତିଶତ ଡବ୍ଲୁ. ଜି. @ଏକର ପିଛା 40 ଗ୍ରାମ୍ କିମ୍ବା ପ୍ରୋଫେନୋଫସ୍ 50 ପ୍ରତିଶତ ଇ. ସି. @ଏକର ପିଛା 400 ମିଲି, ଏହାକୁ 200 ଲିଟର ପାଣିରେ ମିଶାଇ ସ୍ପ୍ରେ କରନ୍ତୁ।",
            "20x15 ସେ. ମି. ବ୍ଯ଼ବଧାନରେ <ଆଇ. ଡି. 1> ଦିନ ପୁରୁଣା ଚାରା ରୋପଣ କରାଯିବା ଉଚିତ, ଅଧିକ ଉତ୍ପାଦନକ୍ଷମ ପ୍ରଜାତି ପାଇଁ ପ୍ରତି ପାହାଡ଼ରେ 2ରୁ 3 ଚାରା ଲଗାଇବା ଉଚିତ।"
         ]
      }
   },
   "date": "19-07-2024"
}