{
   "weather_details": {
      "28/01/2025": {
         "rainfall": 0,
         "t_max": 30,
         "t_min": 18,
         "rh_max": 94,
         "rh_min": 48,
         "wind_speed": 7,
         "wind_direction": 209,
         "cloud_cover": 0
      },
      "29/01/2025": {
         "rainfall": 0,
         "t_max": 29,
         "t_min": 18,
         "rh_max": 91,
         "rh_min": 46,
         "wind_speed": 3,
         "wind_direction": 252,
         "cloud_cover": 0
      }
   },
   "names_of_crops": [
      "ଧାନ।",
      "ଚିନାବାଦାମ",
      "ସୋରିଷ",
      "କଳା ଚଣା",
      "ସବୁଜ ଚଣା",
      "ଆଳୁ",
      "କୋଇଲା ଫସଲ",
      "ଟମାଟୋ",
      "ବାଇଗଣ",
      "ଗୋଲାପ।",
      "ମତ୍ସ୍ୟଚାଷ"
   ],
   "general_advisory": "ଆଇଏମଡିରୁ ମିଳିଥିବା ପୂର୍ବାନୁମାନ ଅନୁଯାୟୀ, ପାଗ ଶୁଖିଲା ରହିପାରେ। କୃଷକମାନଙ୍କୁ ସେମାନଙ୍କ କ୍ଷେତକୁ ଜଳସେଚନ କରିବା ଏବଂ ନିମ୍ନରେ ଉଲ୍ଲେଖ କରାଯାଇଥିବା ନିର୍ଦ୍ଦିଷ୍ଟ ଫସଲ ସମ୍ବନ୍ଧୀୟ ପରାମର୍ଶ ଅନୁସରଣ କରିବାକୁ ପରାମର୍ଶ ଦିଆଯାଇଛି।",
   "crops_data": {
      "paddy": {
         "advisory": [
            "ଧାନରେ କାଣ୍ଡ ଛେଦକକୁ ପରିଚାଳନା କରିବା ପାଇଁ, ସପ୍ତାହରେ 6 ଥର ଟ୍ରାଇକୋଗ୍ରାମମାଜାପୋନିକମ୍ କାର୍ଡ ବ୍ୟବହାର କରନ୍ତୁ।",
            "ଷ୍ଟେମ ବୋରର୍ ପରିଚାଳନା ପାଇଁ କାର୍ଟାପ୍ ହାଇଡ୍ରୋକ୍ଲୋରାଇଡ୍ କିମ୍ବା କ୍ଲୋରାଣ୍ଟ୍ରାନିଲିପ୍ରୋଲ୍ କିମ୍ବା ଇମିଡାକ୍ଲୋପ୍ରିଡ୍ ପ୍ରୟୋଗ କରନ୍ତୁ |"
         ]
      },
      "groundnut": {
         "advisory": [
            "କାଣ୍ଡ କ୍ଷୟକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ, ଭାଲିଡାମାଇସିନ୍ କିମ୍ବା କ୍ୟାପଟାନ + ହେକ୍ସାକୋନାଜୋଲ ସହିତ ମାଟିକୁ ଭିଜାଇ ଦିଅନ୍ତୁ |"
         ]
      },
      "mustard": {
         "advisory": [
            "କୀଟ ସଂକ୍ରମଣ ପାଇଁ, ନିମ୍ବ ଆଧାରିତ କୀଟନାଶକ କିମ୍ବା ରାସାୟନିକ ସ୍ପ୍ରେ ଯେପରିକି ଥାୟାମେଥୋକ୍ସାମ୍ କିମ୍ବା ଏସିଟାମିପ୍ରିଡ୍ କିମ୍ବା ଇମିଡାକ୍ଲୋପ୍ରିଡ୍ ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "black gram": {
         "advisory": [
            "ପାଉଡର ଫଙ୍ଗୁର ପରିଚାଳନା ପାଇଁ, ସଲଫର୍ କିମ୍ବା ହେକ୍ସାକୋନାଜୋଲ୍ କିମ୍ବା ପ୍ରୋପିକୋନାଜୋଲ୍ କିମ୍ବା ପେଙ୍କୋନାଜୋଲ୍ ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "green gram": {
         "advisory": [
            "ପାଉଡର ଫଙ୍ଗୁର ପରିଚାଳନା ପାଇଁ, କଳା ଚଣା ଭଳି ସମାନ ପଦ୍ଧତି।"
         ]
      },
      "potato": {
         "advisory": [
            "ପ୍ରାରମ୍ଭିକ ବ୍ଲାଇଟ୍ ପରିଚାଳନା ପାଇଁ, ମାନକୋଜେବ୍ କିମ୍ବା କାର୍ବେଣ୍ଡାଜିମ୍ ସ୍ପ୍ରେ କରନ୍ତୁ।",
            "ବିଳମ୍ବିତ ବ୍ଲାଇଟ ପାଇଁ, 10 ଦିନ ବ୍ୟବଧାନରେ ମେଟାଲାକ୍ସିଲ + ମାନକୋଜେବ ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "cole crops": {
         "advisory": [
            "ଡାଇମଣ୍ଡ ବ୍ୟାକ୍ ମଥ୍ ଏବଂ ହେଡ୍ ବୋରର୍ ପାଇଁ ଅନୁକୂଳ, କ୍ୟାଟର୍ପିଲାର୍ ଏବଂ ଅଣ୍ଡା ପିଣ୍ଡ ସଂଗ୍ରହ କରନ୍ତୁ, ନିମ୍ ଆଧାରିତ କୀଟନାଶକ କିମ୍ବା ରାସାୟନିକ ସ୍ପ୍ରେ ସ୍ପ୍ରେ କରନ୍ତୁ |"
         ]
      },
      "tomato": {
         "advisory": [
            "ନିମ୍ବ ତେଲ ଗଠନ କିମ୍ବା ଫ୍ଲୋନିକାମ୍ ସ୍ପ୍ରେ କରି ଏଫିଡ୍ ସଂକ୍ରମଣକୁ ନିୟନ୍ତ୍ରଣ କରନ୍ତୁ |"
         ]
      },
      "brinjal": {
         "advisory": [
            "ଏପିଲାକ୍ନା ବିଟଲ୍କୁ ପରିଚାଳନା କରିବା ପାଇଁ, ଗଛକୁ ହଲାନ୍ତୁ, ଗ୍ରବ୍ ଏବଂ ପିଉପା ନଷ୍ଟ କରନ୍ତୁ, ନିମ୍ବ-ଆଧାରିତ କୀଟନାଶକ କିମ୍ବା କ୍ଲୋରପାଇରିଫୋସ୍ କିମ୍ବା ପ୍ରୋଫେନୋଫୋସ୍ ସ୍ପ୍ରେ କରନ୍ତୁ |"
         ]
      },
      "rose": {
         "advisory": [
            "ଥ୍ରିପ୍ସକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ, ଫେନପାଇରୋକ୍ସିମେଟ୍ କିମ୍ବା ଆବାମାକ୍ଟିନ ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "pisciculture": {
         "advisory": [
            "ଜଳର ଗଭୀରତା ବଜାୟ ରଖନ୍ତୁ, ଯାହାଦ୍ୱାରା ଅଧିକ ଉଷ୍ମ ତଳିଆ ଅଞ୍ଚଳରେ ମାଛମାନେ ଶୀତନିଦ୍ରା ମଧ୍ୟରେ ରହିପାରିବେ।"
         ]
      }
   },
   "date": "28-01-2025"
}