{
   "weather_details": {
      "30/10/2024": {
         "rainfall": 4,
         "t_max": 32,
         "t_min": 25,
         "rh_max": 94.3,
         "rh_min": 66,
         "wind_speed": 3,
         "wind_direction": 15,
         "cloud_cover": 8
      },
      "31/10/2024": {
         "rainfall": 0,
         "t_max": 33,
         "t_min": 24,
         "rh_max": 93.4,
         "rh_min": 65,
         "wind_speed": 2,
         "wind_direction": 239,
         "cloud_cover": 7
      },
      "01/11/2024": {
         "rainfall": 0,
         "t_max": 33,
         "t_min": 24,
         "rh_max": 92.1,
         "rh_min": 59,
         "wind_speed": 3,
         "wind_direction": 238,
         "cloud_cover": 6
      },
      "02/11/2024": {
         "rainfall": 0,
         "t_max": 32,
         "t_min": 23,
         "rh_max": 92.7,
         "rh_min": 55,
         "wind_speed": 4,
         "wind_direction": 318,
         "cloud_cover": 4
      }
   },
   "names_of_crops": [
      "ସବୁଜ ଚଣା",
      "କଳା ଚଣା",
      "କଦଳୀ",
      "କ୍ଷେତ ମଟର",
      "ମସୁର ଡାଲି",
      "ଚିନାବାଦାମ",
      "ତୋରିଆ",
      "ସୂର୍ଯ୍ୟମୁଖୀ"
   ],
   "general_advisory": "କ୍ଷେତରେ ଉପଲବ୍ଧ ମୃତ୍ତିକା ଆର୍ଦ୍ରତାର ଉପଯୋଗ କରି ମଧ୍ଯ଼ମ/ଅଗଭୀର ତଳିଆ ଅଞ୍ଚଳରେ ସବୁଜ ଗହମ, କଳା ଗହମ, ମଟର, ମଟର, ଚିନାବାଦାମ, ତୋରିଆ ଏବଂ ସୂର୍ଯ୍ଯ଼ମୁଖୀ ଭଳି ସ୍ୱଳ୍ପକାଳୀନ ରବି ଫସଲ ଚାଷ କରିବାକୁ କୃଷକମାନଙ୍କୁ ପରାମର୍ଶ ଦିଆଯାଇଛି। କୀଟ ସଂକ୍ରମଣ ରୋକିବା ପାଇଁ କୃଷକମାନଙ୍କୁ ନିଯ଼ମିତ ଭାବେ ନିଜ ଫସଲ କ୍ଷେତ ପରିଦର୍ଶନ କରିବାକୁ ପରାମର୍ଶ ଦିଆଯାଇଛି। ଓଡ଼ିଶା ସ୍ଥିତି ପାଇଁ ଉପଯୁକ୍ତ ଚିନାବାଦାମ କିସମ ଯଥା ଦେବୀ (ଆଇ. ସି. ଜି. ଭି. ସି. ଓ.-7, ଧରଣୀ ଇତ୍ଯ଼ାଦି) ବ୍ଯ଼ବହାର କରନ୍ତୁ। ଏକ ଏକର ଜମି ପାଇଁ 40-50 କିଲୋଗ୍ରାମ ଚିନାବାଦାମ ମଞ୍ଜି ଆବଶ୍ଯ଼କ ହୁଏ।",
   "crops_data": {
      "paddy": {
         "advisory": [
            "ବାଇଗଣ ଏବଂ ଟମାଟୋରେ ୱିଲ୍ଟ ଏବଂ ରଟ୍ ରୋଗକୁ ପରିଚାଳନା କରିବା ପାଇଁ ମାନକୋଜେବ୍ 64% ଡବ୍ଲ୍ୟୁ. ପି.) କିମ୍ବା 10 ମିଲି ଟେବୁକୋନାଜୋଲ୍ 10 ଲିଟର ପାଣିରେ ମିଶାଇ ବ୍ୟବହାର କରନ୍ତୁ।"
         ]
      },
      "groundnut": {
         "advisory": [
            "ଷ୍ଟୋରେଜ୍-ଚିନାବାଦାମକୁ ପଲିଥିନ୍ ଲାଇନ୍ ହୋଇଥିବା ଗନ୍ନୀ ବ୍ଯ଼ାଗରେ ଫିଉଜଡ୍ କ୍ଯ଼ାଲସିଯ଼ମ୍ କ୍ଲୋରାଇଡ୍ @250-ଗ୍ରାମ୍/30 ବକ୍ସ ପରି ଡେସିକାଣ୍ଟ ସହିତ ସଂରକ୍ଷଣ କରାଯିବା ଉଚିତ୍ | ସିଲ୍ ହୋଇଥିବା ବ୍ଯ଼ାଗଗୁଡିକ କୋଠରୀର ତାପମାତ୍ରାରେ ଏକ ଭଲ ବାଯ଼ୁଚାଳିତ କୋଠରୀ ଭିତରେ ଉଲ୍ଲମ୍ବ ଭାବରେ ରଖିବା ଉଚିତ୍ |"
         ]
      },
      "sugarcane": {
         "advisory": [
            "ଇଣ୍ଟର୍ନୋଡ୍ ବୋରର୍ ମ୍ଯ଼ାନେଜମେଣ୍ଟ-ଦିଆଯାଇଥିବା ଛିଦ୍ରରେ ପ୍ରତ୍ଯ଼େକ କାର୍ଡକୁ 12 ଖଣ୍ଡରେ ବିଭକ୍ତ କରି 6 ଥର ପାଇଁ କୀଟ ସାପ୍ତାହିକ ବ୍ଯ଼ବଧାନ ପରିଚାଳନା କରିବା। ଏହି କୀଟକୁ ରାସାଯ଼ନିକ ଉପାଯ଼ରେ ପରିଚାଳନା କରିବା ପାଇଁ, ଏକର ପିଛା 600-ମିଲି କିମ୍ବା କ୍ଲୋରାଣ୍ଟ୍ରାନିଲିପ୍ରୋଲ 0.4 ଜିଆର @4 କେଜି/ଏକରକୁ 200ରେ ମିଶାଇ କ୍ଲୋରାଣ୍ଟ୍ରାନିଲିପ୍ରୋଲ 0.4 ଜିଆର @4 କେଜି/ଏକରକୁ 8 କେଜି ବାଲି ସହିତ ମିଶାଇ ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "cucurbits": {
         "advisory": [
            "ଫଳ ମାଛି-କାକୁଡ଼ିରେ ଫଳ ମାଛି ପରିଚାଳନା କରିବା ପାଇଁ, 4 ଲିଟର ପାଣିରେ 400 କିମ୍ବା ଡି. ଡି. ଭି. ପି. ମିଶାଇ ଏକ ବିଷାକ୍ତ ଚାରା ପ୍ରସ୍ତୁତ କରନ୍ତୁ। ଏହି ମିଶ୍ରଣକୁ ପ୍ଲାଷ୍ଟିକ୍ କପ୍ କିମ୍ବା ମାଟି ପାତ୍ରରେ ରଖନ୍ତୁ @80 ମାଛିମାନେ ଏହା ପ୍ରତି ଆକର୍ଷିତ ହେବେ ଏବଂ ଶେଷରେ ବିଷ ଜାଲରେ ପଡ଼ି ମୃତ୍ଯ଼ୁବରଣ କରିବେ।"
         ]
      },
      "cole crop (cauliflower and cabbage)": {
         "advisory": [
            "ସାର ପରିଚାଳନା 20 ଡିଏଟି ଏବଂ 33 କେଜି ଯ଼ୁରିଆ ଏବଂ 23 ଟି ଚାରା ଚଣା/ଲିଟର ରୋପଣ ସମଯ଼ରେ ପ୍ରଯ଼ୋଗ କରାଯାଇ ନାହିଁ। ପ୍ରତିରୋପଣର ଦୁଇ ସପ୍ତାହ ପରେ ଏବଂ ଦହି ତିଆରି ହେବାର ଦୁଇ ସପ୍ତାହ ପୂର୍ବରୁ ବୋରନ ମାଇକ୍ରୋ ନ୍ଯ଼ୁଟ୍ରିଏଣ୍ଟ ସିଞ୍ଚନ କରାଯିବା ଉଚିତ।"
         ]
      },
      "marigold & rose": {
         "advisory": [
            "ମାରିଗୋଲ୍ଡ ଏବଂ ଗୋଲାପ ପରି ଫୁଲରେ ରେଡ୍ ସ୍ପାଇଡର ମାଇଟ୍କୁ ପରିଚାଳନା କରିବା ପାଇଁ 80 ପ୍ରତିଶତ ୱେଟେବଲ୍ ସଲଫର୍ (ସଲଫେକ୍ସ/ବଲୱାନ/ସଲଫାଡେକ୍ସ) ଲିଟର ପିଛା 2 ମିଲି କିମ୍ବା ଫେନପାଇରୋକ୍ସିମେଟ୍ 5 ପ୍ରତିଶତ ଇସି (ସିଗେଟ/ମିଟିଗାଟ୍) ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      }
   },
   "date": "29-10-2024",
   "ERROR": "ନିଯ଼ମିତ ତଥ୍ଯ଼ ମିଳୁନାହିଁ।"
}