{
   "weather_details": {
      "19-10-2024": {
         "rainfall": 2,
         "t_max": 30,
         "t_min": 21,
         "rh_max": 96,
         "rh_min": 61,
         "wind_speed": 3,
         "wind_direction": 111,
         "cloud_cover": 5
      },
      "20-10-2024": {
         "rainfall": 2,
         "t_max": 30,
         "t_min": 21,
         "rh_max": 95,
         "rh_min": 60,
         "wind_speed": 2,
         "wind_direction": 108,
         "cloud_cover": 6
      },
      "21-10-2024": {
         "rainfall": 5,
         "t_max": 30,
         "t_min": 20,
         "rh_max": 95,
         "rh_min": 60,
         "wind_speed": 2,
         "wind_direction": 79,
         "cloud_cover": 6
      },
      "22-10-2024": {
         "rainfall": 0,
         "t_max": 30,
         "t_min": 20,
         "rh_max": 92,
         "rh_min": 51,
         "wind_speed": 2,
         "wind_direction": 81,
         "cloud_cover": 6
      },
      "23-10-2024": {
         "rainfall": 2,
         "t_max": 29,
         "t_min": 20,
         "rh_max": 85,
         "rh_min": 50,
         "wind_speed": 4,
         "wind_direction": 27,
         "cloud_cover": 5
      }
   },
   "names_of_crops": [
      "ଚାଉଳ",
      "ମକା",
      "ରାଗି।",
      "ମାଟି ବାଦାମ",
      "ସବୁଜ ଚଣା",
      "ମୂଳା",
      "ଫୁଲକୋବି",
      "କଦଳୀ",
      "ଅଦା।"
   ],
   "general_advisory": "କୀଟନାଶକ ପ୍ରଯ଼ୋଗ କରିବା ପୂର୍ବରୁ ବର୍ଷା ପ୍ରତି ଧ୍ଯ଼ାନ ଦିଅନ୍ତୁ। ଯଦି ଆବଶ୍ଯ଼କ ହୁଏ, କେବଳ ଯେତେବେଳେ ଆକାଶ ସଫା ହୋଇଯାଏ, ସେତେବେଳେ ସ୍ପ୍ରେ କରନ୍ତୁ ଏବଂ ସ୍ପ୍ରେ ଦ୍ରବଣରେ ଷ୍ଟିକର ବ୍ଯ଼ବହାର କରନ୍ତୁ। ଅନୁର୍ବର ଉଚ୍ଚଭୂମିରେ, ନିକଟରେ ହୋଇଥିବା ବର୍ଷାକୁ ଉପଯୋଗ କରି କୃଷକମାନେ ସ୍ୱଳ୍ପକାଳୀନ ସ୍ୱଳ୍ପ ଜଳ ଆବଶ୍ଯ଼କ କରୁଥିବା ଫସଲ ଯେପରିକି କଳା ଗହମ, ସବୁଜ ଗହମ, ତିଲ, ପଶୁଖାଦ୍ଯ଼ ଫସଲ ଇତ୍ଯ଼ାଦି ଗ୍ରହଣ କରିବା ଉଚିତ। ବିଭିନ୍ନ କୀଟପତଙ୍ଗର ପ୍ରକୋପ ଜାଣିବା ଏବଂ ନିଯ଼ନ୍ତ୍ରଣ ରଣନୀତି ଆରମ୍ଭ କରିବା ପାଇଁ ସମସ୍ତ ଫସଲ ଉପରେ ନିଯ଼ମିତ ନଜର ରଖିବା ଉଚିତ।",
   "crops_data": {
      "rice": {
         "advisory": [
            "ଧାନ କ୍ଷେତ ଗୁଡ଼ିକୁ ଆଗାଛା ମୁକ୍ତ ରଖନ୍ତୁ।",
            "ନେକ୍ ବ୍ଲାସ୍ଟ୍ ରୋଗ ପରିଚାଳନା ପାଇଁ ଟ୍ରାଇସାଇକ୍ଲାଜୋଲ୍ (ବିମ୍) @0.6 ଗ୍ରାମ୍/ଲିଟର ପାଣି (120 ଗ୍ରାମ୍/ଏସି) ଲଗାନ୍ତୁ।",
            "ବାଷ୍ପ ଛେଦକ ଏବଂ ପତ୍ର ଫୋଲଡରକୁ ନିଯ଼ନ୍ତ୍ରଣ କରିବା ପାଇଁ କ୍ଲୋରପିରିଓଫସ୍/ପ୍ରୋଫେନୋଫସ୍ @2 ମିଲି/ଲିଟର ପାଣି ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "maize": {
         "advisory": [
            "ମକା କ୍ଷେତରେ ମୂଳ ଏବଂ ଡାଳି ସଙ୍କୁଚିତ ହେବା ପରିଲକ୍ଷିତ ହୋଇପାରେ, ଏହାକୁ ନିଯ଼ନ୍ତ୍ରଣ କରିବା ପାଇଁ ଭାଲିଡାମାଇସିନ୍ 3% L @2 ମିଲି/ଲିଟର ପାଣି କିମ୍ବା କାର୍ବେନଡାଜିମ୍ 50% WP @1.5 ଗ୍ରାମ୍/ଲିଟର ପାଣି ସ୍ପ୍ରେ କରନ୍ତୁ।",
            "ପତନ ସେନା କୃମିକୁ ନିଯ଼ନ୍ତ୍ରଣ କରିବା ପାଇଁ ଏକର ପିଛା 15 ନମ୍ବରରେ ଫେରୋମୋନ୍ ଫାନ୍ଦ ଲଗାନ୍ତୁ।",
            "ଫଲ୍ ଆର୍ମି କୃମିକୁ ନିଯ଼ନ୍ତ୍ରଣ କରିବା ପାଇଁ ପ୍ରତି 15 ଲିଟର ପାଣିରେ ଇମାମେକ୍ଟିନ୍ ବେନ୍ଜୋଏଟ୍ @6 ଗ୍ରାମ୍/ସ୍ପିନୋସାଦ୍ @4.5 ମିଲି/କ୍ଲୋରାଣ୍ଟ୍ରାନିଲିପ୍ରୋଲ୍ @6ml ସ୍ପ୍ରେ କରନ୍ତୁ। ସକାଳେ ଛୋଟ ପତ୍ରର ଅଗ୍ରଭାଗରୁ ଅଣ୍ଡା ସଂଗ୍ରହ ଏବଂ ନଷ୍ଟ କରିବା ମଧ୍ଯ଼ ସେନା କୃମିର ସଂଖ୍ଯ଼ା ହ୍ରାସ କରିବାରେ ସହାଯ଼କ ହୋଇଥାଏ।"
         ]
      },
      "ragi": {
         "advisory": [
            "ବିସ୍ଫୋରଣ ରୋଗ ପରିଚାଳନା ପାଇଁ ମିଶ୍ରଣ (ଟ୍ରାଇସାଇକ୍ଲାଜୋଲ 18 ପ୍ରତିଶତ + ମାନକୋଜେବ 62 ପ୍ରତିଶତ ଡବ୍ଲ୍ୟୁ. ପି.) 1-1.5 ଗ୍ରାମ୍/ଲିଟର କିମ୍ବା ଟ୍ରାଇସାଇକ୍ଲାଜୋଲ 75 ପ୍ରତିଶତ ଡବ୍ଲ୍ୟୁ. ପି. (ବିମ୍) 0.6 ଗ୍ରାମ୍/ଲିଟର ଜଳ (120 ଗ୍ରାମ୍/ଏସି) କିମ୍ବା ଜିନେବ 75 ପ୍ରତିଶତ ଡବ୍ଲ୍ୟୁ. ପି. 2 ଗ୍ରାମ୍/ଲିଟର ଜଳ ପ୍ରୟୋଗ କରନ୍ତୁ।"
         ]
      },
      "ground nut": {
         "advisory": [
            "ନଟ୍ ରେ କଲାର୍ ରଟ୍ ସଂକ୍ରମଣକୁ ପରିଚାଳନା କରିବା ପାଇଁ, ମେଟାଲାକ୍ସିଲ୍ 8 ପ୍ରତିଶତ + ମାନକୋଜେବ୍ 64 ପ୍ରତିଶତ ଡବ୍ଲ୍ଯ଼ୁ. ପି. ଲିଟର ପିଛା 2 ଗ୍ରାମ୍ ପାଣି କିମ୍ବା କାର୍ବେନଡାଜିମ୍ 50 ପ୍ରତିଶତ ଡବ୍ଲ୍ଯ଼ୁ. ପି. ଲିଟର ପିଛା 1.5 ଗ୍ରାମ୍ ପାଣି ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "green gram": {
         "advisory": [
            "ସବୁଜ ଗହମ ଏବଂ କଳା ଗହମରେ ମୂଳ କ୍ଷଯ଼ ପରିଲକ୍ଷିତ ହୋଇପାରେ, ଏହାକୁ ନିଯ଼ନ୍ତ୍ରଣ କରିବା ପାଇଁ ମାଟି ଭାଲିଡାମାଇସିନ୍ 3% L @2 ମିଲି/ଲିଟର ପାଣି କିମ୍ବା କାର୍ବେନଡାଜିମ୍ 12% + ମାନକୋଜେବ୍ 63% WP @2 ଗ୍ରାମ୍/ଲିଟର ପାଣି ସହିତ ଭିଜିଥାଏ |"
         ]
      },
      "radish": {
         "advisory": [
            "ଶୀତ ଋତୁରେ ଶୀଘ୍ର ଅମଳ ପାଇଁ, ମୂଳା ବୁଣିବା ଏବଂ ବନ୍ଧାକୋବି ଏବଂ ଫୁଲକୋବି ଚାଷ ପାଇଁ ଯାଆନ୍ତୁ।",
            "ବର୍ଷା ଚାରା ଏବଂ ପନିପରିବାର ଛୋଟ ଗଛରେ ରୋଗକୁ ଶୁଖିଲା ଏବଂ ଆର୍ଦ୍ର କରିପାରେ | ଏହାକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ 50 ପ୍ରତିଶତ ଡବ୍ଲ୍ୟୁ. ପି. କପର୍ ଅକ୍ସିକ୍ଲୋରାଇଡ୍ @3 ଗ୍ରାମ୍ ଏବଂ ସ୍ଟ୍ରେପ୍ଟୋମାଇସିନ୍ + ଟେଟ୍ରାସାଇକ୍ଲିନ୍ (<ଆଇ. ଡି. 1>) @0.15 ଗ୍ରାମ୍/ଲିଟର ପାଣିରେ ମାଟି ଭିଜାଇ ଦିଅନ୍ତୁ, ଯେତେବେଳେ ଆକାଶ ସ୍ୱଚ୍ଛ ହୋଇଯାଏ।"
         ]
      },
      "cauliflower": {
         "advisory": [
            "ନର୍ସରୀ ଶଯ୍ୟା ପ୍ରସ୍ତୁତ କରନ୍ତୁ, ଯାହାର ପ୍ରତ୍ୟେକଟିର ଲମ୍ବ 3 ମିଟର, ଓସାର 1 ମିଟର ଏବଂ ଉଚ୍ଚତା 15-20 ସେ. ମି.। ବୁଣିବାର ସାତ ଦିନ ପୂର୍ବରୁ ପ୍ରତ୍ୟେକ ନର୍ସରୀ ଶଯ୍ୟାରେ 15-30 କିଲୋଗ୍ରାମ ଭଲ ଭାବେ ଅପଘଟିତ ଏଫ୍. ଆଇ. ଏମ୍. ଏବଂ 150 ଗ୍ରାମ କ୍ଲୋରପାଇରିଫସ୍ ଧୂଳି ଲଗାନ୍ତୁ। ଉନ୍ନତ କିସମ କ୍ଷେତ୍ରରେ, ଏକ ଏକର ଚାଷ ପାଇଁ 200-250 ଗ୍ରାମ ଏବଂ ସଂକର କ୍ଷେତ୍ରରେ 100-150 ଗ୍ରାମ ମଞ୍ଜି ଆବଶ୍ୟକ ହୋଇଥାଏ।",
            "ଫୁଲକୋବି (60-75 ଦିନ)-ଏଚ. ୱାଇ. ଭି.: ପୁସା ଆର୍ଲି ସିନ୍ଥେଟିକ୍, ଆର୍ଲି କୁଆଁରୀ, କାର୍ତ୍ତିକ, ପୁସା ଦୀପାଲୀ, ଆର୍କା କ୍ରାନ୍ତି, ଆର୍କା ସୁରଥୀ, ହାଇବ୍ରିଡ୍ଃ ଶ୍ୱେତା, ପୁସ୍ପାଗିରି, ତୁସାର ଗୁଡମ୍ଯ଼ାନ୍ ଇତ୍ଯ଼ାଦି।"
         ]
      },
      "cabbage": {
         "advisory": [
            "ନର୍ସରୀ ଶଯ୍ୟା ପ୍ରସ୍ତୁତ କରନ୍ତୁ, ଯାହାର ପ୍ରତ୍ୟେକଟିର ଲମ୍ବ 3 ମିଟର, ଓସାର 1 ମିଟର ଏବଂ ଉଚ୍ଚତା 15-20 ସେ. ମି.। ବୁଣିବାର ସାତ ଦିନ ପୂର୍ବରୁ ପ୍ରତ୍ୟେକ ନର୍ସରୀ ଶଯ୍ୟାରେ 15-30 କିଲୋଗ୍ରାମ ଭଲ ଭାବେ ଅପଘଟିତ ଏଫ୍. ଆଇ. ଏମ୍. ଏବଂ 150 ଗ୍ରାମ କ୍ଲୋରପାଇରିଫସ୍ ଧୂଳି ଲଗାନ୍ତୁ। ଉନ୍ନତ କିସମ କ୍ଷେତ୍ରରେ, ଏକ ଏକର ଚାଷ ପାଇଁ 200-250 ଗ୍ରାମ ଏବଂ ସଂକର କ୍ଷେତ୍ରରେ 100-150 ଗ୍ରାମ ମଞ୍ଜି ଆବଶ୍ୟକ ହୋଇଥାଏ।",
            "ବନ୍ଧାକୋବି (60-75 ଦିନ)-ଏଚ. ୱାଇ. ଭି.: ଗୋଲ୍ଡେନ୍ ଏକର, ପ୍ରାଇଡ୍ ଅଫ୍ ଇଣ୍ଡିଆ, ପୁସା ସମ୍ବନ୍ଧ ହାଇବ୍ରିଡ୍ଃ ଗ୍ରୀନ୍ ବଲ୍, ପ୍ରିୟା, ଜେନିଥ୍ ଗୋଲ୍ଡ ଷ୍ଟାର, ପ୍ରଗତି ଇତ୍ୟାଦି।"
         ]
      },
      "ginger": {
         "advisory": [
            "3ଯ଼ ଘାସ କାଟିବା ଏବଂ 3ଯ଼ ଉପର ଡ୍ରେସିଂ ସମ୍ପୂର୍ଣ୍ଣ କରାଯାଇପାରେ।",
            "ଜିଞ୍ଜରରେ ରାଇଜୋମ କ୍ଷୟକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ ଲିଟର ପିଛା 1.25 ଗ୍ରାମ ମେଟାଲ୍ୟାକ୍ସିଲ-ମାନକୋଜେବ + 2 ମିଲି କ୍ୱିନାଲଫୋସ + 1 ଗ୍ରାମ ପ୍ଲାଣ୍ଟୋମାଇସିନ ସହିତ ମୃତ୍ତିକା ସିଞ୍ଚନ।",
            "ସଂକ୍ରମିତ ଗଛଗୁଡ଼ିକୁ କ୍ଷେତରୁ ବାହାର କରି ପୋଡ଼ି ଦିଅନ୍ତୁ।"
         ]
      }
   },
   "date": "18-10-2024"
}