{
   "weather_details": {
      "08-01-2025": {
         "rainfall": 0,
         "t_max": 26,
         "t_min": 9,
         "rh_max": 75,
         "rh_min": 30,
         "wind_speed": 2,
         "wind_direction": 194,
         "cloud_cover": 3
      },
      "09-01-2025": {
         "rainfall": 0,
         "t_max": 27,
         "t_min": 10,
         "rh_max": 78,
         "rh_min": 28,
         "wind_speed": 1,
         "wind_direction": 63,
         "cloud_cover": 3
      },
      "10-01-2025": {
         "rainfall": 0,
         "t_max": 27,
         "t_min": 10,
         "rh_max": 77,
         "rh_min": 30,
         "wind_speed": 2,
         "wind_direction": 112,
         "cloud_cover": 3
      },
      "11-01-2025": {
         "rainfall": 0,
         "t_max": 27,
         "t_min": 10,
         "rh_max": 79,
         "rh_min": 29,
         "wind_speed": 2,
         "wind_direction": 41,
         "cloud_cover": 3
      },
      "12-01-2025": {
         "rainfall": 0,
         "t_max": 28,
         "t_min": 11,
         "rh_max": 80,
         "rh_min": 29,
         "wind_speed": 2,
         "wind_direction": 0,
         "cloud_cover": 3
      }
   },
   "names_of_crops": [
      "ଚାଉଳ",
      "ଅରହର",
      "ଚିନାବାଦାମ",
      "ଗ୍ରୀନଗ୍ରାମ/ବ୍ଲାକଗ୍ରାମ",
      "ଫୁଲକୋବି/ବନ୍ଧାକୋବି/ବ୍ରୋକୋଲି",
      "ଲଙ୍କା",
      "ଟମାଟୋ"
   ],
   "general_advisory": "ଆଗାମୀ ପାଞ୍ଚ ଦିନ ମଧ୍ୟରେ ବର୍ଷା ଏବଂ ଶୁଖିଲା ପାଗ ହେବାର ସମ୍ଭାବନା ନାହିଁ। ତେଣୁ ଆବଶ୍ୟକତା ଅନୁଯାୟୀ ଫସଲ କ୍ଷେତରେ ଜଳସେଚନ କରନ୍ତୁ। କୌଣସି ଫସଲ ଉଠାଇବା ପୂର୍ବରୁ ମାଟିର ନମୁନା ସଂଗ୍ରହ କରନ୍ତୁ ଏବଂ ନିକଟସ୍ଥ ମୃତ୍ତିକା ପରୀକ୍ଷଣ ପରୀକ୍ଷାଗାରରେ ଏହାର ପରୀକ୍ଷା କରନ୍ତୁ। ମୃତ୍ତିକା ସ୍ୱାସ୍ଥ୍ୟ କାର୍ଡରେ ଉଲ୍ଲିଖିତ ମୃତ୍ତିକା ପରୀକ୍ଷା ଆଧାରିତ ସୁପାରିଶ ଅନୁଯାୟୀ ସମସ୍ତ ଫସଲରେ ସନ୍ତୁଳିତ ସାର ପ୍ରୟୋଗ କରନ୍ତୁ।",
   "crops_data": {
      "rice": {
         "advisory": [
            "ଜଳମଗ୍ନ ମାଟିରେ ପ୍ରାକ୍-ଅଙ୍କୁରିତ ବିଶୋଧିତ ମଞ୍ଜି ଗୁଡ଼ିକର ବୁଣିବା ପ୍ରସାରଣ କିମ୍ବା ଡ୍ରମ୍ ସିଡର୍ ଦ୍ୱାରା ସମ୍ପୂର୍ଣ୍ଣ କରନ୍ତୁ ଏବଂ ଉପଯୁକ୍ତ ପ୍ରତିଷ୍ଠା ତଥା ଚାରା ଗୁଡ଼ିକର ଶୀଘ୍ର ବୃଦ୍ଧି ପାଇଁ ଏକ ପତଳା ଜଳ ସ୍ତର ବଜାୟ ରଖନ୍ତୁ |",
            "ପୋଷକ ତତ୍ତ୍ୱ ପରିଚାଳନାଃ ପୋଡ଼୍ଲିଂ ସମୟରେ ଏକର ପିଛା 44 କିଲୋଗ୍ରାମ ଡିଏପି ଏବଂ 33 କିଲୋଗ୍ରାମ ଏମଓପିକୁ ମୂଳ ମାତ୍ରା ଭାବେ ପ୍ରୟୋଗ କରନ୍ତୁ।",
            "ନିଡ୍ ମ୍ୟାନେଜମେଣ୍ଟଃ ମାଟିର ଆର୍ଦ୍ରତାର ପତଳା ଫିଲ୍ମ କିମ୍ବା ପ୍ରସାରଣ ପ୍ରସ୍ତୁତ ମିଶ୍ରଣ ବେନ୍ସଲ୍ଫୁରନ୍ ମିଥାଇଲ + ପ୍ରିଟିଲାକ୍ଲୋର ଗ୍ରାନୁଲାର ହର୍ବିସାଇଡ୍ 4 କିଲୋ ବାଲି ସହିତ ମିଶ୍ରିତ ହେଲେ, ବୁଣିବା (ଡିଏଏସ୍) ର 3-5 ଦିନ ପରେ ଏକର ପିଛା 80 ଗ୍ରାମ ହାରରେ ପାଇରାଜୋସଲ୍ଫୁରନ୍-ଇଥାଇଲ (ସାଥୀ) ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "arhar": {
         "advisory": [
            "ପ୍ରଚଳିତ ପାଣିପାଗ ସ୍ଥିତି ପରବର୍ତ୍ତୀ କୀଟ ଆକ୍ରମଣକୁ ସମର୍ଥନ କରେ | ତେଣୁ, ଆବଶ୍ୟକତା ଅନୁଯାୟୀ ସୁପାରିସ କରାଯାଇଥିବା ନିୟନ୍ତ୍ରଣ ପଦକ୍ଷେପ ଅନୁସରଣ କରାଯିବା ଉଚିତ।",
            "ପୋଡ୍ ବୋରର୍ଃ ନିୟନ୍ତ୍ରଣ ପାଇଁ, ବେନଫୁରାକାର୍ବ 40 ପ୍ରତିଶତ ଇସି @1ଲିଟ୍/ଏସି କିମ୍ବା ଡେଲ୍ଟାମେଥ୍ରିନ୍ 2.8 ପ୍ରତିଶତ ଇସି @200 ମିଲି/ଏସି କିମ୍ବା ସ୍ପିନୋସାଡ୍ 45 ପ୍ରତିଶତ ଏସସି @60 ମିଲି/ଏସି କିମ୍ବା ଫ୍ଲୁବେଣ୍ଡିଆମାଇଡ୍ 39.35% ଏସସି @40 ମିଲି/ଏସି ସହିତ 200 ଲିଟର ପାଣି ମିଶାଇ ଲଗାନ୍ତୁ।",
            "ପୋଡ୍ ସୁକିଙ୍ଗ୍ ବଗ୍ ଏବଂ ଏଫିଡ୍ଃ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ, ଥିୟାମେଥୋକ୍ସାମ୍ 25 ପ୍ରତିଶତ ଡବ୍ଲୁଜି @40 ଗ୍ରାମ୍/ଏସି କିମ୍ବା ଇମିଡାକ୍ଲୋପ୍ରିଡ୍ 17.8% ଏସ୍ଏଲ୍ @60 ମିଲି/ଏକରକୁ 200 ଲିଟର ପାଣି ସହିତ ମିଶାଇ ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "groundnut": {
         "advisory": [
            "ଆଗାଛା ପରିଚାଳନାଃ ଇମାଜେଥାପାଇର୍ 10 ପ୍ରତିଶତ ଏସ୍. ଏଲ୍. @3 ମିଲି/ଲିଟର ଜଳ 15 ଡିଏଏସ୍ରେ ପ୍ରୟୋଗ କରନ୍ତୁ, ଯଥାଶୀଘ୍ର ଉଦ୍ଭବ ପରବର୍ତ୍ତୀ ହର୍ବିସାଇଡ୍ ଭାବେ, କିମ୍ବା 15-20 ଡିଏଏସ୍ରେ ଫେନକ୍ସାପ୍ରପ-ପି-ଇଥାଇଲ 9.3 ପ୍ରତିଶତ @35 ମିଲି/ଡ୍ରମ୍ (15-ଲିଟର କ୍ଷମତା) ପ୍ରୟୋଗ କରନ୍ତୁ।",
            "କୀଟ ପରିଚାଳନାଃ ପ୍ରଚଳିତ ପାଣିପାଗ ସ୍ଥିତି ଏଫିଡ୍, ଜ୍ଯାସିଡ୍ ଏବଂ ହ୍ୱାଇଟ୍ଫ୍ଲାଇ ପରି ଶୋଷକ କୀଟ ବିକାଶକୁ ସମର୍ଥନ କରେ | କୀଟ ସଂଖ୍ୟା ଉପରେ ନଜର ରଖିବା ପାଇଁ ଏକର ପିଛା 8ନସ୍ ପିଛା ହଳଦିଆ ଚଟପଟା ଜାଲ ଲଗାନ୍ତୁ। ନିମ୍ବ ତେଲ ଆଧାରିତ କୀଟନାଶକ ଆଜାଦିରାକ୍ଟିନ 0.03% (300 ପିପିଏମ) @5 ମିଲି/ଲିଟର ପାଣି ପ୍ରୟୋଗ କରନ୍ତୁ।"
         ]
      },
      "greengram/blackgram": {
         "advisory": [
            "ଆଗାଛା ପରିଚାଳନାଃ 20-25 DAS ରେ 200 ଲିଟର ପାଣି ସହିତ ଏକର ପିଛା 5 ପ୍ରତିଶତ ଇ. ସି. କିମ୍ବା ଇମାଜେଥାପାଇର୍ 10 SL @300 ମି. ଲି. ମିଶ୍ରଣ କରନ୍ତୁ।",
            "କୀଟ ପରିଚାଳନାଃ ପତ୍ର ଖାଉଥିବା କ୍ୟାଟର୍ପିଲାର୍ଃ କୀଟପତଙ୍ଗମାନେ ସାଧାରଣତଃ କୋମଳ ଯୁବା ପତ୍ରକୁ ଖାଇଥାନ୍ତି। ଏହାର ନିୟନ୍ତ୍ରଣ ପାଇଁ ଏକର ପିଛା ପ୍ରୋଫେନୋଫସ୍ 50 ଇସି 400 ମିଲି ସହିତ 200 ଲିଟର ପାଣି ମିଶାଇ ସ୍ପ୍ରେ କରନ୍ତୁ।",
            "ଏଫିଡ୍ ଏବଂ ହ୍ୱାଇଟ୍ଫ୍ଲାଇଃ ଏଫିଡ୍ ଏବଂ ହ୍ୱାଇଟ୍ଫ୍ଲାଇ ପରି ଶୋଷକ କୀଟପତଙ୍ଗ ଘଟଣା ପାଇଁ ପ୍ରଚଳିତ ପାଣିପାଗ ସ୍ଥିତି ଅନୁକୂଳ | କୀଟ ସଂଖ୍ୟା ଉପରେ ନଜର ରଖିବା ପାଇଁ ଉଦ୍ଭିଦ ସ୍ତରରେ ଏକର ପିଛା 8 ନିୟୁତ ହଳଦିଆ ଚଟପଟା ଜାଲ ଲଗାନ୍ତୁ ଏବଂ ସଂକ୍ରମଣର ପ୍ରାରମ୍ଭିକ ପର୍ଯ୍ୟାୟରେ ନିମ୍ବ ତେଲ ଆଧାରିତ କୀଟନାଶକ ଆଜାଦିରାକ୍ଟିନ 0.03% (300 ପିପିଏମ) ଲିଟର ପିଛା 5 ମିଲି ପାଣି ଲଗାନ୍ତୁ।"
         ]
      },
      "cauliflower/cabbage/broccoli": {
         "advisory": [
            "ପୋଷକ ତତ୍ତ୍ୱ ପରିଚାଳନାଃ ତିନି ସପ୍ତାହର ପର୍ଯ୍ୟାୟରେ, ହୋଇଂ, ନିଡ଼ାଇବାର କାର୍ଯ୍ୟ ହାତକୁ ନିଅନ୍ତୁ ଏବଂ 55 କିଲୋଗ୍ରାମ/ଏସି ୟୁରିଆ ଲଗାନ୍ତୁ ଏବଂ ପରେ ଜଳସେଚନ କରନ୍ତୁ।",
            "ଛଅରୁ ସାତ ସପ୍ତାହ ପରେ ଜଳସେଚନ ପାଇଁ 27 କି. ଗ୍ରା. ୟୁରିଆ + 25 କି. ଗ୍ରା. ଏମ୍. ଓ. ପି. ପ୍ରୟୋଗ କରନ୍ତୁ।",
            "କୀଟ ପରିଚାଳନାଃ ପିଠି ପତଙ୍ଗଃ ନିୟନ୍ତ୍ରଣ ପଦକ୍ଷେପ ସ୍ୱରୂପ ଫାଇପ୍ରୋନିଲ୍ 5 ପ୍ରତିଶତ ଏସ୍. ସି. @2 ମିଲି/ଲିଟର କିମ୍ବା କ୍ଲୋରପାଇରିଫସ୍ 20 ପ୍ରତିଶତ ଇ. ସି. @4 ମିଲି/ଲିଟର ପାଣି ସ୍ପ୍ରେ କରନ୍ତୁ। ତମାଖୁ ପତ୍ର ଖାଉଥିବା କ୍ୟାଟର୍ପିଲାର୍ଃ କୀଟପତଙ୍ଗ ସଂଖ୍ୟାକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ ସାଇଣ୍ଟ୍ରାନିଲିପ୍ରୋଲ୍ 10.26% ଓଡି @6 ମିଲି/5 ଲିଟର ପାଣି ସ୍ପ୍ରେ କରନ୍ତୁ। ବନ୍ଧାକୋବି ଏଫିଡ୍ଃ ନିୟନ୍ତ୍ରଣ ପଦକ୍ଷେପ ଭାବେ ଥିୟାମେଥୋକ୍ସାମ୍ 25 ପ୍ରତିଶତ ଡବ୍ଲୁ. ଜି. @2 ଗ୍ରାମ/5 ଲିଟର ପାଣି ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "chilli": {
         "advisory": [
            "ଥ୍ରିପ୍ସଃ ପ୍ରଚଳିତ ପାଣିପାଗ ସ୍ଥିତି ଥ୍ରିପ୍ସ ଆକ୍ରମଣ ପାଇଁ ଅନୁକୂଳ | କୀଟପତଙ୍ଗ ସଂଖ୍ୟାକୁ ନିୟନ୍ତ୍ରଣ ଏବଂ ନିରୀକ୍ଷଣ କରିବା ପାଇଁ ଏକର ପିଛା @8ନୋ ବ୍ଲୁ ଷ୍ଟିକି ଟ୍ରାପ୍ ଲଗାନ୍ତୁ। ସଂକ୍ରମଣର ପ୍ରାରମ୍ଭିକ ପର୍ଯ୍ୟାୟରେ ନିମ୍ବ-ଆଧାରିତ କୀଟନାଶକ ଆଜାଦିରାକ୍ଟିନ 1500 ପିପିଏମ @3 ମିଲି/ଲିଟର ପାଣି ଲଗାନ୍ତୁ। ରାସାୟନିକ ନିୟନ୍ତ୍ରଣ ପାଇଁ 3 ଗ୍ରାମ ଏସିଟାମିପ୍ରିଡ୍ 15 ପ୍ରତିଶତ ଏସ. ପି. କିମ୍ବା 4 ମିଲି ଇମିଡାକ୍ଲୋପ୍ରିଡ୍ 17.8% ଏସ. ଏଲ. କୁ 15 ଲିଟର ପାଣି ସହିତ ମିଶାଇ ଲଗାନ୍ତୁ।"
         ]
      },
      "tomato": {
         "advisory": [
            "ବିଲ୍ଟିଂଃ ଅଧିକ ଆର୍ଦ୍ର ଅବସ୍ଥାକୁ ଦୃଷ୍ଟିରେ ରଖି ଏହି ପର୍ଯ୍ୟାୟରେ ବିଲ୍ଟିଂ ହୋଇପାରେ। ଯଦି ଲକ୍ଷଣ ଦେଖାଯାଏ, ତେବେ ମାନକୋଜେବ୍ 75 ପ୍ରତିଶତ ଡବ୍ଲ୍ୟୁ. ପି. @2 ଗ୍ରାମ/ଲିଟର ପାଣି ସ୍ପ୍ରେ କରନ୍ତୁ।",
            "ଫଳ ଏବଂ ଶୁଟ୍ ବୋରର୍ଃ କୀଟପତଙ୍ଗ ସଂଖ୍ୟା ଉପରେ ନଜର ରଖିବା ପାଇଁ ଏକର ପିଛା 8ନସ୍ ଫେରୋମନ୍ ଟ୍ରାପ୍ ଲଗାନ୍ତୁ।"
         ]
      }
   },
   "date": "07-01-2025"
}