{
   "weather_details": {
      "20-11-2024": {
         "rainfall": 0,
         "t_max": 29,
         "t_min": 14,
         "rh_max": 78,
         "rh_min": 32,
         "wind_speed": 2,
         "wind_direction": 76,
         "cloud_cover": 0
      },
      "21-11-2024": {
         "rainfall": 0,
         "t_max": 28,
         "t_min": 13,
         "rh_max": 75,
         "rh_min": 31,
         "wind_speed": 1,
         "wind_direction": 56,
         "cloud_cover": 0
      },
      "22-11-2024": {
         "rainfall": 0,
         "t_max": 28,
         "t_min": 13,
         "rh_max": 77,
         "rh_min": 33,
         "wind_speed": 2,
         "wind_direction": 76,
         "cloud_cover": 0
      },
      "23-11-2024": {
         "rainfall": 0,
         "t_max": 28,
         "t_min": 13,
         "rh_max": 78,
         "rh_min": 32,
         "wind_speed": 1,
         "wind_direction": 0,
         "cloud_cover": 1
      },
      "24-11-2024": {
         "rainfall": 0,
         "t_max": 27,
         "t_min": 14,
         "rh_max": 82,
         "rh_min": 32,
         "wind_speed": 2,
         "wind_direction": 0,
         "cloud_cover": 1
      }
   },
   "names_of_crops": [
      "ଚାଉଳ",
      "ଗ୍ରାମ୍",
      "ରବି ଚିନାବାଦାମ",
      "ସୋରିଷ",
      "ବିନ୍ସ",
      "ବାଇଗଣ",
      "ଲଙ୍କା"
   ],
   "general_advisory": "ଆଗାମୀ ପାଞ୍ଚ ଦିନ ମଧ୍ଯ଼ରେ ବର୍ଷା ଏବଂ ଶୁଖିଲା ପାଗ ହେବାର ସମ୍ଭାବନା ନାହିଁ। ତେଣୁ ଆବଶ୍ଯ଼କତା ଅନୁଯାଯ଼ୀ ଫସଲ କ୍ଷେତରେ ଜଳସେଚନ କରନ୍ତୁ। ଶୀତକାଳୀନ ପନିପରିବା ଫସଲ ପାଇଁ ସମ୍ପୂର୍ଣ୍ଣ ନର୍ସରୀ ବୁଣିବା। ସକାଳେ ଏବଂ ସନ୍ଧ୍ଯ଼ାରେ ନର୍ସରୀକୁ ଜଳସେଚନ କରନ୍ତୁ। କମ୍ ଜମିରେ ଧାନ ଅମଳ ହେବାର ପନ୍ଦର ଦିନ ପୂର୍ବରୁ ମଟର, ଚଣା ଏବଂ ସବୁଜ ଚଣା ଯୋଡ଼ି ଫସଲ ଭାବେ ବୁଣିବା ପାଇଁ ଯାଆନ୍ତୁ।",
   "crops_data": {
      "rice": {
         "advisory": [
            "ମଧ୍ୟମ ଏବଂ ବିଳମ୍ବ ଅବଧି ଧାନ ଫସଲ ଶସ୍ୟ ପୂରଣ ପର୍ଯ୍ୟାୟରେ ଅଛି। ଶସ୍ୟ ଭରିବା ପର୍ଯ୍ୟନ୍ତ କ୍ଷେତରେ ପାଣି ରଖନ୍ତୁ।",
            "ପି. ଆଇ. ରୁ ନରମ ଅଟା ପର୍ଯ୍ୟାୟରେ ଷ୍ଟେମ ବୋରର ସଂକ୍ରମଣ ପରିଲକ୍ଷିତ ହୋଇପାରେ | ଏହାକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ କ୍ଲୋରାଣ୍ଟ୍ରାନିଲିପ୍ରୋଲ <ଆଇ. ଡି. 1> ଏସ୍. ସି. ଲିଟର ପିଛା 4 ମିଲି. ପାଣି କିମ୍ବା କାର୍ଟ୍ରାପ୍ ହାଇଡ୍ରୋକ୍ଲୋରାଇଡ୍ 50 ପ୍ରତିଶତ ଏସ୍. ପି. ଲିଟର ପିଛା 2 ଗ୍ରାମ୍ ପାଣି ମଧ୍ୟାହ୍ନ ସମୟରେ ସିଞ୍ଚନ କରନ୍ତୁ।",
            "କ୍ଷୀର ଦୋଇବା ପର୍ଯ୍ୟାୟରେ ଫସଲ ପାଇଁ ଗୁଣ୍ଡି ବଗ ଘଟଣାର ସମ୍ଭାବନା | ଯଦି ଲକ୍ଷ୍ୟ କରାଯାଏ, ଇଥୋଫେନୋପ୍ରୋକ୍ସ 10 ପ୍ରତିଶତ ଇ. ସି. 1 ମିଲି./ଲିଟର ପାଣି ଦେଇ ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "gram": {
         "advisory": [
            "ଉଚ୍ଚଭୂମିରେ କଳା ଚଣା ଏବଂ ସବୁଜ ଚଣା ବୁଣିବା ସମ୍ପୂର୍ଣ୍ଣ କରନ୍ତୁ। ଅଧିକ ଉତ୍ପାଦନକ୍ଷମ କିସମ ଯଥା ଟି-9, ପି. ୟୁ. 11, ପି. ୟୁ. 19 ଏବଂ ପି. ୟୁ. 30 କଳା ଗହମ ପାଇଁ ଏବଂ କେ-851, ପି. ଡି. ଏମ୍. 11, ପି. ଡି. ଏମ୍. 54, ଓ. ୟୁ. ଏମ୍. 115 ସବୁଜ ଗହମ ପାଇଁ ଚାଷ କରନ୍ତୁ। ଏକର ପିଛା 10 କିଲୋଗ୍ରାମ ମଞ୍ଜି ବ୍ୟବହାର କରନ୍ତୁ। ବୁଣିବା ପୂର୍ବରୁ, ମଞ୍ଜିଗୁଡ଼ିକୁ ରାଇଜୋବିୟମ୍ ସଂସ୍କୃତି ସହିତ ଚିକିତ୍ସା କରିବାକୁ ହେବ।",
            "ଚୂଡ଼ାନ୍ତ ଜମି ପ୍ରସ୍ତୁତି ସମୟରେ ଏକର ପିଛା 4 କିଲୋଗ୍ରାମ ୟୁରିଆ, 35 କିଲୋଗ୍ରାମ ଡିଏପି ଏବଂ 13 କିଲୋଗ୍ରାମ ଏମଓପି ଲଗାନ୍ତୁ। 10-15 ସେ. ମି. ରୁ ଗଛର ଦୂରତା ସହିତ ଅବଧି ଉପରେ ନିର୍ଭର କରି 30 ସେ. ମି. ବ୍ୟବଧାନରେ ମଞ୍ଜି ବୁଣନ୍ତୁ।"
         ]
      },
      "rabi groundnut": {
         "advisory": [
            "ଜମି ପ୍ରସ୍ତୁତି ଏବଂ 25 ସେ. ମି. x 10 ସେ. ମି. ବ୍ଯ଼ବଧାନରେ ରବି ଚିନାବାଦାମ ବୁଣିବା ପାଇଁ ଯାଆନ୍ତୁ, ଯାହାର ବୀଜ ହାର ଏକର ପିଛା 50 କି. ଗ୍ରା.। ଏକର ପିଛା 35 କିଲୋଗ୍ରାମ ଡିଏପି, 4 କିଲୋଗ୍ରାମ ଯ଼ୁରିଆ ଏବଂ 27 କିଲୋଗ୍ରାମ ଏମଓପି ସହିତ 10 କିଲୋଗ୍ରାମ ଜିଙ୍କ୍ ସଲଫେଟ୍ ଏବଂ ଏକର ପିଛା 4 କିଲୋଗ୍ରାମ ବୋରାକ୍ସକୁ ବେସାଲ୍ ଭାବରେ ପ୍ରଯ଼ୋଗ କରନ୍ତୁ। ବୀଜ ବୁଣିବା ପୂର୍ବରୁ 10 ଗ୍ରାମ୍ ଟ୍ରାଇକୋଡର୍ମା ହାର୍ଜିଆନମ୍/ଭାଇରିଡ୍ କିମ୍ବା 3 ଗ୍ରାମ୍ କାର୍ବୋକ୍ସିନ୍ 37.5% + ଥିରମ୍ 37.5% DS ସହିତ ଏକ କିଲୋ ମଞ୍ଜି ପାଇଁ ଚିକିତ୍ସା କରାଯିବା ଉଚିତ। ଉପରୋକ୍ତ ଚିକିତ୍ସାର 7 ଦିନ ପରେ 50 କିଲୋଗ୍ରାମ ମଞ୍ଜି ପାଇଁ 600 ଗ୍ରାମ ମୂଲ୍ଯ଼ରେ ରାଇଜୋବିଯ଼ମ୍ ସଂସ୍କୃତି ସହିତ ଚିକିତ୍ସା କରନ୍ତୁ।",
            "ଚିନାବାଦାମର କଳାର ସଙ୍କୁଚିତ ହେବା କିମ୍ବା କାଣ୍ଡ ସଙ୍କୁଚିତ ହେବା ହ୍ରାସ କରିବା ପାଇଁ ବୁଣିବା ପୂର୍ବରୁ 15 ଦିନ ପୂର୍ବରୁ କିମ୍ବା ବୁଣିବା ସମୟରେ ମଞ୍ଜି ଫୁରୋରେ ଏକର ପିଛା 200 କିଲୋଗ୍ରାମ ହାରରେ ନିମ୍ବ କିମ୍ବା ସୋରିଷ କେକ୍ ଲଗାନ୍ତୁ। ଉଇପୋକା ପ୍ରବଣ ଅଞ୍ଚଳରେ ଅନ୍ତିମ ଭୂମି ପ୍ରସ୍ତୁତି ସମୟରେ ମାଟି ଉପରେ କ୍ଲୋରପିରିଫସ୍ 20 ପ୍ରତିଶତ ଇସି @4 ମିଲି/ଲିଟର ପାଣି ସିଞ୍ଚନ କରନ୍ତୁ।"
         ]
      },
      "mustard": {
         "advisory": [
            "ଉପଲବ୍ଧ ମୃତ୍ତିକା ଆର୍ଦ୍ରତାର ଲାଭ ଉଠାଇ, ସର୍ବାଧିକ ଉତ୍ପାଦନ ପାଇବା ପାଇଁ ଜମି ପ୍ରସ୍ତୁତି ଏବଂ ଫସଲ ବୁଣିବା ଆରମ୍ଭ କରାଯିବା ଉଚିତ।",
            "ଉପଯୁକ୍ତ କିସମଃ ତୋରିଆ-ଅନୁରାଧା, ପାର୍ବତୀ, ସୁଶ୍ରୀ, ଭାରତୀଯ଼ ସୋରିଷ-ପୁସା ବୋଲ୍ଡ, ପୁସା ଜଯ଼ କିଷାନ। ବୀଜ ହାର-2-3 କି. ଗ୍ରା./ଏସି, ବ୍ଯ଼ବଧାନ-30 ସେ. ମି. x 10 ସେ. ମି.।",
            "ଚାରା ରୋପଣ ପର୍ଯ୍ଯ଼ାଯ଼ରେ ସୋରିଷ ଏବଂ ତୋରିଆରେ କୀଟପତଙ୍ଗକୁ ନିଯ଼ନ୍ତ୍ରଣ କରିବା ପାଇଁ ନିମ୍ବ ତେଲ 5 ମିଲି/ଲିଟର ପାଣି ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "beans": {
         "advisory": [
            "ଫ୍ରେଞ୍ଚ ବିନ୍ ବୁଣିବା ପାଇଁ ପାଗ ଅନୁକୂଳ ଅଟେ। କଣ୍ଟେଣ୍ଡର ଏବଂ ଆର୍କା କମଲ ଏବଂ କେଣ୍ଟୁକି ୱାଣ୍ଡର ଭଳି ଅଧିକ ଉତ୍ପାଦନକ୍ଷମ କିସମ ଚାଷ କରନ୍ତୁ। ବିନ୍ ପ୍ରକାର ଉପରେ ନିର୍ଭର କରି ଏକର ପିଛା 10-20 କିଲୋଗ୍ରାମ ମଞ୍ଜି ବ୍ୟବହାର କରନ୍ତୁ। ଏକର ପିଛା 10 ଟନ୍ ଏଫ. ୱାଇ. ଏମ୍. ଲଗାନ୍ତୁ ଏବଂ ଏକର ପିଛା <ଆଇ. ଡି. 1> କେ. ଜି. ଏନ. ପି. କେ. ଲଗାନ୍ତୁ, 40x20 ସେ. ମି. ବ୍ୟବଧାନରେ ମଞ୍ଜି ବୁଣନ୍ତୁ।"
         ]
      },
      "brinjal": {
         "advisory": [
            "3 ରୁ 4 ସପ୍ତାହ ପର୍ଯ୍ଯ଼ାଯ଼ରେ ଏକର ପିଛା 44 କିଲୋଗ୍ରାମ ଯ଼ୁରିଆ ଏବଂ 20 କିଲୋଗ୍ରାମ ଏମଓପି ପ୍ରଯ଼ୋଗ କରନ୍ତୁ। ଅଧିକ ଉତ୍ପାଦନ ପାଇବା ପାଇଁ 4 ସପ୍ତାହ ପର୍ଯ୍ଯ଼ାଯ଼ରେ ମାଇକ୍ରୋ ନ୍ଯ଼ୁଟ୍ରିଏଣ୍ଟ ମିଶ୍ରଣକୁ ଲିଟର ପିଛା 3-4 ଗ୍ରାମ୍ ପାଣି ସ୍ପ୍ରେ କରନ୍ତୁ।",
            "ବାଇଗଣ କ୍ଷେତରେ ଶୁଟ୍ ବୋରର୍ ନିରୀକ୍ଷଣ କରିପାରେ, ଏହାକୁ ନିଯ଼ନ୍ତ୍ରଣ କରିବା ପାଇଁ ଆଜାଦିରାକ୍ଟିନ 1 ପ୍ରତିଶତ ଇସି @3 ମିଲି/ଲିଟର ପାଣି କିମ୍ବା ଇମାମେକ୍ଟିନ୍ ବେନ୍ଜୋଏଟ୍ 5 ପ୍ରତିଶତ ଏସ୍ଜି @0.4 ଗ୍ରାମ୍/ଲିଟର ପାଣି ସ୍ପ୍ରେ କରେ |"
         ]
      },
      "chilli": {
         "advisory": [
            "ଥାଇମଥୋକ୍ସାମ 12.6% + ଲାମ୍ବଡା ସାଇହାଲୋଥ୍ରିନ 9.5% ଜେଡସି @4.5 ମିଲି କିମ୍ବା ଇମିଡାକ୍ଲୋପ୍ରିଡ 17.8% ଏସଏଲ @7.5 ମିଲି 15 ଲିଟର ପାଣିରେ ସିଞ୍ଚନ କରନ୍ତୁ।"
         ]
      }
   },
   "date": "19-11-2024"
}