{
   "weather_details": {
      "09-08-2024": {
         "rainfall": 6,
         "t_max": 27,
         "t_min": 20,
         "rh_max": 89,
         "rh_min": 57,
         "wind_speed": 8,
         "wind_direction": 248,
         "cloud_cover": 6
      },
      "10-08-2024": {
         "rainfall": 5,
         "t_max": 30,
         "t_min": 21,
         "rh_max": 87,
         "rh_min": 63,
         "wind_speed": 8,
         "wind_direction": 248,
         "cloud_cover": 6
      },
      "11-08-2024": {
         "rainfall": 10,
         "t_max": 32,
         "t_min": 22,
         "rh_max": 89,
         "rh_min": 59,
         "wind_speed": 7,
         "wind_direction": 238,
         "cloud_cover": 7
      },
      "12-08-2024": {
         "rainfall": 5,
         "t_max": 31,
         "t_min": 22,
         "rh_max": 87,
         "rh_min": 56,
         "wind_speed": 5,
         "wind_direction": 246,
         "cloud_cover": 7
      }
   },
   "names_of_crops": [
      "ଚାଉଳ",
      "ମକା",
      "ରାଗି।",
      "ନାଇଜର",
      "ବାଇଗଣ",
      "ଓକ୍ରା",
      "ଆମ୍ବ",
      "ଅଦା।",
      "ହଳଦୀ",
      "ଗାଈ।"
   ],
   "general_advisory": "କ୍ଷେତର ଗୋଟିଏ ଅଂଶରେ ବର୍ଷା ଜଳ ସଂରକ୍ଷଣ ପାଇଁ ଉପଯୁକ୍ତ ବ୍ଯ଼ବସ୍ଥା କରିବାକୁ କୃଷକମାନଙ୍କୁ ପରାମର୍ଶ ଦିଆଯାଇଛି। ଏହି ଜଳକୁ ଶୁଖିଲା ଋତୁରେ ଫସଲରେ ଜଳସେଚନ ପାଇଁ ବ୍ଯ଼ବହାର କରାଯାଇପାରିବ। ଅଧିକ ଆର୍ଦ୍ରତା କାରଣରୁ ପୂର୍ବରୁ ବୁଣାଯାଇଥିବା ଫସଲରେ କୀଟପତଙ୍ଗ ଏବଂ ରୋଗ ସୃଷ୍ଟି ହେବାର ସମ୍ଭାବନା ରହିଛି। ଫସଲ ଏବଂ ପାଣିପାଗ ସ୍ଥିତି ଉପରେ ନିର୍ଭର କରି ଉଦ୍ଭିଦ ସୁରକ୍ଷା ପଦକ୍ଷେପ ନିଅନ୍ତୁ। ଆଗାମୀ ପାଞ୍ଚ ଦିନ ମଧ୍ଯ଼ରେ ସାଧାରଣତଃ ମେଘୁଆ ଆକାଶ ଏବଂ ହାଲୁକା ବର୍ଷା ହେବାର ସମ୍ଭାବନା ରହିଛି। ସର୍ବାଧିକ ତାପମାତ୍ରା 30-32 °C ଏବଂ ସର୍ବନିମ୍ନ ତାପମାତ୍ରା 21-22 °C ହେବାର ଆଶା କରାଯାଏ | ସର୍ବାଧିକ ଏବଂ ସର୍ବନିମ୍ନ ଆପେକ୍ଷିକ ଆର୍ଦ୍ରତା ଯଥାକ୍ରମେ 87-89%, ଏବଂ 56-63% ହେବାର ଆଶା କରାଯାଏ |",
   "crops_data": {
      "rice": {
         "advisory": [
            "ଧାନ ନର୍ସରୀରେ ଚାରା ରୋଗ ଏବଂ ବିସ୍ଫୋରଣ ସଂକ୍ରମଣର ସମ୍ଭାବନା। ଚାରା ବ୍ଲାଇଟକୁ ନିଯ଼ନ୍ତ୍ରଣ କରିବା ପାଇଁ ପ୍ରୋପିକୋନାଜୋଲ 25 ପ୍ରତିଶତ ଇସି @1 ମିଲି/ଲିଟର ପାଣି ସ୍ପ୍ରେ କରନ୍ତୁ ଏବଂ ବିସ୍ଫୋରଣକୁ ନିଯ଼ନ୍ତ୍ରଣ କରିବା ପାଇଁ ଟେବୁକୋନାଜୋଲ 50 ପ୍ରତିଶତ + ଟ୍ରାଇଫ୍ଲୋକ୍ସିସ୍ଟ୍ରୋବିନ୍ 25 ପ୍ରତିଶତ ଡବ୍ଲୁଜି @0.4 ଗ୍ରାମ/ଲିଟର ପାଣି ସଫା ପାଗରେ ସ୍ପ୍ରେ କରନ୍ତୁ।",
            "ସିଧାସଳଖ ବୁଣାଯାଇଥିବା ଧାନ କ୍ଷେତରେ, 16 ଲିଟର କ୍ଷମତା ବିଶିଷ୍ଟ ବିସ୍ପିରିବାକ୍ ସୋଡ଼ିଅମ୍ 10 ପ୍ରତିଶତ ଏସ୍. ସି. @15 ମିଲି/ଟ୍ଯ଼ାଙ୍କ୍ ବୁଣିବାର 8-10 ଦିନ ପରେ କିମ୍ବା ଯେତେବେଳେ ଅପତୃଣଗୁଡ଼ିକ 2-3 ପତ୍ର ସ୍ତରରେ ଥାଏ, ସେତେବେଳେ ହସ୍ତଚାଳିତ ନିରାମଯ଼ ବିକଳ୍ପ ଭାବେ ଆର୍ଦ୍ର ମାଟିରେ ସିଞ୍ଚନ କରନ୍ତୁ।",
            "ଅଧିକ ଉତ୍ପାଦନକ୍ଷମ କିସମ ପ୍ରତିରୋପଣ ପାଇଁ, ଶେଷ ଥର ପାଇଁ ପାଣି ନିଷ୍କାସନ ସମଯ଼ରେ ଏକର ପିଛା 35 କିଲୋଗ୍ରାମ ଡିଏପି, 4 କିଲୋଗ୍ରାମ ଯ଼ୁରିଆ ଏବଂ 27 କିଲୋଗ୍ରାମ ଏମଓପି ପ୍ରଯ଼ୋଗ କରାଯାଇଥାଏ। ଜିଙ୍କ ଅଭାବ ଥିବା ଅଞ୍ଚଳରେ ଏକର ପିଛା 10 କିଲୋଗ୍ରାମ ଜିଙ୍କ ସଲଫେଟ୍ ଲଗାନ୍ତୁ।",
            "ଆଗାଛାକୁ ନିଯ଼ନ୍ତ୍ରଣ କରିବା ପାଇଁ ଏକର ପିଛା 4 କି. ଗ୍ରା. ଦରରେ ବେନ୍ସଲ୍ଫୁରନ୍ ମିଥାଇଲ 0.6% + ପ୍ରିଟିଲାକ୍ଲୋର 6% ଜିଆର ଲଗାନ୍ତୁ।"
         ]
      },
      "maize": {
         "advisory": [
            "ଅଧିକ ବର୍ଷା କାରଣରୁ ପାଣି ଜମିବା ପରିସ୍ଥିତିକୁ ଏଡ଼ାଇବା ପାଇଁ ଉନ୍ନତ ଜଳ ନିଷ୍କାସନ ବ୍ଯ଼ବସ୍ଥା ବିକଶିତ କରନ୍ତୁ।",
            "ପତନ ସେନା କୃମି ସଂକ୍ରମଣ ଉପରେ ନଜର ରଖନ୍ତୁ |",
            "ପତନ ସେନା କୃମିକୁ ନିଯ଼ନ୍ତ୍ରଣ କରିବା ପାଇଁ କୀଟନାଶକ ସ୍ପ୍ରେ କରନ୍ତୁ। ସକାଳେ କିମ୍ବା ସନ୍ଧ୍ଯ଼ାରେ ସ୍ପ୍ରେ କରିବା ଉଚିତ।",
            "ଫଲ୍ ଆର୍ମି କୃମିର ଆକ୍ରମଣକୁ ନିଯ଼ନ୍ତ୍ରଣ କରିବା ପାଇଁ, ଇମାମେକ୍ଟିନ୍ ବେନ୍ଜୋଏଟ୍ 5 ପ୍ରତିଶତ ଏସ୍ଜି @4 ଗ୍ରାମ୍/10ଲିଟ୍ ପାଣି ସ୍ପ୍ରେ କରନ୍ତୁ।",
            "ଏହି ପର୍ଯ୍ଯ଼ାଯ଼ରେ ଷ୍ଟେମ ବୋରର ଏବଂ ବ୍ଯ଼ାଣ୍ଡେଡ ପତ୍ର ଏବଂ ସିଥ୍ ବ୍ଲାଇଟ୍ ଦେଖାଯାଇପାରେ | ନିଯ଼ମିତ ଭାବେ କ୍ଷେତ ଉପରେ ନଜର ରଖନ୍ତୁ ଏବଂ ସଂକ୍ରମିତ ଗଛର ଅଂଶଗୁଡ଼ିକୁ ବାହାର କରନ୍ତୁ।"
         ]
      },
      "ragi": {
         "advisory": [
            "ସିଧାସଳଖ ବୁଣାଯାଇଥିବା ଫସଲରେ, ବୁଣିବା ପରେ 21 ଦିନ ପରେ ଏକର ପିଛା 26 କି. ଗ୍ରା. ହାରରେ ଯ଼ୁରିଆ କାଟିବା ଏବଂ ଉପର ଡ୍ରେସିଂ କରିବା ପାଇଁ ଯାଆନ୍ତୁ।",
            "22. 5 x 10 ସେ. ମି. ବ୍ଯ଼ବଧାନରେ 2ଟି ଚାରା/ପାହାଡ ସହିତ 25 ଦିନ ପୁରୁଣା ଚାରା ରୋପଣ କରନ୍ତୁ। ଶେଷ ହଳ କରିବା ସମଯ଼ରେ ଏକର ପିଛା 26 କିଲୋଗ୍ରାମ ଡିଏପି, 16 କିଲୋଗ୍ରାମ ଯ଼ୁରିଆ ଏବଂ 20 କିଲୋଗ୍ରାମ ଏମଓପି ଲଗାନ୍ତୁ।"
         ]
      },
      "niger": {
         "advisory": [
            "ଉତ୍କଲ ନାଇଜର-150 ନାଇଜର ମଞ୍ଜି ଏକର ପିଛା 4 କି. ଗ୍ରା. ରେ ଧାଡ଼ିରେ କିମ୍ବା ହଳ ପଛପଟେ ବୁଣନ୍ତୁ।"
         ]
      },
      "brinjal": {
         "advisory": [
            "1 ଗ୍ରାମ୍/ଲିଟର ଟାବୁକୋନାଜୋଲ୍ ସିଞ୍ଚନ ଦ୍ୱାରା ବାଇଗଣରେ ତରଳିବାର ନିଯ଼ନ୍ତ୍ରଣ କରାଯାଇପାରିବ।"
         ]
      },
      "okra": {
         "advisory": [
            "କ୍ଷେତରୁ ଅତିରିକ୍ତ ପାଣି ବାହାର କରନ୍ତୁ।",
            "ଫୁସାରିଯ଼ମ୍ ୱିଲ୍ଟକୁ ପରିଚାଳନା କରିବା ପାଇଁ ମାଙ୍କୋଜେବ୍ କିମ୍ବା ଥିରାମ୍ @3 ଗ୍ରାମ୍/କେଜି ମଞ୍ଜି ଲଗାନ୍ତୁ |",
            "ଓକ୍ରାରେ ସେରକୋସ୍ପୋରା ପତ୍ର ଦାଗକୁ ପରିଚାଳନା କରିବା ପାଇଁ କପର୍ ଅକ୍ସିକ୍ଲୋରାଇଡ୍ @3 ମିଲି/ଲିଟର ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "mango": {
         "advisory": [
            "ଆମ୍ବ ରୋପଣ ପାଇଁ ଉପଯୁକ୍ତ ସମଯ଼ ହେଉଛି ଜୁଲାଇରୁ ଅଗଷ୍ଟ।",
            "ଉପଯୁକ୍ତ ପ୍ରଜାତି ଯଥା, ବଙ୍ଗନପଲ୍ଲୀ, ତୋତାପୁରୀ, ବମ୍ବେ ଗ୍ରୀନ୍, ସୁବର୍ଣ୍ଣରେଖା, ନୀଲମ, ହିମସାଗର, ଲାଙ୍ଗ୍ରା, ଦଶେରୀ, ଆମ୍ରପାଲି, ମଲ୍ଲିକା, ରତ୍ନ, ରାମକେଲ୍ଲା, ରୁମ୍ମାନି, ସିନ୍ଧୁ, ଅଲ୍ଫାନ୍ସୋ ଏବଂ କେଶର ଇତ୍ଯ଼ାଦି ଚଯ଼ନ କରନ୍ତୁ। ସୁସ୍ଥ ଶାଖାବିହୀନ ଗ୍ରାଫ୍ଟେଡ ଚାରା ବ୍ଯ଼ବହାର କରନ୍ତୁ।",
            "10 ମି. x 10 ମି. ଦୂରତାରେ 1 ମି. x 1 ମି. x 1 ମି. ଗର୍ତ୍ତରେ ଚାରା ରୋପଣ କରନ୍ତୁ। ରୋପଣ ପୂର୍ବରୁ 5 କି. ଗ୍ରା. ଏଫ. ୱାଇ. ଏମ୍./ଗର୍ତ୍ତ ଲଗାନ୍ତୁ।"
         ]
      },
      "ginger": {
         "advisory": [
            "ଦ୍ୱିତୀଯ଼ ଘାସ କାଟିବା ଏବଂ ଦ୍ୱିତୀଯ଼ ଉପର ଡ୍ରେସିଂ କରାଯାଇପାରେ | ଏକର ପିଛା 40 କି. ଗ୍ରା. ନିମ କେକ୍, 20 କି. ଗ୍ରା. ଡିଏପି ସହିତ 4 କି. ଗ୍ରା. ଫୋରେଟ, 20 କି. ଗ୍ରା. ନିମ ଲେପିତ ଯ଼ୁରିଆ, 20 କି. ଗ୍ରା. ଏମଓପି ଲଗାନ୍ତୁ।"
         ]
      },
      "turmeric": {
         "advisory": [
            "ଆଗାଛା କାଟିବା ଏବଂ ଶୂନ୍ଯ଼ସ୍ଥାନ ପୂରଣ କରିବା ପାଇଁ ଯାଆନ୍ତୁ ଏବଂ ରୋପଣର 45 ଦିନ ପରେ ଏକର ପିଛା 26 କିଲୋଗ୍ରାମ ଯ଼ୁରିଆ ଲଗାନ୍ତୁ ଏବଂ ଏକର ପିଛା 2 ଟନ୍ର ମୂଲ୍ଯ଼ରେ ମଲ୍ଚିଙ୍ଗ ଲଗାନ୍ତୁ।"
         ]
      },
      "cow": {
         "advisory": [
            "ଲିକ୍-ମୁକ୍ତ ଏବଂ ଭଲ ଭାବରେ ପ୍ରସାରିତ ରଖାଯାଇଥିବା କାଉଶେଡ୍ ଆର୍ଦ୍ରତା ନିର୍ମାଣ ଏବଂ କ୍ଷତିକାରକ ଫଙ୍ଗସ୍ ବୃଦ୍ଧିକୁ ରୋକିବାରେ ସାହାଯ୍ଯ଼ କରିବ | ଏଫ୍. ଏମ୍. ଡି., ଏଚ୍. ଏସ୍. ଏବଂ ବି. କ୍ଯ଼ୁ. ବିରୁଦ୍ଧରେ ଗାଈ ଏବଂ ମଇଁଷିକୁ ଟୀକାକରଣ କରନ୍ତୁ। ଆର୍ଦ୍ର ପରିବେଶରେ ଆଭ୍ଯ଼ନ୍ତରୀଣ ପରଜୀବୀକୁ ନିଯ଼ନ୍ତ୍ରଣ କରିବା ପାଇଁ, ଏକ କୃମି ନିବାରଣ କାର୍ଯ୍ଯ଼କ୍ରମ ବିକଶିତ କରନ୍ତୁ।"
         ]
      }
   },
   "date": "13-08-2024"
}