{
   "weather_details": {
      "09-08-2024": {
         "rainfall": 9,
         "t_max": 32,
         "t_min": 25,
         "rh_max": 0,
         "rh_min": 0,
         "wind_speed": 0,
         "wind_direction": 0,
         "cloud_cover": 0
      },
      "10-08-2024": {
         "rainfall": 0,
         "t_max": 33,
         "t_min": 26,
         "rh_max": 0,
         "rh_min": 0,
         "wind_speed": 0,
         "wind_direction": 0,
         "cloud_cover": 0
      },
      "11-08-2024": {
         "rainfall": 7,
         "t_max": 33,
         "t_min": 26,
         "rh_max": 0,
         "rh_min": 0,
         "wind_speed": 0,
         "wind_direction": 0,
         "cloud_cover": 0
      },
      "12-08-2024": {
         "rainfall": 2,
         "t_max": 32,
         "t_min": 26,
         "rh_max": 0,
         "rh_min": 0,
         "wind_speed": 0,
         "wind_direction": 0,
         "cloud_cover": 0
      },
      "14-08-2024": {
         "rainfall": 5,
         "t_max": 35,
         "t_min": 27,
         "rh_max": 91,
         "rh_min": 60,
         "wind_speed": 6,
         "wind_direction": 212,
         "cloud_cover": 6
      },
      "15-08-2024": {
         "rainfall": 5,
         "t_max": 35,
         "t_min": 27,
         "rh_max": 90,
         "rh_min": 67,
         "wind_speed": 5,
         "wind_direction": 214,
         "cloud_cover": 6
      },
      "16-08-2024": {
         "rainfall": 4,
         "t_max": 36,
         "t_min": 27,
         "rh_max": 90,
         "rh_min": 62,
         "wind_speed": 5,
         "wind_direction": 225,
         "cloud_cover": 7
      },
      "17-08-2024": {
         "rainfall": 6,
         "t_max": 36,
         "t_min": 26,
         "rh_max": 90,
         "rh_min": 62,
         "wind_speed": 4,
         "wind_direction": 202,
         "cloud_cover": 7
      },
      "18-08-2024": {
         "rainfall": 10,
         "t_max": 35,
         "t_min": 26,
         "rh_max": 89,
         "rh_min": 58,
         "wind_speed": 4,
         "wind_direction": 238,
         "cloud_cover": 8
      }
   },
   "names_of_crops": [
      "ଚାଉଳ",
      "ବାଇଗଣ",
      "ଓକ୍ରା",
      "ମକା",
      "ଆମ୍ବ",
      "ପେଁପେ"
   ],
   "general_advisory": "ଆଗାମୀ ପାଞ୍ଚ ଦିନ ମଧ୍ଯ଼ରେ ବର୍ଷା ହେବାର ସମ୍ଭାବନା ରହିଛି, କେବଳ ଆକାଶ ସଫା ହେବା ପରେ ସ୍ପ୍ରେ କରନ୍ତୁ ଏବଂ ସ୍ପ୍ରେ ଦ୍ରବଣରେ ଷ୍ଟିକର ବ୍ଯ଼ବହାର କରନ୍ତୁ। କ୍ଷେତର ଗୋଟିଏ ଅଂଶରେ ବର୍ଷା ଜଳ ସଂରକ୍ଷଣ ପାଇଁ ଉପଯୁକ୍ତ ବ୍ଯ଼ବସ୍ଥା କରିବାକୁ କୃଷକମାନଙ୍କୁ ପରାମର୍ଶ ଦିଆଯାଇଛି। ଏହି ଜଳକୁ ଶୁଖିଲା ଋତୁରେ ଫସଲରେ ଜଳସେଚନ ପାଇଁ ବ୍ଯ଼ବହାର କରାଯାଇପାରିବ। ଅଧିକ ଆର୍ଦ୍ରତା କାରଣରୁ ପୂର୍ବରୁ ବୁଣାଯାଇଥିବା ଫସଲରେ କୀଟପତଙ୍ଗ ଏବଂ ରୋଗ ସୃଷ୍ଟି ହେବାର ସମ୍ଭାବନା ରହିଛି। ଫସଲ ଏବଂ ପାଣିପାଗ ସ୍ଥିତି ଉପରେ ନିର୍ଭର କରି ଉଦ୍ଭିଦ ସୁରକ୍ଷା ପଦକ୍ଷେପ ନିଅନ୍ତୁ।",
   "crops_data": {
      "rice": {
         "advisory": [
            "ଧାନ ନର୍ସରୀରେ ଚାରା ରୋଗ ଏବଂ ବିସ୍ଫୋରଣ ସଂକ୍ରମଣର ସମ୍ଭାବନା। ଚାରା ବ୍ଲାଇଟକୁ ନିଯ଼ନ୍ତ୍ରଣ କରିବା ପାଇଁ ପ୍ରୋପିକୋନାଜୋଲ 25 ପ୍ରତିଶତ ଇସି @1 ମିଲି/ଲିଟର ପାଣି ସ୍ପ୍ରେ କରନ୍ତୁ ଏବଂ ବିସ୍ଫୋରଣକୁ ନିଯ଼ନ୍ତ୍ରଣ କରିବା ପାଇଁ ଟେବୁକୋନାଜୋଲ 50 ପ୍ରତିଶତ + ଟ୍ରାଇଫ୍ଲୋକ୍ସିସ୍ଟ୍ରୋବିନ୍ 25 ପ୍ରତିଶତ ଡବ୍ଲୁଜି @0.4 ଗ୍ରାମ/ଲିଟର ପାଣି ସଫା ପାଗରେ ସ୍ପ୍ରେ କରନ୍ତୁ।",
            "ସିଧାସଳଖ ବୁଣାଯାଇଥିବା ଧାନ କ୍ଷେତରେ, 16 ଲିଟର କ୍ଷମତା ବିଶିଷ୍ଟ ବିସ୍ପିରିବାକ୍ ସୋଡ଼ିଅମ୍ 10 ପ୍ରତିଶତ ଏସ୍. ସି. @15 ମିଲି/ଟ୍ଯ଼ାଙ୍କ୍ ବୁଣିବାର 8-10 ଦିନ ପରେ କିମ୍ବା ଯେତେବେଳେ ଆଗାଛା 2-3 ପତ୍ର ସ୍ତରରେ ଥାଏ, ହସ୍ତଚାଳିତ ନିରାମଯ଼ ବିକଳ୍ପ ଭାବରେ ଆର୍ଦ୍ର ମାଟିରେ ସିଞ୍ଚନ କରନ୍ତୁ।",
            "ଅଧିକ ଉତ୍ପାଦନକ୍ଷମ କିସମ ପ୍ରତିରୋପଣ ପାଇଁ, ଶେଷ ପୁଡଲିଂ ସମଯ଼ରେ ଏକର ପିଛା 35 କିଲୋଗ୍ରାମ ଡିଏପି, 4 କିଲୋଗ୍ରାମ ଯ଼ୁରିଆ ଏବଂ 27 କିଲୋଗ୍ରାମ ଏମଓପି ଲଗାନ୍ତୁ। ଜିଙ୍କ ଅଭାବ ଥିବା ଅଞ୍ଚଳରେ ଏକର ପିଛା 10 କିଲୋଗ୍ରାମ ଜିଙ୍କ ସଲଫେଟ୍ ଲଗାନ୍ତୁ।",
            "ଆଗାଛାକୁ ନିଯ଼ନ୍ତ୍ରଣ କରିବା ପାଇଁ ରୋପଣର 3-7 ଦିନ ମଧ୍ଯ଼ରେ ଏକର ପିଛା 4 କି. ଗ୍ରା. ଦରରେ ବେନ୍ସଲ୍ଫୁରନ୍ ମିଥାଇଲ 0.6% + ପ୍ରିଟିଲାକ୍ଲୋର 6% ଜିଆର ସହିତ 4 କି. ଗ୍ରା. ବାଲି ଲଗାନ୍ତୁ।",
            "30 ଡିଏଏସରେ ଷ୍ଟେମ ବୋରର, ଲିଫ୍ ଫୋଲଡର ଏବଂ ଚାଉଳ କାନ ଖାଉଥିବା କ୍ଯ଼ାଟର୍ପିଲରର ଜନସଂଖ୍ଯ଼ା ଉପରେ ନଜର ରଖିବା ଏବଂ ନିଯ଼ନ୍ତ୍ରଣ କରିବା ପାଇଁ ଫେରୋମୋନ୍ ଟ୍ରାପ୍ @8nos./acre ଏବଂ ଲାଇଟ୍ ଟ୍ରାପ୍ @1no./acre ସ୍ଥାପନ କରନ୍ତୁ ଏବଂ ତିନି ସପ୍ତାହ ପରେ ଲୋଭକୁ ବଦଳାନ୍ତୁ |"
         ]
      },
      "brinjal": {
         "advisory": [
            "1 ଗ୍ରାମ୍/ଲିଟର ଟାବୁକୋନାଜୋଲ୍ ସିଞ୍ଚନ ଦ୍ୱାରା ବାଇଗଣରେ ତରଳିବାର ନିଯ଼ନ୍ତ୍ରଣ କରାଯାଇପାରିବ।"
         ]
      },
      "okra": {
         "advisory": [
            "କ୍ଷେତରୁ ଅତିରିକ୍ତ ପାଣି ବାହାର କରନ୍ତୁ।",
            "ଫୁସାରିଯ଼ମ୍ ୱିଲ୍ଟକୁ ପରିଚାଳନା କରିବା ପାଇଁ ମାଙ୍କୋଜେବ୍ କିମ୍ବା ଥିରାମ୍ @3 ଗ୍ରାମ୍/କେଜି ମଞ୍ଜି ଲଗାନ୍ତୁ |",
            "ଓକ୍ରାରେ ସେରକୋସ୍ପୋରା ପତ୍ର ଦାଗକୁ ପରିଚାଳନା କରିବା ପାଇଁ କପର୍ ଅକ୍ସିକ୍ଲୋରାଇଡ୍ @3 ମିଲି/ଲିଟର ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "maize": {
         "advisory": [
            "ଅତ୍ଯ଼ଧିକ ବର୍ଷା କାରଣରୁ ଜଳମଗ୍ନ ପରିସ୍ଥିତିକୁ ଏଡ଼ାଇବା ପାଇଁ ଏକ ଉନ୍ନତ ଜଳ ନିଷ୍କାସନ ବ୍ଯ଼ବସ୍ଥା ବିକଶିତ କରନ୍ତୁ।",
            "ଶରତ ସେନା କୃମି ସଂକ୍ରମଣ ଉପରେ ନଜର ରଖନ୍ତୁ |",
            "ପତଳା ଆର୍ମିୱର୍ମକୁ ନିଯ଼ନ୍ତ୍ରଣ କରିବା ପାଇଁ କୀଟନାଶକ ସ୍ପ୍ରେ କରନ୍ତୁ। ସକାଳେ କିମ୍ବା ସନ୍ଧ୍ଯ଼ାରେ ସ୍ପ୍ରେ କରିବା ଉଚିତ।",
            "ପତନ ଆର୍ମିୱର୍ମର ଆକ୍ରମଣକୁ ପରିଚାଳନା କରିବା ପାଇଁ, ଇମାମେକ୍ଟିନ୍ ବେନ୍ଜୋଏଟ୍ 5 ପ୍ରତିଶତ SG @4 ଗ୍ରାମ୍/10lt ପାଣି ସ୍ପ୍ରେ କରନ୍ତୁ।",
            "ଏହି ପର୍ଯ୍ଯ଼ାଯ଼ରେ ଷ୍ଟେମ ବୋରର ଏବଂ ବ୍ଯ଼ାଣ୍ଡେଡ ପତ୍ର ଏବଂ ସିଥ୍ ବ୍ଲାଇଟ୍ ଦେଖାଯାଇପାରେ | ନିଯ଼ମିତ ଭାବେ କ୍ଷେତ ଉପରେ ନଜର ରଖନ୍ତୁ ଏବଂ ସଂକ୍ରମିତ ଗଛର ଅଂଶଗୁଡ଼ିକୁ ବାହାର କରନ୍ତୁ।"
         ]
      },
      "mango": {
         "advisory": [
            "ଆମ୍ବ ରୋପଣ ପାଇଁ ଉପଯୁକ୍ତ ସମଯ଼ ହେଉଛି ଜୁଲାଇରୁ ଅଗଷ୍ଟ।",
            "ଉପଯୁକ୍ତ କିସମ ଯଥା, ବଙ୍ଗନପଲ୍ଲୀ, ତୋତାପୁରୀ, ବମ୍ବେ ଗ୍ରୀନ୍, ସୁବର୍ଣ୍ଣରେଖା, ନୀଲମ, ହିମସାଗର, ଲାଙ୍ଗ୍ରା, ଦଶେରୀ, ଆମ୍ରପାଲି, ମଲ୍ଲିକା, ରତ୍ନା, ରାମକେଲ୍ଲା, ରୁମ୍ମାନି, ସିନ୍ଧୁ, ଅଲ୍ଫାନ୍ସୋ ଏବଂ କେଶର ଇତ୍ଯ଼ାଦି ଚଯ଼ନ କରନ୍ତୁ। ସୁସ୍ଥ ଶାଖାବିହୀନ ଗ୍ରାଫ୍ଟେଡ ଚାରା ବ୍ଯ଼ବହାର କରନ୍ତୁ।",
            "10 ମି. x 10 ମି. ଦୂରତାରେ 1 ମି. x 1 ମି. x 1 ମି. ଗର୍ତ୍ତରେ ଚାରା ରୋପଣ କରନ୍ତୁ। ରୋପଣ ପୂର୍ବରୁ 5 କି. ଗ୍ରା. ଏଫ. ୱାଇ. ଏମ୍./ଗର୍ତ୍ତ ଲଗାନ୍ତୁ।"
         ]
      },
      "papaya": {
         "advisory": [
            "କଦଳୀ ଗଛ ଲଗାଇବା ପାଇଁ ଏହା ଉପଯୁକ୍ତ ସମଯ଼।",
            "ପେଁପେ ପାଇଁ ଏଚୱାଇଭି ହେଉଛି ହନିଡିଉ, କୁର୍ଗ ହନିଡିଉ, ସିଓ-1, ସିଓ-2, ପୁସା ସୁସ୍ୱାଦୁ, ପୁସା ମ୍ଯ଼ାଜେଷ୍ଟି ଏବଂ ପୁସା ଜଏଣ୍ଟ |",
            "ଚାରା ଗୁଡ଼ିକୁ 2.5 ମି. x 2.5 ମି. ଦୂରତା ଏବଂ 0.5 ମି. x 0.5 ମି. x 0.5 ମି. ଗର୍ତ୍ତରେ ରୋପଣ କରନ୍ତୁ। ରୋଗ ପ୍ରତିରୋଧକ ଏବଂ ଟିସ୍ଯ଼ୁ କଲ୍ଚର ଚାରା ବ୍ଯ଼ବହାର କରାଯିବା ଉଚିତ। ରୋପଣ ପୂର୍ବରୁ ଗର୍ତ୍ତରେ ଉପର ମାଟି ଏବଂ ଭଲ ଭାବେ ସଡି ଯାଇଥିବା ଏଫ୍. ଆଇ. ଏମ୍. ର ମିଶ୍ରଣ ଲଗାନ୍ତୁ।"
         ]
      }
   },
   "date": "13-08-2024"
}