{
   "weather_details": {
      "2025-01-11": {
         "rainfall": 0,
         "t_max": 28,
         "t_min": 14,
         "rh_max": 73,
         "rh_min": 28,
         "wind_speed": 3,
         "wind_direction": 0,
         "cloud_cover": 2
      },
      "2025-01-12": {
         "rainfall": 0,
         "t_max": 26,
         "t_min": 15,
         "rh_max": 70,
         "rh_min": 29,
         "wind_speed": 4,
         "wind_direction": 334,
         "cloud_cover": 3
      },
      "2025-01-13": {
         "rainfall": 0,
         "t_max": 27,
         "t_min": 16,
         "rh_max": 67,
         "rh_min": 27,
         "wind_speed": 5,
         "wind_direction": 352,
         "cloud_cover": 3
      },
      "2025-01-14": {
         "rainfall": 0,
         "t_max": 27,
         "t_min": 16,
         "rh_max": 73,
         "rh_min": 28,
         "wind_speed": 3,
         "wind_direction": 0,
         "cloud_cover": 2
      },
      "2025-01-15": {
         "rainfall": 0,
         "t_max": 28,
         "t_min": 16,
         "rh_max": 70,
         "rh_min": 29,
         "wind_speed": 4,
         "wind_direction": 334,
         "cloud_cover": 3
      }
   },
   "names_of_crops": [
      "ଚାଉଳ",
      "ସୂର୍ଯ୍ୟମୁଖୀ",
      "ବ୍ଲାକଗ୍ରାମ ଏବଂ ଗ୍ରୀନଗ୍ରାମ",
      "ସୋରିଷ",
      "ଚିନାବାଦାମ",
      "ଲାଲ ଚଣା",
      "ଲଙ୍କା",
      "ଫୁଲକୋବି",
      "କଦଳୀ",
      "ବାଇଗଣ",
      "ଟମାଟୋ",
      "ରସୁଣ",
      "ଆଳୁ",
      "ପଶୁପାଳନ",
      "ଛେଳି।",
      "କୁକୁଡ଼ା ମାଂସ",
      "ମତ୍ସ୍ୟଚାଷ"
   ],
   "general_advisory": "ପୂର୍ବାନୁମାନର ବର୍ଦ୍ଧିତ ପରିସର ଅନୁଯାୟୀ, ଓଡ଼ିଶାର ଜିଲ୍ଲାଗୁଡ଼ିକରେ ଶୁଖିଲା ପାଗ ରହିବାର ସମ୍ଭାବନା ରହିଛି। ପରିପକ୍ୱ ଫସଲ ଅମଳ ଜାରି ରଖିବା, ଉଦ୍ଭିଦ ସୁରକ୍ଷା ରାସାୟନିକ ପ୍ରୟୋଗ କରିବା ଏବଂ ଆବଶ୍ୟକ ଆନ୍ତଃସାଂସ୍କୃତିକ କାର୍ଯ୍ୟ କରିବା ପାଇଁ କୃଷକମାନଙ୍କୁ ପରାମର୍ଶ ଦିଆଯାଇଛି।",
   "crops_data": {
      "rice": {
         "advisory": [
            "ଅମଳ ପରବର୍ତ୍ତୀ ଯତ୍ନଃ ଆଲୁମିନିୟମ୍ ଫସଫାଇଡ୍ ସହିତ ଗଚ୍ଛିତ ଶସ୍ୟ କୀଟକୁ ଧୂମାୟିତ କରନ୍ତୁ। ଶୁଖିଲା ଋତୁ ରୋପଣ ପାଇଁ ଭଲ ଗୁଣବତ୍ତା ବିଶିଷ୍ଟ ଧାନ ମଞ୍ଜି ବ୍ୟବହାର କରନ୍ତୁ।"
         ]
      },
      "sunflower": {
         "advisory": [
            "ୟୁରିଆ ଏବଂ ଏମ୍. ଓ. ପି. କୁ ଉପର ଡ୍ରେସିଂ ଭାବେ ଲଗାନ୍ତୁ। କୀଟ ନିୟନ୍ତ୍ରଣ ପାଇଁ ଏସିଟାମିପ୍ରିଡ୍ କିମ୍ବା ଇମିଡାକ୍ଲୋପ୍ରିଡ୍ ବ୍ୟବହାର କରନ୍ତୁ। ପାଉଡର ଫଙ୍ଗୁର ପାଇଁ ଓଦା ହେଉଥିବା ଗନ୍ଧକ ବ୍ୟବହାର କରନ୍ତୁ।"
         ]
      },
      "blackgram and greengram": {
         "advisory": [
            "ୱାଇ. ଏମ୍. ଭି. ରୋଗ ପ୍ରତିରୋଧକ କିସମର ଚୟନ କରନ୍ତୁ। ବୁଣିବା ପୂର୍ବରୁ ମଞ୍ଜିଗୁଡ଼ିକୁ ଇମିଡାକ୍ଲୋପ୍ରିଡ୍ ସହିତ ଚିକିତ୍ସା କରନ୍ତୁ। ଧଳା ମାଛି ପାଇଁ ହଳଦିଆ ଚଟପଟା ଜାଲ ବ୍ୟବହାର କରନ୍ତୁ। ନିମ୍ବ ଆଧାରିତ କୀଟନାଶକ କିମ୍ବା ରାସାୟନିକ ସ୍ପ୍ରେ ଦ୍ୱାରା ଶ୍ୱେତ ମାଛି ସଂକ୍ରମଣ ପରିଚାଳନା କରନ୍ତୁ।"
         ]
      },
      "mustard": {
         "advisory": [
            "ଏଫିଡ୍ ସଂକ୍ରମଣ ପ୍ରତି ଧ୍ୟାନ ଦିଅନ୍ତୁ। ହଳଦିଆ ଚଟପଟା ଜାଲ ବ୍ୟବହାର କରନ୍ତୁ। ନିମ୍ବ ଆଧାରିତ କୀଟନାଶକ କିମ୍ବା ରାସାୟନିକ ସ୍ପ୍ରେ ସହିତ ଏଫିଡ୍ ପରିଚାଳନା କରନ୍ତୁ |"
         ]
      },
      "groundnut": {
         "advisory": [
            "ଏଫିଡ୍ ଏବଂ ଥ୍ରୀପ୍ ପାଇଁ ନିମ୍ ଆଧାରିତ କୀଟନାଶକ ସ୍ପ୍ରେ କରନ୍ତୁ। ପ୍ରାକ୍-ଆବିର୍ଭାବ ହର୍ବିସାଇଡ୍ ପ୍ରୟୋଗ କରନ୍ତୁ। ରୋଗ ପ୍ରତିରୋଧ ପାଇଁ ମଞ୍ଜି ଉପଚାର କରନ୍ତୁ।"
         ]
      },
      "red gram": {
         "advisory": [
            "ଫଳଗୁଡ଼ିକ ବାଦାମୀ ରଙ୍ଗ ହେବା ପରେ ଅମଳ କରନ୍ତୁ। ସୂର୍ଯ୍ୟାଲୋକରେ ଶୁଖିଲା ଅମଳ ହୋଇଥିବା ମଞ୍ଜି। ଖାଇବା ତେଲ ଏବଂ କର୍ପୂର ଟାବଲେଟ୍ ସହିତ ସଂରକ୍ଷଣ କୀଟକୁ ରୋକନ୍ତୁ |"
         ]
      },
      "chilli": {
         "advisory": [
            "ନିମ୍ବ ଆଧାରିତ କୀଟନାଶକ କିମ୍ବା ରାସାୟନିକ ସ୍ପ୍ରେ ସହିତ ଏଫିଡ୍ ଏବଂ ଥ୍ରୀପ୍ କୁ ନିୟନ୍ତ୍ରଣ କରନ୍ତୁ |"
         ]
      },
      "cauliflower": {
         "advisory": [
            "ବୋରାକ୍ସ ମୃତ୍ତିକା ପ୍ରୟୋଗ ଦ୍ୱାରା ବ୍ରାଉନିଙ୍ଗ୍ କିମ୍ବା ବ୍ରାଉନ୍ ରଟ୍ କୁ ରୋକନ୍ତୁ |"
         ]
      },
      "cabbage": {
         "advisory": [
            "ହାଲୁକା ଫାନ୍ଦ ଏବଂ ନିମ ଆଧାରିତ କୀଟନାଶକ ଦ୍ୱାରା ଡିମଣ୍ଡ ବ୍ୟାକ୍ ମଥ ସଂକ୍ରମଣର ପରିଚାଳନା କରନ୍ତୁ।"
         ]
      },
      "brinjal": {
         "advisory": [
            "ହଳଦିଆ ଚଟପଟା ଜାଲ ଏବଂ ନିମ ଆଧାରିତ କୀଟନାଶକ କିମ୍ବା ରାସାୟନିକ ସ୍ପ୍ରେ ସହିତ ଧଳା ମାଛି ନିୟନ୍ତ୍ରଣ କରନ୍ତୁ | ଉଦ୍ଭିଦ ଅପସାରଣ ଏବଂ ଫେରୋମୋନ୍ ଫାନ୍ଦ ସହିତ ଶୁଟ୍ ଏବଂ ଫଳ ଛେଦକ ପରିଚାଳନା କରନ୍ତୁ |"
         ]
      },
      "tomato": {
         "advisory": [
            "ପ୍ରଭାବିତ ଫଳ ସଂଗ୍ରହ କରି ଏବଂ ଫେରୋମୋନ୍ ଟ୍ରାପ୍ ବ୍ୟବହାର କରି ଫଳ ଛେଦକକୁ ପରିଚାଳନା କରନ୍ତୁ | ନିୟନ୍ତ୍ରଣ ପାଇଁ କୀଟନାଶକ ବ୍ୟବହାର କରନ୍ତୁ।"
         ]
      },
      "onion": {
         "advisory": [
            "ରୋଗକୁ ଡିମ୍ପିଂରୁ ରକ୍ଷା କରିବା ପାଇଁ ନର୍ସରୀ ଶଯ୍ୟାକୁ ଭିଜାଇ ଦିଅନ୍ତୁ। 8 ସପ୍ତାହ ପରେ ମୁଖ୍ୟ କ୍ଷେତରେ ଚାରା ରୋପଣ କରନ୍ତୁ।"
         ]
      },
      "potato": {
         "advisory": [
            "ଏବଂ ଆଳୁ ଫସଲ। ଏନ୍ ସାର ପ୍ରୟୋଗ କରନ୍ତୁ। ଉପଯୁକ୍ତ ସ୍ପ୍ରେ ସାହାଯ୍ୟରେ ଲିଫ୍ ବ୍ଲାଇଟ୍ ରୋଗକୁ ପରିଚାଳନା କରନ୍ତୁ।"
         ]
      },
      "livestock": {
         "advisory": [
            "ପଶୁମାନଙ୍କ ପାଇଁ ଭେଣ୍ଟିଲେସନ୍ ସହିତ ଉପଯୁକ୍ତ ଆଶ୍ରୟ ପ୍ରଦାନ କରନ୍ତୁ | ଶୀତଦିନେ ଖାଦ୍ୟ ପରିମାଣ ବୃଦ୍ଧି କରନ୍ତୁ। ଆବଶ୍ୟକ ପଡ଼ିଲେ ପଶୁମାନଙ୍କୁ ଟିକା ଦିଅନ୍ତୁ।"
         ]
      },
      "goat": {
         "advisory": [
            "ପିପିଆର ରୋଗ ବିରୁଦ୍ଧରେ ଟୀକାକରଣ କରନ୍ତୁ। ମୃତ୍ୟୁହାର ହ୍ରାସ କରିବା ପାଇଁ ଉପଯୁକ୍ତ ଯତ୍ନ ଏବଂ ଖାଦ୍ୟ ପ୍ରଦାନ କରନ୍ତୁ।"
         ]
      },
      "poultry": {
         "advisory": [
            "ଶୀତଦିନେ ଖାଦ୍ୟଦ୍ରବ୍ୟ ବୃଦ୍ଧି କରନ୍ତୁ। ନିରନ୍ତର ଭାବେ ଜଳ ଉପଲବ୍ଧ କରାଇବା। କୁକୁଡ଼ା ପାଳିରେ ହିଟର୍ ଲଗାନ୍ତୁ।"
         ]
      },
      "fisheries": {
         "advisory": [
            "ସିଫ୍ୟାକ୍ସ ପ୍ରୟୋଗ ଦ୍ୱାରା 'ଇ. ୟୁ. ଏସ୍.' ରୋଗକୁ ପ୍ରତିରୋଧ କରନ୍ତୁ। ପ୍ରତିଦିନ ତେଲ କେକ୍ ବ୍ରାନ୍ ମିଶ୍ରଣ ସହିତ ମାଛ ଖାଆନ୍ତୁ |"
         ]
      }
   },
   "date": "10-01-2025"
}