{
   "weather_details": {
      "2024-09-07": {
         "rainfall": 10,
         "t_max": 33,
         "t_min": 27,
         "rh_max": 85,
         "rh_min": 57,
         "wind_speed": 8,
         "wind_direction": 90,
         "cloud_cover": 7
      },
      "2024-09-08": {
         "rainfall": 15,
         "t_max": 32,
         "t_min": 27,
         "rh_max": 93,
         "rh_min": 66,
         "wind_speed": 9,
         "wind_direction": 72,
         "cloud_cover": 7
      },
      "2024-09-09": {
         "rainfall": 25,
         "t_max": 30,
         "t_min": 26,
         "rh_max": 91,
         "rh_min": 66,
         "wind_speed": 8,
         "wind_direction": 112,
         "cloud_cover": 7
      },
      "2024-09-10": {
         "rainfall": 20,
         "t_max": 30,
         "t_min": 26,
         "rh_max": 92,
         "rh_min": 63,
         "wind_speed": 7,
         "wind_direction": 79,
         "cloud_cover": 8
      },
      "2024-09-11": {
         "rainfall": 10,
         "t_max": 32,
         "t_min": 26,
         "rh_max": 90,
         "rh_min": 64,
         "wind_speed": 7,
         "wind_direction": 270,
         "cloud_cover": 7
      }
   },
   "names_of_crops": [
      "ଚାଉଳ",
      "ଫିଙ୍ଗର ମିଲେଟ୍",
      "କଦଳୀ",
      "ମେନାସିନାକାହି",
      "ଲଙ୍କା",
      "ବାଇଗଣ",
      "ଚିକେନ୍"
   ],
   "general_advisory": "ଆଇଏମଡିରୁ ମିଳିଥିବା ପୂର୍ବାନୁମାନର ବର୍ଦ୍ଧିତ ପରିସର ଅନୁଯାୟୀ, ସପ୍ତାହ-1 (6 ରୁ 12 ସେପ୍ଟେମ୍ବର, 2024) ମଧ୍ୟରେ ଓଡ଼ିଶାର ଜିଲ୍ଲାଗୁଡ଼ିକରେ ବ୍ୟାପକ ବର୍ଷା/ବଜ୍ରପାତ ହେବାର ସମ୍ଭାବନା ରହିଛି ଏବଂ ସେପ୍ଟେମ୍ବର 6 ରେ ଦକ୍ଷିଣ ଓଡ଼ିଶାର ଜିଲ୍ଲାଗୁଡ଼ିକରେ ବିଚ୍ଛିନ୍ନ ଭାବେ ପ୍ରବଳ ବର୍ଷା ହେବାର ସମ୍ଭାବନା ରହିଛି; ସେପ୍ଟେମ୍ବର 7 ରେ ଦକ୍ଷିଣ ଓଡ଼ିଶାର ଜିଲ୍ଲାଗୁଡ଼ିକରେ ବିଚ୍ଛିନ୍ନ ଭାବେ ପ୍ରବଳରୁ ଅତି ପ୍ରବଳ ବର୍ଷା ହେବାର ସମ୍ଭାବନା ରହିଛି; ସେପ୍ଟେମ୍ବର 8 ରେ କେନ୍ଦ୍ରୀୟ ଓଡ଼ିଶାର ଜିଲ୍ଲାଗୁଡ଼ିକରେ ବିଚ୍ଛିନ୍ନ ଭାବେ ପ୍ରବଳରୁ ଅତି ପ୍ରବଳ ବର୍ଷା ହେବାର ସମ୍ଭାବନା ରହିଛି, ପ୍ରବଳ ବର୍ଷା ହେବାର ସମ୍ଭାବନା ରହିଛି।",
   "crops_data": {
      "rice": {
         "advisory": [
            "ଫସଲଟି ସକ୍ରିୟ ଚାଷ ପର୍ଯ୍ୟାୟରେ ରହିଛି। ବର୍ଷା ଜଳ ହ୍ରାସ ପାଇବା ପରେ, 28 ଡିଗ୍ରୀ ସେଲସିୟସରୁ କମ୍ ତାପମାତ୍ରା ଏବଂ 70 ପ୍ରତିଶତରୁ ଅଧିକ ଆପେକ୍ଷିକ ଆର୍ଦ୍ରତା ଧାନରେ ସ୍ୱାର୍ମିଂ କ୍ୟାଟର୍ପିଲାର୍ ଏବଂ ହଳଦିଆ କାଣ୍ଡ ଛେଦକ ସଂକ୍ରମଣକୁ ପସନ୍ଦ କରେ | ସ୍ୱାର୍ମିଂ କ୍ୟାଟର୍ପିଲର ପରିଚାଳନା ପାଇଁ, ପ୍ରଥମେ କ୍ଷେତ ଏବଂ ବନ୍ଧରୁ ଆଗାଛା ଅପସାରଣ କରେ | ଯଦି ଫସଲ ବିଉଶାନିଙ୍ଗ ପର୍ଯ୍ୟାୟରେ ଥାଏ, ତେବେ ତୁରନ୍ତ ବିଉଶାନିଙ୍ଗ ସମ୍ପୂର୍ଣ୍ଣ କରନ୍ତୁ। ଯେତେବେଳେ ଇ. ଟି. ଏଲ୍. '1 କ୍ଷତିଗ୍ରସ୍ତ ଟିଲର୍/ହିଲ୍' କିମ୍ବା '2 ଲାର୍ଭା/ଏମ୍2' ରେ ପହଞ୍ଚେ, ସେତେବେଳେ କ୍ଲୋରପିରିଫସ୍ 50 ପ୍ରତିଶତ + ସାଇପର୍ମେଥ୍ରିନ୍ 5 ପ୍ରତିଶତ ଇ. ସି. @400-ମିଲି/ଏକର କିମ୍ବା କ୍ୱିନାଲ୍ଫସ୍ 20 ପ୍ରତିଶତ ଇ. ସି. + ସାଇପର୍ମେଥ୍ରିନ୍ 3 ପ୍ରତିଶତ ଇ. ସି. @400-ମିଲି/ଏକର କିମ୍ବା ଲାମ୍ବଡା ସାଇହାଲୋଥ୍ରିନ୍ 5 ପ୍ରତିଶତ ଇ. ସି. @300 ମିଲି/ଏକରରେ ମଧ୍ୟାହ୍ନ ସମୟରେ ସ୍ପ୍ରେ କରନ୍ତୁ। ଫସଲର ପ୍ରାରମ୍ଭିକ ପର୍ଯ୍ୟାୟରେ ଧାନରେ କାଣ୍ଡ ଛେଦକକୁ ପରିଚାଳନା କରିବା ପାଇଁ, କାର୍ଟାପ୍ ହାଇଡ୍ରୋକ୍ଲୋରାଇଡ୍ 4 ପ୍ରତିଶତ ଗ୍ରାମ୍ ପ୍ରତି ଏକରରେ 8 କି. ଗ୍ରା. କିମ୍ବା କ୍ଲୋରାଣ୍ଟ୍ରାନିଲିପ୍ରୋଲେ 0.4 ପ୍ରତିଶତ ଗ୍ରାମ୍ ପ୍ରତି ଏକରରେ 4 କି. ଗ୍ରା. କିମ୍ବା ଇମିଡାକ୍ଲୋପ୍ରିଡ୍ 0.3 ପ୍ରତିଶତ ଗ୍ରାମ୍ ପ୍ରତି ଏକରରେ 6 କି. ଗ୍ରା. ବାଲିରେ ମିଶାଇ ଲଗାନ୍ତୁ। 1 ଅନୁପାତ।"
         ]
      },
      "finger millet": {
         "advisory": [
            "ଫିଙ୍ଗର ମିଲେଟ୍ ଫସଲରେ ପତ୍ର ଦାଗ ଏବଂ ପତ୍ର ବ୍ଲାଇଟ୍ ରୋଗ ହେବାର ସମ୍ଭାବନା ରହିଛି। ଯୁବା ପତ୍ରରେ ବାଦାମୀ ରଙ୍ଗର କ୍ଷତ ଦେଖାଯାଏ। ଗୁରୁତର ଭାବେ ପ୍ରଭାବିତ ଚାରା ମରିଯାଇପାରେ। ବଢ଼ୁଥିବା ଗଛର ପତ୍ରରେ ଗାଢ଼ ବାଦାମୀ ରଙ୍ଗର ଦାଗ ଦେଖାଯାଏ। ପତ୍ରଗୁଡ଼ିକ ଉଜ୍ଜ୍ୱଳ ଦେଖାଯାଏ। ବେକରେ ଫାଟ ସୃଷ୍ଟି ହୁଏ ଏବଂ ଗଛରୁ କାନ ଝୁଲୁଥାଏ | ଏହି ରୋଗକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ।"
         ]
      },
      "pumpkin": {
         "advisory": [
            "ବର୍ଷା ଏବଂ ଆର୍ଦ୍ର ପାଗ, ଉଚ୍ଚ ସକାଳ ଆରଏଚ (> 85 ପ୍ରତିଶତ) ଏବଂ ଜଳ ପରିପୂର୍ଣ୍ଣ ମୃତ୍ତିକା କୁକୁଡ଼ା ପନିପରିବାରେ ଡାଉନି ମାଇଲ୍ଡ୍ୟୁ ରୋଗକୁ ପସନ୍ଦ କରେ | କୁକୁଡ଼ାରେ ଡାଉନି ମାଇଲ୍ଡ୍ୟୁ ରୋଗ ପରିଚାଳନା କରିବା ପାଇଁ 10 ଦିନ ବ୍ୟବଧାନରେ ଦୁଇଥର ମେଟାଲାକ୍ସିଲ୍ @2-ଗ୍ରାମ୍/ଲିଟର କିମ୍ବା ଏଜୋକ୍ସିସ୍ଟ୍ରୋବିନ୍ @1-ଗ୍ରାମ୍/ଲିଟର କିମ୍ବା କପର ଅକ୍ସିକ୍ଲୋରାଇଡ୍ 50% ଡବ୍ଲ୍ୟୁ. ପି. @3-ଗ୍ରାମ୍/ଲିଟର ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "menacinakahi": {
         "advisory": [
            "ଲଙ୍କା ଫସଲ ଚାରା ରୋପଣ ପର୍ଯ୍ୟାୟରେ ରହିଛି। ଉଚ୍ଚ ମୃତ୍ତିକା ଆର୍ଦ୍ରତା ଏବଂ ମଧ୍ୟମ ମୃତ୍ତିକା ତାପମାତ୍ରା (<28 ଡିଗ୍ରୀ ସେଲସିୟସ୍), ଉଚ୍ଚ ଆର୍. ଏଚ୍., ଅଧିକ ବର୍ଷା ଏବଂ ଏହି ବର୍ଷା ଋତୁରେ ଖରାପ ଜଳ ନିଷ୍କାସନ ରୋଗକୁ ଆର୍ଦ୍ର କରିପାରେ। ମାଙ୍କୋଜେବ୍ @3 ଗ୍ରାମ୍/ଲିଟର କିମ୍ବା ମେଟାଲାକ୍ସିଲ୍ @2 ଗ୍ରାମ୍/ଲିଟର କିମ୍ବା ମେଟାଲାକ୍ସିଲ୍ + ମାଙ୍କୋଜେବ୍ @3 ଗ୍ରାମ୍/ଲିଟର ସହିତ ପତ୍ର ସ୍ପ୍ରେ ସହିତ ମାଟିକୁ ଭିଜାଇ ଦିଅନ୍ତୁ |"
         ]
      },
      "chilli": {
         "advisory": [
            "ଲଙ୍କା ଫସଲ ଚାରା ରୋପଣ ପର୍ଯ୍ୟାୟରେ ରହିଛି। ଉଚ୍ଚ ମୃତ୍ତିକା ଆର୍ଦ୍ରତା ଏବଂ ମଧ୍ୟମ ମୃତ୍ତିକା ତାପମାତ୍ରା (<28 ଡିଗ୍ରୀ ସେଲସିୟସ୍), ଉଚ୍ଚ ଆର୍. ଏଚ୍., ଅଧିକ ବର୍ଷା ଏବଂ ଏହି ବର୍ଷା ଋତୁରେ ଖରାପ ଜଳ ନିଷ୍କାସନ ରୋଗକୁ ଆର୍ଦ୍ର କରିପାରେ। ମାଙ୍କୋଜେବ୍ @3 ଗ୍ରାମ୍/ଲିଟର କିମ୍ବା ମେଟାଲାକ୍ସିଲ୍ @2 ଗ୍ରାମ୍/ଲିଟର କିମ୍ବା ମେଟାଲାକ୍ସିଲ୍ + ମାଙ୍କୋଜେବ୍ @3 ଗ୍ରାମ୍/ଲିଟର ସହିତ ପତ୍ର ସ୍ପ୍ରେ ସହିତ ମାଟିକୁ ଭିଜାଇ ଦିଅନ୍ତୁ |"
         ]
      },
      "brinjal": {
         "advisory": [
            "ବାଇଗଣ ଫୁଲ ଫୁଟାଇବାର ପର୍ଯ୍ୟାୟ ପର୍ଯ୍ୟନ୍ତ ରହିଛି। ବର୍ଷା ହ୍ରାସ ପାଇବା ପରେ ଏବଂ ଦିନ ଓ ରାତିର ତାପମାତ୍ରା ବୃଦ୍ଧି ହେବାର ସମ୍ଭାବନା ରହିଛି ଏବଂ ସକାଳ ଆପେକ୍ଷିକ ଆର୍ଦ୍ରତା 70 ପ୍ରତିଶତରୁ ଅଧିକ ବାଇଗଣରେ ଶୁଟ୍ ଏବଂ ଫଳ ଛେଦକକୁ ପସନ୍ଦ କରେ | କୀଟକୁ ପରିଚାଳନା କରିବା ପାଇଁ, ଛିଦ୍ର ଏବଂ ପ୍ରଭାବିତ ଫଳ ଦେଖାଇଥିବା ପ୍ରଭାବିତ ଟର୍ମିନାଲ୍ ଶୁଟ୍ ଅପସାରଣ କରନ୍ତୁ | ଏହି କୀଟକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ, ଏକର ପିଛା ଲିଉସିନ୍ ଲ୍ୟୁର୍ ଥିବା 8ଟି ଫେରୋମୋନ୍ ଫାନ୍ଦ ଲଗାନ୍ତୁ। ରାସାୟନିକ ନିୟନ୍ତ୍ରଣ ବ୍ୟବହାର କରନ୍ତୁ ଯଦି ଟର୍ମିନାଲ୍ ଶୁଟର 4 ପ୍ରତିଶତ ଶୁଖିଲା ଅଛି କିମ୍ବା 14 ପ୍ରତିଶତ ଫଳ ବୋରର ଦ୍ୱାରା ସଂକ୍ରମିତ | ରାସାୟନିକ ନିୟନ୍ତ୍ରଣ ପାଇଁ ଏମାମେକ୍ଟିନ୍ ବେନ୍ଜୋଏଟ୍ 5 ପ୍ରତିଶତ ଏସ୍ଜି @80-ଗ୍ରାମ୍/ଏକର କିମ୍ବା କ୍ଲୋରାଣ୍ଟ୍ରାନିଲିପ୍ରୋଲ୍ 18.5% ଏସ୍ସି @80-ମିଲି/ଏକର କିମ୍ବା ସ୍ପିନେଟୋରାମ୍ 11.7% ଏସ୍ସି @200-ମିଲି/ଏକର ସ୍ପ୍ରେ କରନ୍ତୁ। କୀଟନାଶକ ପ୍ରୟୋଗ ଏବଂ ଅମଳ ମଧ୍ୟରେ 7-10 ଦିନର ବ୍ୟବଧାନ ରହିବା ଉଚିତ୍। ଉପରୋକ୍ତ ଯେ କୌଣସି କୀଟନାଶକକୁ 15 ଦିନର ବ୍ୟବଧାନରେ ବିକଳ୍ପ ଭାବେ ବ୍ୟବହାର କରନ୍ତୁ।"
         ]
      },
      "chicken": {
         "advisory": [
            "ବାର୍ଡ ଫ୍ଲୁ ହେଉଛି କୁକୁଡ଼ାର ଏକ ଭୂତାଣୁଜନିତ ରୋଗ। ଏହା ଦୂଷିତ ଡେଣା, ଲାଳ, ପକ୍ଷୀଙ୍କ ବିଷ୍ଠା ମାଧ୍ୟମରେ ବ୍ୟାପିଥାଏ | ବେଳେବେଳେ ଏହା ପ୍ରଭାବିତ ପକ୍ଷୀଙ୍କଠାରୁ ମଣିଷକୁ ବ୍ୟାପିପାରେ | ଏହି ସମୟରେ ଦୟାକରି ପ୍ରତିଦିନ କୁକୁଡ଼ା ଘର ସଫା କରନ୍ତୁ ଏବଂ କୁକୁଡ଼ା ପକ୍ଷୀଙ୍କ ଖାଦ୍ୟ ଏବଂ ପାଣି ବାରମ୍ବାର ପରିବର୍ତ୍ତନ କରନ୍ତୁ। ମୃତ କୁକୁଡ଼ା ପକ୍ଷୀମାନଙ୍କୁ ଏଠାରେ ଏବଂ ସେଠାରେ ଫିଙ୍ଗି ଦିଅନ୍ତୁ ନାହିଁ। ଦୟାକରି ଗ୍ଲୋଭସ୍ ଏବଂ ମାସ୍କ ପିନ୍ଧି ସେମାନଙ୍କୁ ପୋତି ଦିଅନ୍ତୁ ଏବଂ ବ୍ଲିଚିଂ ପାଉଡରରେ ସେହି ସ୍ଥାନକୁ ସାନିଟାଇଜ୍ କରନ୍ତୁ। ପ୍ରଭାବିତ ଅଞ୍ଚଳରୁ କୁକୁଡ଼ା ପକ୍ଷୀ କିମ୍ବା ଅଣ୍ଡା ଘରକୁ ଆଣନ୍ତୁ ନାହିଁ।"
         ]
      }
   },
   "date": "06-09-2024"
}