{
   "weather_details": {
      "2025-01-18": {
         "rainfall": 0,
         "t_max": 26,
         "t_min": 13,
         "rh_max": 73,
         "rh_min": 28,
         "wind_speed": 3,
         "wind_direction": 0,
         "cloud_cover": 3
      },
      "2025-01-19": {
         "rainfall": 0,
         "t_max": 26,
         "t_min": 13,
         "rh_max": 70,
         "rh_min": 29,
         "wind_speed": 4,
         "wind_direction": 334,
         "cloud_cover": 2
      },
      "2025-01-20": {
         "rainfall": 0,
         "t_max": 26,
         "t_min": 13,
         "rh_max": 67,
         "rh_min": 27,
         "wind_speed": 5,
         "wind_direction": 352,
         "cloud_cover": 2
      },
      "2025-01-21": {
         "rainfall": 0,
         "t_max": 27,
         "t_min": 14,
         "rh_max": 73,
         "rh_min": 28,
         "wind_speed": 3,
         "wind_direction": 0,
         "cloud_cover": 3
      },
      "2025-01-22": {
         "rainfall": 0,
         "t_max": 27,
         "t_min": 14,
         "rh_max": 70,
         "rh_min": 29,
         "wind_speed": 4,
         "wind_direction": 334,
         "cloud_cover": 3
      }
   },
   "names_of_crops": [
      "ଚାଉଳ",
      "ସୂର୍ଯ୍ୟମୁଖୀ",
      "କଳା ଗ୍ରାମ",
      "ଗ୍ରୀନଗ୍ରାମ",
      "ସୋରିଷ",
      "ଚିନାବାଦାମ",
      "ଲାଲ ଚଣା",
      "ଲଙ୍କା",
      "ଫୁଲକୋବି",
      "କଦଳୀ",
      "ବାଇଗଣ",
      "ଟମାଟୋ",
      "ରସୁଣ",
      "ଆଳୁ",
      "ପଶୁପାଳନ",
      "ଛେଳି।",
      "କୁକୁଡ଼ା ମାଂସ",
      "ମତ୍ସ୍ୟଚାଷ"
   ],
   "general_advisory": "ନିମ୍ନ ରାତି ତାପମାତ୍ରା ଏବଂ କୁହୁଡ଼ି ପରିସ୍ଥିତି ହେତୁ ରବି ଫସଲ ଏବଂ ପନିପରିବାରେ ଶୋଷକ କୀଟ, ପତ୍ର ରୋଗ ଏବଂ ପାଉଡର ଫଙ୍ଗୁର ସଂକ୍ରମଣ ହେବାର ସମ୍ଭାବନା ରହିବ। ଫସଲ ଏବଂ ପନିପରିବା ଉପରେ ନଜର ରଖନ୍ତୁ, ଉପଯୁକ୍ତ ଉଦ୍ଭିଦ ସୁରକ୍ଷା ପଦକ୍ଷେପ ଗ୍ରହଣ କରନ୍ତୁ। ରବି ପନିପରିବାରେ ନିଡ଼ାଇ, ହୋଇଂ ଏବଂ ଅନ୍ୟାନ୍ୟ ଆନ୍ତଃସାଂସ୍କୃତିକ କାର୍ଯ୍ୟକଳାପ କରନ୍ତୁ | କୋଇଲା ଫସଲରେ, ମୃତ୍ତିକାର ଆର୍ଦ୍ରତା ଏବଂ ପାଣିପାଗ ସ୍ଥିତି ଉପରେ ନିର୍ଭର କରି 7ରୁ 8 ଦିନ ବ୍ୟବଧାନରେ ଜଳସେଚନ କରାଯିବା ଉଚିତ।",
   "crops_data": {
      "rice": {
         "advisory": [
            "ସତ୍ୟଭାମା, ସହଭାଗି ଧାନ, ମନ୍ଦାକିନୀ, ମାନସ୍ୱିନୀ, ଡି. ଆର୍. ଆର୍. 42, ଡି. ଆର୍. ଆର୍.-43, ଡି. ଆର୍. ଆର୍.-44, ବିନା 11, ଜି. ବି.-1, ଉନ୍ନତ ଲଲାଟ, ଏମ. ଟି. ୟୁ. 1010, ଏମ. ଟି. ୟୁ. 1001, ନବୀନ, ସ୍ୱର୍ଣ୍ଣ ଶ୍ରେୟା ଭଳି ଉନ୍ନତ ମାନର ଧାନ ମଞ୍ଜି ପ୍ରସ୍ତୁତ କରନ୍ତୁ, ଯାହା ଶୁଖିଲା ଋତୁରେ ଚାଷ କରାଯାଇପାରିବ।",
            "ଏହି କିସମଗୁଡ଼ିକ ପାଇଁ ଏକ ଏକର ଜମି ପାଇଁ ବୀଜ ହାର ହେଉଛି 20 କିଲୋଗ୍ରାମ।",
            "ନର୍ସରୀରେ ବୁଣିବା ପୂର୍ବରୁ ମଞ୍ଜିଗୁଡ଼ିକୁ କାର୍ବେନଡାଜିମ୍ 50 ପ୍ରତିଶତ ଡବ୍ଲୁ. ପି. @2-ଗ୍ରାମ/1-କିଲୋଗ୍ରାମ ମଞ୍ଜି କିମ୍ବା କାର୍ବୋକ୍ସିନ୍ 37.5% + ଥିରମ୍ 37.5% @3-ଗ୍ରାମ/1 କିଲୋଗ୍ରାମ ମଞ୍ଜି ସହିତ ଚିକିତ୍ସା କରନ୍ତୁ।"
         ]
      },
      "sunflower": {
         "advisory": [
            "ଦ୍ୱିତୀୟ ଜଳସେଚନ ସମୟରେ ୟୁରିଆର ଅଧା ମାତ୍ରା ଏବଂ ଏମ୍. ଓ. ପି. ର ଅଧା ମାତ୍ରା ଦ୍ୱିତୀୟ ଉପର ଡ୍ରେସିଂ ଭାବେ ଲଗାନ୍ତୁ।",
            "ପ୍ରଚଳିତ ପାଣିପାଗ ସ୍ଥିତି ଶୋଷକ କୀଟପତଙ୍ଗର ବିକାଶକୁ ସମର୍ଥନ କରେ | ଏସିଟାମିପ୍ରିଡ୍ 20 ପ୍ରତିଶତ ଏସ. ପି. @50 ଗ୍ରାମ/ଏକର କିମ୍ବା ଇମିଡାକ୍ଲୋପ୍ରିଡ୍ 17.8% ଏସ. ଏଲ. @60 ମିଲି/ଏକରକୁ 200 ଲିଟର ପାଣି ସହିତ ମିଶାଇ ଆବଶ୍ୟକ ଅନୁଯାୟୀ ସ୍ପ୍ରେ କରିବା ପାଇଁ ପରାମର୍ଶ ଦିଆଯାଇଛି।",
            "ପାଉଡର ଫଙ୍ଗୁର ପାଇଁ 2 ଗ୍ରାମ/ଲିଟର ପାଣି ଦେଇ 0.20% ଓଦା ହେଉଥିବା ଗନ୍ଧକ ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "blackgram": {
         "advisory": [
            "ପି. ଡି. ଏମ୍. 139, ପି. ଡି. ଏମ୍. 11 ଭଳି ୱାଇ. ଏମ୍. ଭି. ରୋଗ ପ୍ରତିରୋଧକ ପ୍ରଜାତି ବାଛନ୍ତୁ।",
            "ଶ୍ୱେତ ମାଛି ସଂକ୍ରମଣକୁ ରୋକିବା ପାଇଁ, ମଞ୍ଜି ବୁଣିବା ପୂର୍ବରୁ ଇମିଡାକ୍ଲୋପ୍ରିଡ୍ @7-ଗ୍ରାମ୍/କେଜି ମଞ୍ଜି ସହିତ ଚିକିତ୍ସା କରାଯିବା ଉଚିତ୍ |",
            "ଫସଲର 2ରୁ 3ଟି ପତ୍ର ପର୍ଯ୍ୟାୟରୁ ଆରମ୍ଭ କରି ଅନେକ ହଳଦିଆ ଚଟପଟା ଜାଲ 8-10 ଲଗାନ୍ତୁ।"
         ]
      },
      "greengram": {
         "advisory": [
            "ବ୍ଲାକଗ୍ରାମ୍ ପରାମର୍ଶ ସହିତ ସମାନ |"
         ]
      },
      "mustard": {
         "advisory": [
            "ଶୀଘ୍ର ବୁଣାଯାଇଥିବା ସୋରିଷ ଫସଲରେ ଏଫିଡ୍ ସଂକ୍ରମଣ ହେବାର ସମ୍ଭାବନା ରହିଛି। ପ୍ରାରମ୍ଭିକ ପର୍ଯ୍ୟାୟରେ ଏଫିଡ୍ ପରିଚାଳନା କରିବା ପାଇଁ, ଏକର ପିଛା 8 ସଂଖ୍ୟକ ହଳଦିଆ ଚଟପଟା ଜାଲ ଲଗାନ୍ତୁ |",
            "200 ଲିଟର ପାଣିରେ ମିଶ୍ରଣ କରି ନିମ୍ବ-ଆଧାରିତ କୀଟନାଶକ 1500 ପିପିଏମ @600-ମିଲି/ଏକର ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "groundnut": {
         "advisory": [
            "ଏଫିଡ୍ ଏବଂ ଥ୍ରୀପ୍ସର ପରିଚାଳନା ପାଇଁ, ନିମ ଆଧାରିତ କୀଟ ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "red gram": {
         "advisory": [
            "ଯେତେବେଳେ 70-80% ଶୁଆଗୁଡ଼ିକ ବାଦାମୀ ହୋଇଯାଏ, ସେତେବେଳେ ରେଡ୍ ଗ୍ରାମ୍ ଫସଲ ଅମଳ କରନ୍ତୁ।",
            "ପରିପକ୍ୱତା ପରେ ମଞ୍ଜି ଭାଙ୍ଗିଯାଇପାରେ, ଯାହାର ଫଳ ସ୍ୱରୂପ କମ୍ ଉତ୍ପାଦନ ହୋଇଥାଏ।"
         ]
      },
      "chilli": {
         "advisory": [
            "କୀଟ ସଂକ୍ରମଣର ପ୍ରାଥମିକ ପର୍ଯ୍ୟାୟରେ ଲଙ୍କାରେ ଏଫିଡ୍ ଏବଂ ଥ୍ରିପ୍ସକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ, 200 ଲିଟର ପାଣିରେ ମିଶ୍ରଣ କରି ନିମ୍ବ ଆଧାରିତ କୀଟନାଶକ 1500 ପିପିଏମ @600-ମିଲି/ଏକର ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "cauliflower": {
         "advisory": [
            "ବ୍ରାଉନ୍ ରଟ୍ କୁ ରୋକିବା ପାଇଁ କୋଲ୍ ଫସଲରେ ରୋପଣ ସମୟରେ ମାଟି ପ୍ରୟୋଗ ଭାବରେ ଏକର ପିଛା 4 କିଲୋଗ୍ରାମ ବୋରାକ୍ସ ଲଗାନ୍ତୁ |"
         ]
      },
      "cabbage": {
         "advisory": [
            "କୀଟ ପରିଚାଳନା (ଡିମଣ୍ଡ ବ୍ୟାକ୍ ମଥ୍)"
         ]
      },
      "brinjal": {
         "advisory": [
            "ବାଇଗଣ ଏବଂ ଟମାଟୋ ଫସଲରେ ଧଳା ମାଛି ପରିଚାଳନା କରିବା ପାଇଁ, କୀଟପତଙ୍ଗମାନଙ୍କୁ ଆକର୍ଷିତ କରିବା ଏବଂ ମାରିବା ପାଇଁ @8-10 ଏକର ହଳଦିଆ ଚଟପଟା ଜାଲ ବ୍ୟବହାର କରନ୍ତୁ।"
         ]
      },
      "tomato": {
         "advisory": [
            "ଟମାଟୋରେ ଫଳ ଛେଦକକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ, ପ୍ରଥମେ ପ୍ରଭାବିତ ଫଳ ଏବଂ ବୟସ୍କ ଲାର୍ଭା ସଂଗ୍ରହ କରି ନଷ୍ଟ କରନ୍ତୁ।",
            "ଏକର ପିଛା ହେଲିଲ୍ୟୁର୍ ଥିବା 20ଟି ଫେରୋମୋନ୍ ଫାନ୍ଦ ସ୍ଥାପନ କରନ୍ତୁ।"
         ]
      },
      "onion": {
         "advisory": [
            "ନର୍ସରୀରେ ରୋଗ ହ୍ରାସକୁ ରୋକିବା ପାଇଁ, ନର୍ସରୀ ଶଯ୍ୟାକୁ 15 ଦିନ ବ୍ୟବଧାନରେ କାର୍ବେନଡାଜିମ୍ @2 ଗ୍ରାମ୍/ଲିଟର ପାଣିରେ ଭିଜାଇ ଦିଅନ୍ତୁ।"
         ]
      },
      "potato": {
         "advisory": [
            "ଶୀଘ୍ର ରୋପଣ କରାଯାଇଥିବା ଆଳୁ ଫସଲ 3 ସପ୍ତାହର ପର୍ଯ୍ୟାୟରେ ରହିଛି।",
            "ହୋଇଂ ଏବଂ ଆଗାଛା କାଟିବା ପାଇଁ ଯାଆନ୍ତୁ ଏବଂ ଅବଶିଷ୍ଟ 30-45 Kg N/ଏକର ଲଗାନ୍ତୁ।"
         ]
      },
      "livestock": {
         "advisory": [
            "ଉପଯୁକ୍ତ ଭେଣ୍ଟିଲେସନ୍ ସୁବିଧା ସହିତ ପଶୁମାନଙ୍କୁ ଉପଯୁକ୍ତ ଆଶ୍ରୟ ପ୍ରଦାନ କରନ୍ତୁ |",
            "ଚଟାଣ ସଫା, ଶୁଖିଲା ଏବଂ ଘାସ ସହିତ ବିଛଣା ହେବା ଉଚିତ ଯାହା ଉତ୍ତାପ ହ୍ରାସକୁ ପ୍ରତିରୋଧ ଏବଂ ପ୍ରତିରୋଧ ଭାବରେ କାର୍ଯ୍ୟ କରେ |"
         ]
      },
      "goat": {
         "advisory": [
            "ପିପିଆର ରୋଗ, ଯାହାକୁ 'ଛେଳି ପ୍ଲେଗ୍' ମଧ୍ୟ କୁହାଯାଏ, ଶୀତ ଋତୁରେ ସାଧାରଣ ହୋଇଥାଏ।",
            "ପଶୁମାନଙ୍କୁ ଟିକା ଦିଅନ୍ତୁ।"
         ]
      },
      "poultry": {
         "advisory": [
            "ଶୀତଦିନେ ଫିଡର ସଂଖ୍ୟା ବୃଦ୍ଧି କରାଯିବା ଉଚିତ।",
            "ଦିନସାରା ପକ୍ଷୀ ପାଇଁ ଖାଦ୍ୟ ଉପଲବ୍ଧ ରହିବା ଉଚିତ।"
         ]
      },
      "fisheries": {
         "advisory": [
            "ଶୀତ ଋତୁରେ ମାଛରେ 'ଇ. ୟୁ. ଏସ୍.' ରୋଗ ହେବାର ସମ୍ଭାବନା ରହିଛି।",
            "ପ୍ରତିଷେଧକ ପଦକ୍ଷେପ ସ୍ୱରୂପ କୃଷକମାନଙ୍କୁ ଏକ ଏକର ପୋଖରୀ ଅଞ୍ଚଳରେ 40 ଲିଟର ପାଣି ସହିତ 400 ମିଲିଲିଟର ସିଫ୍ୟାକ୍ସ ଲଗାଇବାକୁ ପରାମର୍ଶ ଦିଆଯାଇଛି।"
         ]
      }
   },
   "date": "17-01-2025"
}