{
   "weather_details": {
      "2024-12-28": {
         "rainfall": 0,
         "t_max": 26,
         "t_min": 16,
         "rh_max": 77,
         "rh_min": 41,
         "wind_speed": 4,
         "wind_direction": 90,
         "cloud_cover": 1
      },
      "2024-12-29": {
         "rainfall": 2,
         "t_max": 25,
         "t_min": 16,
         "rh_max": 75,
         "rh_min": 41,
         "wind_speed": 3,
         "wind_direction": 90,
         "cloud_cover": 4
      },
      "2024-12-30": {
         "rainfall": 1,
         "t_max": 26,
         "t_min": 16,
         "rh_max": 76,
         "rh_min": 44,
         "wind_speed": 4,
         "wind_direction": 9,
         "cloud_cover": 4
      },
      "2024-12-31": {
         "rainfall": 0,
         "t_max": 26,
         "t_min": 14,
         "rh_max": 80,
         "rh_min": 47,
         "wind_speed": 5,
         "wind_direction": 98,
         "cloud_cover": 1
      },
      "2025-01-01": {
         "rainfall": 0,
         "t_max": 27,
         "t_min": 12,
         "rh_max": 73,
         "rh_min": 37,
         "wind_speed": 5,
         "wind_direction": 356,
         "cloud_cover": 2
      }
   },
   "names_of_crops": [
      "ଚାଉଳ",
      "ସୋରିଷ",
      "ସବୁଜ ଚଣା",
      "ସୂର୍ଯ୍ୟମୁଖୀ",
      "ଅମରନ୍ଥ",
      "ମେନାସିନାକାହି",
      "ଲଙ୍କା",
      "କଦଳୀ",
      "ଟମାଟୋ",
      "ଫୁଲକୋବି",
      "ରସୁଣ",
      "ବାଇଗଣ",
      "ମାରିଗୋଲ୍ଡ",
      "କଦଳୀ",
      "ପେଁପେ",
      "ରସୁଣ",
      "ସବୁଜ ମଟର",
      "କଦଳୀ",
      "ଗାଈ।",
      "ଛେଳି।",
      "ମଧୁର ଜଳ।",
      "ଚିକ"
   ],
   "general_advisory": "କ୍ଷେତରେ ରହିବା ଏବଂ ଅଙ୍କୁରୋଦଗମକୁ ଏଡ଼ାଇବା ପାଇଁ ଅମଳ ପରିପକ୍ୱତା ପର୍ଯ୍ୟାୟରେ ଚାଉଳ ଅମଳ ପାଇଁ ଯାଆନ୍ତୁ | ଛିଡ଼ା ହୋଇଥିବା ଧାନ ଫସଲରୁ ପାଣି ବାହାର କରିବା ପାଇଁ ଗଲି (ପାହି) ତିଆରି କରି ବ୍ୟବସ୍ଥା କରନ୍ତୁ ଏବଂ ନର୍ଦ୍ଦମାର ଶେଷ ଭାଗକୁ ଖୋଲା ରଖନ୍ତୁ। ଅମଳ ହୋଇଥିବା ଧାନକୁ ଅମଳ କରିବା ପାଇଁ ଯାଆନ୍ତୁ। ଅମଳ ପରେ, ଧାନ ଶସ୍ୟକୁ ଉପଭୋଗ ଉଦ୍ଦେଶ୍ୟରେ 14 ପ୍ରତିଶତ ଆର୍ଦ୍ରତା ପର୍ଯ୍ୟନ୍ତ ସୂର୍ଯ୍ୟାଲୋକରେ ଶୁଖାଇବା ଆବଶ୍ୟକ ଏବଂ ଉନ୍ନତ ଆତ୍ମ-ଜୀବନ ପାଇଁ ବୀଜ ଉଦ୍ଦେଶ୍ୟରେ ଏହାକୁ 12 ପ୍ରତିଶତ ଆର୍ଦ୍ରତା ପର୍ଯ୍ୟନ୍ତ ଶୁଖାଇବା ଆବଶ୍ୟକ | ଧାନ କ୍ଷେତ ଏବଂ କ୍ଷେତରେ ମୂଷାଙ୍କ ସଂକ୍ରମଣ ଦେଖିବାକୁ ମିଳିଛି। ବିଷାକ୍ତ ଚାରା ବ୍ୟବହାର କରନ୍ତୁ। 100 ଗ୍ରାମ୍ ବିଷ ଚାରା ପ୍ରସ୍ତୁତ କରିବା ପାଇଁ 96 ଗ୍ରାମ୍ ଅଟା, 2 ଗ୍ରାମ୍ ଖାଇବା ତେଲ ଏବଂ 2 ଗ୍ରାମ୍ ଜିଙ୍କ୍ ଫସଫାଇଡ୍ ମିଶାନ୍ତୁ। ମାଟି ପାତ୍ରରେ ପାଣି ବିଷାକ୍ତ ଚାରା ପାଖରେ ରଖନ୍ତୁ। ପ୍ରତ୍ୟେକ ମୂଷା ଛିଦ୍ରର ପାଟିରେ ଗୋଟିଏ ସେଲ୍ଫୋସ୍ ଟାବଲେଟ୍ ରଖନ୍ତୁ | ଅଧିକ ସମୟ ଧରି ଧାନ/ଚାଉଳର ସୁରକ୍ଷିତ ସଂରକ୍ଷଣ ପାଇଁ 'ସୁପର ଗ୍ରେନ୍ ବ୍ୟାଗ୍ \"ବ୍ୟବହାର କରନ୍ତୁ କିମ୍ବା ଅସମୟ ବର୍ଷା କାରଣରୁ କ୍ଷୟକ୍ଷତି ଏଡ଼ାଇବା ପାଇଁ ଅମଳ ହୋଇଥିବା ଧାନକୁ ଉପଯୁକ୍ତ ବ୍ୟାଗରେ ଏବଂ ଉପଯୁକ୍ତ ଢାଙ୍କି ସହିତ ଷ୍ଟକ୍ କରି ରଖନ୍ତୁ। ଜଳସେଚନ ସୁବିଧା ଉପଲବ୍ଧ ଥିବା ସବୁଜ ଚଣା ଏବଂ କଳା ଚଣା ପାଇଁ କ୍ଷେତ ପ୍ରସ୍ତୁତି ଆରମ୍ଭ କରନ୍ତୁ, କ୍ଷେତରେ ଉପଲବ୍ଧ ମୃତ୍ତିକା ଆର୍ଦ୍ରତାକୁ ବ୍ୟବହାର କରି ମଧ୍ୟମ/ଅଗଭୀର ତଳିଆ ଅଞ୍ଚଳରେ ଚିନାବାଦାମ, କାଉପି ଭଳି ରବି ଫସଲ ଚାଷ କରନ୍ତୁ।",
   "crops_data": {
      "rice": {
         "advisory": [
            "ଗଚ୍ଛିତ ଶସ୍ୟ କୀଟପତଙ୍ଗର ସଂକ୍ରମଣକୁ ଲକ୍ଷ୍ୟ କରିବାର ତୁରନ୍ତ ପରେ, ଆଲୁମିନିୟମ୍ ଫସଫାଇଡ୍ ଟାବଲେଟ୍ ବ୍ୟବହାର କରି (ଘରେ ବ୍ୟବହାର କରନ୍ତୁ ନାହିଁ) 3 ଟାବଲେଟ୍/ଟନ୍ ଶସ୍ୟ (ମୋଟ 9 ଗ୍ରାମ୍ ଟାବଲେଟ୍) ମୋଟାମୋଟି ବାୟୁ ଟାଇଟ କଣ୍ଟେନରରେ କିମ୍ବା ମୋଟା ତିରପାଲ ସହିତ ଆଚ୍ଛାଦନ କରି କୌଣସି ବ୍ୟବଧାନ ଛାଡି ବ୍ୟବହାର କରନ୍ତୁ | ଟାବଲେଟ୍ଗୁଡ଼ିକୁ ଷ୍ଟାକ୍ରେ ରଖିବା ପୂର୍ବରୁ ସେଗୁଡ଼ିକୁ ସୂତା ପାଉଚରେ ବାନ୍ଧି ରଖିବା ଉଚିତ। ଗ୍ୟାସ୍ ଲିକ୍ ରୋକିବା ପାଇଁ ପ୍ଲାଷ୍ଟିକ୍ କଭର୍ର ସମସ୍ତ କୋଣକୁ 6 ଇଞ୍ଚ ମୋଟା ସ୍ତର କାଦୁଅ/ଆଡ଼େସିଭ୍ ଟେପ୍ ଦ୍ୱାରା ପ୍ଲାଷ୍ଟର କରାଯିବା ଉଚିତ। ସର୍ବନିମ୍ନ ଏକ୍ସପୋଜର ଅବଧି ପ୍ରାୟ 7-10 ଦିନ ପାଇଁ |"
         ]
      },
      "mustard": {
         "advisory": [
            "ରବି ସୋରିଷ ବୁଣିବା ପାଇଁ ସର୍ବୋତ୍ତମ ସମୟ ଆସିଛି, ଟି-9, ପିଟି-303, ନିର୍ମଳ କଳା ସୁନା, ଉତ୍ତରା ଏବଂ ଲାଇନ ବୁଣିବା ପାଇଁ 3-5 କିଲୋଗ୍ରାମ ମଞ୍ଜି ବ୍ୟବହାର କରନ୍ତୁ। 1 କିଲୋଗ୍ରାମ ମଞ୍ଜି ପିଛା 3 ଗ୍ରାମ କ୍ୟାପଟାନ କିମ୍ବା ଥିରାମ ବ୍ୟବହାର କରନ୍ତୁ। ଶେଷ କିସମଗୁଡ଼ିକରେ 20 * 10 ସେ. ମି. ଏବଂ ଶୀଘ୍ର ବୁଣାଯାଇଥିବା କିସମଗୁଡ଼ିକରେ 30 * 10 ସେ. ମି. ବ୍ୟବଧାନ ଦିଅନ୍ତୁ।"
         ]
      },
      "green gram": {
         "advisory": [
            "ବୁଣିବା ପୂର୍ବରୁ ଏକ ସପ୍ତାହ ପୂର୍ବରୁ ମଞ୍ଜିଗୁଡ଼ିକୁ କାର୍ବେନଡାଜିମ୍ 50 ପ୍ରତିଶତ ଡବ୍ଲ୍ୟୁ. ପି. @2-ଗ୍ରାମ୍/କି. ଗ୍ରା. ମଞ୍ଜି କିମ୍ବା କାର୍ବୋକ୍ସିନ୍ 37.5% + ଥିରମ୍ 37.5% ଡି. ଏସ୍. @3-ଗ୍ରାମ୍/କି. ଗ୍ରା. ମଞ୍ଜି ବ୍ୟବହାର କରନ୍ତୁ। ବୁଣିବା ପୂର୍ବରୁ, ପ୍ରତି କିଲୋଗ୍ରାମରେ 20 ଗ୍ରାମ୍ ମଞ୍ଜି ସହିତ ରାଇଜୋବିୟମ୍ ସଂସ୍କୃତି ସହିତ ମଞ୍ଜି ଉପଚାର କରନ୍ତୁ। ଶେଷ ହଳ କରିବା ସମୟରେ 2 ଟନ୍ ଏଫ୍. ୱାଇ. ଏମ୍. କିମ୍ବା କମ୍ପୋଷ୍ଟ ସହିତ ଏକର ପିଛା 35 କି. ଗ୍ରା. ଡିଏ. ପି., 13 କି. ଗ୍ରା. ଏମ୍. ଓ. ପି., 4 କି. ଗ୍ରା. ୟୁରିଆ ମୂଳ ସାର ଭାବେ ପ୍ରୟୋଗ କରନ୍ତୁ।"
         ]
      },
      "sunflower": {
         "advisory": [
            "ସୂର୍ଯ୍ୟମୁଖୀ ଏକ ଲାଭଜନକ ରବି ତୈଳବୀଜ ଫସଲ। ଏବେ ସୂର୍ଯ୍ୟମୁଖୀ ବୁଣିବା ପାଇଁ ସର୍ବୋତ୍ତମ ସମୟ। ମର୍ଡେନ୍, ସନ୍ରାଇଜ୍, ସୂର୍ଯ୍ୟ ଭଳି ଉଚ୍ଚ-ଉତ୍ପାଦନକାରୀ ପ୍ରଜାତି ଏବଂ କେ. ବି. ଏସ୍. ଏଚ୍.-1, କେ. ବି. ଏସ୍. ଏଚ୍.-3 ଏବଂ ଏମ୍. ଏସ୍. ଏଫ୍. ଏଚ୍. ଭଳି ହାଇବ୍ରିଡ୍ ପ୍ରଜାତି ଚାଷ କରନ୍ତୁ। ଅଧିକ ଉତ୍ପାଦନକ୍ଷମ କିସମ ପାଇଁ ଏକର ପିଛା 4 କି. ଗ୍ରା. ମଞ୍ଜି, ଜଳସେଚିତ ଅବସ୍ଥା ପାଇଁ 3 କି. ଗ୍ରା., ବର୍ଷା ଆଧାରିତ ଅବସ୍ଥା ପାଇଁ ଏକର ପିଛା 1 କି. ଗ୍ରା. ମଞ୍ଜି, ଏବଂ ଜଳସେଚିତ ଅବସ୍ଥା ପାଇଁ ଏକର ପିଛା 2 କି. ଗ୍ରା. ମଞ୍ଜି ବ୍ୟବହାର କରନ୍ତୁ। ବୁଣିବା ପୂର୍ବରୁ ମଞ୍ଜିଗୁଡ଼ିକୁ 2 ଗ୍ରାମ୍ କାର୍ବେନଡାଜିମ୍/କି. ଗ୍ରା. ମଞ୍ଜି ସହିତ ଉପଚାର କରନ୍ତୁ। ଫସଲକୁ ଫଙ୍ଗାଲ୍ ୱିଲ୍ଟରୁ ରକ୍ଷା କରିବା ପାଇଁ, 4 ଗ୍ରାମ୍ ଟ୍ରାଇକୋଡର୍ମା/କେଜି ସହିତ ମଞ୍ଜି ଉପଚାର କରନ୍ତୁ | ଉତ୍ତମ ଅଙ୍କୁରୋଦଗମ ପାଇଁ ମଞ୍ଜିଗୁଡ଼ିକୁ 10-12 ଘଣ୍ଟା ପର୍ଯ୍ୟନ୍ତ ଭିଜାଇ ରଖନ୍ତୁ। ପାଣି ବାହାର କରିବା ପରେ ଏକର ପିଛା 600 ଗ୍ରାମ୍ ପି. ଏସ୍. ବି. ଚାଷ ବ୍ୟବହାର କରନ୍ତୁ। ଅଧିକ ଉତ୍ପାଦନକାରୀ କିସମ ପାଇଁ ଏକର ପିଛା 8:16:12 କେଜି NPK ସହିତ 2 ଟନ୍ FYM ପ୍ରୟୋଗ କରନ୍ତୁ ଏବଂ ବୁଣିବା ପୂର୍ବରୁ ହାଇବ୍ରିଡ୍ ଭାରିଆଣ୍ଟି ପାଇଁ ଏହାର ଦ୍ୱିଗୁଣିତ କରନ୍ତୁ। ଦୋଆଁଶ ମାଟି ପାଇଁ 45 ସେ. ମି. ଏବଂ ଦୋଆଁଶ ମାଟି ପାଇଁ 60 ସେ. ମି. ବ୍ୟବଧାନ ରଖି 30 ସେ. ମି. ବ୍ୟବଧାନରେ ମଞ୍ଜି ବୁଣନ୍ତୁ।"
         ]
      },
      "amaranth": {
         "advisory": [
            "ଅକ୍ଟୋବରରୁ ମାର୍ଚ୍ଚ ମାସ ସବୁଜିମା ଅମାରାନ୍ଥ ପାଇଁ ଉପଯୁକ୍ତ। ଅମରନ୍ଥ ଦୁଇ ପ୍ରକାରର-ଧଳା କିମ୍ବା ଲାଲ | ଏକର ପିଛା 3 କି. ଗ୍ରା. ମଞ୍ଜି ବ୍ୟବହାର କରନ୍ତୁ। 4 ଫୁଟ ଚଉଡ଼ା ବିଶିଷ୍ଟ 5 ଫୁଟ ଲମ୍ବ ଶଯ୍ୟାକୁ ବନ୍ଧ ସହିତ ବିଛାନ୍ତୁ। ଶଯ୍ୟାକୁ ଫୁଲାଇ ଦିଅନ୍ତୁ, ଆଗାଛା ବାହାର କରନ୍ତୁ ଏବଂ 1 ରୁ 2 ଝୁଡ଼ି ଏଫ୍. ଆଇ. ଏମ୍./ଶଯ୍ୟା ଲଗାନ୍ତୁ। ଛୋଟ ଆକାରର ମଞ୍ଜି ହେତୁ, ସହଜ ଏବଂ ସମାନ ବୁଣିବା ପାଇଁ ମଞ୍ଜି ସହିତ କିଛି ମୋଟା ବାଲି ମିଶାନ୍ତୁ | ବୁଣିବା ପରେ ମଞ୍ଜିଗୁଡ଼ିକୁ ଏକ ପତଳା ମୃତ୍ତିକା ସ୍ତର ଦ୍ୱାରା ଆଚ୍ଛାଦିତ କରନ୍ତୁ ଏବଂ ହାଲୁକା ଜଳସେଚନ ପରେ ଏହାକୁ ନଡ଼ିଆ ଦ୍ୱାରା ଆଚ୍ଛାଦିତ କରନ୍ତୁ। ନଡ଼ିଆ ବାହାରିବା ପରେ ତାକୁ ବାହାର କରିଦିଅନ୍ତୁ।"
         ]
      },
      "menacinakahi": {
         "advisory": [
            "କୀଟ ସଂକ୍ରମଣର ପ୍ରାଥମିକ ପର୍ଯ୍ୟାୟରେ ଲଙ୍କାରେ ଏଫିଡ୍ ଏବଂ ଥ୍ରିପ୍ସକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ 200 ଲିଟର ପାଣିରେ ମିଶ୍ରଣ କରି ନିମ୍ବ-ଆଧାରିତ କୀଟନାଶକ 1500 ପିପିଏମ @600-ମିଲି/ଏକର ସ୍ପ୍ରେ କରନ୍ତୁ। ଥିୟାମେଥୋକ୍ସାମ୍ 25 ପ୍ରତିଶତ ଡବ୍ଲୁ. ଜି. @40 ଗ୍ରାମ୍/ଏକର କିମ୍ବା ଏସିଟାମିପ୍ରିଡ୍ 20 ପ୍ରତିଶତ ଏସ. ପି. @50 ଗ୍ରାମ୍/ଏକର କିମ୍ବା ପ୍ରୋଫେନୋଫସ୍ 40 ପ୍ରତିଶତ + ଫେନପାଇରୋକ୍ସିମେଟ୍ 2.5 ପ୍ରତିଶତ ଇ. ସି. @400-ମିଲି/ଏକର ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "chilli": {
         "advisory": [
            "କୀଟ ସଂକ୍ରମଣର ପ୍ରାଥମିକ ପର୍ଯ୍ୟାୟରେ ଲଙ୍କାରେ ଏଫିଡ୍ ଏବଂ ଥ୍ରିପ୍ସକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ 200 ଲିଟର ପାଣିରେ ମିଶ୍ରଣ କରି ନିମ୍ବ-ଆଧାରିତ କୀଟନାଶକ 1500 ପିପିଏମ @600-ମିଲି/ଏକର ସ୍ପ୍ରେ କରନ୍ତୁ। ଥିୟାମେଥୋକ୍ସାମ୍ 25 ପ୍ରତିଶତ ଡବ୍ଲୁ. ଜି. @40 ଗ୍ରାମ୍/ଏକର କିମ୍ବା ଏସିଟାମିପ୍ରିଡ୍ 20 ପ୍ରତିଶତ ଏସ. ପି. @50 ଗ୍ରାମ୍/ଏକର କିମ୍ବା ପ୍ରୋଫେନୋଫସ୍ 40 ପ୍ରତିଶତ + ଫେନପାଇରୋକ୍ସିମେଟ୍ 2.5 ପ୍ରତିଶତ ଇ. ସି. @400-ମିଲି/ଏକର ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "cabbage": {
         "advisory": [
            "ଡାଇମଣ୍ଡ ବ୍ୟାକ୍ ମଥ୍ର ପରିଚାଳନା ପାଇଁ ଏକର ପିଛା 6ରୁ 8ଟି ଲାଇଟ୍ ଟ୍ରାପ୍ ଲଗାନ୍ତୁ। କୀଟ ସଂକ୍ରମଣର ପ୍ରାଥମିକ ପର୍ଯ୍ୟାୟରେ 200 ଲିଟର ପାଣିରେ ମିଶ୍ରଣ କରି ନିମ୍ବ-ଆଧାରିତ କୀଟନାଶକ (ଆଜାଦିରାକ୍ଟିନ) ଏକର ପିଛା 1 ଲିଟରରେ 300 ପିପିଏମ ସ୍ପ୍ରେ କରନ୍ତୁ। ଟଲ୍ଫେନ୍ପାଇରାଡ୍ 15 ପ୍ରତିଶତ ଇସି @400-ମିଲି/ଏକର କିମ୍ବା ଫ୍ଲୁବେଣ୍ଡିଆମାଇଡ୍ 20 ପ୍ରତିଶତ ଡବ୍ଲୁଜି @20-ଗ୍ରାମ୍/ଏକର କିମ୍ବା ଇମାମେକ୍ଟିନ୍ ବେନ୍ଜୋଏଟ୍ 5 ପ୍ରତିଶତ ଏସ୍ଜି @@80-ଗ୍ରାମ୍/ଏକରକୁ 200 ଲିଟର ପାଣିରେ ମିଶାଇ ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "tomato": {
         "advisory": [
            "କୀଟପତଙ୍ଗମାନଙ୍କୁ ଆକର୍ଷିତ କରିବା ଏବଂ ମାରିବା ପାଇଁ @8-10 ଏକର ହଳଦିଆ ଚଟପଟା ଫାନ୍ଦ ବ୍ୟବହାର କରନ୍ତୁ। କୀଟ ସଂକ୍ରମଣର ପ୍ରାଥମିକ ପର୍ଯ୍ୟାୟରେ 200 ଲିଟର ପାଣିରେ ମିଶ୍ରଣ କରି ନିମ୍ବ-ଆଧାରିତ କୀଟନାଶକ (ଆଜାଦିରାକ୍ଟିନ) 1500 ପିପିଏମ @600 ମିଲି/ଏକର ସ୍ପ୍ରେ କରନ୍ତୁ। ଥିୟାମେଥୋକ୍ସାମ୍ 25 ପ୍ରତିଶତ ଡବ୍ଲୁ. ଜି. ଏକର ପିଛା 40 ଗ୍ରାମ କିମ୍ବା ପାଇରିପ୍ରୋକ୍ସିଫେନ୍ 10 ପ୍ରତିଶତ ଇ. ସି. ଏକର ପିଛା 200 ମିଲି କିମ୍ବା ସ୍ପାଇରୋମେସିଫେନ୍ 22.9% ଏସ୍. ସି. ଏକର ପିଛା 250 ମିଲି, 200 ଲିଟର ପାଣିରେ ମିଶାଇ ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "cauliflower": {
         "advisory": [
            "ଏକର ପିଛା 25 କିଲୋଗ୍ରାମ ୟୁରିଆ ପ୍ରୟୋଗ କରନ୍ତୁ ଏବଂ 15-20 DAT ରେ ହାତ କାଟିବା ଏବଂ ଏକର ପିଛା 25 କିଲୋଗ୍ରାମ ୟୁରିଆ ଏବଂ 25 କିଲୋଗ୍ରାମ ଏମଓପିକୁ 30-35 DAT ରେ ଶେଷ ଟପ୍ ଡ୍ରେସିଂ ସାର ଭାବରେ ପ୍ରୟୋଗ କରନ୍ତୁ। ଯଦି ଚାରା ରୋପଣ ସମୟରେ ବୋରାକ୍ସ ପ୍ରୟୋଗ କରାଯାଇନଥାଏ, ତେବେ ବୋରାକ୍ସ ସ୍ପ୍ରେ @4 କେଜି/ଏକର କିମ୍ବା ଫୋଲିବୋର/ସଲ୍ୟୁବର ସ୍ପ୍ରେ @1.5 ଗ୍ରାମ/ଲିଟର। ପ୍ରତିରୋପଣର ଦୁଇ ସପ୍ତାହ ପରେ ଏବଂ ଦହି ତିଆରି ହେବାର ଦୁଇ ସପ୍ତାହ ପୂର୍ବରୁ ବୋରନ ମାଇକ୍ରୋ ନ୍ୟୁଟ୍ରିଏଣ୍ଟ ସିଞ୍ଚନ କରାଯିବା ଉଚିତ।"
         ]
      },
      "onion": {
         "advisory": [
            "ଅଗ୍ରିଫାଉଣ୍ଡ୍ ଲାଇଟ୍ ରେଡ୍, ଅଗ୍ରିଫାଉଣ୍ଡ୍ ଡାର୍କ ରେଡ୍, ଭୀମ ଶକ୍ତି, ଭୀମ ସୁପର, ଅର୍କ ନିକେତନ୍ ଇତ୍ୟାଦି ଶୀତ ଋତୁରେ ଆମ ଓଡ଼ିଶା ସ୍ଥିତି ପାଇଁ ଉପଯୁକ୍ତ | ଏକ ଏକର ଜମିରେ ହେଉଥିବା ପିଆଜର ଚାଷ ପାଇଁ 4 କିଲୋଗ୍ରାମ ମଞ୍ଜି ଆବଶ୍ୟକ ହୋଇଥାଏ। ବୁଣିବା ପୂର୍ବରୁ, ପ୍ରତି କିଲୋଗ୍ରାମ ମଞ୍ଜି ପିଛା କାର୍ବେନଡାଜିମ୍ 50 ପ୍ରତିଶତ ଡବ୍ଲ୍ୟୁ. ପି. @2-ଗ୍ରାମ୍ କିମ୍ବା କାର୍ବୋକ୍ସିନ୍ 37.5% + ଥିରମ୍ 37.5% ଡି. ଏସ୍. @3-ଗ୍ରାମ୍/କିଲୋଗ୍ରାମ ମଞ୍ଜି ବ୍ୟବହାର କରି ମଞ୍ଜି ଚିକିତ୍ସା କରାଯିବା ଉଚିତ। ନର୍ସରୀରେ ଏଫ୍ ରୋଗକୁ ହ୍ରାସ କରିବା ରୋକିବା ପାଇଁ, ନର୍ସରୀ ଶଯ୍ୟାକୁ 15 ଦିନ ବ୍ୟବଧାନରେ କାର୍ବେନଡାଜିମ୍ @2-ଗ୍ରାମ୍/ଲିଟର ପାଣିରେ ଭିଜାଇ ଦିଅନ୍ତୁ। 8 ସପ୍ତାହ ପୁରୁଣା ଚାରା ମୁଖ୍ୟ କ୍ଷେତରେ ରୋପଣ କରାଯାଏ |"
         ]
      },
      "brinjal": {
         "advisory": [
            "ବାଇଗଣ ପାଇଁ ଏକର ପିଛା 30 କି. ଗ୍ରା. ୟୁରିଆ ଏବଂ 20 କି. ଗ୍ରା. ମୁରୀଏଟ ଅଫ ପୋଟାସ ଲଗାନ୍ତୁ ଏବଂ 30 ଡି. ଏ. ଟି. ରେ ହାତ କାଟିବା ଏବଂ 30 କି. ଗ୍ରା. ଅବଶିଷ୍ଟ ୟୁରିଆ 45 ଡି. ଏ. ଟି. ରେ ଶେଷ ଟପ୍ ଡ୍ରେସିଂ ସାର ଭାବରେ ଲଗାନ୍ତୁ। ଉତ୍ତମ ଉତ୍ପାଦନ ପାଇଁ ମାଇକ୍ରୋ ନ୍ୟୁଟ୍ରିଏଣ୍ଟ୍ର ମିଶ୍ରଣକୁ ଲିଟର ପିଛା 3 ଗ୍ରାମ୍ରେ 30 ଏବଂ 60 ଡିଏଟିରେ ଦୁଇଥର ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "marigold": {
         "advisory": [
            "ମାରିଗୋଲ୍ଡ ଏବଂ ଗୋଲାପ ପରି ଫୁଲରେ ରେଡ୍ ସ୍ପାଇଡର ମାଇଟ୍କୁ ପରିଚାଳନା କରିବା ପାଇଁ 80 ପ୍ରତିଶତ ୱେଟେବଲ୍ ସଲଫର୍ (ସଲଫେକ୍ସ/ବଲୱାନ/ସଲଫାଡେକ୍ସ) @2 ଗ୍ରାମ/ଲିଟର ପାଣି କିମ୍ବା ପ୍ରୋପାର୍ଜାଇଟ୍ 57 ପ୍ରତିଶତ ଇସି (ଓମାଇଟ୍/ମାଇଟକିଲ/ସୁପର ଡାଇନାମାଇଟ୍) @2 ମିଲି/ଲିଟର ପାଣି କିମ୍ବା ଫେନପାଇରୋକ୍ସିମେଟ୍ 5 ପ୍ରତିଶତ ଇସି (ସିଗେଟ/ମିଟିଗେଟ/ଫର୍ମାଇଟ୍) @2 ମିଲି/ଲିଟର ପାଣି ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "banana": {
         "advisory": [
            "ଷ୍ଟେମ ୱିଭିଲକୁ ପରିଚାଳନା କରିବା ପାଇଁ, କଦଳୀ ବଗିଚାରେ ଏକର ପିଛା 10ରେ କସମୋଲୁର ଫେରୋମୋନ୍ ଟ୍ରାପ୍ ଲଗାନ୍ତୁ। ରୋପଣ ପୂର୍ବରୁ କଦଳୀ କାଣ୍ଡକୁ 30 ମିନିଟ୍ ପାଇଁ ଉଷୁମ ପାଣିରେ ବୁଡ଼ାଇ ଦିଅନ୍ତୁ। ଚାରା ଲଗାଇବା ପୂର୍ବରୁ ଗର୍ତ୍ତରେ 25 ଗ୍ରାମ୍ ନିମ୍ବ ପେଡିଆ କିମ୍ବା 25-50 ଗ୍ରାମ୍ ଯେକୌଣସି ଦାଣାଦାର କୀଟନାଶକ ଭର୍ତ୍ତି କରନ୍ତୁ। ପ୍ରଭାବିତ ଗଛକୁ ଖଣ୍ଡ ଖଣ୍ଡ କରି କାଟି ସୂର୍ଯ୍ୟକିରଣ ତଳେ ଶୁଖାଇ ଦିଅନ୍ତୁ। କଦଳୀ ବଗିଚାକୁ ପରିଷ୍କାର ପରିଚ୍ଛନ୍ନ ରଖନ୍ତୁ।"
         ]
      },
      "papaya": {
         "advisory": [
            "ସଂକ୍ରମଣର ପ୍ରାରମ୍ଭିକ ପର୍ଯ୍ୟାୟରେ କ୍ଷୁଦ୍ର କୀଟକୁ ପରିଚାଳନା କରିବା ପାଇଁ ନିମ୍ବ-ଆଧାରିତ କୀଟନାଶକ (ନିମ୍ବ ତେଲ 1500 ପିପିଏମ @30-ମିଲି/10 ଲିଟର ପାଣି କିମ୍ବା କୀଟନାଶକ ସାବୁନ) ସ୍ପ୍ରେ କରନ୍ତୁ। ଗୁରୁତର ସଂକ୍ରମଣ କ୍ଷେତ୍ରରେ ପ୍ରୋଫେନ୍ଫସ୍ 50 ପ୍ରତିଶତ ଇସି @20-ମିଲି/10-ଲିଟର ପାଣି କିମ୍ବା ଥିୟାମେଥୋକ୍ସାମ୍ 25 ପ୍ରତିଶତ ଡବ୍ଲୁଜି @3-ଗ୍ରାମ୍/10-ଲିଟର ପାଣି ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "garlic": {
         "advisory": [
            "ଫୱାରୀ, ଜାମନଗର ଏବଂ ଜି-282 ଭଳି ଜଳସେଚିତ ଉଚ୍ଚଭୂମି ଏବଂ ମଧ୍ୟମ ଜମିର ଏଚ. ୱାଇ. ଭି. ରେ ରସୁଣ ବୁଣିବା ପାଇଁ ପାଗ ଅନୁକୂଳ ଅଟେ। ଏକର ପିଛା 150 କିଲୋଗ୍ରାମ ବିହନ ସାମଗ୍ରୀ ବ୍ୟବହାର କରନ୍ତୁ। 15 ଟନ୍ ଏଫ୍. ୱାଇ. ଏମ୍. ସହିତ ଏକର ପିଛା 24:24:24 କେ. ଜି. ଏନ୍. ପି. କେ. କୁ ଆଧାର ଭାବେ ପ୍ରୟୋଗ କରନ୍ତୁ। 20 ସେ. ମି. ର ଧାଡ଼ି ବ୍ୟବଧାନ ବଜାୟ ରଖି 8 ସେ. ମି. ବ୍ୟବଧାନରେ ମଞ୍ଜି ବୁଣନ୍ତୁ।"
         ]
      },
      "green pea": {
         "advisory": [
            "ଏବେ ଅନୁର୍ବର ଉଚ୍ଚଭୂମିରେ ସବୁଜ ମଟର ବୁଣିବା ପାଇଁ ଏହା ସର୍ବୋତ୍ତମ ସମୟ। ଓଡ଼ିଶା ପାଇଁ ଉପଯୁକ୍ତ ଉଚ୍ଚ-ଉତ୍ପାଦନକାରୀ କିସମ ଯେପରିକି ରଚନା, ଆର୍କେଲ ଏବଂ ଟି-163 25-30 କିଲୋଗ୍ରାମ ମଞ୍ଜି/ଏକର ବ୍ୟବହାର କରନ୍ତୁ। ମଞ୍ଜି ବୁଣିବା ପୂର୍ବରୁ 2 ଗ୍ରାମ୍ କାର୍ବେନଡାଜିମ୍/କିଲୋଗ୍ରାମ ମଞ୍ଜି ବ୍ୟବହାର କରି ଚିକିତ୍ସା କରାଯାଏ। ଚୂଡ଼ାନ୍ତ ଜମି ପ୍ରସ୍ତୁତି ସମୟରେ ଏକର ପିଛା 10:16:10 କେଜି ଏନ. ପି. କେ. ଲଗାନ୍ତୁ। ଗଛ ଲଗାଇବା ପାଇଁ 10 ସେ. ମି. ଦୂରତା ସହିତ 30 ସେ. ମି. ବ୍ୟବଧାନରେ ମଞ୍ଜି ବୁଣନ୍ତୁ।"
         ]
      },
      "pumpkin": {
         "advisory": [
            "କାକୁଡ଼ିରେ ଫଳ ମାଛି ପରିଚାଳନା କରିବା ପାଇଁ, 4 ଲିଟର ପାଣିରେ 400 ଗ୍ରାମ୍ ଗୁଡ଼ ଏବଂ 8 ମିଲି ମାଲାଥିଅନ୍ କିମ୍ବା ଡି. ଡି. ଭି. ପି. ମିଶାଇ ଏକ ବିଷାକ୍ତ ଚାରା ପ୍ରସ୍ତୁତ କରନ୍ତୁ। ଏହି ମିଶ୍ରଣକୁ ପ୍ଲାଷ୍ଟିକ୍ କପ୍ କିମ୍ବା ମାଟି ପାତ୍ରରେ ରଖନ୍ତୁ @80-ସଂଖ୍ୟା/ଏକର। ଫଳ ମାଛିମାନେ ଏହା ପ୍ରତି ଆକର୍ଷିତ ହେବେ ଏବଂ ଶେଷରେ ବିଷ ଜାଲରେ ପଡ଼ି ମୃତ୍ୟୁବରଣ କରିବେ।"
         ]
      },
      "cow": {
         "advisory": [
            "ଉପଯୁକ୍ତ ଭେଣ୍ଟିଲେସନ୍ ସୁବିଧା ସହିତ ପଶୁମାନଙ୍କୁ ଉପଯୁକ୍ତ ଆଶ୍ରୟ ପ୍ରଦାନ କରନ୍ତୁ | ଚଟାଣ ସଫା, ଶୁଖିଲା ଏବଂ ଘାସ ସହିତ ବିଛଣା ହେବା ଉଚିତ ଯାହା ଉତ୍ତାପ ହ୍ରାସକୁ ପ୍ରତିରୋଧ ଏବଂ ପ୍ରତିରୋଧ ଭାବରେ କାର୍ଯ୍ୟ କରେ | ଶୀତ ଋତୁରେ, ତାପମାତ୍ରା ହ୍ରାସ ପାଇବା କାରଣରୁ ପଶୁମାନଙ୍କର ଅଧିକ ପରିମାଣର ଖାଦ୍ୟ ଆବଶ୍ୟକ ହୋଇଥାଏ। ଦୁଗ୍ଧ ଉତ୍ପାଦନ ବଜାୟ ରଖିବା ପାଇଁ ଅଧିକ ପରିମାଣର ରଫେଜ୍ ଦିଆଯିବା ଉଚିତ। ମଇଁଷି ପରି ବଡ଼ ପଶୁମାନଙ୍କୁ ମକା, ଗହମ ଏବଂ ଘନୀଭୂତ ତୈଳ କେକ୍ @3 କେଜି ଏବଂ ପଶୁମାନଙ୍କୁ ଖୁଆଇବା ପଶୁମାନଙ୍କ ଶରୀରର ଉତ୍ତାପ ବଜାୟ ରଖିବାରେ ସାହାଯ୍ୟ କରେ |"
         ]
      },
      "goat": {
         "advisory": [
            "ପଶୁମାନଙ୍କର ଘର ଏବଂ ତା 'ର ଚଟାଣ ଅଧିକ ସମୟ ପର୍ଯ୍ୟନ୍ତ ଓଦା ଏବଂ ଥଣ୍ଡା ରହିବା ଉଚିତ ନୁହେଁ। ଏହା ପଶୁମାନଙ୍କୁ, ବିଶେଷ କରି ସାନମାନଙ୍କୁ, ନିମୋନିଆ, ଜ୍ୱର, କୋକ୍ସିଡିଓସିସ୍, ତରଳ ଝାଡ଼ା ଏବଂ ଏପରିକି ଗୁରୁତର କ୍ଷେତ୍ରରେ ମୃତ୍ୟୁ ଭଳି ବିଭିନ୍ନ ରୋଗର ସମ୍ମୁଖୀନ କରାଇପାରେ। ଶୀତ ଋତୁରେ ଭଲ ଭେଣ୍ଟିଲେସନ୍ ସୁନିଶ୍ଚିତ କରାଯିବା ଆବଶ୍ୟକ।"
         ]
      },
      "fresh water": {
         "advisory": [
            "ଶୀତ ଋତୁରେ, ମାଛରେ ବିଭିନ୍ନ ଫଙ୍ଗଲ୍, ବ୍ୟାକ୍ଟେରିଆ ଏବଂ ପରଜୀବୀ ରୋଗ ଦେଖାଯାଇପାରେ | ଶୀତ ଋତୁ ଆରମ୍ଭ ହେବାର ଠିକ୍ ପୂର୍ବରୁ ପୋଖରୀକୁ ସିଫାକ୍ସ @400 ମିଲି/ଏକରରେ ବ୍ୟବହାର କରନ୍ତୁ। ପୋଖରୀରେ ପୋଟାସିୟମ୍ ପର୍ମାଙ୍ଗାନେଟ୍ ପ୍ରତି ଏକର ପିଛା 1 ରୁ 2 କି. ଗ୍ରା. କିମ୍ବା ଚୂନପଥର ପ୍ରତି ଏକର ପିଛା 1 ରୁ 1 କି. ଗ୍ରା. ବ୍ୟବହାର କରନ୍ତୁ। ଏକର ପିଛା 100 କିଲୋଗ୍ରାମ ଲବଣ ପ୍ରୟୋଗ ମଧ୍ୟ ଶୀତ ଋତୁରେ ମାଛମାନଙ୍କୁ ରୋଗ ପ୍ରାଦୁର୍ଭାବରୁ ରକ୍ଷା କରିବାରେ ସାହାଯ୍ୟ କରିଥାଏ।"
         ]
      },
      "chick": {
         "advisory": [
            "ଯଦି କୁକୁଡ଼ା ପକ୍ଷୀର ବୟସ 3ରୁ 4 ସପ୍ତାହ ହୋଇଥାଏ, ତେବେ ରାଣୀଖେତ୍ ରୋଗ ବିରୁଦ୍ଧରେ ଟୀକାକରଣ ପାଇଁ ଯାଆନ୍ତୁ।"
         ]
      }
   },
   "date": "27-12-2024"
}