{
   "weather_details": {
      "2024-07-03": {
         "rainfall": 10,
         "t_max": 32,
         "t_min": 27,
         "rh_max": 77,
         "rh_min": 55,
         "wind_speed": 18,
         "wind_direction": 249,
         "cloud_cover": 8
      },
      "2024-07-04": {
         "rainfall": 20,
         "t_max": 32,
         "t_min": 27,
         "rh_max": 77,
         "rh_min": 52,
         "wind_speed": 13,
         "wind_direction": 238,
         "cloud_cover": 8
      },
      "2024-07-05": {
         "rainfall": 20,
         "t_max": 33,
         "t_min": 28,
         "rh_max": 79,
         "rh_min": 53,
         "wind_speed": 11,
         "wind_direction": 243,
         "cloud_cover": 8
      },
      "2024-07-06": {
         "rainfall": 20,
         "t_max": 33,
         "t_min": 28,
         "rh_max": 79,
         "rh_min": 52,
         "wind_speed": 11,
         "wind_direction": 207,
         "cloud_cover": 8
      },
      "2024-07-07": {
         "rainfall": 20,
         "t_max": 32,
         "t_min": 27,
         "rh_max": 77,
         "rh_min": 50,
         "wind_speed": 10,
         "wind_direction": 208,
         "cloud_cover": 8
      }
   },
   "names_of_crops": [
      "ଚାଉଳ",
      "ମକା",
      "ତିଲ।",
      "ପିଜନ୍ ମଟର",
      "ଆମ୍ବ",
      "କାକୁଡ଼ି",
      "ଓକ୍ରା",
      "କଦଳୀ",
      "ବାଇଗଣ",
      "ଛେଳି।",
      "ମଧୁର ଜଳ କାର୍ପ"
   ],
   "general_advisory": "ଏକ ଏକର ଜମିରେ ଧାନ ରୋପଣ ପାଇଁ 400 ମି. 2 (10 ଦଶମିକ) ଆକାରର ଜମିର ଆବଶ୍ଯ଼କତା ରହିଛି। ବୁଣିବା ପୂର୍ବରୁ ଧାନ ମଞ୍ଜି ଗୁଡ଼ିକୁ ଟ୍ରାଇକୋଡର୍ମା ପାଉଡର (ଆଇ. ଡି. 1) କିଲୋଗ୍ରାମ ମଞ୍ଜି କିମ୍ବା ଅନ୍ଯ଼ କୌଣସି ମଞ୍ଜି ଉପଚାରକାରୀ ରାସାଯ଼ନିକ ପଦାର୍ଥ ଯଥା ଥିରାମ 75 ପ୍ରତିଶତ 3 ଗ୍ରାମ କିମ୍ବା କ୍ଯ଼ାପଟାନ 50 ପ୍ରତିଶତ 3 ଗ୍ରାମ ପ୍ରତି କିଲୋଗ୍ରାମ ମଞ୍ଜି ଦେଇ ଚିକିତ୍ସା କରାଯିବା ଉଚିତ। ଚରମ ମରୁଡ଼ି ଏଡ଼ାଇବା ପାଇଁ ଉଚ୍ଚଭୂମିରେ ଅଣ-ଧାନ ଫସଲ ପାଇଁ ଯାଆନ୍ତୁ | ଶସ୍ଯ଼ + ଡାଲି/ତୈଳବୀଜକୁ ପରସ୍ପର ସହିତ ମିଶାଇ ଚାଷ କରିବା ପାଇଁ ପରାମର୍ଶ ଦିଆଯାଇଛି। ଅଗଷ୍ଟ ମଧ୍ଯ଼ଭାଗ ସୁଦ୍ଧା ଏଗୁଡ଼ିକୁ ସମ୍ପୂର୍ଣ୍ଣ କରିବା ପାଇଁ ଯଥା ସମ୍ଭବ ଶୀଘ୍ର ବୁଣିବା/ରୋପଣ କରନ୍ତୁ। ମଧ୍ଯ଼ମ ଜମିରେ ମଧ୍ଯ଼ମ ଅବଧି ଧାନ କିସମ ପାଇଁ ଯାଆନ୍ତୁ। ଧାନର ଧାଡ଼ି ବୁଣିବା ପାଇଁ ଯାଆନ୍ତୁ ଏବଂ ତା 'ପରେ ଶୀଘ୍ର ବିଉଶେନିଂ ଏବଂ ନିରାମଯ଼ କରନ୍ତୁ | ଏହା ପ୍ରତିରୋପଣ ପାଇଁ ଆବଶ୍ଯ଼କ ବୃଷ୍ଟିପାତ ଏବଂ ବିଳମ୍ବରେ ପ୍ରତିରୋପଣ ହେଲେ ଅଧିକ ବଯ଼ସ୍କ ଚାରା ଏଡ଼ାଇ ଦେବ।",
   "crops_data": {
      "rice": {
         "advisory": [
            "ଉଚ୍ଚଭୂମି ପରିସଂସ୍ଥା ପାଇଁ, 'ଆଇଡି1' ଦିନ ମଧ୍ଯ଼ରେ ପରିପକ୍ୱ ହେଉଥିବା କିସମଗୁଡ଼ିକ 'ଖଣ୍ଡଗିରି', 'ସହଭାଗି ଧନ', 'ଡିଡିଆର-42', 'ଡିଆର୍ଆର୍-44', 'ଡିଆର୍ଆର୍-46', 'ମନ୍ଦାକିନୀ', 'ନବୀନ', 'ଜିବି-1', 'ବିନା-11', 'ଏମ୍ଟିଯ଼ୁ-1010', 'ସତ୍ଯ଼ଭାମା', 'ସ୍ୱର୍ଣ୍ଣ ଶ୍ରେଯ଼ା' ଇତ୍ଯ଼ାଦି ଚାଷ ପାଇଁ ଉପଯୁକ୍ତ।",
            "ଧାନ ବୁଣିବା ପୂର୍ବରୁ ବୀଜ ଚିକିତ୍ସା ଆବଶ୍ଯ଼କ। ଏହା କିଛି ମାତ୍ରାରେ ବୀଜ ବାହିତ ରୋଗକୁ ନିଯ଼ନ୍ତ୍ରଣ କରିବ। କାର୍ବେଣ୍ଡାଜିମ୍ 50 ପ୍ରତିଶତ ଡବ୍ଲ୍ଯ଼ୁ. ପି. @2 ଗ୍ରାମ/କେଜି ମଞ୍ଜି କିମ୍ବା କାରବକ୍ସିନ୍ <ଆଇ. ଡି. 1> + ଥିରମ୍ <ଆଇ. ଡି. 1> ଡି. ଏସ୍. ଡବ୍ଲ୍ଯ଼ୁ. ପି. @3 ଗ୍ରାମ/କେଜି ମଞ୍ଜି ଦ୍ୱାରା ମଞ୍ଜି ଚିକିତ୍ସା କରାଯାଇପାରିବ। ସର୍ବଦା ପ୍ରମାଣିତ ମଞ୍ଜି ବ୍ଯ଼ବହାର କରନ୍ତୁ ଏବଂ ବୁଣିବା ପୂର୍ବରୁ ଅଙ୍କୁରୋଦଗମ ପରୀକ୍ଷା କରନ୍ତୁ। ଏକ ଏକର ଧାନ ଚାଷ ପାଇଁ 20 କିଲୋଗ୍ରାମ ମଞ୍ଜି ବ୍ଯ଼ବହାର କରନ୍ତୁ।",
            "ସୁନିଶ୍ଚିତ ଜଳସେଚିତ ଅଞ୍ଚଳରେ ଭଲ ଜଳ ନିଷ୍କାସନ ସୁବିଧା ସହିତ ଜଳସେଚନ ଜଳ ଉତ୍ସ ନିକଟରେ ଓଦା ଶଯ୍ଯ଼ା ନର୍ସରୀ ପାଇଁ ଜମି ଚଯ଼ନ କରନ୍ତୁ | ଗ୍ରାମ ସ୍ତରରେ ଗୋଷ୍ଠୀ ନର୍ସରୀ ଆଭିମୁଖ୍ଯ଼ ଅନୁସରଣ କରିବାକୁ ପରାମର୍ଶ ଦିଆଯାଇଛି। ନର୍ସରୀ ଅଞ୍ଚଳକୁ 1.5-metre-long, 10 ସେ. ମି. ଉଚ୍ଚତା ଏବଂ ସୁବିଧାଜନକ ଲମ୍ବ ବିଶିଷ୍ଟ ଛୋଟ ଛୋଟ ପ୍ଲଟରେ ବିଭକ୍ତ କରନ୍ତୁ। ଜଳସେଚନ/ଜଳ ନିଷ୍କାସନ ପାଇଁ ଶଯ୍ଯ଼ା ସହିତ 30 ସେ. ମି. ଓସାରର ଜଳସେଚନ ଚ୍ଯ଼ାନେଲ ନିର୍ମାଣ କରାଯିବା ଉଚିତ। ପ୍ରତ୍ଯ଼େକ ଧାଡ଼ି କିମ୍ବା ସିଧାସଳଖ ପ୍ରସାରଣ ମଧ୍ଯ଼ରେ 5 ସେ. ମି. ବ୍ଯ଼ବଧାନ ସହିତ ଧାଡ଼ି ବୁଣିବା ଦ୍ୱାରା ଅଙ୍କୁରିତ ବୀଜଗୁଡିକ ବୀଜ ଶଯ୍ଯ଼ାର @40-50 ଗ୍ରାମ୍/ମି2 ଅଞ୍ଚଳରେ ରୋପଣ କରାଯିବା ଉଚିତ ଏବଂ ମଞ୍ଜି ଉପରେ ଶୁଖିଲା କମ୍ପୋଷ୍ଟ ପକାଇବା ଉଚିତ।",
            "ଖଣ୍ଡଗିରି, ସହଭାଗି ଧାନ, ଡି. ଆର୍. ଆର୍.-42, ଡି. ଆର୍. ଆର୍.-44, ଡି. ଆର୍. ଆର୍.-46, ମନ୍ଦାକିନୀ, ନବୀନ, ଜି. ବି.-1, ବିନା-11, ଏମ. ଟି. ଯ଼ୁ.-1010, ସତ୍ଯ଼ଭାମା ଇତ୍ଯ଼ାଦି ଉଚ୍ଚଭୂମି ଧାନ କିସମ (<ଆଇ. ଡି. 1> ଦିନରେ ପରିପକ୍ୱ) ଚାଷ କରାଯାଇପାରିବ। ଏମ୍. ଟି. ଯ଼ୁ. 1156, ଏମ୍. ଟି. ଯ଼ୁ. 1153, ସି. ଆର୍. ଧାନ 310, ଆର୍. ଜି. ଏଲ୍. 2538, ଲଲାଟ, ଉନ୍ନତ ଲଲାଟ, ମାନସ୍ୱିନୀ, ଏମ୍. ଟି. ଯ଼ୁ.-1001, ସମ୍ପାଡ଼ା, ଗୀତାଞ୍ଜଳି, ନୁଆ ଆଚାରମତୀ ଇତ୍ଯ଼ାଦି ମଧ୍ଯ଼ମ ଧରଣର ଧାନ କିସମ (ଆଇ. ଡି. 2 ଦିନରେ ପରିପକ୍ୱ) ଯଥା-ପ୍ରତିକ୍ଷ୍ଯ଼, ସ୍ୱର୍ଣ୍ଣ, ସ୍ୱର୍ଣ୍ଣ ସବ୍-1, ଆର୍. ଜି. ଏଲ୍.-2537, ଏମ୍. ଟି. ଯ଼ୁ.-1075, ମୃଣାଲିନୀ, ହାସନ୍ତ, ରାଣୀଧନ, ସି. ଆର୍. 1009, ସି. ଆର୍. 1009 ସବ୍-1, ଡି. ଆର୍. ଆର୍. 50, ପୂଜା, ଏମ୍. ଟି. ଯ଼ୁ.-1064, ସି. ଆର୍.",
            "1018, ସରଳା, ଦୁର୍ଗା, ପ୍ରଧାନ ଧନ, ନୁଆ କଳଜୀରା, ନୁଆ ଚିନିକାମିନୀ, ସି. ଆର୍. ସୁଙ୍ଗଧି ଧନ-907 ଇତ୍ଯ଼ାଦି ଚାଷ କରାଯାଇପାରିବ। ବୁଣିବା ପୂର୍ବରୁ, କାର୍ବେଣ୍ଡାଜିମ୍ 50 ପ୍ରତିଶତ ଡବ୍ଲ୍ଯ଼ୁ. ପି. @2 ଗ୍ରାମ/କେଜି ମଞ୍ଜି କିମ୍ବା କାରବକ୍ସିନ୍ <ଆଇ. ଡି. 1> + ଥିରମ୍ <ଆଇ. ଡି. 1> ଡି. ଏସ୍. ଡବ୍ଲ୍ଯ଼ୁ. ପି. କିମ୍ବା ଥିରମ୍ 75 ପ୍ରତିଶତ ଡବ୍ଲ୍ଯ଼ୁ. ଏସ୍. @3 ଗ୍ରାମ/କେଜି ମଞ୍ଜି ବ୍ଯ଼ବହାର କରି ମଞ୍ଜି ଚିକିତ୍ସା କରାଯାଇପାରିବ। ସମ୍ପ୍ରଚାରିତ ଧାନ ଚାଷରେ, ଆବିର୍ଭାବ ପରବର୍ତ୍ତୀ ତୃଣନାଶକ ଯଥା ବିସ୍ପିରିବାକ୍ ସୋଡିଯ଼ମ୍ @80-ମିଲି/ଏକର କିମ୍ବା ଫେନକ୍ସାପ୍ରୋପ୍-ପି-ଇଥାଇଲ୍ର ଟ୍ଯ଼ାଙ୍କ୍ ମିଶ୍ରଣ 9.3% ଡବ୍ଲୁ/ଡବ୍ଲୁ ଇସି + ଇଥୋକ୍ସିସଲ୍ଫୁରନ୍ 15% ଡବ୍ଲୁଡିଜି @250 ମିଲି + 50-ଗ୍ରାମ୍/ଏକର 15-20 ଡିଏଏସ୍ରେ ଆର୍ଦ୍ର ମାଟିରେ 200 ଲିଟର ପାଣିରେ (ଯେତେବେଳେ ଆଗାଛା 3-4 ପତ୍ର ପର୍ଯ୍ଯ଼ାଯ଼ରେ ଥାଏ) ମିଶାଇ ସ୍ପ୍ରେ କରନ୍ତୁ। ଧାନ ପ୍ରତିରୋପଣ କ୍ଷେତ୍ରରେ ଯଥାଶୀଘ୍ର ଚାଉଳ ରୋପଣ କାର୍ଯ୍ଯ଼ ସମ୍ପୂର୍ଣ୍ଣ କରନ୍ତୁ। 21 ଦିନ ପୁରୁଣା ଚାରା ରୋପଣ ପାଇଁ ଉପଯୁକ୍ତ। ଧାନରେ ଆଗାଛାକୁ ନିଯ଼ନ୍ତ୍ରଣ କରିବା ପାଇଁ ପ୍ରାକ୍-ଉଦ୍ଭବ ହର୍ବିସାଇଡ୍ ପ୍ରିଟିଲାକ୍ଲୋର 37 ପ୍ରତିଶତ ଇ. ଡବ୍ଲ୍ଯ଼ୁ. @600-ମିଲି/ଏକର କିମ୍ବା ଅକ୍ସାଡିଆର୍ଜିଲ 80 ପ୍ରତିଶତ ଡବ୍ଲ୍ଯ଼ୁ. ପି. @50-ଗ୍ରାମ୍/ଏକର କିମ୍ବା ପାଇରାଜୋସଲ୍ଫୁରନ୍ ଇଥାଇଲ 10 ପ୍ରତିଶତ ଡବ୍ଲ୍ଯ଼ୁ. ପି. @80-ଗ୍ରାମ୍/ଏକର 1-3 (ପ୍ରତିରୋପଣର କିଛି ଦିନ ପରେ) ଡି. ଏ. ଟି. ବ୍ଯ଼ବହାର କରନ୍ତୁ।"
         ]
      },
      "maize": {
         "advisory": [
            "ମକା ପାଇଁ ବିହନ ହାର ଏକର ପିଛା 6-7 କିଲୋଗ୍ରାମ। ଫଲ୍ ଆର୍ମି କୃମିର ସଂକ୍ରମଣରୁ ରକ୍ଷା ପାଇବା ପାଇଁ, 1-କିଲୋଗ୍ରାମ ମଞ୍ଜି 4-ମିଲି Cyantraniliprole19.8% + ଥାଯ଼ାମେଥୋକ୍ସାମ୍ 19.8% ଏଫ୍. ଏସ୍. ସହିତ ଚିକିତ୍ସା କରନ୍ତୁ। ଧାଡ଼ି ଠାରୁ ଧାଡ଼ି ମଧ୍ଯ଼ରେ ଦୂରତା 60 ସେ. ମି. ରଖନ୍ତୁ ଏବଂ ଗଛ ଲଗାଇବା ପାଇଁ 20 ସେ. ମି. ରଖନ୍ତୁ। ସର୍ବୋତ୍ତମ ଉଦ୍ଭିଦ ସଂଖ୍ଯ଼ାକୁ ବଜାଯ଼ ରଖିବା ପାଇଁ, ବୁଣିବା ପାଇଁ କିମ୍ବା ହଳ ପଛରେ ମଞ୍ଜି ବୁଣିବା ପାଇଁ ବୀଜ ଡ୍ରିଲ୍ ବ୍ଯ଼ବହାର କରନ୍ତୁ | 55 କିଲୋଗ୍ରାମ ଡିଏପି ଏବଂ 22 କିଲୋଗ୍ରାମ ପୋଟାସକୁ ମୂଳ ସାର ଭାବେ ପ୍ରଯ଼ୋଗ କରନ୍ତୁ। ମକା ଉପରେ ରାସାଯ଼ନିକ ନିଯ଼ନ୍ତ୍ରଣ ପାଇଁ 1ରୁ 2 ଡିଏଏସ୍ ମଧ୍ଯ଼ରେ 200 ଲିଟର ପାଣିରେ ମିଶାଇ ଏକର ପିଛା 800 ଗ୍ରାମ ଦରରେ ଆଟ୍ରାଜିନ୍ 50 ପ୍ରତିଶତ ଡବ୍ଲୁ. ପି. ହର୍ବିସାଇଡ୍ ସିଞ୍ଚନ କରନ୍ତୁ।"
         ]
      },
      "sesame": {
         "advisory": [
            "ତିଲ ବୁଣିବା ପାଇଁ ପାଗ ଅନୁକୂଳ ଅଟେ। ପ୍ରାଚି, କାଳିକା, କନକ, ବିନାଯ଼କ ଇତ୍ଯ଼ାଦି ଉନ୍ନତ ଏଚ. ୱାଇ. ଭି. ବୃଦ୍ଧି କରନ୍ତୁ। ଏକର ପିଛା 1 ରୁ 1.2 କି. ଗ୍ରା. ମଞ୍ଜି ବ୍ଯ଼ବହାର କରନ୍ତୁ। ବୁଣିବା ପୂର୍ବରୁ ମଞ୍ଜିଗୁଡ଼ିକୁ 3 ଗ୍ରାମ୍ ସେରେସନ୍/କିଲୋଗ୍ରାମ ମଞ୍ଜି ସହିତ ଉପଚାର କରନ୍ତୁ। ଅନ୍ତିମ ଜମି ପ୍ରସ୍ତୁତି ସମଯ଼ରେ ଏକର ପିଛା 6ଃ8ଃ8 କିଲୋଗ୍ରାମ ଏନ. ପି. କେ. ପ୍ରଯ଼ୋଗ କରନ୍ତୁ। ଗଛଗୁଡ଼ିକ ମଧ୍ଯ଼ରେ 10 ସେ. ମି. ବ୍ଯ଼ବଧାନରେ 30 ସେ. ମି. ବ୍ଯ଼ବଧାନରେ ବୀଜ ବୁଣନ୍ତୁ।"
         ]
      },
      "pigeon pea": {
         "advisory": [
            "ଅରହରର କେତେକ ଉନ୍ନତ ପ୍ରଜାତି ହେଉଛି ପିଆରଜି-235, ପିଆରଜି 176, ଭିଏଲ ଅରହର-1, ଟି-ଅରହର ଇତ୍ଯ଼ାଦି। ଲାଇନ ବୁଣିବା ପାଇଁ ଶୀଘ୍ର ପରିପକ୍ୱ ହେଉଥିବା କିସମ ପାଇଁ ସୁପାରିସ କରାଯାଇଥିବା ବୀଜ ହାର 8 କିଲୋଗ୍ରାମ ଥିବାବେଳେ ବିଳମ୍ବରେ ପରିପକ୍ୱ ହେଉଥିବା ପ୍ରଜାତି ପାଇଁ ଏହା 6 କିଲୋଗ୍ରାମ ଅଟେ। ଭଲ ଚାଷ ପାଇଁ ଚାଷୀମାନଙ୍କ ଦ୍ୱାରା 3ରୁ 4 ଥର ଜମି ଚାଷ କରାଯିବା ଉଚିତ ଏବଂ ପରେ ଜମି ସମତଳ କରାଯିବା ଉଚିତ। ଅନ୍ତିମ ଜମି ପ୍ରସ୍ତୁତି ସମଯ଼ରେ 2 ଟନ୍ ଭଲ ଭାବେ କ୍ଷତବିକ୍ଷତ ଏଫ୍. ଆଇ. ଏମ୍. ପ୍ରଯ଼ୋଗ କରନ୍ତୁ। କାର୍ବେଣ୍ଡାଜିମ୍ 50 ପ୍ରତିଶତ ଡବ୍ଲ୍ଯ଼ୁ. ପି. @2 ଗ୍ରାମ/କେଜି ମଞ୍ଜି କିମ୍ବା କାରବକ୍ସିନ୍ <ଆଇ. ଡି. 1> + ଥିରମ୍ <ଆଇ. ଡି. 1> ଡି. ଏସ୍. ଡବ୍ଲ୍ଯ଼ୁ. ପି. ସହିତ ମଞ୍ଜି ଚିକିତ୍ସା କରାଯାଇପାରିବ। ବୁଣିବା 1 ଘଣ୍ଟା ପୂର୍ବରୁ 20 ଗ୍ରାମ୍/କି. ଗ୍ରା. ମୂଲ୍ଯ଼ର ସୁପାରିଶ କରାଯାଇଥିବା ପ୍ରଜାତିର ରାଇଜୋବିଯ଼ମ୍ ବ୍ଯ଼ାକ୍ଟେରିଆ କଲ୍ଚର୍ର ମଞ୍ଜି ବ୍ଯ଼ବହାର କରନ୍ତୁ। ରାସାଯ଼ନିକ ବୀଜ ଚିକିତ୍ସା ଏବଂ ରାଇଜୋବିଯ଼ମ୍ ଚିକିତ୍ସା ମଧ୍ଯ଼ରେ ବ୍ଯ଼ବଧାନ ଅତିକମରେ 7 ଦିନ ହେବା ଉଚିତ।"
         ]
      },
      "mango": {
         "advisory": [
            "ଫଳ ଅମଳ ଏବଂ ପକେଇବା। ଆନ୍ଥ୍ରାକ୍ନୋଜ୍ ଏବଂ ଫଳ ମାଛି ପରିଚାଳନା ପାଇଁ 1 ଘଣ୍ଟା ପାଇଁ ହାଲୁକା ଉଷୁମ ପାଣିରେ (48 ଡିଗ୍ରୀ ସେଲସିଯ଼ସ୍) ଫଳ ବୁଡ଼ାଇ ଆବଶ୍ଯ଼କ ହେଲେ ଆମ୍ବକୁ ଗରମ ପାଣି ଉପଚାର କରନ୍ତୁ। ଏ. ଏଫ୍. ସଂକ୍ରମିତ କାଣ୍ଡକୁ ସଫା କରି ଏବଂ ଲାର୍ଭା ମାରି ଷ୍ଟେମବୋରରର ପରିଚାଳନା। 1 ମି. ଏକ୍ସ. 1 ମି. ଏକ୍ସ. 1 ମି. ର ଗର୍ତ୍ତ ଖୋଳିବା ଏବଂ ଚାରା ରୋପଣ।"
         ]
      },
      "cucumber": {
         "advisory": [
            "କାକୁଡ଼ିରେ ଡାଉନି ମାଇଲ୍ଡ୍ଯ଼ୁ ରୋଗ ପରିଚାଳନା ପାଇଁ କପର୍ ହାଇଡ୍ରୋକ୍ସାଇଡ୍ 77 ପ୍ରତିଶତ ଡବ୍ଲ୍ଯ଼ୁ. ପି. @3-ଗ୍ରାମ୍/ଲିଟର କିମ୍ବା ଫୋସେଟିଲ୍-ଏ. ଏଲ୍. 80 ପ୍ରତିଶତ ଡବ୍ଲ୍ଯ଼ୁ. ପି. @3-ଗ୍ରାମ୍/ଲିଟର କିମ୍ବା କାର୍ବେନଡାଜିମ୍ 12 ପ୍ରତିଶତ + ମାନକୋଜେବ୍ 63 ପ୍ରତିଶତ ଡବ୍ଲ୍ଯ଼ୁ. ପି. @2-ଗ୍ରାମ୍/ଲିଟର ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "okra": {
         "advisory": [
            "ଏଚ. ୱାଇ. ଭି. ଓକ୍ରା ପାଇଁ ମଞ୍ଜି ହାର ଏକର ପିଛା 4-କିଲୋଗ୍ରାମ ଥିବାବେଳେ ସଂକର ମଞ୍ଜି ପାଇଁ ମଞ୍ଜି ହାର ଏକର ପିଛା 1.5 କିଲୋଗ୍ରାମ। ଫସଲର ପ୍ରାରମ୍ଭିକ ପର୍ଯ୍ଯ଼ାଯ଼ରେ ଶୋଷକ କୀଟପତଙ୍ଗର ସଂକ୍ରମଣ ବିରୁଦ୍ଧରେ ପ୍ରତିରୋଧ ପ୍ରଦାନ କରିବା ପାଇଁ, ମଞ୍ଜି ସହିତ ଇମିଡାକ୍ଲୋପ୍ରିଡ୍ ସହିତ ଚିକିତ୍ସା କରନ୍ତୁ |"
         ]
      },
      "banana": {
         "advisory": [
            "ପାନାମା ୱିଲ୍ଟକୁ ପରିଚାଳନା କରିବା ପାଇଁ, ରୋଗ ମୁକ୍ତ ରୋପଣ ସାମଗ୍ରୀ ଏବଂ ବାଣ୍ଟାଲ, ରୋବଷ୍ଟା, ଚମ୍ପା, କାବୁଲି ଇତ୍ଯ଼ାଦି ପ୍ରତିରୋଧକ ଚାଷ ଚଯ଼ନ କରନ୍ତୁ | କଦଳୀ ଶୋଷକମାନଙ୍କୁ ରୋପଣ ପୂର୍ବରୁ କାର୍ବେନଡାଜିମ୍ ଦ୍ରବଣରେ 10-ଗ୍ରାମ୍/10-ଲିଟର ପାଣିରେ ବୁଡ଼ାଇବା ଉଚିତ ଏବଂ ରୋପଣର 5 ମାସ ପରେ ଛଦ୍ମ କାଣ୍ଡ ଚାରିପାଖରେ ଦୁଇମାସିଆ ମାଟି ଭିଜାଇଦେବା ଉଚିତ।"
         ]
      },
      "brinjal": {
         "advisory": [
            "ଏକ ଏକର ବାଇଗଣ ଫସଲ ଚାଷ ପାଇଁ 200 ଗ୍ରାମ ଉନ୍ନତ କିସମ ଏବଂ 80 ଗ୍ରାମ ହାଇବ୍ରିଡ୍ ମଞ୍ଜି ହେଉଛି required.Some ବାଇଗଣର ଗୁରୁତ୍ୱପୂର୍ଣ୍ଣ କିସମଗୁଡ଼ିକ ହେଉଛି ଉତ୍କଳ ତାରିଣୀ, ଉତ୍କଳ ମାଧୁରୀ, ସଫେଦ୍ ମୋତି, ଭି. ଏନ୍. ଆର୍. ଲଙ୍ଗ୍ ପର୍ପଲ, ଅକ୍ଷିତା, ଭି. ଏନ୍. ଆର୍. ବି5, ବୈରାବି, ବୋରିଗୁମ୍ମା ରାଉଣ୍ଡ ଇତ୍ଯ଼ାଦି | ନର୍ସରୀ ଶଯ୍ଯ଼ାରେ ବୁଣିବା ଦଶ ଦିନ ପୂର୍ବରୁ 20 କିଲୋଗ୍ରାମ ସମ୍ପୂର୍ଣ୍ଣ ଅପଘଟିତ ଏଫ୍. ଆଇ. ଏମ୍. କୁ ମାଟି ସହିତ ଭଲ ଭାବେ ମିଶାଇବା ଉଚିତ। କାର୍ବେଣ୍ଡାଜିମ୍ 50 ପ୍ରତିଶତ ଡବ୍ଲ୍ଯ଼ୁ. ପି. @2 ଗ୍ରାମ୍/କି. ଗ୍ରା. ମଞ୍ଜି କିମ୍ବା କାରବକ୍ସିନ୍ <ଆଇ. ଡି. 1> + ଥିରାମ୍ <ଆଇ. ଡି. 1> ଡି. ଏସ୍. ଡବ୍ଲ୍ଯ଼ୁ. ପି. @3 ଗ୍ରାମ୍/କି. ଗ୍ରା. ମଞ୍ଜି ଦ୍ୱାରା ମଞ୍ଜି ଚିକିତ୍ସା କରାଯାଇପାରିବ। ପ୍ରାଯ଼ 6 ଘଣ୍ଟା ବୀଜ ଉପଚାର ପରେ 1 ସେ. ମି. ଗଭୀରତାରେ 2.5 x 5 ସେ. ମି. ରେ ମଞ୍ଜି ବୁଣନ୍ତୁ। ବୁଣିବା ପରେ, 2-ଗ୍ରାମ୍ କାର୍ବେନଡାଜିମ୍ ମିଶ୍ରଣରେ ମାଟିକୁ ଭିଜାଇ ଦିଅନ୍ତୁ। ଉତ୍ତମ ଅଙ୍କୁରୋଦଗମ ପାଇଁ ନର୍ସରୀ ଶଯ୍ଯ଼ାକୁ ଧାନ ନଡ଼ିଆ କିମ୍ବା ଶୁଖିଲା ପତ୍ରରେ ଢାଙ୍କି ଦିଅନ୍ତୁ। ପିମ୍ପୁଡ଼ିମାନଙ୍କୁ ଏଡ଼ାଇବା ପାଇଁ ନର୍ସରୀ ଶଯ୍ଯ଼ା ଚାରିପାଖରେ କ୍ଲୋରପିରିଫସ୍ ପାଉଡରକୁ ଧୂଳି ଦିଅନ୍ତୁ | 4 ସପ୍ତାହ ପୁରୁଣା ଚାରା ମୁଖ୍ଯ଼ କ୍ଷେତରେ ରୋପଣ କରାଯିବା ଉଚିତ।"
         ]
      },
      "goat": {
         "advisory": [
            "ଚଟାଣ ଉପରେ ବାଲି ବ୍ଯ଼ବହାର କରି ଆମେ ଚଟାଣକୁ ଶୁଖିଲା ରଖିପାରିବା ଯାହା ଦ୍ୱାରା ପଶୁମାନଙ୍କୁ ବିଭିନ୍ନ ଭଯ଼ଙ୍କର ରୋଗରୁ ମୁକ୍ତ ରଖାଯାଇପାରିବ। ଏହି ଛପର ବିଶେଷତ୍ୱ ହେଉଛି ଏହାର ଚଟାଣ ଇଟା ଏବଂ ସିମେଣ୍ଟରେ ତିଆରି ଏବଂ ନଦୀର ବାଲି ଏହା ଉପରେ 4ରୁ 6 ଇଞ୍ଚ ମୋଟା ହୋଇ ବ୍ଯ଼ାପ୍ତ। ବାଲି ପରିସ୍ରାକୁ ଭିଜାଇ ରଖେ, ଯାହାଦ୍ୱାରା ପଶୁମାନେ ତା 'ଉପରେ ଆରାମରେ ଶୋଇପାରିବେ। ବାଲିର ଚଟାଣ ଉପରେ ଥିବା ମଳ ପଦାର୍ଥକୁ ସଫା କରିବା ମଧ୍ଯ଼ ସହଜ। ବାଲିକୁ ଶୁଖିଲା ରଖିବା ପାଇଁ ଏହାକୁ 15-20 ଦିନ ବ୍ଯ଼ବଧାନରେ ଓଲଟପାଲଟ କରି ଦିଆଯାଏ। ଶିଶୁଙ୍କ ପାଇଁ ଚଟାଣ ସ୍ଥାନର ଆବଶ୍ଯ଼କତା 0.5, ବଯ଼ସ୍କଙ୍କ ପାଇଁ 1.2, ହରିଣ ପାଇଁ 2 ବର୍ଗ ମିଟର ଏବଂ ଗର୍ଭବତୀ ମହିଳାଙ୍କ ପାଇଁ 2 ବର୍ଗ ମିଟର ଚଟାଣ ସ୍ଥାନ ଆବଶ୍ଯ଼କ, ଯାହା ପ୍ରତ୍ଯ଼େକ ପ୍ରକାରର ଘର ପାଇଁ ଉପଯୁକ୍ତ।"
         ]
      },
      "fresh water carp": {
         "advisory": [
            "ଦ୍ରୁତ ଗତିରେ ବଢ଼ୁଥିବା ରୋହୁ, କାଟଲା ଏବଂ ମ୍ରିଗଲ ଭଳି କାର୍ପକୁ 4ଃ3ଃ3 ଅନୁପାତରେ ମହଜୁଦ ରଖିବା ଉଚିତ, ଯାହାଦ୍ୱାରା ଏହାର ଲାଭ ବଢ଼ିପାରିବ। ସାଧାରଣତଃ, ହେକ୍ଟର ପିଛା 5,000 ଫିଙ୍ଗରଲିଙ୍ଗର ଘନତ୍ୱ ଏକ ମାନକ ଷ୍ଟକିଂ ଭାବରେ ରଖାଯାଏ | ଚିନାବାଦାମ ତେଲ କେକ୍ ଏବଂ ଚାଉଳ ଚୋପା ଷ୍ଟକିଂ ସାମଗ୍ରୀର ମୋଟ ବାଯ଼ୋମାସର 5 ପ୍ରତିଶତ ଅନୁପାତରେ ସମାନ ଅନୁପାତରେ ଦିଆଯାଏ | ପୁଷ୍କରିଣୀର ଗୁଣବତ୍ତା ବୃଦ୍ଧି ପାଇଁ ଗୋବର, ଯ଼ୁରିଆ ଏବଂ ସୁପର ଫସଫେଟ୍ ପ୍ରଯ଼ୋଗ କରାଯିବା ଉଚିତ। 8-10 ମାସରେ, ମାଛମାନେ ସେମାନଙ୍କର ବିପଣନ ଯୋଗ୍ଯ଼ ଆକାରରେ ପହଞ୍ଚନ୍ତି |"
         ]
      }
   },
   "date": "02-07-2024"
}