{
   "weather_details": {
      "2024-07-31": {
         "rainfall": 20,
         "t_max": 28,
         "t_min": 25,
         "rh_max": 85,
         "rh_min": 62,
         "wind_speed": 8,
         "wind_direction": 225,
         "cloud_cover": 8
      },
      "2024-08-01": {
         "rainfall": 20,
         "t_max": 27,
         "t_min": 24,
         "rh_max": 89,
         "rh_min": 71,
         "wind_speed": 6,
         "wind_direction": 289,
         "cloud_cover": 8
      },
      "2024-08-02": {
         "rainfall": 15,
         "t_max": 28,
         "t_min": 24,
         "rh_max": 87,
         "rh_min": 73,
         "wind_speed": 13,
         "wind_direction": 246,
         "cloud_cover": 8
      },
      "2024-08-03": {
         "rainfall": 12,
         "t_max": 29,
         "t_min": 25,
         "rh_max": 86,
         "rh_min": 67,
         "wind_speed": 13,
         "wind_direction": 207,
         "cloud_cover": 8
      },
      "2024-08-04": {
         "rainfall": 10,
         "t_max": 31,
         "t_min": 26,
         "rh_max": 86,
         "rh_min": 61,
         "wind_speed": 12,
         "wind_direction": 212,
         "cloud_cover": 7
      }
   },
   "names_of_crops": [
      "ମକା",
      "ଫିଙ୍ଗର ମିଲେଟ୍",
      "ପିଜନ୍ ମଟର",
      "ଚାଉଳ",
      "ବାଇଗଣ",
      "ଆମ୍ବ",
      "ଓକ୍ରା",
      "ଛେଳି।",
      "ଗାଈ।",
      "ମଧୁର ଜଳ କାର୍ପ",
      "ଚିକେନ୍"
   ],
   "general_advisory": "ପାଣି ଜମାଟ ବାନ୍ଧିବାରୁ ରକ୍ଷା ପାଇବା ପାଇଁ ଫସଲ କ୍ଷେତରୁ ଅତିରିକ୍ତ ପାଣି ବାହାର କରନ୍ତୁ। ମକା, ପିଜନ୍ ମଟର ଏବଂ ପନିପରିବା ବୁଣିବା ସ୍ଥଗିତ ରଖନ୍ତୁ। ବର୍ଷା ଜଳସେଚିତ ଉଚ୍ଚଭୂମିରେ ଉଠାଯାଇଥିବା ବୀଜ ଶଯ୍ଯ଼ାରେ ପନିପରିବାର ଚାରା ଲଗାଇବା ପାଇଁ ଯାଆନ୍ତୁ। ପ୍ରବଳ ବର୍ଷାରୁ ରକ୍ଷା ପାଇବା ପାଇଁ ପନିପରିବା ନର୍ସରୀକୁ ପଲିଥିନ୍ ଦ୍ୱାରା ଢାଙ୍କି ଦିଅନ୍ତୁ ଏବଂ ଜଳ ନିଷ୍କାସନ ବ୍ଯ଼ବସ୍ଥା କରନ୍ତୁ। ପ୍ରବଳ ବର୍ଷା ହେଉଥିବା ଅଞ୍ଚଳରେ, କିଛି ସମଯ଼ ପାଇଁ ମଞ୍ଜି ବୁଣିବା ଏବଂ ସାର କିମ୍ବା ତୃଣନାଶକ ପଦାର୍ଥ ଉପରେ ଲଗାଇବା ବନ୍ଦ କରନ୍ତୁ।",
   "crops_data": {
      "maize": {
         "advisory": [
            "ଏହି ଫସଲ ଅଙ୍କୁରିତ ହୋଇ ତିନି ସପ୍ତାହ ପର୍ଯ୍ଯ଼ନ୍ତ ରହିଥାଏ। ମକା ଫସଲର ତିନିରୁ ଚାରି ସପ୍ତାହର ପର୍ଯ୍ଯ଼ାଯ଼ରେ ହୋଇଂ ପାଇଁ ଯାଆନ୍ତୁ, ମାଟିର ଆର୍ଦ୍ରତା ଉପରେ ନଜର ରଖି ନିରାମଯ଼ କରନ୍ତୁ ଏବଂ ହାଇବ୍ରିଡ୍ ମକା ପାଇଁ ଏକର ପିଛା 52 କିଲୋଗ୍ରାମ ଯ଼ୁରିଆ ଏବଂ ଅଧିକ ଉତ୍ପାଦନକାରୀ ପ୍ରଜାତି ପାଇଁ ଏକର ପିଛା 40 କିଲୋଗ୍ରାମ ଯ଼ୁରିଆ ଲଗାନ୍ତୁ।",
            "20-25 DAS ରେ ହାତ କାଟିବା ଏବଂ ମୃତ୍ତିକା ଉତ୍ତୋଳନ କରାଯିବା ଉଚିତ। ଏହି ପର୍ଯ୍ଯ଼ାଯ଼ରେ ଏକର ପିଛା 55 କିଲୋଗ୍ରାମ ଯ଼ୁରିଆକୁ ପ୍ରଥମ ଟପ୍ ଡ୍ରେସିଂ ଭାବରେ ଲଗାନ୍ତୁ। ପୁଣିଥରେ 40-45 DAS ରେ କିମ୍ବା ଟାସେଲିଂ ପୂର୍ବରୁ 55 କିଲୋଗ୍ରାମ ଯ଼ୁରିଆ ଏବଂ 20 କିଲୋଗ୍ରାମ ଏମଓପି ଦ୍ୱିତୀଯ଼ ଟପ୍ ଡ୍ରେସିଂ ଭାବରେ ପ୍ରଯ଼ୋଗ କରନ୍ତୁ | ଶରତ ଋତୁର ପରିଚାଳନା ପାଇଁ ସେନା କୃମି କୀଟ 200 ଲିଟର ପାଣିରେ ମିଶାଇ ଏକର ପିଛା 1200-ଗ୍ରାମ୍ ବାଯ଼ୋପଷ୍ଟିସାଇଡ୍ ବିଉଭେରିଆ ବାସିଆନା ସ୍ପ୍ରେ କରନ୍ତୁ। ଏକର ପିଛା 10-12 ପକ୍ଷୀ ପର୍ଚ୍ ବ୍ଯ଼ବହାର କରନ୍ତୁ ଏବଂ ଟାସେଲିଂ ପର୍ଯ୍ଯ଼ାଯ଼ ପୂର୍ବରୁ ସେଗୁଡ଼ିକୁ ବାହାର କରନ୍ତୁ | ପତ୍ର ଚକ୍ର ଭିତରେ ବାଲି, ମାଟି ଏବଂ କାଠର ଛାଇର ଧୂଳି ମିଶ୍ରଣ ଲଗାନ୍ତୁ ଯାହା ଦ୍ୱାରା କ୍ଯ଼ାଟର୍ପିଲାର୍ମାନେ ପତ୍ରକୁ ଖାଇପାରିବେ ନାହିଁ | ରାସାଯ଼ନିକ ଉପାଯ଼ରେ ଏହି କୀଟକୁ ନିଯ଼ନ୍ତ୍ରଣ କରିବା ପାଇଁ ଇମାମେକ୍ଟିନ୍ ବେନ୍ଜୋଏଟ୍ 5 ପ୍ରତିଶତ ଏସ୍. ଜି. @80-ଗ୍ରାମ୍/ଏକର କିମ୍ବା ସ୍ପିନେଟୋରାମ୍ <ଆଇ. ଡି. 1> ଏସ୍. ସି. @100-ମିଲି/ଏକର କିମ୍ବା କ୍ଲୋରାଣ୍ଟ୍ରାନିଲିପ୍ରୋଲ୍ <ଆଇ. ଡି. 2> ଏସ୍. ସି. @80-ମିଲି/ଏକରକୁ 200-ଲିଟର ପାଣିରେ ମିଶାଇ ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "finger millet": {
         "advisory": [
            "ଏବେ ନର୍ସରୀରେ ରାଗି ବୁଣିବା ସମଯ଼। ଅର୍ଜୁନ, ଦିବ୍ଯ଼ସିଂହ, ଏ. କେ. ପି.-2, ଏ. କେ. ପି.-3, ଏ. କେ. ପି.-7, ଗୋଦାବରୀ, ନୀଳଚଲ, ଭୈରବୀ, ଶୁଭ୍ରା ଏବଂ ଚିଲିକା ଭଳି ଅଧିକ ଉତ୍ପାଦନକ୍ଷମ କିସମ ଚାଷ କରନ୍ତୁ। ରୋପଣ ପାଇଁ ଏକର ପିଛା 2 ରୁ 2.5 କି. ଗ୍ରା. ମଞ୍ଜି ବ୍ଯ଼ବହାର କରନ୍ତୁ। ବୁଣିବା ପୂର୍ବରୁ ପ୍ରତି କିଲୋଗ୍ରାମ ମଞ୍ଜି ପିଛା 3 ଗ୍ରାମ୍ ଥିରମ୍ କିମ୍ବା 1 ଗ୍ରାମ୍ ଟ୍ରାଇସିକ୍ଲୋଜୋଲ୍ ଦେଇ ମଞ୍ଜି ଉପଚାର କରନ୍ତୁ। ପ୍ରତି sq.metre ନର୍ସରୀ ଶଯ୍ଯ଼ାରେ 10 ଗ୍ରାମ୍ ନାଇଟ୍ରୋଜେନ୍ ଏବଂ ଫୋଫରସ୍ ଲଗାନ୍ତୁ ଏବଂ ଏହାକୁ ଭଲ ଭାବରେ ମିଶାନ୍ତୁ। ଶଯ୍ଯ଼ା ଉପରେ ସମାନ ଭାବରେ ମଞ୍ଜି ବୁଣନ୍ତୁ ଏବଂ ପାଉଡର ମାଟି ସହିତ ମଞ୍ଜିଗୁଡ଼ିକୁ ପତଳା ଭାବରେ ଆଚ୍ଛାଦନ କରନ୍ତୁ |"
         ]
      },
      "pigeon pea": {
         "advisory": [
            "ଅରହରର କେତେକ ଉନ୍ନତ ପ୍ରଜାତି ହେଉଛି ପିଆରଜି-235, ପିଆରଜି 176, ଭିଏଲ ଅରହର-1, ଟି-ଅରହର ଇତ୍ଯ଼ାଦି। ଲାଇନ ବୁଣିବା ପାଇଁ ଶୀଘ୍ର ପରିପକ୍ୱ ହେଉଥିବା କିସମ ପାଇଁ ସୁପାରିସ କରାଯାଇଥିବା ବୀଜ ହାର 8 କିଲୋଗ୍ରାମ ଥିବାବେଳେ ବିଳମ୍ବରେ ପରିପକ୍ୱ ହେଉଥିବା ପ୍ରଜାତି ପାଇଁ ଏହା 6 କିଲୋଗ୍ରାମ ଅଟେ। ଭଲ ଚାଷ ପାଇଁ ଚାଷୀମାନଙ୍କ ଦ୍ୱାରା 3ରୁ 4 ଥର ଜମି ଚାଷ କରାଯିବା ଉଚିତ ଏବଂ ପରେ ଜମି ସମତଳ କରାଯିବା ଉଚିତ। ଅନ୍ତିମ ଜମି ପ୍ରସ୍ତୁତି ସମଯ଼ରେ 2 ଟନ୍ ଭଲ ଭାବେ କ୍ଷତବିକ୍ଷତ ଏଫ୍. ଆଇ. ଏମ୍. ପ୍ରଯ଼ୋଗ କରନ୍ତୁ। କାର୍ବେଣ୍ଡାଜିମ୍ 50 ପ୍ରତିଶତ ଡବ୍ଲ୍ଯ଼ୁ. ପି. @2-ଗ୍ରାମ୍/କେଜି ମଞ୍ଜି କିମ୍ବା କାରବକ୍ସିନ୍ <ଆଇ. ଡି. 1> + ଥିରମ୍ <ଆଇ. ଡି. 1> ଡି. ଏସ୍. ଡବ୍ଲ୍ଯ଼ୁ. ପି. ସହିତ ମଞ୍ଜି ଚିକିତ୍ସା କରାଯାଇପାରିବ। ବୁଣିବା 1 ଘଣ୍ଟା ପୂର୍ବରୁ 20 ଗ୍ରାମ୍/କି. ଗ୍ରା. ମୂଲ୍ଯ଼ର ସୁପାରିଶ କରାଯାଇଥିବା ପ୍ରଜାତିର ରାଇଜୋବିଯ଼ମ୍ ବ୍ଯ଼ାକ୍ଟେରିଆ କଲ୍ଚର୍ର ମଞ୍ଜି ବ୍ଯ଼ବହାର କରନ୍ତୁ। ରାସାଯ଼ନିକ ବୀଜ ଚିକିତ୍ସା ଏବଂ ରାଇଜୋବିଯ଼ମ୍ ଚିକିତ୍ସା ମଧ୍ଯ଼ରେ ବ୍ଯ଼ବଧାନ ଅତିକମରେ 7 ଦିନ ହେବା ଉଚିତ।"
         ]
      },
      "rice": {
         "advisory": [
            "ଶୁଖିଲା ପ୍ରତ୍ଯ଼କ୍ଷ ବିହନ ଚାଉଳଃ ତଳିଆ ଅଞ୍ଚଳରେ, ଯେଉଁଠାରେ ସିଧାସଳଖ ବିହନ ବୁଣିବା କାର୍ଯ୍ଯ଼ କରାଯାଇଛି ଏବଂ ଆଗାଛା ନିଯ଼ନ୍ତ୍ରଣ ପାଇଁ ତୃଣନାଶକ ପ୍ରଯ଼ୋଗ କରାଯାଇ ନାହିଁ, କ୍ଷେତରେ ପର୍ଯ୍ଯ଼ାପ୍ତ ପରିମାଣର ପାଣି (ଅତିକମ୍ରେ 7-10 ସେ. ମି. ଠିଆ ହୋଇଥିବା ପାଣି) ଜମା ହେବା ପରେ 'ବିଉଶେନିଂ' କରାଯାଇପାରିବ। 'ବିଉଶେନିଂ' ପରେ ଅର୍ଦ୍ଧ-ନିମ୍ନ/ଗଭୀର ଜଳ କ୍ଷେତ୍ରରେ ଏକର ପିଛା 18 କିଲୋଗ୍ରାମ ଯ଼ୁରିଆ ଏବଂ ଅଗଭୀର ତଳିଆ ଅଞ୍ଚଳରେ ଏକର ପିଛା 36 କିଲୋଗ୍ରାମ ଯ଼ୁରିଆ ପ୍ରଯ଼ୋଗ କରନ୍ତୁ। ପ୍ରତିରୋପଣ କରାଯାଇଥିବା ଚାଉଳଃ ଯଦି ଧାନ ନର୍ସରୀରେ ପତ୍ର ବିସ୍ଫୋରଣ ଦେଖାଯାଏ, ତେବେ ଟେବୁକୋନାଜୋଲ୍ 50 ପ୍ରତିଶତ + ଟ୍ରାଇଫ୍ଲୋକ୍ସିସ୍ଟ୍ରୋବିନ୍ 25 ପ୍ରତିଶତ ଡବ୍ଲୁଜି @0.4 ଗ୍ରାମ୍ କିମ୍ବା, ଆଇସୋପ୍ରୋଥିଓଲେନ୍ 40ଇସି @1.5 ମିଲି ଲିଟର ପ୍ରତି ଲିଟର ପାଣି ସ୍ପ୍ରେ କରନ୍ତୁ। 7-10 ଦିନ ପରେ ଦ୍ୱିତୀଯ଼ ସ୍ପ୍ରେ ଲଗାନ୍ତୁ। କେସ୍ କୃମି କ୍ଷେତ୍ରରେ, ଇଣ୍ଡୋକ୍ସାକାର୍ବ 14.5% SC @200 ମିଲି/ଏକର କିମ୍ବା, ଫିପ୍ରୋନିଲ 5% SC @400 ମିଲି/ଏକର ସ୍ପ୍ରେ କରନ୍ତୁ। ଜଳସେଚନ/ସ୍ୱାଭାବିକ ବର୍ଷା ହେଉଥିବା ଅଞ୍ଚଳରେ ଅଗଷ୍ଟ ମାସ ମଧ୍ଯ଼ଭାଗ ସୁଦ୍ଧା ଧାନ ରୋପଣ ସମ୍ପୂର୍ଣ୍ଣ ହେବା ଆବଶ୍ଯ଼କ। ଅଧିକ ଉତ୍ପାଦନକ୍ଷମ କିସମ ପାଇଁ, 44 କିଲୋଗ୍ରାମ ଡିଏପି + 33 କିଲୋଗ୍ରାମ ଏମଓପି କିମ୍ବା, 22 କିଲୋଗ୍ରାମ ଯ଼ୁରିଆ + 125 କିଲୋଗ୍ରାମ ଏସ୍. ଏସ୍. ପି + 33 କିଲୋଗ୍ରାମ ଏମଓପିକୁ ଶେଷ ପୁଡଲିଂ ସମଯ଼ରେ ମୂଳ ମାତ୍ରା ଭାବରେ ପ୍ରଯ଼ୋଗ କରନ୍ତୁ।"
         ]
      },
      "brinjal": {
         "advisory": [
            "ଉଚ୍ଚ ମୃତ୍ତିକା ଆର୍ଦ୍ରତା ଏବଂ ମଧ୍ଯ଼ମ ମୃତ୍ତିକା ତାପମାତ୍ରା (<28oC), ଏବଂ ବର୍ଷା ଋତୁରେ ଅଧିକ RH। ଅଧିକ ବର୍ଷା ହେତୁ ଆର୍ଦ୍ରତା, ଏବଂ ଖରାପ ଜଳ ନିଷ୍କାସନ, ବାଇଗଣରେ ରୋଗକୁ ଆର୍ଦ୍ର କରିଥାଏ। ନର୍ସରୀରେ ବାଇଗଣ ଗଛର ଆର୍ଦ୍ର ରୋଗକୁ ନିଯ଼ନ୍ତ୍ରଣ କରିବା ପାଇଁ, 10 ଲିଟର ପାଣିରେ 20 ଗ୍ରାମ ମେଟାଲାକ୍ସିଲ ଏବଂ ମାନକୋଜେବର ଦ୍ରବଣ ସହିତ ଶଯ୍ଯ଼ା ମାଟିକୁ ଭିଜାଇ ଦିଅନ୍ତୁ | ବାଇଗଣ ଚାରା ରୋପଣର 25-30 ଦିନ ପରେ ରୋପଣ ପାଇଁ ପ୍ରସ୍ତୁତ ହୋଇଯାଏ। ରୋପଣ ପାଇଁ ଚାରା ଉପୁଡ଼ିବା ପୂର୍ବରୁ ଗୋଟିଏ ଦିନ ସନ୍ଧ୍ଯ଼ାରେ, 10 ଲିଟର ପାଣିରେ 20 ଗ୍ରାମ୍ କପର ଅକ୍ସିକ୍ଲୋରାଇଡ୍ ଏବଂ 1 ଗ୍ରାମ୍ ସ୍ଟ୍ରେପ୍ଟୋସାଇକ୍ଲିନ୍ ଦ୍ୱାରା ପ୍ରସ୍ତୁତ ଦ୍ରବଣରେ ନର୍ସରୀ ଶଯ୍ଯ଼ା ମାଟିକୁ ଭିଜାଇ ଦିଅନ୍ତୁ।"
         ]
      },
      "mango": {
         "advisory": [
            "ଜୁଲାଇ ଏବଂ ଅଗଷ୍ଟ ହେଉଛି ଆମ୍ବ ରୋପଣ ପାଇଁ ସର୍ବୋତ୍ତମ।"
         ]
      },
      "okra": {
         "advisory": [
            "ଓକ୍ରାରେ ଶୁଟ୍ ଏବଂ ଫଳ ଛେଦକ ସଂକ୍ରମଣ ହେବାର ସମ୍ଭାବନା ଅଛି | ଓକ୍ରା ଶୁଟର ଲାର୍ଭା ଏବଂ ଫଳ ଛେଦକ ପତ୍ରପତ୍ରିକା ଏବଂ କୋମଳ ଅଙ୍କୁରରେ ଗର୍ତ୍ତ କରନ୍ତି ଯାହାର ଫଳସ୍ୱରୂପ ଅନ୍ତିମ ଅଙ୍କୁରଗୁଡ଼ିକ ଶୁଖିଯାଏ, ପତ୍ରଗୁଡ଼ିକ ଖସିଯାଏ ଏବଂ ଫୁଲର କଳାଗୁଡ଼ିକ ଝଡ଼ିଥାଏ | ପରେ ଲାର୍ଭା ଫଳରେ ପରିଣତ ହୁଏ ଯାହା ଖାଇବା ପାଇଁ ଅନୁପଯୁକ୍ତ ହୋଇଯାଏ | କୀଟକୁ ପରିଚାଳନା କରିବା ପାଇଁ, ଛିଦ୍ର ଏବଂ ପ୍ରଭାବିତ ଫଳ ଦେଖାଇଥିବା ପ୍ରଭାବିତ ଟର୍ମିନାଲ୍ ଶୁଟ୍ ଅପସାରଣ କରନ୍ତୁ | କୀଟ ସଂକ୍ରମଣର ପ୍ରାଥମିକ ପର୍ଯ୍ଯ଼ାଯ଼ରେ 200 ଲିଟର ପାଣିରେ ମିଶ୍ରଣ କରି ନିମ୍ବ-ଆଧାରିତ କୀଟନାଶକ (ଆଜାଦିରାକ୍ଟିନ) 1500 ପିପିଏମ @600-ମିଲି/ଏକର ସ୍ପ୍ରେ କରନ୍ତୁ। କୀଟକୁ ଜୈବିକ ଭାବରେ ପରିଚାଳନା କରିବା ପାଇଁ ବାସିଲସ୍ ଥୁରିନଜିଏନ୍ସିସ୍ ବାର୍ ସ୍ପ୍ରେ କରନ୍ତୁ। କୁର୍ଷ୍ଟାକି 5 ପ୍ରତିଶତ ୱାଲ୍ପି @400-ଗ୍ରାମ/ଏକର। କୀଟକୁ ନିଯ଼ନ୍ତ୍ରଣ କରିବା ପାଇଁ ରାସାଯ଼ନିକ ଉପାଯ଼ରେ ଏମାମେକ୍ଟିନ୍ ବେନ୍ଜୋଏଟ୍ 5 ପ୍ରତିଶତ ଏସ୍ଜି @80-ଗ୍ରାମ୍/ଏକର କିମ୍ବା କ୍ଲୋରାଣ୍ଟ୍ରାନିଲିପ୍ରୋଲ୍ 18.5% ଏସ୍ସି @80-ମିଲି/ଏକର କିମ୍ବା ପାଇରିଡାଲିଲ୍ 10 ପ୍ରତିଶତ ଇସି @300-ମିଲି/ଏକରକୁ 200-ଲିଟର ପାଣିରେ ମିଶାଇ ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "goat": {
         "advisory": [
            "ଚଟାଣ ଉପରେ ବାଲି ବ୍ଯ଼ବହାର କରି ଆମେ ଚଟାଣକୁ ଶୁଖିଲା ରଖିପାରିବା ଯାହା ଦ୍ୱାରା ପଶୁମାନଙ୍କୁ ବିଭିନ୍ନ ରୋଗରୁ ମୁକ୍ତ ରଖାଯାଇପାରିବ। ଏହି ଛପର ବିଶେଷତ୍ୱ ହେଉଛି ଏହାର ଚଟାଣ ଇଟା ଏବଂ ସିମେଣ୍ଟରେ ତିଆରି ହୋଇଥାଏ ଏବଂ ନଦୀର ବାଲି ଏହା ଉପରେ 4ରୁ 6 ଇଞ୍ଚ ମୋଟା ହୋଇଥାଏ। ବାଲି ପରିସ୍ରାକୁ ଭିଜାଇ ରଖେ, ଯାହାଦ୍ୱାରା ପଶୁମାନେ ତା 'ଉପରେ ଆରାମରେ ଶୋଇପାରିବେ। ବାଲିର ଚଟାଣ ଉପରେ ଥିବା ମଳ ପଦାର୍ଥକୁ ସଫା କରିବା ମଧ୍ଯ଼ ସହଜ। ବାଲିକୁ ଶୁଖିଲା ରଖିବା ପାଇଁ ଏହାକୁ 15-20 ଦିନ ବ୍ଯ଼ବଧାନରେ ଓଲଟପାଲଟ କରି ଦିଆଯାଏ। ଶିଶୁଙ୍କ ପାଇଁ ଚଟାଣ ସ୍ଥାନର ଆବଶ୍ଯ଼କତା 0.5, ବଯ଼ସ୍କଙ୍କ ପାଇଁ 1.2, ହରିଣ ପାଇଁ 2 ବର୍ଗ ମିଟର ଏବଂ ଗର୍ଭବତୀ ମହିଳାଙ୍କ ପାଇଁ 2 ବର୍ଗ ମିଟର ଚଟାଣ ସ୍ଥାନ ଆବଶ୍ଯ଼କ, ଯାହା ପ୍ରତ୍ଯ଼େକ ପ୍ରକାରର ଘର ପାଇଁ ଉପଯୁକ୍ତ।"
         ]
      },
      "cow": {
         "advisory": [
            "ମୌସୁମୀ ବର୍ଷା ଆର୍ଦ୍ରତା ଏବଂ ଜଳ ନିଷ୍କାସନ ଅଭାବ ସୃଷ୍ଟି କରିପାରେ, ଅତିରିକ୍ତ ଆର୍ଦ୍ରତାରୁ ମୁକ୍ତି ପାଇବା ପାଇଁ ବାଲି ଏବଂ ଛାଇ ବ୍ଯ଼ବହାର କରେ | ମାଛି ଏବଂ ସେମାନଙ୍କ ସହିତ ଜଡିତ ରୋଗରୁ ରକ୍ଷା ପାଇବା ପାଇଁ ଆଶ୍ରଯ଼ସ୍ଥଳୀକୁ ଫିନାଇଲ ଦ୍ୱାରା ଦୁଇଥର ସଫା କରନ୍ତୁ।",
            "ଏଫ୍. ଏମ୍. ଡି., ଏଚ୍. ଏସ୍. ଏବଂ ବି. କ୍ଯ଼ୁ. ବିରୁଦ୍ଧରେ ପଶୁମାନଙ୍କର କୃମି ଦୂରୀକରଣ ଏବଂ ଟୀକାକରଣ ସୁନିଶ୍ଚିତ କରାଯିବା ଉଚିତ କାରଣ ମୌସୁମୀ ଆରମ୍ଭ ହେବା ସହିତ (ବର୍ଷା ଋତୁରେ) ଏହା ପଶୁମାନଙ୍କ ମଧ୍ଯ଼ରେ ଦ୍ରୁତ ଗତିରେ ବ୍ଯ଼ାପିଥାଏ।"
         ]
      },
      "fresh water carp": {
         "advisory": [
            "ଦ୍ରୁତ ଗତିରେ ବଢ଼ୁଥିବା ରୋହୁ, କାଟଲା ଏବଂ ମ୍ରିଗଲ ଭଳି କାର୍ପକୁ 4ଃ3ଃ3 ଅନୁପାତରେ ମହଜୁଦ ରଖିବା ଉଚିତ, ଯାହାଦ୍ୱାରା ଏହାର ଲାଭ ବଢ଼ିପାରିବ। ସାଧାରଣତଃ, ହେକ୍ଟର ପିଛା 5,000 ଫିଙ୍ଗରଲିଙ୍ଗର ଘନତ୍ୱ ଏକ ମାନକ ଷ୍ଟକିଂ ଭାବରେ ରଖାଯାଏ | ଚିନାବାଦାମ ତେଲ କେକ୍ ଏବଂ ଚାଉଳ ଚୋପା ଷ୍ଟକିଂ ସାମଗ୍ରୀର ମୋଟ ବାଯ଼ୋମାସର 5 ପ୍ରତିଶତ ଅନୁପାତରେ ସମାନ ଅନୁପାତରେ ଦିଆଯାଏ | ପୁଷ୍କରିଣୀର ଗୁଣବତ୍ତା ବୃଦ୍ଧି ପାଇଁ ଗୋବର, ଯ଼ୁରିଆ ଏବଂ ସୁପର ଫସଫେଟ୍ ପ୍ରଯ଼ୋଗ କରାଯିବା ଉଚିତ। 8-10 ମାସରେ, ମାଛମାନେ ସେମାନଙ୍କର ବିପଣନ ଯୋଗ୍ଯ଼ ଆକାରରେ ପହଞ୍ଚନ୍ତି |"
         ]
      },
      "chicken": {
         "advisory": [
            "ବର୍ଷା ଋତୁରେ, ଚିକେନ୍ କୋକ୍ସିଡିଓସିସ୍ ଅନୁଭବ କରିପାରେ, ନିକଟତମ ପଶୁ ଚିକିତ୍ସା ବିଶେଷଜ୍ଞଙ୍କ ସୁପାରିଶ ସହିତ ଚିକେନ୍ ଫିଡରେ କୋକ୍ସିଡିଓଷ୍ଟାଟ ଦେଇପାରେ |"
         ]
      }
   },
   "date": "30-07-2024"
}