{
   "weather_details": {
      "2024-10-05": {
         "rainfall": 5,
         "t_max": 35,
         "t_min": 26,
         "rh_max": 84,
         "rh_min": 57,
         "wind_speed": 7,
         "wind_direction": 285,
         "cloud_cover": 4
      },
      "2024-10-06": {
         "rainfall": 5,
         "t_max": 34,
         "t_min": 26,
         "rh_max": 83,
         "rh_min": 52,
         "wind_speed": 7,
         "wind_direction": 292,
         "cloud_cover": 5
      },
      "2024-10-07": {
         "rainfall": 0,
         "t_max": 33,
         "t_min": 25,
         "rh_max": 85,
         "rh_min": 54,
         "wind_speed": 7,
         "wind_direction": 193,
         "cloud_cover": 4
      },
      "2024-10-08": {
         "rainfall": 10,
         "t_max": 33,
         "t_min": 25,
         "rh_max": 92,
         "rh_min": 57,
         "wind_speed": 8,
         "wind_direction": 180,
         "cloud_cover": 8
      },
      "2024-10-09": {
         "rainfall": 5,
         "t_max": 32,
         "t_min": 25,
         "rh_max": 93,
         "rh_min": 60,
         "wind_speed": 10,
         "wind_direction": 199,
         "cloud_cover": 8
      }
   },
   "names_of_crops": [
      "ଚାଉଳ",
      "ଚିନାବାଦାମ",
      "ମକା",
      "କାକୁଡ଼ି",
      "ପେଁପେ",
      "ଫୁଲକୋବି",
      "ବାଇଗଣ"
   ],
   "general_advisory": "ଧାନର ଏଚ. ୱାଇ. ଭି. ପାଇଁ ପି. ଆଇ. ପର୍ଯ୍ଯ଼ାଯ଼ରେ ଏକର ପିଛା 17 କିଲୋଗ୍ରାମ ଯ଼ୁରିଆ ପ୍ରଯ଼ୋଗ କରନ୍ତୁ। ହାଲୁକା ବାଲୁକାମଯ଼ ମାଟି କ୍ଷେତ୍ରରେ, ଏକର ପିଛା 17 କିଲୋଗ୍ରାମ ଯ଼ୁରିଆ ଏବଂ 15 କିଲୋଗ୍ରାମ ଏମଓପି ଲଗାନ୍ତୁ। ହାଇବ୍ରିଡ୍ ପାଇଁ ପି. ଆଇ. ପର୍ଯ୍ଯ଼ାଯ଼ରେ 20 କିଲୋଗ୍ରାମ ଯ଼ୁରିଆ ସହିତ 20 କିଲୋଗ୍ରାମ ଏମ୍. ଓ. ପି. ପ୍ରଯ଼ୋଗ କରନ୍ତୁ। ବିଭିନ୍ନ ସ୍ଥାଯ଼ୀ ଫସଲରେ ଫଙ୍ଗାଲ୍ ଏବଂ ବ୍ଯ଼ାକ୍ଟେରିଆ ରୋଗ (ପତ୍ର ବ୍ଲାଇଟ୍, ୱିଲ୍ଟ, ଏବଂ ରଟ୍) କୁ ପରିଚାଳନା କରିବା ପାଇଁ, ପ୍ଲାଣ୍ଟୋମାଇସିନ୍ ସହିତ ଲିଟର ପିଛା 2 ଗ୍ରାମ୍/ଲିଟର ପାଣି କିମ୍ବା (କାର୍ବେନଡାଜିମ୍ + ମାନକୋଜେବ୍) ଲିଟର ପିଛା 2 ଗ୍ରାମ୍/ଲିଟର ପାଣି ସ୍ପ୍ରେ କରନ୍ତୁ। କୁକୁଡ଼ା ଫାର୍ମକୁ ପରିଷ୍କାର ପରିଚ୍ଛନ୍ନ ରଖନ୍ତୁ, ଚାଷ ପାଇଁ ରୋଗମୁକ୍ତ କୁକୁଡ଼ା ବାଛନ୍ତୁ ଏବଂ କୁକୁଡ଼ା ପକ୍ଷୀ ରୋଗରୁ ରକ୍ଷା ପାଇବା ପାଇଁ ପର୍ଯ୍ଯ଼ାପ୍ତ କୁକୁଡ଼ା ଖାଦ୍ଯ଼ ଏବଂ ସ୍ୱଚ୍ଛ ଜଳ ପ୍ରଦାନ କରନ୍ତୁ। କୀଟପତଙ୍ଗ ଏବଂ ରୋଗର ପ୍ରକୋପ ପାଇଁ ଫସଲର ନିଯ଼ମିତ ତଦାରଖ କରାଯିବା ଉଚିତ।",
   "crops_data": {
      "rice": {
         "advisory": [
            "ପ୍ରଚଳିତ ଆର୍ଦ୍ର ଏବଂ ଆର୍ଦ୍ର ପରିସ୍ଥିତି ହେତୁ, ଫସଲରେ ହଳଦିଆ କାଣ୍ଡ ଛେଦକ ଏବଂ ପତ୍ର ଫୋଲଡର ପରି କୀଟପତଙ୍ଗର ଆକ୍ରମଣ ବୃଦ୍ଧି ପାଇପାରେ | ଧାନରେ ଲିଫ୍ ଫୋଲ୍ଡର୍ ଏବଂ କେସ୍ ୱର୍ମ୍ କୀଟକୁ ପରିଚାଳନା କରିବା ପାଇଁ, ଏକର ପିଛା 200 ମିଲି. ରେ ବାଇଫେନ୍ଥ୍ରିନ 10 ପ୍ରତିଶତ ଇସି କିମ୍ବା ଏକର ପିଛା 200 ମିଲି. ରେ ଲାମ୍ବଡା ସାଇହାଲୋଥ୍ରିନ 5 ପ୍ରତିଶତ ଇସି କିମ୍ବା ଏକର ପିଛା 400 ମିଲି. ରେ ଫିପ୍ରୋନିଲ 5 ପ୍ରତିଶତ ଏସସି କିମ୍ବା ଏକର ପିଛା 60 ମିଲି. ରେ କ୍ଲୋରାଣ୍ଟ୍ରାନିଲିପ୍ରୋଲ 18.5% ଏସସି ସ୍ପ୍ରେ କରନ୍ତୁ।",
            "ଫସଲର ପ୍ରାରମ୍ଭିକ ପର୍ଯ୍ଯ଼ାଯ଼ରେ ଧାନରେ କାଣ୍ଡ ଛେଦକକୁ ପରିଚାଳନା କରିବା ପାଇଁ, କାର୍ଟାପ୍ ହାଇଡ୍ରୋକ୍ଲୋରାଇଡ୍ 4 ପ୍ରତିଶତ ଜି @18.45-kg/ha କିମ୍ବା କ୍ଲୋରାଣ୍ଟ୍ରାନିଲିପ୍ରୋଲ୍ 0.4 ପ୍ରତିଶତ ଜିଆର @10 କିଲୋଗ୍ରାମ/ହେକ୍ଟର କିମ୍ବା ଇମିଡାକ୍ଲୋପ୍ରିଡ୍ 0.3 ପ୍ରତିଶତ ଜି @15 କିଲୋଗ୍ରାମ/ହେକ୍ଟରକୁ ବାଲି ସହିତ 1:1 ଅନୁପାତରେ ମିଶ୍ରଣ କରି ଲଗାନ୍ତୁ।",
            "ଧାନରେ ଲିଫ୍ ଫୋଲ୍ଡର୍ ଏବଂ କେସ୍ ୱର୍ମ୍ କୀଟକୁ ପରିଚାଳନା କରିବା ପାଇଁ, ଫିପ୍ରୋନିଲ୍ 5 ପ୍ରତିଶତ ଏସ୍. ସି. ହେକ୍ଟର ପିଛା 1000-ମିଲି କିମ୍ବା ପ୍ରୋଫେନୋଫସ୍ 50 ପ୍ରତିଶତ ଇ. ସି. ହେକ୍ଟର ପିଛା 1000-ମିଲି କିମ୍ବା କ୍ଲୋରାଣ୍ଟ୍ରାନିଲିପ୍ରୋଲ୍ <ଆଇ. ଡି. 1> ଏସ୍. ସି. ହେକ୍ଟର ପିଛା 200-ମିଲି ଲଗାନ୍ତୁ।",
            "ବ୍ଯ଼ାକ୍ଟେରିଆଲ୍ ଲିଫ୍ ବ୍ଲାଇଟ୍ର ପରିଚାଳନା ପାଇଁ, କପର୍ ହାଇଡ୍ରୋକ୍ସାଇଡ୍ 53.8% DF 3g/ltr କିମ୍ବା କପର୍ ଅକ୍ସିକ୍ଲୋରାଇଡ୍ 50% WP 3.0g/ltr ସ୍ପ୍ରେ କରନ୍ତୁ।",
            "ବିସ୍ଫୋରଣ ରୋଗକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ ହେକ୍ଟର ପିଛା 400-ମିଲି ହେକ୍ସାକୋନାଜୋଲ 5 ପ୍ରତିଶତ ଏସ୍. ସି. କିମ୍ବା ଏକର ପିଛା 200-ମିଲି ଡିଫେନୋକୋନାଜୋଲ ଏସ୍. ସି. କିମ୍ବା ଏକର ପିଛା 50 ପ୍ରତିଶତ ଟେବୁକୋନାଜୋଲ, ଟ୍ରାଇଫ୍ଲୋକ୍ସିସ୍ଟ୍ରୋବିନ 25 ପ୍ରତିଶତ ଡବ୍ଲୁ. ଜି. ସ୍ପ୍ରେ କରନ୍ତୁ।",
            "ସିଥ୍ ବ୍ଲାଇଟ୍ ରୋଗକୁ ପରିଚାଳନା କରିବା ପାଇଁ ରାସାଯ଼ନିକ ଭାବରେ ଭାଲିଡାମାଇସିନ୍ 3 ପ୍ରତିଶତ ଏଲ @400-ମିଲି/ଏକର କିମ୍ବା ହେକ୍ସାକୋନାଜୋଲ୍ 5 ପ୍ରତିଶତ ଏସସି @400-ମିଲି/ଏକର କିମ୍ବା ଟେବୁକୋନାଜୋଲ୍ 50 ପ୍ରତିଶତ + ଟ୍ରାଇଫ୍ଲୋକ୍ସିସ୍ଟ୍ରୋବିନ୍ 25 ପ୍ରତିଶତ ଡବ୍ଲୁଜି @80-ଗ୍ରାମ/ଏକର ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "groundnut": {
         "advisory": [
            "ବର୍ଷା ପରେ ଏହି ରୋଗର ପ୍ରକୋପ ସର୍ବାଧିକ ହୋଇଥାଏ। ଏହି ରୋଗକୁ ରୋକିବା ପାଇଁ, କାର୍ବେଣ୍ଡାଜିମ୍ 50 ପ୍ରତିଶତ ଡବ୍ଲ୍ଯ଼ୁ. ପି. @2-ଗ୍ରାମ୍/କି. ଗ୍ରା. ମଞ୍ଜି କିମ୍ବା କାରବକ୍ସିନ୍ <ଆଇ. ଡି. 1> + ଥିରମ୍ <ଆଇ. ଡି. 1> ଡି. ଏସ୍. ଡବ୍ଲ୍ଯ଼ୁ. ପି. @3-ଗ୍ରାମ୍/କି. ଗ୍ରା. ମଞ୍ଜି ବ୍ଯ଼ବହାର କରି ମଞ୍ଜି ଚିକିତ୍ସା କରାଯିବା ଉଚିତ।",
            "ଚିନାବାଦାମରେ ଷ୍ଟେମ ରୋଟ୍ ରୋଗ ପରିଚାଳନା ପାଇଁ, ଭାଲିଡାମାଇସିନ୍ 3 ପ୍ରତିଶତ ଏଲ @400-ମିଲି/ଏକର କିମ୍ବା କ୍ୟାପଟାନ 70 ପ୍ରତିଶତ + ହେକ୍ସାକୋନାଜୋଲ 5 ପ୍ରତିଶତ @300-ଗ୍ରାମ/ଏକର ସ୍ପ୍ରେ କରନ୍ତୁ। ଏହି କବକନାଶକକୁ ସିଞ୍ଚନ କରିବା ପାଇଁ ଏକର ପିଛା 200 ଲିଟର ପାଣି ଆବଶ୍ୟକ ହୋଇଥାଏ।"
         ]
      },
      "maize": {
         "advisory": [
            "ଶରତ ସେନା କୀଟକୁ ପରିଚାଳନା କରିବା ପାଇଁ, 200-ଲିଟର ପାଣିରେ ମିଶାଇ ଏକର ପିଛା 1200-ଗ୍ରାମ୍ ବାଯ଼ୋପେଷ୍ଟିସାଇଡ୍ ବେଉଭେରିଆ ବାସିଆନା ସ୍ପ୍ରେ କରନ୍ତୁ।",
            "ଏକର ପିଛା 10-12 ପକ୍ଷୀ ପର୍ଚ୍ ବ୍ଯ଼ବହାର କରନ୍ତୁ ଏବଂ ଟାସେଲିଂ ପର୍ଯ୍ଯ଼ାଯ଼ ପୂର୍ବରୁ ସେଗୁଡ଼ିକୁ ବାହାର କରନ୍ତୁ |",
            "ପତ୍ର ଚକ୍ର ଭିତରେ ବାଲି, ମାଟି ଏବଂ କାଠର ଛାଇର ଧୂଳି ମିଶ୍ରଣ ଯାହା ଦ୍ୱାରା କ୍ଯ଼ାଟର୍ପିଲାର୍ମାନେ ପତ୍ରକୁ ଖାଇପାରିବେ ନାହିଁ |",
            "ରାସାଯ଼ନିକ ଉପାଯ଼ରେ ଏହି କୀଟକୁ ନିଯ଼ନ୍ତ୍ରଣ କରିବା ପାଇଁ ଇମାମେକ୍ଟିନ୍ ବେନ୍ଜୋଏଟ୍ 5 ପ୍ରତିଶତ ଏସ୍. ଜି. @80-ଗ୍ରାମ୍/ଏକର କିମ୍ବା ସ୍ପିନେଟୋରାମ୍ <ଆଇ. ଡି. 2> ଏସ୍. ସି. @100-ମିଲି/ଏକର କିମ୍ବା କ୍ଲୋରାଣ୍ଟ୍ରାନିଲିପ୍ରୋଲ୍ <ଆଇ. ଡି. 1> ଏସ୍. ସି. @80-ମିଲି/ଏକରକୁ 200-ଲିଟର ପାଣିରେ ମିଶାଇ ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "cucumber": {
         "advisory": [
            "କାକୁଡ଼ିରେ ଏପିଲାକ୍ନା ବିଟଲ୍କୁ ପରିଚାଳନା କରିବା ପାଇଁ, ସଂକ୍ରମଣର ପ୍ରାରମ୍ଭିକ ପର୍ଯ୍ଯ଼ାଯ଼ରେ ନିମ୍ବ-ଆଧାରିତ କୀଟନାଶକ (ନିମ୍ବ ତେଲ 1500 ପିପିଏମ) ଲିଟର ପିଛା 3 ମିଲି ପାଣି ସ୍ପ୍ରେ କରନ୍ତୁ।",
            "ଏପିଲାକ୍ନା ବିଟଲ୍କୁ ରାସାଯ଼ନିକ ଭାବେ ପରିଚାଳନା କରିବା ପାଇଁ କ୍ଲୋରପିରିଫସ୍ 20 ପ୍ରତିଶତ ଇସି @2 ମିଲି/ଲିଟର ପାଣି କିମ୍ବା ପ୍ରୋଫେନୋଫସ୍ 50 ପ୍ରତିଶତ ଇସି @2 ମିଲି/ଲିଟର ପାଣି ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "papaya": {
         "advisory": [
            "ସଂକ୍ରମଣର ପ୍ରାରମ୍ଭିକ ପର୍ଯ୍ଯ଼ାଯ଼ରେ କ୍ଷୁଦ୍ର କୀଟକୁ ପରିଚାଳନା କରିବା ପାଇଁ, ନିମ-ଆଧାରିତ କୀଟନାଶକ (ନିମ ତେଲ 1500 ପିପିଏମ @30-ମିଲି/10-ଲିଟର ପାଣି କିମ୍ବା କୀଟନାଶକ ସାବୁନ) ସ୍ପ୍ରେ କରନ୍ତୁ।",
            "ଗୁରୁତର ସଂକ୍ରମଣ କ୍ଷେତ୍ରରେ, ପ୍ରୋଫେନ୍ଫସ୍ 50 ପ୍ରତିଶତ ଇସି @20-ମିଲି/10-ଲିଟର ପାଣି କିମ୍ବା ଥିୟାମେଥୋକ୍ସାମ୍ 25 ପ୍ରତିଶତ ଡବ୍ଲୁଜି @3-ଗ୍ରାମ୍/10-ଲିଟର ପାଣି ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "cauliflower": {
         "advisory": [
            "ଫୁଲକୋବି, ବନ୍ଧାକୋବି ଏବଂ ବ୍ରୋକୋଲି ପାଇଁ ଉନ୍ନତ କିସମ ପାଇଁ 200 ଗ୍ରାମ୍ ଏବଂ ହାଇବ୍ରିଡ୍ ମଞ୍ଜି ପାଇଁ 50 ଗ୍ରାମ୍ ମଞ୍ଜି ମୂଲ୍ଯ଼ ରହିଛି।",
            "ଏକ ଏକର ଚାଷ ପାଇଁ, 3 ମିଟର ଲମ୍ବ, 1 ମିଟର ଓସାର ଏବଂ 1 ସେ. ମି. ଉଚ୍ଚତା ବିଶିଷ୍ଟ 10-12 ନର୍ସରୀ ଶଯ୍ଯ଼ା ପ୍ରସ୍ତୁତ କରନ୍ତୁ।",
            "ବୁଣିବାର ଦଶ ଦିନ ପୂର୍ବରୁ ପ୍ରତ୍ୟେକ ନର୍ସରୀ ଶଯ୍ୟାରେ 20 କିଲୋଗ୍ରାମ ସମ୍ପୂର୍ଣ୍ଣ ଅପଘଟିତ ଏଫ୍. ଆଇ. ଏମ୍. ଲଗାନ୍ତୁ।"
         ]
      },
      "brinjal": {
         "advisory": [
            "ବାଇଗଣ ଫୁଲ ଫୁଟାଇବା ଠାରୁ ଆରମ୍ଭ କରି ଫଳ ଧାରଣ କରିବା ପର୍ଯ୍ୟନ୍ତ ପର୍ଯ୍ୟାୟରେ ରହିଛି। ବର୍ଷା ହ୍ରାସ ପାଇବା ପରେ ଏବଂ ଦିନ ଓ ରାତିର ତାପମାତ୍ରା ବୃଦ୍ଧି ହେବାର ସମ୍ଭାବନା ରହିଛି ଏବଂ ସକାଳ ଆପେକ୍ଷିକ ଆର୍ଦ୍ରତା 70 ପ୍ରତିଶତରୁ ଅଧିକ ବାଇଗଣରେ ଶୁଟ୍ ଏବଂ ଫଳ ଛେଦକକୁ ପସନ୍ଦ କରେ |",
            "କୀଟକୁ ପରିଚାଳନା କରିବା ପାଇଁ, ଛିଦ୍ର ଏବଂ ପ୍ରଭାବିତ ଫଳ ଦେଖାଇଥିବା ପ୍ରଭାବିତ ଟର୍ମିନାଲ୍ ଶୁଟ୍ ଅପସାରଣ କରନ୍ତୁ |",
            "ଏହି କୀଟକୁ ନିଯ଼ନ୍ତ୍ରଣ କରିବା ପାଇଁ, ଏକର ପିଛା ଲିଉସିନ୍ ଲ୍ଯ଼ୁର୍ ଥିବା 8ଟି ଫେରୋମୋନ୍ ଫାନ୍ଦ ଲଗାନ୍ତୁ।",
            "ରାସାଯ଼ନିକ ନିଯ଼ନ୍ତ୍ରଣ ବ୍ଯ଼ବହାର କରନ୍ତୁ ଯଦି ଟର୍ମିନାଲ୍ ଶୁଟର 4 ପ୍ରତିଶତ ଶୁଖିଲା ଅଛି କିମ୍ବା 14 ପ୍ରତିଶତ ଫଳ ବୋରର ଦ୍ୱାରା ସଂକ୍ରମିତ |",
            "ରାସାୟନିକ ନିୟନ୍ତ୍ରଣ ପାଇଁ, ଏମାମେକ୍ଟିନ୍ ବେନ୍ଜୋଏଟ୍ 5 ପ୍ରତିଶତ ଏସ୍ଜି @80-ଗ୍ରାମ୍/ଏକର କିମ୍ବା କ୍ଲୋରାଣ୍ଟ୍ରାନିଲିପ୍ରୋଲ୍ 18.5% ଏସ୍ସି @80-ମିଲି/ଏକର କିମ୍ବା ସ୍ପିନେଟୋରାମ୍ 11.7% ଏସ୍ସି @200-ମିଲି/ଏକର ସ୍ପ୍ରେ କରନ୍ତୁ।",
            "କୀଟନାଶକ ପ୍ରଯ଼ୋଗ ଏବଂ ଅମଳ ମଧ୍ଯ଼ରେ 7-10 ଦିନର ବ୍ଯ଼ବଧାନ ରହିବା ଉଚିତ୍। ଉପରୋକ୍ତ ଯେ କୌଣସି କୀଟନାଶକକୁ 15 ଦିନର ବ୍ଯ଼ବଧାନରେ ବିକଳ୍ପ ଭାବେ ବ୍ଯ଼ବହାର କରନ୍ତୁ।"
         ]
      }
   },
   "date": "04-10-2024"
}