{
   "weather_details": {
      "2025-02-08": {
         "rainfall": 0.0,
         "t_max": 32,
         "t_min": 16,
         "rh_max": 48,
         "rh_min": 14,
         "wind_speed": 4,
         "wind_direction": 351,
         "cloud_cover": 2
      },
      "2025-02-09": {
         "rainfall": 0.0,
         "t_max": 32,
         "t_min": 15,
         "rh_max": 46,
         "rh_min": 13,
         "wind_speed": 3,
         "wind_direction": 348,
         "cloud_cover": 2
      },
      "2025-02-10": {
         "rainfall": 0.0,
         "t_max": 32,
         "t_min": 14,
         "rh_max": 57,
         "rh_min": 13,
         "wind_speed": 2,
         "wind_direction": 334,
         "cloud_cover": 1
      },
      "2025-02-11": {
         "rainfall": 0.0,
         "t_max": 32,
         "t_min": 14,
         "rh_max": 71,
         "rh_min": 16,
         "wind_speed": 3,
         "wind_direction": 262,
         "cloud_cover": 1
      },
      "2025-02-12": {
         "rainfall": 0.0,
         "t_max": 33,
         "t_min": 14,
         "rh_max": 64,
         "rh_min": 17,
         "wind_speed": 3,
         "wind_direction": 243,
         "cloud_cover": 0
      }
   },
   "names_of_crops": [
      "ଚାଉଳ",
      "ଚିନାବାଦାମ",
      "ସବୁଜ ଚଣା",
      "ସୂର୍ଯ୍ୟମୁଖୀ",
      "ସୋରିଷ",
      "ମେନାସିନାକାହି",
      "ଲଙ୍କା",
      "ଫୁଲକୋବି",
      "କଦଳୀ",
      "ବାଇଗଣ",
      "ଟମାଟୋ",
      "ମାରିଗୋଲ୍ଡ",
      "କଦଳୀ",
      "ଗାଈ।",
      "ଛେଳି।",
      "ମଧୁର ଜଳ"
   ],
   "general_advisory": "କୁହୁଡ଼ି ଏବଂ ଆର୍ଦ୍ରତା ଚାପରୁ କ୍ଷତିକୁ ରୋକିବା ପାଇଁ ସକାଳ ସମୟରେ ଠିଆ ହୋଇଥିବା ପନିପରିବା ଏବଂ ଫସଲକୁ ହାଲୁକା ଜଳସେଚନ ପ୍ରଦାନ କରନ୍ତୁ | କୁହୁଡ଼ି ପରିସ୍ଥିତି ହେତୁ ରବି ଫସଲ ଏବଂ ପନିପରିବାରେ ଶୋଷକ କୀଟ, ପତ୍ର ରୋଗ, ପାଉଡର ଫଙ୍ଗୁର ସଂକ୍ରମଣ ହେବାର ସମ୍ଭାବନା ରହିବ। ଫସଲ ଏବଂ ପନିପରିବା ଉପରେ ନଜର ରଖନ୍ତୁ, ଯଦି ଲକ୍ଷଣ ଦେଖାଯାଏ, ଉପଯୁକ୍ତ ଉଦ୍ଭିଦ ସୁରକ୍ଷା ପଦକ୍ଷେପ ଗ୍ରହଣ କରନ୍ତୁ। ରବି ପନିପରିବାରେ ନିଡ଼ାଇ, ହୋଇଂ ଏବଂ ଅନ୍ୟାନ୍ୟ ଆନ୍ତଃସାଂସ୍କୃତିକ କାର୍ଯ୍ୟକଳାପ କରନ୍ତୁ | କୋଇଲା ଫସଲରେ ମାଟିର ଆର୍ଦ୍ରତା ଏବଂ ପାଣିପାଗ ସ୍ଥିତି ଉପରେ ନିର୍ଭର କରି 7ରୁ 8 ଦିନ ବ୍ୟବଧାନରେ ଜଳସେଚନ କରାଯିବା ଉଚିତ।",
   "crops_data": {
      "rice": {
         "advisory": [
            "ଯେଉଁ କୃଷକମାନେ ରୋପଣ ପାଇଁ ଯାଉଛନ୍ତି, ସେମାନେ ଶେଷ ପୋଖରୀରେ ଏକର ପିଛା 35 କିଲୋଗ୍ରାମ ଡିଏପି, 30 କିଲୋଗ୍ରାମ ଏମଓପି ଏବଂ 8 କିଲୋଗ୍ରାମ ୟୁରିଆ ଲଗାଇବା ଉଚିତ। ବାଲୁକାମୟ ମୃତ୍ତିକା ପାଇଁ ଏକର ପିଛା 35 କିଲୋଗ୍ରାମ ଡିଏପି, 15 କିଲୋଗ୍ରାମ ଏମଓପି ଏବଂ 8 କିଲୋଗ୍ରାମ ୟୁରିଆ ଲଗାନ୍ତୁ। ଜିଙ୍କ ଅଭାବ ଥିବା ମାଟିରେ ଜିଙ୍କ ସଲ୍ଫେଟ୍ (21 ପ୍ରତିଶତ) ପ୍ରତି ତିନି ବର୍ଷରେ ଏକର ପିଛା 10 କିଲୋଗ୍ରାମ ଲେଖାଏଁ ଲଗାନ୍ତୁ। 20 x 15 ସେ. ମି. ବ୍ୟବଧାନରେ 25-30 ଦିନ ପୁରୁଣା ଚାରା ରୋପଣ କରାଯିବା ଉଚିତ, ଅଧିକ ଉତ୍ପାଦନକ୍ଷମ ପ୍ରଜାତି ପାଇଁ ପ୍ରତି ପାହାଡ଼ରେ 2ରୁ 3 ଚାରା ରୋପଣ କରାଯିବା ଉଚିତ।"
         ]
      },
      "groundnut": {
         "advisory": [
            "ବାଲିଡାମାଇସିନ୍ 3 ପ୍ରତିଶତ ଏଲ @400-ମିଲି/ଏକର କିମ୍ବା କ୍ୟାପଟାନ 70 ପ୍ରତିଶତ + ହେକ୍ସାକୋନାଜୋଲ 5 ପ୍ରତିଶତ ଡବ୍ଲ୍ୟୁ. ପି. @300-ଗ୍ରାମ/ଏକର ସହିତ ଚିନାବାଦାମ ଗର୍ତ୍ତ ମାଟିରେ କାଣ୍ଡ ପଚାକୁ ନିୟନ୍ତ୍ରଣ କରିବା।"
         ]
      },
      "green gram": {
         "advisory": [
            "20-25 DAS ରେ 200 ଲିଟର ପାଣି ସହିତ ମିଶ୍ରଣ କରି କ୍ବିଜାଲ୍ଫପ୍-ଇଥାଇଲ 5 ପ୍ରତିଶତ ଇସି କିମ୍ବା ଇମାଜେଥାପାଇର୍ 10 SL @300 ମିଲି/ଏକର ପ୍ରୟୋଗ କରନ୍ତୁ। ପତ୍ର ଖାଉଥିବା କ୍ୟାଟର୍ପିଲାର୍ଃ କୀଟପତଙ୍ଗ ସାଧାରଣତଃ କୋମଳ ଯୁବା ପତ୍ରକୁ ଖାଇଥାନ୍ତି। ଏହାର ନିୟନ୍ତ୍ରଣ ପାଇଁ ଏକର ପିଛା ପ୍ରୋଫେନୋଫସ୍ 50 ଇସି 400 ମିଲି ସହିତ 200 ଲିଟର ପାଣି ମିଶାଇ ସ୍ପ୍ରେ କରନ୍ତୁ। ଏଫିଡ୍ ଏବଂ ହ୍ୱାଇଟ୍ଫ୍ଲାଇଃ ଏଫିଡ୍ ଏବଂ ହ୍ୱାଇଟ୍ ମାଛି ପରି ଶୋଷକ କୀଟପତଙ୍ଗ ଘଟଣା ପାଇଁ ପ୍ରଚଳିତ ପାଣିପାଗ ସ୍ଥିତି ଅନୁକୂଳ | କୀଟ ସଂଖ୍ୟା ଉପରେ ନଜର ରଖିବା ପାଇଁ ଉଦ୍ଭିଦ ସ୍ତରରେ ଏକର ପିଛା 8 ନିୟୁତ ହଳଦିଆ ଚଟପଟା ଜାଲ ଲଗାନ୍ତୁ ଏବଂ ସଂକ୍ରମଣର ପ୍ରାରମ୍ଭିକ ପର୍ଯ୍ୟାୟରେ ନିମ୍ବ ତେଲ ଆଧାରିତ କୀଟନାଶକ ଆଜାଦିରାକ୍ଟିନ 0.03% (300 ପିପିଏମ) ଲିଟର ପିଛା 5 ମିଲି ପାଣି ଲଗାନ୍ତୁ।"
         ]
      },
      "sunflower": {
         "advisory": [
            "ୟୁରିଆର ଅଧା ମାତ୍ରା (ଇନବ୍ରେଡ୍-6 କେଜି/ଏସି, ହାଇବ୍ରିଡ୍-12 କେଜି/ଏସି) + ଏମଓପିର ଅଧା ମାତ୍ରା (ଇନବ୍ରେଡ୍-10 କେଜି/ଏସି, ହାଇବ୍ରିଡ୍-20 କେଜି/ଏସି) ଦ୍ୱିତୀୟ ଜଳସେଚନ ସମୟରେ ଦ୍ୱିତୀୟ ଶୀର୍ଷ ଡ୍ରେସିଂ ଭାବରେ ପ୍ରୟୋଗ କରନ୍ତୁ। ଶୋଷକ କୀଟ କମ୍ପ୍ଲେକ୍ସ (ଏଫିଡ୍, ହପର୍, ଥ୍ରିପ୍ସ ଏବଂ ହ୍ୱାଇଟ୍ ମାଛି): ପ୍ରଚଳିତ ପାଣିପାଗ ସ୍ଥିତି ଶୋଷକ କୀଟଗୁଡ଼ିକର ବିକାଶକୁ ସମର୍ଥନ କରେ | ଏସିଟାମିପ୍ରିଡ୍ 20 ପ୍ରତିଶତ ଏସ. ପି. @50 ଗ୍ରାମ/ଏକର କିମ୍ବା ଇମିଡାକ୍ଲୋପ୍ରିଡ୍ 17.8% ଏସ. ଏଲ. @60 ମିଲି/ଏକରକୁ 200 ଲିଟର ପାଣି ସହିତ ମିଶାଇ ଆବଶ୍ୟକ ଅନୁଯାୟୀ ସ୍ପ୍ରେ କରିବା ପାଇଁ ପରାମର୍ଶ ଦିଆଯାଇଛି। ପାଉଡର ଫଙ୍ଗୁରଃ 2 ଗ୍ରାମ/ଲିଟର ପାଣି ଦେଇ 0.2% ଓଦା ସଲଫର୍ ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "mustard": {
         "advisory": [
            "ଶୀଘ୍ର ବୁଣାଯାଇଥିବା ସୋରିଷ ଫସଲରେ ଏଫିଡ୍ ସଂକ୍ରମଣ ହେବାର ସମ୍ଭାବନା ରହିଛି। ପ୍ରାରମ୍ଭିକ ପର୍ଯ୍ୟାୟରେ ଏଫିଡ୍ ପରିଚାଳନା କରିବାକୁ, ଏକର ପିଛା 8 ଟି ହଳଦିଆ ଷ୍ଟିକ୍ ଟ୍ରାପ୍ ଲଗାନ୍ତୁ | 200 ଲିଟର ପାଣିରେ ମିଶ୍ରଣ କରି ନିମ୍ବ ଆଧାରିତ କୀଟନାଶକ 1500 ପିପିଏମ @600-ମିଲି/ଏକର ସ୍ପ୍ରେ କରନ୍ତୁ। ଯଦି ସଂକ୍ରମଣ ଗୁରୁତର ହୁଏ, ତା \"ହେଲେ ରାସାୟନିକ କୀଟନାଶକ 'ଥାୟାମେଥୋକ୍ସାମ୍\" ସ୍ପ୍ରେ କରନ୍ତୁ, 25 ପ୍ରତିଶତ ଡବ୍ଲୁ. ଜି. @40 ଗ୍ରାମ୍/ଏକର କିମ୍ବା ଏସିଟାମିପ୍ରିଡ୍ 20 ପ୍ରତିଶତ ଏସ୍. ପି. @50 ଗ୍ରାମ୍/ଏକର, 200 ଲିଟର ପାଣିରେ ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "menacinakahi": {
         "advisory": [
            "କୀଟ ସଂକ୍ରମଣର ପ୍ରାଥମିକ ପର୍ଯ୍ୟାୟରେ ଲଙ୍କାରେ ଏଫିଡ୍ ଏବଂ ଥ୍ରିପ୍ସକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ 200 ଲିଟର ପାଣିରେ ମିଶାଇ ଏକର ପିଛା 600-ମିଲି ପିଛା ନିମ୍ବ ଆଧାରିତ କୀଟନାଶକ 1500 ପିପିଏମ ସ୍ପ୍ରେ କରନ୍ତୁ। ଥିୟାମେଥୋକ୍ସାମ୍ 25 ପ୍ରତିଶତ ଡବ୍ଲୁ. ଜି. @40 ଗ୍ରାମ୍/ଏକର କିମ୍ବା ଏସିଟାମିପ୍ରିଡ୍ 20 ପ୍ରତିଶତ ଏସ. ପି. @50 ଗ୍ରାମ୍/ଏକର କିମ୍ବା ପ୍ରୋଫେନୋଫସ୍ 40 ପ୍ରତିଶତ + ଫେନପାଇରୋକ୍ସିମେଟ୍ 2.5 ପ୍ରତିଶତ ଇ. ସି. @400-ମିଲି/ଏକର ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "chilli": {
         "advisory": [
            "କୀଟ ସଂକ୍ରମଣର ପ୍ରାଥମିକ ପର୍ଯ୍ୟାୟରେ ଲଙ୍କାରେ ଏଫିଡ୍ ଏବଂ ଥ୍ରିପ୍ସକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ 200 ଲିଟର ପାଣିରେ ମିଶାଇ ଏକର ପିଛା 600-ମିଲି ପିଛା ନିମ୍ବ ଆଧାରିତ କୀଟନାଶକ 1500 ପିପିଏମ ସ୍ପ୍ରେ କରନ୍ତୁ। ଥିୟାମେଥୋକ୍ସାମ୍ 25 ପ୍ରତିଶତ ଡବ୍ଲୁ. ଜି. @40 ଗ୍ରାମ୍/ଏକର କିମ୍ବା ଏସିଟାମିପ୍ରିଡ୍ 20 ପ୍ରତିଶତ ଏସ. ପି. @50 ଗ୍ରାମ୍/ଏକର କିମ୍ବା ପ୍ରୋଫେନୋଫସ୍ 40 ପ୍ରତିଶତ + ଫେନପାଇରୋକ୍ସିମେଟ୍ 2.5 ପ୍ରତିଶତ ଇ. ସି. @400-ମିଲି/ଏକର ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "cauliflower": {
         "advisory": [
            "ବ୍ରାଉନ୍ ରଟ୍ କୁ ରୋକିବା ପାଇଁ କୋଲ୍ ଫସଲରେ ରୋପଣ ସମୟରେ ମାଟି ପ୍ରୟୋଗ ଭାବରେ ଏକର ପିଛା 4 କିଲୋଗ୍ରାମ ବୋରାକ୍ସ ଲଗାନ୍ତୁ | ଯଦି ଚାରା ରୋପଣ ସମୟରେ ବୋରାକ୍ସ ପ୍ରୟୋଗ କରାଯାଇନଥାଏ, ତେବେ ବୋରାକ୍ସ @2.5 ଗ୍ରାମ/ଲିଟର କିମ୍ବା ଫୋଲିବୋର/ସଲ୍ୟୁବର @1.5 ଗ୍ରାମ/ଲିଟର ସ୍ପ୍ରେ କରନ୍ତୁ। ପ୍ରତିରୋପଣର ଦୁଇ ସପ୍ତାହ ପରେ ଏବଂ ଦହି ତିଆରି ହେବାର ଦୁଇ ସପ୍ତାହ ପୂର୍ବରୁ ବୋରନ ମାଇକ୍ରୋ ନ୍ୟୁଟ୍ରିଏଣ୍ଟ ସିଞ୍ଚନ କରାଯିବା ଉଚିତ।"
         ]
      },
      "cabbage": {
         "advisory": [
            "ଶୀଘ୍ର ରୋପଣ କରାଯାଇଥିବା କୋଲ୍ ଫସଲରେ ଡିମଣ୍ଡ ବ୍ୟାକ୍ ମଥ୍ର ସଂକ୍ରମଣ ହେବାର ସମ୍ଭାବନା ରହିଛି। ଏହି କ୍ଷତି ପତ୍ର ତନ୍ତୁରେ ସୁଡ଼ଙ୍ଗ ଖୋଳିବା କିମ୍ବା ପତ୍ର ବ୍ଲେଡର ତଳ ପୃଷ୍ଠର ଏପିଡର୍ମାଲ୍ ପତ୍ର ତନ୍ତୁଗୁଡ଼ିକୁ ସ୍କ୍ରାପ୍ କରିବା ଦ୍ୱାରା ହୋଇଥାଏ, ଯାହା ପତ୍ରରେ ସାଧାରଣ ଧଳା ଦାଗ ସୃଷ୍ଟି କରିଥାଏ। ଏହି କୀଟକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ, ଏକର ପିଛା 6ରୁ 8ଟି ହାଲୁକା ଫାନ୍ଦ ଲଗାନ୍ତୁ। କୀଟ ସଂକ୍ରମଣର ପ୍ରାଥମିକ ପର୍ଯ୍ୟାୟରେ 200 ଲିଟର ପାଣିରେ ମିଶ୍ରଣ କରି ଏକର ପିଛା 1 ଲିଟର ନିମ୍ବ ଆଧାରିତ କୀଟନାଶକ ସ୍ପ୍ରେ କରନ୍ତୁ। ଏହି କୀଟକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ ରାସାୟନିକ ଉପାୟରେ ଟଲ୍ଫେନ୍ପାଇରାଡ୍ 15 ପ୍ରତିଶତ ଇସି @400-ମିଲି/ଏକର କିମ୍ବା ଫ୍ଲୁବେଣ୍ଡିଆମାଇଡ୍ 20 ପ୍ରତିଶତ ଡବ୍ଲୁଜି @20-ଗ୍ରାମ୍/ଏକର କିମ୍ବା ଇମାମେକ୍ଟିନ୍ ବେନ୍ଜୋଏଟ୍ 5 ପ୍ରତିଶତ ଏସ୍ଜି @80-ଗ୍ରାମ୍/ଏକରକୁ 200-ଲିଟର ପାଣିରେ ମିଶାଇ ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "brinjal": {
         "advisory": [
            "ବାଇଗଣ ଏବଂ ଟମାଟୋ ଫସଲରେ ଧଳା ମାଛି ପରିଚାଳନା କରିବା ପାଇଁ, କୀଟପତଙ୍ଗମାନଙ୍କୁ ଆକର୍ଷିତ କରିବା ଏବଂ ମାରିବା ପାଇଁ @8-10 ଏକର ହଳଦିଆ ଚଟପଟା ଜାଲ ବ୍ୟବହାର କରନ୍ତୁ। କୀଟ ସଂକ୍ରମଣର ପ୍ରାଥମିକ ପର୍ଯ୍ୟାୟରେ 200 ଲିଟର ପାଣିରେ ମିଶ୍ରଣ କରି ନିମ୍ବ ଆଧାରିତ କୀଟନାଶକ 1500 ପିପିଏମ @600-ମିଲି/ଏକର ସ୍ପ୍ରେ କରନ୍ତୁ। ଏହି କୀଟକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ ରାସାୟନିକ ଉପାୟରେ ଥିୟାମେଥୋକ୍ସାମ୍ 25 ପ୍ରତିଶତ ଡବ୍ଲୁ. ଜି. @40-ଗ୍ରାମ/ଏକର କିମ୍ବା ପାଇରିପ୍ରୋକ୍ସିଫେନ୍ 10 ପ୍ରତିଶତ ଇ. ସି. @200-ମିଲି/ଏକର କିମ୍ବା ସ୍ପାଇରୋମେସିଫେନ୍ 22.9% ଏସ୍. ସି. @250-ମିଲି/ଏକରକୁ 200 ଲିଟର ପାଣିରେ ମିଶାଇ ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "tomato": {
         "advisory": [
            "ଟମାଟୋରେ ଫଳ ଛେଦକକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ, ପ୍ରଥମେ ପ୍ରଭାବିତ ଫଳ ଏବଂ ବିକଶିତ ଲାର୍ଭା ସଂଗ୍ରହ କରି ନଷ୍ଟ କରନ୍ତୁ। ଏକର ପିଛା ହେଲିଲ୍ୟୁର ବିଶିଷ୍ଟ 20ଟି ଫେରୋମୋନ୍ ଫାନ୍ଦ ସ୍ଥାପନ କରନ୍ତୁ। ଯଦି 10 ପ୍ରତିଶତ ଫଳ ଛେଦକ ଦ୍ୱାରା ସଂକ୍ରମିତ, ତେବେ କୀଟନାଶକ ସିଞ୍ଚନ କରନ୍ତୁ। କ୍ଲୋରାଣ୍ଟ୍ରାନିଲିପ୍ରୋଲ 18.5% S. C. @80 ମିଲି/ଏକର କିମ୍ବା ଫ୍ଲୁବେଣ୍ଡିଆମାଇଡ୍ 39.5% M/M. S. C. @40 ମିଲି/ଏକର କିମ୍ବା ଇଣ୍ଡୋକ୍ସାକାର୍ବ 14.5% S. C. @200 ମିଲି/ଏକର ସ୍ପ୍ରେ କରନ୍ତୁ। ଉପରୋକ୍ତ ଯେ କୌଣସି କୀଟନାଶକକୁ 15 ଦିନର ବ୍ୟବଧାନରେ ବିକଳ୍ପ ଭାବେ ବ୍ୟବହାର କରନ୍ତୁ।"
         ]
      },
      "marigold": {
         "advisory": [
            "ମାରିଗୋଲ୍ଡ ଏବଂ ଗୋଲାପ ପରି ଫୁଲରେ ରେଡ୍ ସ୍ପାଇଡର ମାଇଟ୍କୁ ପରିଚାଳନା କରିବା ପାଇଁ ଓଦା ସଲଫର୍ 80 ପ୍ରତିଶତ ଡବ୍ଲ୍ୟୁ. ପି. @2 ଗ୍ରାମ୍/ଲିଟର ପାଣି କିମ୍ବା ପ୍ରୋପାର୍ଜାଇଟ୍ 57 ପ୍ରତିଶତ ଇସି @2 ମିଲି/ଲିଟର ପାଣି କିମ୍ବା ଫେନପାଇରୋକ୍ସିମେଟ୍ 5 ପ୍ରତିଶତ ଇସି @2 ମିଲି/ଲିଟର ପାଣି ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "pumpkin": {
         "advisory": [
            "କାକୁଡ଼ିରେ ଫଳ ମାଛି ପରିଚାଳନା କରିବା ପାଇଁ, 4 ଲିଟର ପାଣିରେ 400-ଗ୍ରାମ ଗୁଡ଼ ଏବଂ 8-ମିଲି ମାଲାଥିଅନ୍ କିମ୍ବା ଡି. ଡି. ଭି. ପି. ମିଶାଇ ଏକ ବିଷାକ୍ତ ଚାରା ପ୍ରସ୍ତୁତ କରନ୍ତୁ। ଏହି ମିଶ୍ରଣକୁ ପ୍ଲାଷ୍ଟିକ୍ କପ୍ କିମ୍ବା ମାଟି ପାତ୍ରରେ ରଖନ୍ତୁ @80-ସଂଖ୍ୟା/ଏକର। ଫଳ ମାଛିମାନେ ଏହା ପ୍ରତି ଆକର୍ଷିତ ହେବେ ଏବଂ ଶେଷରେ ବିଷ ଜାଲରେ ପଡ଼ି ମୃତ୍ୟୁବରଣ କରିବେ।"
         ]
      },
      "cow": {
         "advisory": [
            "ଯଦି ପଶୁମାନଙ୍କୁ ଏପର୍ଯ୍ୟନ୍ତ ଏଫ୍. ଏମ୍. ଡି., ରକ୍ତସ୍ରାବଜନିତ ସେପ୍ଟିସେମିଆ, ବ୍ଲାକ୍ କ୍ୱାର୍ଟର୍, ଏଣ୍ଟେରୋଟକ୍ସିମିଆ ଇତ୍ୟାଦି ବିରୁଦ୍ଧରେ ଟୀକାକରଣ କରାଯାଇ ନାହିଁ, ତେବେ ଏଗୁଡ଼ିକ କରିବା ଆବଶ୍ୟକ | କେତେକ ଅଞ୍ଚଳରେ ଶୀତ ଋତୁରେ ଉପୁଜିଥିବା ଅଭାବ ସମୟ ପାଇଁ ପଶୁଖାଦ୍ୟ ସଂରକ୍ଷଣ/କ୍ରୟ କରିବା ପାଇଁ ଉପଯୁକ୍ତ ଯତ୍ନ ନିଆଯିବା ଉଚିତ। ଏହି ସମୟରେ ବହୁବର୍ଷିଆ ଘାସ କାଟିବା ଆବଶ୍ୟକ।"
         ]
      },
      "goat": {
         "advisory": [
            "ଟିପିପିଆର ରୋଗ, ଯାହାକୁ 'ଛେଳି ପ୍ଲେଗ୍' ମଧ୍ୟ କୁହାଯାଏ, ଶୀତ ଋତୁରେ ସାଧାରଣ ହୋଇଥାଏ। ଏହି ଭାଇରାଲ ରୋଗ ଯାହା ଛେଳି ଏବଂ ମେଣ୍ଢାଙ୍କୁ ପ୍ରଭାବିତ କରେ ଯାହା ହଠାତ୍ ଜ୍ୱର, ନିମୋନିଆ ଏବଂ କାଶ ସୃଷ୍ଟି କରେ | ପ୍ରଭାବିତ ପ୍ରାଣୀମାନେ ଅସ୍ଥିର ଦେଖାଯାଆନ୍ତି, ଏକ ନିସ୍ତେଜ କୋଟ, ଶୁଖିଲା ଥଣ୍ଡ ଏବଂ ଅବସାଦଗ୍ରସ୍ତ କ୍ଷୁଧା | ଗର୍ଭବତୀ ପଶୁମାନଙ୍କର ଗର୍ଭପାତ ହୋଇପାରେ। ପଶୁମାନଙ୍କୁ ଟିକା ଦିଅନ୍ତୁ।"
         ]
      },
      "freshwater": {
         "advisory": [
            "ଶୀତ ଋତୁରେ, ମାଛରେ \"ଇ. ୟୁ. ଏସ୍\". ରୋଗ ହେବାର ସମ୍ଭାବନା ଥାଏ। ପ୍ରତିଷେଧକ ପଦକ୍ଷେପ ସ୍ୱରୂପ କୃଷକମାନଙ୍କୁ ଏକ ଏକର ପୋଖରୀ ଅଞ୍ଚଳରେ 40 ଲିଟର ପାଣି ସହିତ 400 ମିଲିଲିଟର ସିଫ୍ୟାକ୍ସ ଲଗାଇବାକୁ ପରାମର୍ଶ ଦିଆଯାଇଛି। ମାଛମାନଙ୍କୁ ପ୍ରତିଦିନ ସେମାନଙ୍କର ମୋଟ ଜୈବବସ୍ତୁର 2-3% ହାରରେ ତୈଳ କେକ୍ ବ୍ରାନ୍ ମିଶ୍ରଣ ସହିତ ଖୁଆଇବା ଉଚିତ୍ |"
         ]
      }
   },
   "date": "07-02-2025"
}