{
   "weather_details": {
      "21-12-2024": {
         "rainfall": 7,
         "t_max": 27,
         "t_min": 19,
         "rh_max": 94,
         "rh_min": 55,
         "wind_speed": 5,
         "wind_direction": 51,
         "cloud_cover": 6
      },
      "22-12-2024": {
         "rainfall": 2,
         "t_max": 28,
         "t_min": 19,
         "rh_max": 87,
         "rh_min": 42,
         "wind_speed": 3,
         "wind_direction": 36,
         "cloud_cover": 4
      },
      "23-12-2024": {
         "rainfall": 1,
         "t_max": 28,
         "t_min": 18,
         "rh_max": 80,
         "rh_min": 32,
         "wind_speed": 5,
         "wind_direction": 53,
         "cloud_cover": 2
      },
      "24-12-2024": {
         "rainfall": 1,
         "t_max": 28,
         "t_min": 18,
         "rh_max": 77,
         "rh_min": 33,
         "wind_speed": 4,
         "wind_direction": 0,
         "cloud_cover": 2
      },
      "25-12-2024": {
         "rainfall": 0,
         "t_max": 29,
         "t_min": 18,
         "rh_max": 73,
         "rh_min": 30,
         "wind_speed": 3,
         "wind_direction": 63,
         "cloud_cover": 2
      }
   },
   "names_of_crops": [
      "ଚାଉଳ",
      "ଅରହର",
      "ଚିନାବାଦାମ",
      "ଗ୍ରୀନଗ୍ରାମ/ବ୍ଲାକଗ୍ରାମ",
      "ସୋରିଷ",
      "ଫୁଲକୋବି/ବନ୍ଧାକୋବି/ବ୍ରୋକୋଲି",
      "ବାଇଗଣ",
      "ଟମାଟୋ",
      "ଓକ୍ରା",
      "ଛେଳି।",
      "କୁକୁଡ଼ା ମାଂସ"
   ],
   "general_advisory": "କ୍ଷେତରେ ଶେଷ ହଳ କରିବା ସମୟରେ ଭଲ ଭାବେ ସଙ୍କୁଚିତ ଫାର୍ମ ୟାର୍ଡ ସାର/ଭର୍ମିକମ୍ପୋଷ୍ଟ ଲଗାନ୍ତୁ। କୌଣସି ଫସଲ ଉଠାଇବା ପୂର୍ବରୁ ମାଟିର ନମୁନା ସଂଗ୍ରହ କରନ୍ତୁ ଏବଂ ନିକଟସ୍ଥ ମୃତ୍ତିକା ପରୀକ୍ଷଣ ପରୀକ୍ଷାଗାରରେ ଏହାର ପରୀକ୍ଷା କରନ୍ତୁ। ମୃତ୍ତିକା ସ୍ୱାସ୍ଥ୍ୟ କାର୍ଡରେ ଉଲ୍ଲିଖିତ ମୃତ୍ତିକା ପରୀକ୍ଷା ଆଧାରିତ ସୁପାରିଶ ଅନୁଯାୟୀ ସମସ୍ତ ଫସଲରେ ସନ୍ତୁଳିତ ସାର ପ୍ରୟୋଗ କରନ୍ତୁ। ବର୍ତ୍ତମାନ ପାଇଁ କୀଟନାଶକ ସିଞ୍ଚନ ବନ୍ଦ କରନ୍ତୁ। ପ୍ରତ୍ଯାଶିତ ବର୍ଷାକୁ ଉପଯୋଗ କରିବା ପାଇଁ ଆସନ୍ନ ରବି ଫସଲ ବୁଣିବା ସମ୍ପୂର୍ଣ୍ଣ କରନ୍ତୁ।",
   "crops_data": {
      "rice": {
         "advisory": [
            "ଡିସେମ୍ବର ମାସରୁ ଜାନୁଆରୀ ମାସର ପ୍ରଥମ ସପ୍ତାହ ପର୍ଯ୍ୟନ୍ତ ଗ୍ରୀଷ୍ମକାଳୀନ ଚାଉଳର ନର୍ସରୀ ଚାଷ କରନ୍ତୁ। ଶୀଘ୍ର ରୋପଣ କଲେ କାଣ୍ଡ ଛେଦକ ଆକ୍ରମଣ ହ୍ରାସ ପାଇଥାଏ।",
            "ଖାଣ୍ଡଗିରି, ମନ୍ଦାକିନୀ, ସାହଭାଗି ଧନ, ଏମ୍ଟିୟୁ 1010, ସିଦ୍ଧାନ୍ତ, ଲାଲଟ, ସି. ଆର. ଧନ 101 ଇତ୍ୟାଦି ଜୈବିକ ଚାପ ପ୍ରତି ପ୍ରତିରୋଧକ ପ୍ରମାଣିତ 3-4 ମାସର ଅବଧି ଏଚ. ୱାଇ. ଭି. ଚୟନ କରନ୍ତୁ।",
            "ମଞ୍ଜି ଗୁଡ଼ିକୁ ଲବଣାକ୍ତ ଦ୍ରବଣ (ଏକ ଲିଟର ପାଣିରେ 165 ଗ୍ରାମ ସାଧାରଣ ଲୁଣ) ରେ ବୁଡ଼ାଇ ଚୋଫ ଏବଂ ଅଧା ଭର୍ତ୍ତି ମଞ୍ଜି ଫିଙ୍ଗି ଦିଅନ୍ତୁ।",
            "ଶୁଖିଯିବା ପରେ ମଞ୍ଜିଗୁଡ଼ିକୁ ସଫା ପାଣିରେ ଧୋଇ ଶୁଖାନ୍ତୁ।",
            "ବୁଣିବା ପୂର୍ବରୁ, ବୀଜ ବାହିତ ରୋଗର ପ୍ରକୋପକୁ ହ୍ରାସ କରିବା ପାଇଁ, ମଞ୍ଜିଗୁଡ଼ିକୁ କାର୍ବେନଡାଜିମ୍ @1.5 ଗ୍ରାମ/କିଲୋଗ୍ରାମ ମଞ୍ଜି କିମ୍ବା ଭିଟାଭାକ୍ସ ପାୱାର @2.5 ଗ୍ରାମ/କିଲୋଗ୍ରାମ ମଞ୍ଜି ସହିତ ଚିକିତ୍ସା କରନ୍ତୁ।"
         ]
      },
      "arhar": {
         "advisory": [
            "ଶୁଣ୍ଢ ଛେଦକକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ, ବେନଫୁରାକାର୍ବ 40 ପ୍ରତିଶତ ଇସି @1ଲିଟ୍/ଏସି କିମ୍ବା ଡେଲ୍ଟାମେଥ୍ରିନ୍ 2.8 ପ୍ରତିଶତ ଇସି @200 ମିଲି/ଏସି କିମ୍ବା ସ୍ପିନୋସାଡ୍ 45 ପ୍ରତିଶତ ଏସସି @60 ମିଲି/ଏସି କିମ୍ବା ଫ୍ଲୁବେଣ୍ଡିଆମାଇଡ୍ 39.35% ଏସସି @40 ମିଲି/ଏସି ସହିତ 200 ଲିଟର ପାଣି ମିଶାଇ ଲଗାନ୍ତୁ।",
            "ପୋଡ୍ ଶୋଷକ ବଗ୍ ଏବଂ ଏଫିଡ୍ କୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ, ଥିୟାମେଥୋକ୍ସାମ୍ 25 ପ୍ରତିଶତ ଡବ୍ଲୁଜି @40 ଗ୍ରାମ୍/ଏସି କିମ୍ବା ଇମିଡାକ୍ଲୋପ୍ରିଡ୍ 17.8% ଏସ୍ଏଲ୍ @60 ମିଲି/ଏକର ସହିତ 200 ଲିଟର ପାଣି ମିଶାଇ ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "groundnut": {
         "advisory": [
            "ଇମାଜେଥାପାଇର୍ 10 ପ୍ରତିଶତ ଏସ୍. ଏଲ୍. @3 ମିଲି/ଲିଟର ପାଣି 15 ଡିଏଏସ୍ରେ ପ୍ରୟୋଗ କରନ୍ତୁ, ଯଥାଶୀଘ୍ର ଉଦ୍ଭବ ପରବର୍ତ୍ତୀ ହର୍ବିସାଇଡ୍ କିମ୍ବା 15-20 ଡିଏଏସ୍ରେ ଫେନକ୍ସାପ୍ରପ୍-ପି-ଇଥାଇଲ 9.3 ପ୍ରତିଶତ @35 ମିଲି/ଡ୍ରମ୍ (15 ଲିଟର କ୍ଷମତା) ପ୍ରୟୋଗ କରନ୍ତୁ।"
         ]
      },
      "greengram/blackgram": {
         "advisory": [
            "1-2 ଡିଏଏସରେ 200 ଲିଟର ପାଣି ସହିତ ପେଣ୍ଡିମିତାଲିନ୍ 30 ପ୍ରତିଶତ ଇସି @1.20 ଲିଟର/ଏକର ମିଶାନ୍ତୁ।"
         ]
      },
      "mustard": {
         "advisory": [
            "ଏଫିଡ୍ ନିୟନ୍ତ୍ରଣ ପାଇଁ, ଡାଇମେଥୋଏଟ୍ 30 ପ୍ରତିଶତ ଇସି (1.5 ମିଲି/ଲି) କିମ୍ବା ଇମିଡାକ୍ଲୋପ୍ରିଡ୍ 17.8% ଏସଏଲ (0.6 ମିଲି/ଲି) କିମ୍ବା ଥିଓମେଥୋକ୍ସାମ୍ 25 ପ୍ରତିଶତ ଡବ୍ଲୁଜି (0.2 ଗ୍ରାମ୍/ଲି) ସ୍ପ୍ରେ କରନ୍ତୁ। ଫ୍ଲାଇ ସ୍ପ୍ରେ ନିୟନ୍ତ୍ରଣ ପାଇଁ ଇଥୋଫେନପ୍ରୋକ୍ସ 10 ପ୍ରତିଶତ ଇସି @1 ମିଲି/ଲିଟର ପାଣି କିମ୍ବା କ୍ୱିନାଲଫୋସ୍ 25 ପ୍ରତିଶତ ଇସି @2.5ml/l ପାଣି କିମ୍ବା ଆସେଫେଟ୍ 75 ପ୍ରତିଶତ ଏସପି @1 ଗ୍ରାମ ପ୍ରତି ଲିଟର ପାଣି।",
            "ନିଡ ମ୍ୟାନେଜମେଣ୍ଟଃ 15-20 ଡିଏଏସରେ 2 ମିଲି/ଲିଟର ଜଳ ଉଠିବା ପରେ କୁଇଜାଲୋଫପ-ଇଥାଇଲ 5 ପ୍ରତିଶତ ଇସି ଲଗାନ୍ତୁ।",
            "3-ସପ୍ତାହ ପର୍ଯ୍ୟାୟରେ ସାର ପ୍ରୟୋଗ (ୟୁରିଆ @35-40 କି. ଗ୍ରା./ଏସି + ଏମଓପି @10 କି. ଗ୍ରା./ଏସି) ଏବଂ ଜଳସେଚନ ଭଳି ଆନ୍ତଃସାଂସ୍କୃତିକ କାର୍ଯ୍ୟ ହାତକୁ ନିଅନ୍ତୁ।"
         ]
      },
      "cauliflower/cabbage/broccoli": {
         "advisory": [
            "ଡାଇମଣ୍ଡ ବ୍ୟାକ୍ ମଥ୍କୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ ଜୈବ କୀଟନାଶକ ଆଜାଦିରାକ୍ଟିନ 0.03% (300 ପିପିଏମ) ଲିଟର ପିଛା 5 ମିଲି ପାଣି କିମ୍ବା ବିଉଭେରିଆ ବାସିଆନା 5 ପ୍ରତିଶତ ଡବ୍ଲ୍ୟୁ. ପି. ଲିଟର ପିଛା 800 ଗ୍ରାମ ପାଣି ସହିତ 200 ଲିଟର ପାଣି ମିଶାଇ ସ୍ପ୍ରେ କରନ୍ତୁ। ରାସାୟନିକ ନିୟନ୍ତ୍ରଣ ପାଇଁ, ଫାଇପ୍ରୋନିଲ୍ 5 ପ୍ରତିଶତ ଏସ୍. ସି. @2 ମିଲି/ଲିଟର କିମ୍ବା କ୍ଲୋରପାଇରିଫସ୍ 20 ପ୍ରତିଶତ ଇ. ସି. @4 ମିଲି/ଲିଟର ପାଣି ସିଞ୍ଚନ କରନ୍ତୁ।",
            "ତମାଖୁ ପତ୍ର ଖାଉଥିବା କ୍ୟାଟର୍ପିଲରକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ, ସାଇଣ୍ଟ୍ରାନିଲିପ୍ରୋଲ 10.26% ଓଡି @6 ମିଲି/5 ଲିଟର ପାଣି ସ୍ପ୍ରେ କରନ୍ତୁ।",
            "ବନ୍ଧାକୋବିରେ ଏଫିଡ୍ ସଂକ୍ରମଣ ହେବାର ସମ୍ଭାବନା, ଯଦି ଥାୟାମେଥୋକ୍ସାମ୍ 25 ପ୍ରତିଶତ ଡବ୍ଲୁଜି @6 ଗ୍ରାମ୍ କିମ୍ବା ଏସିଟାମିପ୍ରିଡ୍ 20 ପ୍ରତିଶତ ଏସପି @3 ଗ୍ରାମ୍ ପ୍ରତି 15 ଲିଟର ପାଣି ସ୍ପ୍ରେ କରାଯାଏ।"
         ]
      },
      "brinjal": {
         "advisory": [
            "ବାଇଗଣ କ୍ଷେତରେ ଶୁଟ୍ ବୋରର୍ ନିରୀକ୍ଷଣ କରିପାରେ, ଏହାକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ ଆଜାଦିରାକ୍ଟିନ 1 ପ୍ରତିଶତ ଇସି @3 ମିଲି/ଲିଟର ପାଣି କିମ୍ବା ଇମାମେକ୍ଟିନ୍ ବେନ୍ଜୋଏଟ୍ 5 ପ୍ରତିଶତ ଏସ୍ଜି @0.4 ଗ୍ରାମ୍/ଲିଟର ପାଣି ସ୍ପ୍ରେ କରେ |"
         ]
      },
      "tomato": {
         "advisory": [
            "ଉଚ୍ଚ ଆର୍ଦ୍ର ଅବସ୍ଥାକୁ ଦୃଷ୍ଟିରେ ରଖି ଏହି ପର୍ଯ୍ୟାୟରେ ଶୁଷ୍କତା ଘଟିପାରେ। ଯଦି ଲକ୍ଷଣ ଦେଖାଯାଏ, ତେବେ ମାନକୋଜେବ୍ 75 ପ୍ରତିଶତ ଡବ୍ଲ୍ୟୁ. ପି. @2 ଗ୍ରାମ/ଲିଟର ପାଣି ସ୍ପ୍ରେ କରନ୍ତୁ।",
            "ଯଦି ଆଜୋକ୍ସିସ୍ଟ୍ରୋବିନ୍ 18.2% + ଡିଫେନୋକାନାଜୋଲ୍ 11.4% ଏସ୍ସି @1 ମିଲି/ଲିଟର ପାଣି କିମ୍ବା କ୍ୟାପଟାନ 50 ପ୍ରତିଶତ ଡବ୍ଲ୍ୟୁ. ପି. @2.5 ଗ୍ରାମ/ଲିଟର ପାଣି ସ୍ପ୍ରେ କରାଯାଏ, ତେବେ ଟମାଟୋରେ ଶୀଘ୍ର ବ୍ଲାଇଟ୍ ସଂକ୍ରମଣ ହେବାର ସମ୍ଭାବନା ରହିଛି।",
            "ଟମାଟୋରେ ଧଳା ମାଛି ନିରୀକ୍ଷଣ କରିପାରେ, ଏହାକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ 15 ଲିଟର ପାଣିରେ ଥିୟାମେଥୋକ୍ସାମ୍ 12.6% + ଲାମ୍ବଡା ସାଇହାଲୋଥ୍ରିନ୍ 9.5 ଜେଡସି @3.75 ମିଲି କିମ୍ବା ଇମିଡାକ୍ଲୋପ୍ରିଡ୍ 70 ପ୍ରତିଶତ ଡବ୍ଲୁଜି @1.5 ଗ୍ରାମ୍ ସ୍ପ୍ରେ କରେ |"
         ]
      },
      "okra": {
         "advisory": [
            "ଓକ୍ରାରେ ଏଫିଡ୍ ସଂକ୍ରମଣ ହେତୁ ୱାଇ. ଏମ୍. ଭି. ର ଭେକ୍ଟର ଏବଂ ପତ୍ର କୁଞ୍ଚନକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ ବୁପ୍ରୋଫେଜିନ୍ 15 ପ୍ରତିଶତ + ଆସେଫେଟ୍ 35 ପ୍ରତିଶତ ଡବ୍ଲ୍ୟୁ. ପି. ଲିଟର ପିଛା 1.5 ଗ୍ରାମ୍ କିମ୍ବା 15 ଲିଟର ପାଣିରେ ଥିୟାମେଥୋକ୍ସାମ୍ 25 ପ୍ରତିଶତ ଡବ୍ଲ୍ୟୁ. ଜି. 3 ଗ୍ରାମ୍ ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "goat": {
         "advisory": [
            "ଥଣ୍ଡା ପବନ ଏବଂ ଆର୍ଦ୍ର ଚଟାଣରୁ ଛେଳିଙ୍କୁ ରକ୍ଷା କରନ୍ତୁ।"
         ]
      },
      "poultry": {
         "advisory": [
            "ମୃତ୍ୟୁ ହାର ହ୍ରାସ କରିବା ପାଇଁ ବିଶେଷ କରି ରାତିରେ ଛୁଆମାନଙ୍କୁ ଉତ୍ତାପ ପ୍ରଦାନ କରିବା ପାଇଁ ଆବଶ୍ୟକ ବ୍ୟବସ୍ଥା କରନ୍ତୁ। ଛୁଆମାନଙ୍କ ପାଇଁ ଉପଯୁକ୍ତ ପ୍ରଜନନ ବ୍ୟବସ୍ଥା କରନ୍ତୁ। କୁକୁଡ଼ା ଘରକୁ ସଫା ରଖନ୍ତୁ ଏବଂ କ୍ଲାମ୍ପ ମୁକ୍ତ ରଖନ୍ତୁ |"
         ]
      }
   },
   "date": "20-12-2024"
}