{
   "weather_details": {
      "05-10-2024": {
         "rainfall": 0,
         "t_max": 32,
         "t_min": 25,
         "rh_max": 72,
         "rh_min": 43,
         "wind_speed": 6,
         "wind_direction": 248,
         "cloud_cover": 3
      },
      "06-10-2024": {
         "rainfall": 0,
         "t_max": 32,
         "t_min": 25,
         "rh_max": 72,
         "rh_min": 49,
         "wind_speed": 6,
         "wind_direction": 112,
         "cloud_cover": 4
      },
      "07-10-2024": {
         "rainfall": 0,
         "t_max": 31,
         "t_min": 24,
         "rh_max": 76,
         "rh_min": 49,
         "wind_speed": 5,
         "wind_direction": 198,
         "cloud_cover": 4
      },
      "08-10-2024": {
         "rainfall": 5,
         "t_max": 31,
         "t_min": 24,
         "rh_max": 91,
         "rh_min": 51,
         "wind_speed": 6,
         "wind_direction": 199,
         "cloud_cover": 6
      },
      "09-10-2024": {
         "rainfall": 5,
         "t_max": 31,
         "t_min": 24,
         "rh_max": 91,
         "rh_min": 55,
         "wind_speed": 7,
         "wind_direction": 135,
         "cloud_cover": 6
      }
   },
   "names_of_crops": [
      "ଚାଉଳ",
      "ଅରହର",
      "ମକା",
      "ବାଇଗଣ",
      "ଓକ୍ରା",
      "ପେଁପେ",
      "କଦଳୀ"
   ],
   "general_advisory": "ଆଇଏମଡିରୁ ମିଳିଥିବା ପାଞ୍ଚ ଦିନିଆ ପାଣିପାଗ ପୂର୍ବାନୁମାନ ଆଧାରରେ, କୃଷକମାନେ ଗୁରୁବାରଠାରୁ କୃଷି ସମ୍ବନ୍ଧୀଯ଼ ଅଭ୍ଯ଼ାସ, ପ୍ରଯ଼ୋଗ କୀଟନାଶକ ଏବଂ ସାର ପୁନଃ ଆରମ୍ଭ କରିପାରିବେ। ଫସଲର ବୃଦ୍ଧି ପର୍ଯ୍ଯ଼ାଯ଼ ଅନୁଯାଯ଼ୀ ସନ୍ତୁଳିତ ଏବଂ ଉପଯୁକ୍ତ ସାର ପ୍ରଯ଼ୋଗ କରନ୍ତୁ। ଅତ୍ଯ଼ଧିକ ନାଇଟ୍ରୋଜେନ୍ ଠାରୁ ଦୂରେଇ ରୁହନ୍ତୁ କାରଣ ଏହା ଅତ୍ଯ଼ଧିକ ଉଦ୍ଭିଦ ବୃଦ୍ଧିକୁ ପ୍ରୋତ୍ସାହିତ କରେ ଏବଂ ଜଳ ଚାହିଦା ବୃଦ୍ଧି କରେ |",
   "crops_data": {
      "rice": {
         "advisory": [
            "ଉଚ୍ଚଭୂମିରେ ଏକର ପିଛା 16 କିଲୋଗ୍ରାମ ୟୁରିଆ + 10 କିଲୋଗ୍ରାମ ଏମଓପି ଏବଂ ମଧ୍ୟମ ଏବଂ ନିମ୍ନ ଭୂମିରେ ଏକର ପିଛା 20 କିଲୋଗ୍ରାମ ୟୁରିଆ + 13 କିଲୋଗ୍ରାମ ଏମଓପି ପ୍ରୟୋଗ କରନ୍ତୁ।",
            "କାଣ୍ଡ ଛେଦକ, ପତ୍ର ଫୋଲଡର ଏବଂ ଧାନ କାନ ଖାଉଥିବା କ୍ୟାଟର୍ପିଲରର ଜନସଂଖ୍ୟାକୁ ନିରୀକ୍ଷଣ ଏବଂ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ ଫେରୋମୋନ୍ ଟ୍ରାପ୍ ଏବଂ ହାଲୁକା ଟ୍ରାପ୍ ସ୍ଥାପନ କରନ୍ତୁ |",
            "ଅଣ୍ଡା ପରଜୀବୀ ଟ୍ରାଇକୋଗ୍ରାମମା ଜାପୋନିକମ (ଟ୍ରାଇକୋ କାର୍ଡ) କୁ ଷ୍ଟେମ ବୋରର ସ୍ଥାନୀୟ ଅଞ୍ଚଳରେ ଛାଡ଼ି ଦିଅନ୍ତୁ |",
            "ଚାଉଳରେ ବିସ୍ଫୋରଣ ରୋଗକୁ ନିଯ଼ନ୍ତ୍ରଣ କରିବା ପାଇଁ, ଟେବୁକୋନାଜୋଲ୍ 50 ପ୍ରତିଶତ + ଟ୍ରାଇଫ୍ଲୋକ୍ସିସ୍ଟ୍ରୋବିନ୍ 25 ପ୍ରତିଶତ ଡବ୍ଲୁଜି କିମ୍ବା ଟ୍ରାଇସାଇକ୍ଲାଜୋଲ୍ 45 ପ୍ରତିଶତ + ହେକ୍ସାକୋନାଜୋଲ୍ 10 ପ୍ରତିଶତ ଡବ୍ଲୁଜି ସ୍ପ୍ରେ କରନ୍ତୁ।",
            "ଷ୍ଟେମ ବୋରର ଏବଂ ପତ୍ର ଫୋଲଡର ସଂକ୍ରମଣକୁ ନିଯ଼ନ୍ତ୍ରଣ କରିବା ପାଇଁ, କ୍ଲୋରାଣ୍ଟ୍ରାନିଲିପ୍ରୋଲ 18.5% SC କିମ୍ବା ଫ୍ଲୁବେଣ୍ଡିଆମାଇଡ୍ 20 ପ୍ରତିଶତ WG ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "arhar": {
         "advisory": [
            "ପତ୍ର ୱେବରକୁ ନିଯ଼ନ୍ତ୍ରଣ କରିବା ପାଇଁ, ପ୍ରୋଫେନୋଫସ୍ 50 ପ୍ରତିଶତ ଇସି କିମ୍ବା କ୍ଲୋରପାଇରିଫସ୍ 50 ପ୍ରତିଶତ + ସାଇପର୍ମେଥ୍ରିନ୍ 5 ପ୍ରତିଶତ ଇସି ସ୍ପ୍ରେ କରନ୍ତୁ।",
            "ୱିଲ୍ଟ କ୍ଷେତ୍ରରେ, ମେଟିରାମ 75 ପ୍ରତିଶତ ଡବ୍ଲ୍ଯ଼ୁ. ଜି. ଲଗାନ୍ତୁ।"
         ]
      },
      "maize": {
         "advisory": [
            "ଷ୍ଟେମ ବୋରର, ଏଫ. ଏ. ଡବ୍ଲ୍ଯ଼ୁ, ଏବଂ ବ୍ଯ଼ାଣ୍ଡେଡ ପତ୍ର ଏବଂ ସିଥ୍ ବ୍ଲାଇଟ୍ ପାଇଁ ମନିଟର କରନ୍ତୁ |",
            "ଫଲ୍ ଆର୍ମି କୃମିକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ, ଇମାମେକ୍ଟିନ୍ ବେନ୍ଜୋଏଟ୍ 5 ପ୍ରତିଶତ ଏସ୍ଜି କିମ୍ବା କ୍ଲୋରାଣ୍ଟ୍ରାନିଲିପ୍ରୋଲ୍ 18.5% ଏସ୍ସି ସ୍ପ୍ରେ କରନ୍ତୁ।",
            "ଷ୍ଟେମ ବୋରର ନିୟନ୍ତ୍ରଣ ପାଇଁ, ଫିପ୍ରୋନିଲ 5 ପ୍ରତିଶତ ଏସ୍. ସି. କିମ୍ବା ପ୍ରୋଫେନୋଫସ୍ 50 ପ୍ରତିଶତ ଇ. ସି. ସ୍ପ୍ରେ କରନ୍ତୁ।",
            "ବି. ଏଲ୍. ଏସ୍. ବି. କୁ ନିଯ଼ନ୍ତ୍ରଣ କରିବା ପାଇଁ, ଭାଲିଡାମାଇସିନ୍ 3 ପ୍ରତିଶତ ଏସ୍. ଏଲ୍. କିମ୍ବା ହେକ୍ସାକୋନାଜୋଲ୍ 5 ପ୍ରତିଶତ ଇ. ସି. ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "brinjal": {
         "advisory": [
            "ୱିଲ୍ଟକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ, ମୂଳ ଅଞ୍ଚଳରେ ଟେବୁକୋନାଜୋଲ୍ 25.9% ଇସି + ସ୍ଟ୍ରେପ୍ଟୋସାଇକ୍ଲିନ୍ ସ୍ପ୍ରେ କରନ୍ତୁ।",
            "ଫୋମୋପ୍ସିସ୍ ବ୍ଲାଇଟ୍ ରୋଗକୁ ପରିଚାଳନା କରିବା ପାଇଁ ମେଟାଲାକ୍ସିଲ୍ 8 ପ୍ରତିଶତ + ମାନକୋଜେବ୍ 64 ପ୍ରତିଶତ ଡବ୍ଲ୍ଯ଼ୁ. ପି. କିମ୍ବା ପ୍ରୋପିନେବ୍ 70 ପ୍ରତିଶତ ଡବ୍ଲ୍ଯ଼ୁ. ପି. ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "okra": {
         "advisory": [
            "ଫଳ ଏବଂ ଶୁଟ୍ ବୋରର୍ ସଂକ୍ରମଣକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ, ଇମାମେକ୍ଟିନ୍ ବେନ୍ଜୋଏଟ୍ 5 ପ୍ରତିଶତ SG କିମ୍ବା ଫ୍ଲୁବେଣ୍ଡିଆମାଇଡ୍ 39.35 SC ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "papaya": {
         "advisory": [
            "ପେଁପେ ପତ୍ର କର୍ଲ ଭାଇରସକୁ ନିଯ଼ନ୍ତ୍ରଣ କରିବା ପାଇଁ, ହଳଦିଆ ଚଟପଟା ଜାଲ ଲଗାନ୍ତୁ ଏବଂ ନିମ୍ବ ତେଲ (1500 ପିପିଏମ) ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "banana": {
         "advisory": [
            "ସିଗଟୋକା ଲିଫ୍ ସ୍ପଟ୍ ଏବଂ ସିଗାର ଏଣ୍ଡ୍ ରଟ୍ କିମ୍ବା ଟିପ୍ ରଟ୍ ପରିଚାଳନା କରିବାକୁ, ମାନକୋଜେବ୍ 75 ପ୍ରତିଶତ ଡବ୍ଲ୍ଯ଼ୁ. ପି. ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      }
   },
   "date": "04-10-2024"
}