{
   "weather_details": {
      "30-11-2024": {
         "rainfall": 1,
         "t_max": 26,
         "t_min": 12,
         "rh_max": 88,
         "rh_min": 53,
         "wind_speed": 10,
         "wind_direction": 39,
         "cloud_cover": 5
      },
      "01-12-2024": {
         "rainfall": 1,
         "t_max": 25,
         "t_min": 12,
         "rh_max": 96,
         "rh_min": 64,
         "wind_speed": 9,
         "wind_direction": 45,
         "cloud_cover": 5
      },
      "02-12-2024": {
         "rainfall": 4,
         "t_max": 26,
         "t_min": 12,
         "rh_max": 96,
         "rh_min": 62,
         "wind_speed": 8,
         "wind_direction": 53,
         "cloud_cover": 7
      },
      "03-12-2024": {
         "rainfall": 2,
         "t_max": 26,
         "t_min": 11,
         "rh_max": 95,
         "rh_min": 61,
         "wind_speed": 6,
         "wind_direction": 62,
         "cloud_cover": 7
      },
      "04-12-2024": {
         "rainfall": 1,
         "t_max": 27,
         "t_min": 11,
         "rh_max": 93,
         "rh_min": 57,
         "wind_speed": 5,
         "wind_direction": 63,
         "cloud_cover": 6
      }
   },
   "names_of_crops": [
      "ଚାଉଳ",
      "ଡାଲିଗୁଡ଼ିକ",
      "ଚିନାବାଦାମ",
      "ସୋରିଷ",
      "ଫୁଲକୋବି",
      "କଦଳୀ",
      "ବ୍ରୋକୋଲି",
      "ଟମାଟୋ",
      "ଲଙ୍କା",
      "ଗାଈ।"
   ],
   "general_advisory": "ଆଗାମୀ ପାଞ୍ଚ ଦିନ ମଧ୍ୟରେ କମ୍ ବର୍ଷା ଏବଂ ଶୁଖିଲା ପାଗ ହେବାର ଆଶଙ୍କା ରହିଛି। ତେଣୁ ଆବଶ୍ୟକତା ଅନୁଯାୟୀ ଫସଲ କ୍ଷେତରେ ଜଳସେଚନ କରନ୍ତୁ। ଶୀତକାଳୀନ ପନିପରିବା ଫସଲ ପାଇଁ ସମ୍ପୂର୍ଣ୍ଣ ନର୍ସରୀ ବୁଣିବା। ସକାଳେ ଏବଂ ସନ୍ଧ୍ୟାରେ ନର୍ସରୀକୁ ଜଳସେଚନ କରନ୍ତୁ। କମ୍ ଜମିରେ ଧାନ ଅମଳ କରିବାର ପନ୍ଦର ଦିନ ପୂର୍ବରୁ ମଟର, ଚଣା ଏବଂ ସବୁଜ ଚଣା ଯୋଡ଼ି ଫସଲ ଭାବରେ ବୁଣିବା ପାଇଁ ଯାଆନ୍ତୁ। ନିଜ ଫସଲ କ୍ଷେତକୁ ଆଗାଛାରୁ ମୁକ୍ତ ରଖନ୍ତୁ ଏବଂ ଫସଲ ଦ୍ୱାରା ଆବଶ୍ୟକତା ଅନୁଯାୟୀ ଜଳସେଚନ କରନ୍ତୁ। ସବୁଜ ଘାସ + ଘାସ + ଖଣିଜ ପଦାର୍ଥ + ଶୁଖିଲା ଖାଦ୍ୟର ମିଶ୍ରଣ ସହିତ ପଶୁମାନଙ୍କୁ ଖାଇବାକୁ ଦିଅନ୍ତୁ | ବିଶୁଦ୍ଧ ପାନୀୟ ଜଳ ଯୋଗାଇ ଦିଅନ୍ତୁ। ପାଦ ଏବଂ ପାଟି ରୋଗ (ଏଫ୍. ଏମ୍. ଡି.) ବିରୁଦ୍ଧରେ ପଶୁମାନଙ୍କୁ ଟୀକାକରଣ କରନ୍ତୁ।",
   "crops_data": {
      "rice": {
         "advisory": [
            "80-85% ଶସ୍ୟ ପରିପକ୍ୱ ହେବା ପରେ ଫସଲ ଅମଳ କରନ୍ତୁ। ଫସଲ ଅମଳ କରିବାର 15 ଦିନ ପୂର୍ବରୁ ଧାନ କ୍ଷେତରୁ ପାଣି ବାହାର କରନ୍ତୁ।",
            "ପ୍ରଚଳିତ ପାଣିପାଗ ସ୍ଥିତିରେ ମିଥ୍ୟା ବିକଶିତ ହେବାର ସମ୍ଭାବନା ରହିଛି। ଯଦି ସଂକ୍ରମଣ ପରିଲକ୍ଷିତ ହୁଏ, ତେବେ କପର୍ ହାଇଡ୍ରୋକ୍ସାଇଡ୍ 77 ପ୍ରତିଶତ @2 ଗ୍ରାମ୍/ଲିଟର କିମ୍ବା ଟେବୁକୋନାଜୋଲ୍ 25 ପ୍ରତିଶତ @2 ଗ୍ରାମ୍/ଲିଟର ସ୍ପ୍ରେ କରନ୍ତୁ।",
            "ଯଦି 'ମୂଷା/ମୂଷା' ସମସ୍ୟା ଦେଖାଯାଏ, ତେବେ ଫସଲ କ୍ଷେତ ଏବଂ ଆଖପାଖ ଅଞ୍ଚଳରେ ମୂଷା ଗର୍ତ୍ତକୁ ଚିହ୍ନଟ କରନ୍ତୁ | ଆଲୁମିନିୟମ୍ ଫସଫାଇଡ୍ 6 ପ୍ରତିଶତ ଟାବଲେଟ୍ ପ୍ରତି ଗର୍ତ୍ତରେ ଗୋଟିଏ ଟାବଲେଟ୍ (12 ଗ୍ରାମ୍) ରଖି ଗର୍ତ୍ତକୁ କାଦୁଅରେ ବନ୍ଦ କରିଦିଅନ୍ତୁ ଯାହା ମୂଷାଙ୍କୁ ମାରିଦେବ।"
         ]
      },
      "pulses": {
         "advisory": [
            "ଉଚ୍ଚଭୂମିରେ କଳା ଚଣା ଏବଂ ସବୁଜ ଚଣା ବୁଣିବା ସମ୍ପୂର୍ଣ୍ଣ କରନ୍ତୁ। କଳା ଚଣା ପାଇଁ ଟି-9, ପି. ୟୁ. 11, ପି. ୟୁ. 19, ଏବଂ ପି. ୟୁ. 30 ଭଳି ଅଧିକ ଉତ୍ପାଦନକ୍ଷମ କିସମ ଏବଂ ସବୁଜ ଚଣା ପାଇଁ କେ-851, ପି. ଡି. ଏମ. 11, ପି. ଡି. ଏମ. 54, ଓ. ୟୁ. ଏମ. 115 ଚାଷ କରନ୍ତୁ। ଏକର ପିଛା 10 କିଲୋଗ୍ରାମ ମଞ୍ଜି ବ୍ୟବହାର କରନ୍ତୁ। ବୁଣିବା ପୂର୍ବରୁ, ମଞ୍ଜିଗୁଡ଼ିକୁ ରାଇଜୋବିୟମ୍ ସଂସ୍କୃତି ସହିତ ଚିକିତ୍ସା କରିବାକୁ ହେବ। 200 ଗ୍ରାମ୍ ରାଇଜୋବିୟମ୍ କଲ୍ଚର + 250 ଗ୍ରାମ୍ ଫସଫେଟ୍ ସଲ୍ୟୁବିଲାଇଜିଂ ବ୍ୟାକ୍ଟେରିଆ (ପି. ଏସ୍. ବି.) କୁ 600 ମି. ଲି. ପାଣିରେ ପକାଇ ଭଲ ଭାବେ ମିଶାନ୍ତୁ। ଏବେ 10 କି. ଗ୍ରା. ବୁନ୍ଦା ବୁନ୍ଦା ମଞ୍ଜି ଉପରେ ସ୍ଲରି ଢାଳି ଦିଅନ୍ତୁ ଏବଂ ସମସ୍ତ ମଞ୍ଜି ଉପରେ ସମାନ ପ୍ରକାରର କଲ୍ଚରର ଲେପ ପାଇବା ପର୍ଯ୍ୟନ୍ତ ହାତରେ ମିଶାନ୍ତୁ। ଶୁଖିଲା କପଡ଼ା, କାଗଜ, କିମ୍ବା ପଲିଥିନ୍ ଶୀଟ୍ ଉପରେ ଛାୟାରେ ବିଶୋଧିତ ମଞ୍ଜି ଶୁଖାଇ ତୁରନ୍ତ, ବିଶେଷ କରି ଅପରାହ୍ନରେ ବୁଣନ୍ତୁ |",
            "ଅନ୍ତିମ ଜମି ପ୍ରସ୍ତୁତି ସମୟରେ ଏକର ପିଛା 4 କିଲୋଗ୍ରାମ ୟୁରିଆ, 35 କିଲୋଗ୍ରାମ ଡିଏପି ଏବଂ 13 କିଲୋଗ୍ରାମ ଏମଓପି ଲଗାନ୍ତୁ। 10-15 ସେ. ମି. ରୁ ଗଛର ଦୂରତା ସହିତ ଅବଧି ଉପରେ ନିର୍ଭର କରି 30 ସେ. ମି. ବ୍ୟବଧାନରେ ମଞ୍ଜି ବୁଣନ୍ତୁ।"
         ]
      },
      "groundnut": {
         "advisory": [
            "ଜମି ପ୍ରସ୍ତୁତି ଏବଂ 25 ସେ. ମି. x 10 ସେ. ମି. ବ୍ୟବଧାନରେ 50 କି. ଗ୍ରା./ଏକରର ବୀଜ ହାର ସହିତ ରବି ଚିନାବାଦାମ ବୁଣିବା ପାଇଁ ଯାଆନ୍ତୁ। ଏକର ପିଛା 35 କିଲୋଗ୍ରାମ ଡିଏପି, 4 କିଲୋଗ୍ରାମ ୟୁରିଆ, ଏବଂ 27 କିଲୋଗ୍ରାମ ଏମଓପି ସହିତ 10 କିଲୋଗ୍ରାମ ଜିଙ୍କ୍ ସଲଫେଟ୍ ଏବଂ ଏକର ପିଛା 4 କିଲୋଗ୍ରାମ ବୋରାକ୍ସ ପ୍ରୟୋଗ କରନ୍ତୁ। ବୀଜ ବୁଣିବା ପୂର୍ବରୁ 10 ଗ୍ରାମ୍ ଟ୍ରାଇକୋଡର୍ମା ହାର୍ଜିଆନମ୍/ଭାଇରିଡ୍ କିମ୍ବା 3 ଗ୍ରାମ୍ କାର୍ବୋକ୍ସିନ୍ 37.5% + ଥିରାମ୍ 37.5% ଡିଏସ୍ ସହିତ ଏକ କିଲୋ ମଞ୍ଜି ପାଇଁ ଚିକିତ୍ସା କରାଯିବା ଉଚିତ। ଉପରୋକ୍ତ ଚିକିତ୍ସାର 7 ଦିନ ପରେ, 50 କିଲୋଗ୍ରାମ ମଞ୍ଜି ପାଇଁ 600 ଗ୍ରାମ୍ ରେ ରାଇଜୋବିୟମ୍ ସଂସ୍କୃତି ସହିତ ଚିକିତ୍ସା କରନ୍ତୁ।",
            "ଚିନାବାଦାମର କଳାର ସଙ୍କୁଚିତ ହେବା କିମ୍ବା କାଣ୍ଡ ସଙ୍କୁଚିତ ହେବା ହ୍ରାସ କରିବା ପାଇଁ ବୁଣିବା ପୂର୍ବରୁ 15 ଦିନ ପୂର୍ବରୁ କିମ୍ବା ବୁଣିବା ସମୟରେ ମଞ୍ଜି ଫୁରୋରେ ଏକର ପିଛା 200 କିଲୋଗ୍ରାମ ହାରରେ ନିମ୍ବ କିମ୍ବା ସୋରିଷ କେକ୍ ଲଗାନ୍ତୁ। ଅନ୍ତିମ ଭୂମି ପ୍ରସ୍ତୁତି ସମୟରେ ଉଇପୋକା-ପ୍ରବଣ ଅଞ୍ଚଳରେ କ୍ଲୋରପିରିଫସ୍ 20 ପ୍ରତିଶତ ଇସି @4 ମିଲି/ଲିଟର ଜଳ ମାଟିରେ ସିଞ୍ଚନ କରନ୍ତୁ।"
         ]
      },
      "mustard": {
         "advisory": [
            "ଆଗାଛା ପରିଚାଳନାଃ 1-2 ଡିଏଏସରେ 3 ମିଲି/ଲିଟର ଜଳ କିମ୍ବା 15-20 ଡିଏଏସରେ 2 ମିଲି/ଲିଟର ଜଳ ଉତକ୍ଷେପଣ ପରେ କୁଇଜାଲୋଫପ-ଇଥାଇଲ 5 ପ୍ରତିଶତ ଇସିରେ ଅକ୍ସାଡିଆର୍ଜିଲ 6 ପ୍ରତିଶତ ଇସି ପ୍ରୟୋଗ କରନ୍ତୁ।"
         ]
      },
      "cauliflower": {
         "advisory": [
            "30-45 ଦିନର ପୁରୁଣା ଚାରା ଗୁଡ଼ିକୁ ମୁଖ୍ୟ କ୍ଷେତରେ 45-60 ସେ. ମି. ର ଧାଡ଼ି ଠାରୁ ଧାଡ଼ି ବ୍ୟବଧାନ ସହିତ ରୋପଣ କରନ୍ତୁ ଏବଂ 30-45 ସେ. ମି. ର ଚାରା ବ୍ୟବଧାନ ସହିତ ରୋପଣ କରନ୍ତୁ।",
            "ରୋପଣ ପୂର୍ବରୁ, ଚାରା ଉପରେ କାର୍ବେନଡାଜିମ୍ 12 ପ୍ରତିଶତ + ମାନକୋଜେବ୍ 63 ପ୍ରତିଶତ ଡବ୍ଲ୍ୟୁ. ପି. ଲଗାନ୍ତୁ, ଏବଂ ଅପରାହ୍ନରେ ପ୍ରତିରୋପଣ କରନ୍ତୁ।",
            "ପୋଷକ ତତ୍ତ୍ୱ ପରିଚାଳନାଃ ପ୍ରତିରୋପଣ ସମୟରେ 26 କିଲୋଗ୍ରାମ ଡିଏପି, 10 କିଲୋଗ୍ରାମ ଏମଓପି, 15 କିଲୋଗ୍ରାମ ୟୁରିଆ ଏବଂ 5 କିଲୋଗ୍ରାମ ବୋରାକ୍ସକୁ ଆଧାର ଭାବେ ପ୍ରୟୋଗ କରନ୍ତୁ।"
         ]
      },
      "cabbage": {
         "advisory": [
            "30-45 ଦିନର ପୁରୁଣା ଚାରା ଗୁଡ଼ିକୁ ମୁଖ୍ୟ କ୍ଷେତରେ 45-60 ସେ. ମି. ର ଧାଡ଼ି ଠାରୁ ଧାଡ଼ି ବ୍ୟବଧାନ ସହିତ ରୋପଣ କରନ୍ତୁ ଏବଂ 30-45 ସେ. ମି. ର ଚାରା ବ୍ୟବଧାନ ସହିତ ରୋପଣ କରନ୍ତୁ।",
            "ରୋପଣ ପୂର୍ବରୁ, ଚାରା ଉପରେ କାର୍ବେନଡାଜିମ୍ 12 ପ୍ରତିଶତ + ମାନକୋଜେବ୍ 63 ପ୍ରତିଶତ ଡବ୍ଲ୍ୟୁ. ପି. ଲଗାନ୍ତୁ, ଏବଂ ଅପରାହ୍ନରେ ପ୍ରତିରୋପଣ କରନ୍ତୁ।",
            "ପୋଷକ ତତ୍ତ୍ୱ ପରିଚାଳନାଃ ପ୍ରତିରୋପଣ ସମୟରେ 26 କିଲୋଗ୍ରାମ ଡିଏପି, 10 କିଲୋଗ୍ରାମ ଏମଓପି, 15 କିଲୋଗ୍ରାମ ୟୁରିଆ ଏବଂ 5 କିଲୋଗ୍ରାମ ବୋରାକ୍ସକୁ ଆଧାର ଭାବେ ପ୍ରୟୋଗ କରନ୍ତୁ।"
         ]
      },
      "broccoli": {
         "advisory": [
            "30-45 ଦିନର ପୁରୁଣା ଚାରା ଗୁଡ଼ିକୁ ମୁଖ୍ୟ କ୍ଷେତରେ 45-60 ସେ. ମି. ର ଧାଡ଼ି ଠାରୁ ଧାଡ଼ି ବ୍ୟବଧାନ ସହିତ ରୋପଣ କରନ୍ତୁ ଏବଂ 30-45 ସେ. ମି. ର ଚାରା ବ୍ୟବଧାନ ସହିତ ରୋପଣ କରନ୍ତୁ।",
            "ରୋପଣ ପୂର୍ବରୁ, ଚାରା ଉପରେ କାର୍ବେନଡାଜିମ୍ 12 ପ୍ରତିଶତ + ମାନକୋଜେବ୍ 63 ପ୍ରତିଶତ ଡବ୍ଲ୍ୟୁ. ପି. ଲଗାନ୍ତୁ, ଏବଂ ଅପରାହ୍ନରେ ପ୍ରତିରୋପଣ କରନ୍ତୁ।",
            "ପୋଷକ ତତ୍ତ୍ୱ ପରିଚାଳନାଃ ପ୍ରତିରୋପଣ ସମୟରେ 26 କିଲୋଗ୍ରାମ ଡିଏପି, 10 କିଲୋଗ୍ରାମ ଏମଓପି, 15 କିଲୋଗ୍ରାମ ୟୁରିଆ ଏବଂ 5 କିଲୋଗ୍ରାମ ବୋରାକ୍ସକୁ ଆଧାର ଭାବେ ପ୍ରୟୋଗ କରନ୍ତୁ।"
         ]
      },
      "tomato": {
         "advisory": [
            "30-35 ଦିନର ପୁରୁଣା ଚାରା ଗୁଡ଼ିକୁ ମୁଖ୍ୟ କ୍ଷେତରେ 75-90 ସେ. ମି. ର ଧାଡ଼ି ଠାରୁ ଧାଡ଼ି ବ୍ୟବଧାନ ସହିତ ପ୍ରତିରୋପଣ କରନ୍ତୁ ଏବଂ 45-60 ସେ. ମି. ର ଚାରା ବ୍ୟବଧାନ ସହିତ ରୋପଣ କରନ୍ତୁ।",
            "ରୋପଣ ପୂର୍ବରୁ, ବାଭିଷ୍ଟିନ୍ @1.5 ଗ୍ରାମ ଏବଂ ପ୍ଲାଣ୍ଟୋମାଇସିନ୍ @1 ଗ୍ରାମ୍ର ଦ୍ରବଣକୁ 1 ଲିଟର ପାଣିରେ ମିଶାଇ 10 ରୁ 15 ମିନିଟ୍ ପର୍ଯ୍ୟନ୍ତ ଚାରା ରୋପଣ କରନ୍ତୁ, ଏବଂ ଅପରାହ୍ନରେ ପ୍ରତିରୋପଣ କରନ୍ତୁ।",
            "ପୋଷକ ତତ୍ତ୍ୱ ପରିଚାଳନାଃ ଏକର ପିଛା 66 କିଲୋଗ୍ରାମ ଡିଏପି, 33 କିଲୋଗ୍ରାମ ଏମଓପି ଏବଂ 80 କିଲୋଗ୍ରାମ ୟୁରିଆ ପ୍ରୟୋଗ କରନ୍ତୁ। ୟୁରିଆର ଏକ ତୃତୀୟାଂଶ + ସମ୍ପୂର୍ଣ୍ଣ ଡିଏପି + ଏକ ତୃତୀୟାଂଶ ଏମଓପିକୁ ଆଧାର ଭାବେ ପ୍ରୟୋଗ କରନ୍ତୁ।"
         ]
      },
      "chilli": {
         "advisory": [
            "ଥାଇମଥୋକ୍ସାମ 12.6% + ଲାମ୍ବଡା ସାଇହାଲୋଥ୍ରିନ 9.5% ଜେଡସି @4.5 ମିଲି କିମ୍ବା ଇମିଡାକ୍ଲୋପ୍ରିଡ 17.8% ଏସଏଲ @7.5 ମିଲି 15 ଲିଟର ପାଣିରେ ଲଙ୍କା ସ୍ପ୍ରେକୁ ନିୟନ୍ତ୍ରଣ କରିବା।"
         ]
      },
      "cow": {
         "advisory": [
            "ପର୍ଯ୍ୟାପ୍ତ ପରିମାଣର ସବୁଜ ଘାସ ଯୋଗାଇ ଦିଅନ୍ତୁ। ଉତ୍ତମ ଉତ୍ପାଦନ ପାଇଁ ସ୍ତନ୍ୟପାନ କରାଉଥିବା ପଶୁମାନଙ୍କୁ ଏକ ଘନୀଭୂତ ମିଶ୍ରଣ ପ୍ରଦାନ କରାଯିବା ଉଚିତ।"
         ]
      }
   },
   "date": "29-11-2024"
}