{
   "weather_details": {
      "08-02-2025": {
         "rainfall": 0,
         "t_max": 31,
         "t_min": 17,
         "cloud_cover": 2,
         "rh_max": 58,
         "rh_min": 21,
         "wind_speed": 4,
         "wind_direction": 37
      },
      "09-02-2025": {
         "rainfall": 0,
         "t_max": 31,
         "t_min": 16,
         "cloud_cover": 2,
         "rh_max": 51,
         "rh_min": 17,
         "wind_speed": 3,
         "wind_direction": 34
      },
      "10-02-2025": {
         "rainfall": 0,
         "t_max": 31,
         "t_min": 16,
         "cloud_cover": 1,
         "rh_max": 50,
         "rh_min": 12,
         "wind_speed": 3,
         "wind_direction": 196
      },
      "11-02-2025": {
         "rainfall": 0,
         "t_max": 32,
         "t_min": 17,
         "cloud_cover": 1,
         "rh_max": 57,
         "rh_min": 15,
         "wind_speed": 7,
         "wind_direction": 205
      },
      "12-02-2025": {
         "rainfall": 0,
         "t_max": 32,
         "t_min": 18,
         "cloud_cover": 0,
         "rh_max": 55,
         "rh_min": 16,
         "wind_speed": 8,
         "wind_direction": 211
      }
   },
   "names_of_crops": [
      "ଚାଉଳ",
      "ସୋରିଷ",
      "ତୋରିଆ",
      "ଲଙ୍କା",
      "ଟମାଟୋ",
      "ଆଳୁ",
      "ଓକ୍ରା"
   ],
   "general_advisory": "କୃଷକମାନଙ୍କୁ ମକା, ଚିନାବାଦାମ, ସବୁଜ ଚଣା, ଚଣା ଏବଂ ପନିପରିବା ପରି ଠିଆ ଫସଲରେ ଆଗାଛା କାଟିବା ଏବଂ ହୋଇଂ କରିବାକୁ ପରାମର୍ଶ ଦିଆଯାଇଛି ଯାହା ସେମାନଙ୍କୁ ଆଗାଛାରୁ ରକ୍ଷା କରିବ | ଫସଲର ବୃଦ୍ଧି ପର୍ଯ୍ୟାୟ ଅନୁଯାୟୀ ସନ୍ତୁଳିତ ଏବଂ ଉପଯୁକ୍ତ ସାର ପ୍ରୟୋଗ କରନ୍ତୁ। କୀଟପତଙ୍ଗ ଉପରେ ନଜର ରଖିବା ପାଇଁ ହଳଦିଆ ଚଟପଟା ଜାଲ ଲଗାନ୍ତୁ। ପନିପରିବାରେ ଭାଇରାଲ ସଂକ୍ରମଣକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ ଆବଶ୍ୟକ ପଦକ୍ଷେପ ନିଅନ୍ତୁ। ଦସ୍ତାବିଜରେ ଉଲ୍ଲେଖ କରାଯାଇଥିବା ବିଭିନ୍ନ ଫସଲ ପାଇଁ ନିର୍ଦ୍ଦିଷ୍ଟ ପରାମର୍ଶ।",
   "crops_data": {
      "rice": {
         "advisory": [
            "ଆବଶ୍ୟକ ସମୟରେ ନର୍ସରୀ ଶଯ୍ୟାରେ ହାଲୁକା ଜଳସେଚନ ପ୍ରୟୋଗ କରନ୍ତୁ।",
            "ବିସ୍ଫୋରଣ ସଂକ୍ରମଣକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ ନର୍ସରୀ ଅଞ୍ଚଳରେ ଟେବୁକୋନାଜୋଲ୍ 50 ପ୍ରତିଶତ + ଟ୍ରାଇଫ୍ଲୋକ୍ସିସ୍ଟ୍ରୋବିନ୍ 25 ପ୍ରତିଶତ ଡବ୍ଲୁ. ଜି. ସ୍ପ୍ରେ କରନ୍ତୁ।",
            "ମୁଖ୍ୟ ପଡ଼ିଆରେ ପାଣି ଭର୍ତ୍ତି କରିବା ପାଇଁ ଯାଆନ୍ତୁ। ପୁଡଲିଂର ଶେଷ ରାଉଣ୍ଡ ସମୟରେ ବେସାଲ୍ ସାର ପ୍ରୟୋଗ କରନ୍ତୁ |"
         ]
      },
      "mustard": {
         "advisory": [
            "ନିୟମିତ ଭାବରେ ଫସଲ କ୍ଷେତରେ ଘାସ, ଏଫିଡ୍ ଏବଂ ଲାର୍ଭା ପରି କୀଟପତଙ୍ଗ ଉପରେ ନଜର ରଖନ୍ତୁ |",
            "ଗୁରୁତର ସଂକ୍ରମଣ ସମୟରେ ଏଫିଡ୍, ସୋରଡ ମାଛି ଏବଂ ଅନ୍ୟାନ୍ୟ କୀଟପତଙ୍ଗକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ କାର୍ଯ୍ୟାନୁଷ୍ଠାନ ଗ୍ରହଣ କରନ୍ତୁ।"
         ]
      },
      "toria": {
         "advisory": [
            "ନିୟମିତ ଭାବେ ଫସଲ କ୍ଷେତରେ କୀଟପତଙ୍ଗ ଉପରେ ନଜର ରଖନ୍ତୁ।",
            "ଗୁରୁତର ସଂକ୍ରମଣରେ ଏଫିଡ୍, କରାତ ମାଛି ଏବଂ ଅନ୍ୟାନ୍ୟ କୀଟପତଙ୍ଗକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ କାର୍ଯ୍ୟାନୁଷ୍ଠାନ ନିଅନ୍ତୁ |"
         ]
      },
      "chilli": {
         "advisory": [
            "ଉପଯୁକ୍ତ ସ୍ପ୍ରେ ଦ୍ୱାରା ଲଙ୍କାରେ ଛୋଟ ଛୋଟ ପତ୍ରକୁ ପରିଚାଳନା କରନ୍ତୁ।",
            "ଏଫିଡ୍, ଜ୍ଯାସିଡ୍ ଏବଂ ମାଇଟ୍ ସଂକ୍ରମଣକୁ ନିୟନ୍ତ୍ରଣ କରନ୍ତୁ |"
         ]
      },
      "tomato": {
         "advisory": [
            "ନିର୍ଦ୍ଦିଷ୍ଟ ସ୍ପ୍ରେ ସାହାଯ୍ୟରେ ଟମାଟୋ କ୍ଷେତରେ ଶୀଘ୍ର ଏବଂ ବିଳମ୍ବରେ ହେଉଥିବା ରୋଗକୁ ନିୟନ୍ତ୍ରଣ କରନ୍ତୁ।",
            "ଟମାଟୋ ଗଛରେ ଧଳା ମାଛି ସଂକ୍ରମଣ ଉପରେ ନଜର ରଖନ୍ତୁ ଏବଂ ନିୟନ୍ତ୍ରଣ କରନ୍ତୁ।"
         ]
      },
      "potato": {
         "advisory": [
            "ଫସଲର ଆବଶ୍ୟକତା ଅନୁଯାୟୀ ଜଳସେଚନ ବ୍ୟବସ୍ଥା କରନ୍ତୁ।",
            "ସିଧାସଳଖ ସୂର୍ଯ୍ୟକିରଣ ସଂସ୍ପର୍ଶରେ ଆସିବାକୁ ରୋକିବା ପାଇଁ ଆଳୁରେ ମାଟି ଉଠାଇବା ଆବଶ୍ୟକ।",
            "ପଡ଼ିଆରେ ବିକାରକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ ପଦକ୍ଷେପ ନିଅନ୍ତୁ।"
         ]
      },
      "okra": {
         "advisory": [
            "ଓକ୍ରାରେ ଫଳ ଛେଦକକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ, ନିମ-ଆଧାରିତ କୀଟନାଶକ ସ୍ପ୍ରେ କରନ୍ତୁ।",
            "ଓକ୍ରା ଗଛରେ ରୋଗ ଏବଂ କୀଟପତଙ୍ଗ ପରିଚାଳନା ପାଇଁ ନିର୍ଦ୍ଦିଷ୍ଟ ସ୍ପ୍ରେ ବ୍ୟବହାର କରନ୍ତୁ |"
         ]
      }
   },
   "date": "07-02-2025"
}