{
   "weather_details": {
      "28-09-2024": {
         "rainfall": 5,
         "t_max": 30,
         "t_min": 23,
         "rh_max": 94,
         "rh_min": 71,
         "wind_speed": 14,
         "wind_direction": 202,
         "cloud_cover": 8
      },
      "29-09-2024": {
         "rainfall": 5,
         "t_max": 30,
         "t_min": 23,
         "rh_max": 95,
         "rh_min": 65,
         "wind_speed": 12,
         "wind_direction": 204,
         "cloud_cover": 8
      },
      "30-09-2024": {
         "rainfall": 2,
         "t_max": 31,
         "t_min": 24,
         "rh_max": 96,
         "rh_min": 61,
         "wind_speed": 10,
         "wind_direction": 225,
         "cloud_cover": 4
      },
      "01-10-2024": {
         "rainfall": 2,
         "t_max": 32,
         "t_min": 25,
         "rh_max": 96,
         "rh_min": 65,
         "wind_speed": 11,
         "wind_direction": 243,
         "cloud_cover": 4
      },
      "02-10-2024": {
         "rainfall": 2,
         "t_max": 33,
         "t_min": 26,
         "rh_max": 95,
         "rh_min": 69,
         "wind_speed": 11,
         "wind_direction": 248,
         "cloud_cover": 4
      }
   },
   "names_of_crops": [
      "ଚାଉଳ",
      "ଅରହର",
      "ମକା",
      "କଳା ଚଣା",
      "ତିଲ।",
      "ବାଇଗଣ",
      "ଲଙ୍କା",
      "ପେଁପେ"
   ],
   "general_advisory": "ଆଗାମୀ ପାଞ୍ଚ ଦିନ ମଧ୍ଯ଼ରେ ବର୍ଷା ହେବାର ସମ୍ଭାବନା ରହିଛି, କେବଳ ଆକାଶ ସଫା ହେବା ପରେ ସ୍ପ୍ରେ କରନ୍ତୁ ଏବଂ ସ୍ପ୍ରେ ଦ୍ରବଣରେ ଷ୍ଟିକର ବ୍ଯ଼ବହାର କରନ୍ତୁ। କ୍ଷେତର ଗୋଟିଏ ଅଂଶରେ ବର୍ଷା ଜଳ ସଂରକ୍ଷଣ ପାଇଁ ଉପଯୁକ୍ତ ବ୍ଯ଼ବସ୍ଥା କରିବାକୁ କୃଷକମାନଙ୍କୁ ପରାମର୍ଶ ଦିଆଯାଇଛି। ଏହି ଜଳକୁ ଶୁଖିଲା ଋତୁରେ ଫସଲରେ ଜଳସେଚନ ପାଇଁ ବ୍ଯ଼ବହାର କରାଯାଇପାରିବ। ଅଧିକ ଆର୍ଦ୍ରତା କାରଣରୁ ପୂର୍ବରୁ ବୁଣାଯାଇଥିବା ଫସଲରେ କୀଟପତଙ୍ଗ ଏବଂ ରୋଗ ସୃଷ୍ଟି ହେବାର ସମ୍ଭାବନା ରହିଛି। ଫସଲ ଏବଂ ପାଣିପାଗ ସ୍ଥିତି ଉପରେ ନିର୍ଭର କରି ଉଦ୍ଭିଦ ସୁରକ୍ଷା ପଦକ୍ଷେପ ନିଅନ୍ତୁ।",
   "crops_data": {
      "rice": {
         "advisory": [
            "ଉଚ୍ଚଭୂମିରେ ଏକର ପିଛା 16 କିଲୋଗ୍ରାମ ଯ଼ୁରିଆ + 10 କିଲୋଗ୍ରାମ ଏମଓପି ଏବଂ ମଧ୍ଯ଼ମ ଏବଂ ନିମ୍ନ ଭୂମିରେ ଏକର ପିଛା 20 କିଲୋଗ୍ରାମ ଯ଼ୁରିଆ + 13 କିଲୋଗ୍ରାମ ଏମଓପି ପ୍ରଯ଼ୋଗ କରନ୍ତୁ।",
            "କାଣ୍ଡ ଛେଦକ, ପତ୍ର ଫୋଲଡର ଏବଂ ଧାନ କାନ ଖାଉଥିବା କ୍ଯ଼ାଟର୍ପିଲରର ଜନସଂଖ୍ଯ଼ା ଉପରେ ନଜର ରଖିବା ଏବଂ ନିଯ଼ନ୍ତ୍ରଣ କରିବା ପାଇଁ ଫେରୋମୋନ୍ ଟ୍ରାପ୍ @8nos./acre ଏବଂ ଲାଇଟ୍ ଟ୍ରାପ୍ @1no./acre ସ୍ଥାପନ କରନ୍ତୁ ଏବଂ ତିନି ସପ୍ତାହ ପରେ ଲୋଭକୁ ବଦଳାନ୍ତୁ |",
            "ଷ୍ଟେମ ବୋରର ସ୍ଥାନୀଯ଼ ଅଞ୍ଚଳରେ, ଅଣ୍ଡା ପରଜୀବୀ ଟ୍ରାଇକୋଗ୍ରାମମା ଜାପୋନିକମ (ଟ୍ରାଇକୋ କାର୍ଡ) @60000 ଅଣ୍ଡା (3 କାର୍ଡ)/ଏକର ଛାଡ଼ିବା ଆବଶ୍ଯ଼କ।",
            "ବର୍ତ୍ତମାନର ପାଣିପାଗ ଧାନରେ ବିସ୍ଫୋରଣ ରୋଗକୁ ସମର୍ଥନ କରିପାରେ | ଏହାକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ ଟିବୁକୋନାଜୋଲ୍ 50 ପ୍ରତିଶତ + ଟ୍ରାଇଫ୍ଲୋକ୍ସିସ୍ଟ୍ରୋବିନ୍ 25 ପ୍ରତିଶତ ଡବ୍ଲୁ. ଜି. @4 ଗ୍ରାମ/ଲିଟର ପାଣି କିମ୍ବା ଟ୍ରାଇସାଇକ୍ଲାଜୋଲ୍ 45 ପ୍ରତିଶତ + ହେକ୍ସାକୋନାଜୋଲ୍ 10 ପ୍ରତିଶତ ଡବ୍ଲୁ. ଜି. @1 ଗ୍ରାମ/ଲିଟର ପାଣି ସିଞ୍ଚନ କରନ୍ତୁ।"
         ]
      },
      "arhar": {
         "advisory": [
            "ଲିଫ୍ ୱେବର୍ଃ ପ୍ରୋଫେନୋଫସ୍ 50 ପ୍ରତିଶତ ଇସି କିମ୍ବା କ୍ଲୋରପିରିଫସ୍ 50 ପ୍ରତିଶତ + ସାଇପର୍ମେଥ୍ରିନ୍ 5 ପ୍ରତିଶତ ଇସି @2 ମିଲି/ଲିଟର @2 ମିଲି/ଲିଟର ପାଣି ସ୍ପ୍ରେ କରନ୍ତୁ।",
            "ବିଲ୍ଟଃ ବର୍ଷା କମିବା ପରେ ବିଲ୍ଟିଂ ଦେଖାଯାଇପାରେ। ନିୟନ୍ତ୍ରଣ ପଦକ୍ଷେପ ଭାବରେ ଗଛର ମୂଳ ଅଞ୍ଚଳରେ ମେଟିରାମ୍ 75 ପ୍ରତିଶତ WG @1.5g/liter ପ୍ରୟୋଗ କରନ୍ତୁ।"
         ]
      },
      "maize": {
         "advisory": [
            "ଅଧିକ ବର୍ଷା କାରଣରୁ ପାଣି ଜମିବା ପରିସ୍ଥିତିକୁ ଏଡ଼ାଇବା ପାଇଁ ଉନ୍ନତ ଜଳ ନିଷ୍କାସନ ବ୍ଯ଼ବସ୍ଥା ବିକଶିତ କରନ୍ତୁ।",
            "ଯଦି ଫସଲ ଟାସେଲିଂ ପର୍ଯ୍ଯ଼ାଯ଼ରେ ଥାଏ, ତା \"ହେଲେ ଏସି ପିଛା 25 କିଲୋଗ୍ରାମ ଯ଼ୁରିଆ ଲଗାନ୍ତୁ ଏବଂ ଯଦି ପର୍ଯ୍ଯ଼ାପ୍ତ ପାଣି ନଥାଏ, ତେବେ ଜଳସେଚନ କରନ୍ତୁ।",
            "ବର୍ତ୍ତମାନର ପାଣିପାଗ ସ୍ଥିତି କାରଣରୁ ଷ୍ଟେମ ବୋରର, ଏଫ. ଏ. ଡବ୍ଲ୍ଯ଼ୁ. ଏବଂ ବ୍ଯ଼ାଣ୍ଡେଡ ଲିଫ୍ ଏବଂ ସିଥ୍ ବ୍ଲାଇଟ୍ ଦେଖାଯାଇପାରେ। ନିଯ଼ମିତ ଭାବେ କ୍ଷେତ ଉପରେ ନଜର ରଖନ୍ତୁ ଏବଂ ସଂକ୍ରମିତ ଗଛର ଅଂଶଗୁଡ଼ିକୁ ବାହାର କରନ୍ତୁ।",
            "ଫଲ୍ ଆର୍ମି କୃମିକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ ଇମାମେକ୍ଟିନ୍ ବେନ୍ଜୋଏଟ୍ 5 ପ୍ରତିଶତ ଏସ୍ଜି @0.4 ଗ୍ରାମ୍/ଲିଟର ପାଣି କିମ୍ବା କ୍ଲୋରାଣ୍ଟ୍ରାନିଲିପ୍ରୋଲ୍ 18.5% ଏସ୍ସି @0.4 ମିଲି/ଆଇଟ୍ରେ ପାଣି ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "black gram": {
         "advisory": [
            "ଏହା ପ୍ରାକ୍-ରାବି କଳା ଗହମ (ବୀରି) ଏବଂ ସବୁଜ ଗହମ (ମୁଙ୍ଗ) ବୁଣିବା ସମୟ। ଏକର ପିଛା 10 କିଲୋଗ୍ରାମ ମଞ୍ଜି ବ୍ୟବହାର କରନ୍ତୁ। ବୁଣିବା ପୂର୍ବରୁ, ମଞ୍ଜିଗୁଡ଼ିକୁ ରାଇଜୋବିୟମ୍ ସଂସ୍କୃତି ସହିତ ଚିକିତ୍ସା କରିବାକୁ ହେବ। ଅନ୍ତିମ ଜମି ପ୍ରସ୍ତୁତି ସମୟରେ ଏକର ପିଛା 4 କିଲୋଗ୍ରାମ ୟୁରିଆ, 35 କିଲୋଗ୍ରାମ ଡିଏପି ଏବଂ 13 କିଲୋଗ୍ରାମ ଏମଓପି ଲଗାନ୍ତୁ। 30 ସେ. ମି. ବ୍ୟବଧାନରେ ମଞ୍ଜି ବୁଣନ୍ତୁ ଏବଂ ଗଛ ଠାରୁ ଗଛର ଦୂରତା 10-15 ସେ. ମି. ମଧ୍ୟରେ ରଖନ୍ତୁ।"
         ]
      },
      "sesame": {
         "advisory": [
            "ପ୍ରାକ୍-ରାବି ତିଲ ବୁଣିବା ପାଇଁ ଏହା ହେଉଛି ସର୍ବୋତ୍ତମ ସମୟ। ଏକର ପିଛା 3 କି. ଗ୍ରା. ମଞ୍ଜି ବ୍ୟବହାର କରି ଗଛଗୁଡ଼ିକ ମଧ୍ୟରେ 30 ସେ. ମି. ଏବଂ 10 ସେ. ମି. ବ୍ୟବଧାନରେ ମଞ୍ଜି ବୁଣନ୍ତୁ। ଅନ୍ତିମ ଜମି ପ୍ରସ୍ତୁତି ସମୟରେ ଏକର ପିଛା 6.5 କି. ଗ୍ରା. ୟୁରିଆ, 17 କି. ଗ୍ରା. ଡିଏପି ଏବଂ 13 କି. ଗ୍ରା. ଏମଓପି ଲଗାନ୍ତୁ।"
         ]
      },
      "brinjal": {
         "advisory": [
            "ୱିଲ୍ଟକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ, 200 ଲିଟର ପାଣି ସହିତ ମିଶ୍ରିତ ମୂଳ ଅଞ୍ଚଳରେ ଟେବୁକୋନାଜୋଲ୍ 25.9% ଇସି @200-ମିଲି/ଏକର + ସ୍ଟ୍ରେପ୍ଟୋସାଇକ୍ଲିନ୍ @30 ଗ୍ରାମ୍/ଏକର ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "chilli": {
         "advisory": [
            "ଫଳ ଛେଦକକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ, 200 ଲିଟର ପାଣି ସହିତ ସିଣ୍ଟ୍ରାନିଲିପ୍ରୋଲ 10.26% ଓଡି @240 ମିଲି/ଏକର ମିଶାଇ ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "papaya": {
         "advisory": [
            "କଦଳୀ ପତ୍ରର କର୍ଲ ଭୂତାଣୁକୁ ନିଯ଼ନ୍ତ୍ରଣ କରିବା ପାଇଁ ଏକର ପିଛା 8 ନିଯ଼ୁତ ହଳଦିଆ ଚଟପଟା ଜାଲ ଲଗାନ୍ତୁ ଏବଂ ଲିଟର ପିଛା 3 ମିଲି ନିମ୍ବ ତେଲ (1500 ପିପିଏମ) ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      }
   },
   "date": "27-09-2024"
}