{
   "weather_details": {
      "03/04/2024": {
         "rainfall": 0,
         "t_max": 41,
         "t_min": 26,
         "rh_max": 46,
         "rh_min": 11,
         "wind_speed": 8,
         "wind_direction": 288,
         "cloud_cover": 0
      },
      "04/04/2024": {
         "rainfall": 0,
         "t_max": 41,
         "t_min": 26,
         "rh_max": 63,
         "rh_min": 10,
         "wind_speed": 7,
         "wind_direction": 198,
         "cloud_cover": 1
      },
      "05/04/2024": {
         "rainfall": 0,
         "t_max": 42,
         "t_min": 27,
         "rh_max": 53,
         "rh_min": 16,
         "wind_speed": 9,
         "wind_direction": 207,
         "cloud_cover": 1
      },
      "06/04/2024": {
         "rainfall": 0,
         "t_max": 42,
         "t_min": 27,
         "rh_max": 51,
         "rh_min": 12,
         "wind_speed": 9,
         "wind_direction": 165,
         "cloud_cover": 1
      },
      "07/04/2024": {
         "rainfall": 0,
         "t_max": 42,
         "t_min": 27,
         "rh_max": 35,
         "rh_min": 8,
         "wind_speed": 10,
         "wind_direction": 202,
         "cloud_cover": 2
      }
   },
   "names_of_crops": [
      "ଧାନ।",
      "ଆଖୁ",
      "ମକା",
      "ଟମାଟୋ",
      "ବାଇଗଣ",
      "ନଡ଼ିଆ",
      "ପନିପରିବା",
      "କଳା ଚଣା",
      "ସବୁଜ ଚଣା",
      "ରସୁଣ",
      "ଓକ୍ରା",
      "ଆମ୍ବ"
   ],
   "general_advisory": "ଧାନ ଫସଲରେ, ପେନିକଲ୍ ଆରମ୍ଭ, ପେନିକଲ୍ ଉଦ୍ଭବ, ଫୁଲ ଏବଂ କ୍ଷୀର ଦୋଇବା ପର୍ଯ୍ଯ଼ାଯ଼ ଗୁରୁତ୍ୱପୂର୍ଣ୍ଣ ପର୍ଯ୍ଯ଼ାଯ଼ | ଆଖୁରେ ଶୁଖିଲା ପତ୍ରରେ ଧାଡ଼ିଗୁଡ଼ିକୁ ଢାଙ୍କି ଦିଅନ୍ତୁ। ଜଳ ସଂରକ୍ଷଣ ପାଇଁ ସ୍ପ୍ରିଂକଲର ଜଳସେଚନ ପ୍ରଯ଼ୋଗ କରନ୍ତୁ। ମକା ଏବଂ ଟମାଟୋ ପାଇଁ ଉପଯୁକ୍ତ ଜଳସେଚନ ବଜାଯ଼ ରଖନ୍ତୁ | ଜଳକ୍ଷଯ଼ ହ୍ରାସ କରିବା ପାଇଁ ନଡ଼ିଆ ପତ୍ରକୁ ମଲ୍ଚ କରନ୍ତୁ। ନୂତନ ଭାବରେ ରୋପଣ କରାଯାଇଥିବା ପନିପରିବା ଚାରା ଉପରେ କାଗଜ କ୍ଯ଼ାପ୍ ସହିତ ଆଚ୍ଛାଦନ କରନ୍ତୁ | ଯଦି ପାଣିର ତାପମାତ୍ରା 30 ଡିଗ୍ରୀ ସେଲସିଯ଼ସକୁ ବୃଦ୍ଧି ପାଏ, ତେବେ ଅଗଭୀର ପୋଖରୀରୁ ଫିଙ୍ଗରଲିଂ ଅମଳ କରନ୍ତୁ। ଧାନ ଫସଲରେ ହଳଦିଆ ଷ୍ଟେମ ବୋରର ପରିଚାଳନା କରନ୍ତୁ। ଧାନ ଫସଲରେ ବିସ୍ଫୋରଣ ରୋଗ ପରିଚାଳନା କରନ୍ତୁ। ତମାଖୁ କ୍ଯ଼ାଟରପିଲରକୁ କଳା ଚଣା ଏବଂ ସବୁଜ ଚଣା ସହିତ ପରିଚାଳନା କରନ୍ତୁ। ଆଖୁରେ ଅର୍ଲି ସୁଟ୍ ବୋରର୍ ପରିଚାଳନା କରନ୍ତୁ। ବାଇଗଣ ଅଙ୍କୁର ଏବଂ ଫଳ ଛେଦକକୁ ପରିଚାଳନା କରନ୍ତୁ। ଓକ୍ରାରେ ଶ୍ୱେତ ମାଛି ସଂକ୍ରମଣରୁ ରକ୍ଷା କରନ୍ତୁ। ସଠିକ ଭାବେ ଅମଳ ଏବଂ ପିଆଜର ସଂରକ୍ଷଣ। ଆମ୍ବରେ ଥିବା ଆମ୍ବ ହପରକୁ ନିଯ଼ନ୍ତ୍ରଣ କରନ୍ତୁ।",
   "crops_data": {
      "paddy": {
         "advisory": [
            "ଧାନ ଫସଲରେ, ପେନିକଲ୍ ଆରମ୍ଭ, ପେନିକଲ୍ ଉଦ୍ଭବ, ଫୁଲ ଏବଂ କ୍ଷୀର ଦୋଇବା ପର୍ଯ୍ଯ଼ାଯ଼ ଗୁରୁତ୍ୱପୂର୍ଣ୍ଣ ପର୍ଯ୍ଯ଼ାଯ଼ | ଆଖୁରେ ଶୁଖିଲା ପତ୍ରରେ ଧାଡ଼ିଗୁଡ଼ିକୁ ଢାଙ୍କି ଦିଅନ୍ତୁ। ଜଳ ସଂରକ୍ଷଣ ପାଇଁ ସ୍ପ୍ରିଂକଲର ଜଳସେଚନ ପ୍ରଯ଼ୋଗ କରନ୍ତୁ। ଧାନ ଫସଲରେ ହଳଦିଆ ଷ୍ଟେମ ବୋରର ପରିଚାଳନା କରନ୍ତୁ। ଧାନ ଫସଲରେ ବିସ୍ଫୋରଣ ରୋଗ ପରିଚାଳନା କରନ୍ତୁ।"
         ]
      },
      "sugarcane": {
         "advisory": [
            "ଆଖୁରେ ଶୁଖିଲା ପତ୍ରରେ ଧାଡ଼ିଗୁଡ଼ିକୁ ଢାଙ୍କି ଦିଅନ୍ତୁ। ଗ୍ରୀଷ୍ମ ଋତୁରେ ପାଣିର ଅଭାବରୁ ଫସଲକୁ ରକ୍ଷା କରିବା ପାଇଁ 4 ପ୍ରତିଶତ ପୋଟାସିଯ଼ମ ସହିତ ଉପର ପୋଷାକ ପିନ୍ଧନ୍ତୁ | ଉତ୍ତାପ ପ୍ରଭାବକୁ ହ୍ରାସ କରିବା ପାଇଁ ସ୍ପ୍ରିଂକଲର ଜଳସେଚନ ପ୍ରଯ଼ୋଗ କରନ୍ତୁ। ଆଖୁରେ ଅର୍ଲି ସୁଟ୍ ବୋରର୍ ପରିଚାଳନା କରନ୍ତୁ।"
         ]
      },
      "maize": {
         "advisory": [
            "ଉଚ୍ଚ ତାପମାତ୍ରା ମକା ଫସଲର ଜଳ ଆବଶ୍ଯ଼କତା ବୃଦ୍ଧି କରିଥାଏ। ଫସଲକୁ ଜଳସେଚନ କରନ୍ତୁ। କ୍ଷେତରେ ପାଣି କେବେ ବି ଛଅ ଘଣ୍ଟାରୁ ଅଧିକ ସମଯ଼ ପାଇଁ ଅଟକି ରହିବାକୁ ଦିଅନ୍ତୁ ନାହିଁ।"
         ]
      },
      "tomato": {
         "advisory": [
            "ଦିନର ଉଚ୍ଚ ତାପମାତ୍ରା ଟମାଟୋରେ ଶୁଷ୍କତା ସୃଷ୍ଟି କରିପାରେ। ମୂଳ ଅଞ୍ଚଳରେ 10 ଲିଟର ପାଣିରେ 1 ଗ୍ରାମ୍ ସ୍ଟ୍ରେପ୍ଟୋସାଇକ୍ଲିନ୍ ଲଗାନ୍ତୁ।"
         ]
      },
      "brinjal": {
         "advisory": [
            "ଏହି କୀଟକୁ ନିଯ଼ନ୍ତ୍ରଣ କରିବା ପାଇଁ, ଏକର ପିଛା ଲ୍ଯ଼ୁସିନ୍ ଲ୍ଯ଼ୁର୍ ଥିବା 20ଟି ଫେରୋମୋନ୍ ଫାନ୍ଦ ଲଗାନ୍ତୁ। 200 ଲିଟର ପାଣିରେ ମିଶ୍ରଣ କରି ନିମ୍ବ-ଆଧାରିତ କୀଟନାଶକ (ଆଜାଦିରାକ୍ଟିନ) 1500 ପିପିଏମ @600-ମିଲି/ଏକର ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "coconut": {
         "advisory": [
            "ଜଳକ୍ଷଯ଼କୁ ହ୍ରାସ କରିବା ପାଇଁ ଏକ ନଡ଼ିଆ ଗଛ ଚାରିପାଖରେ ମଲ୍ଚ ନଡ଼ିଆ 1.8 ମି. ଛାଡ଼ିଥାଏ।"
         ]
      },
      "vegetables": {
         "advisory": [
            "ଦିନରେ ନୂତନ ଭାବରେ ରୋପଣ କରାଯାଇଥିବା ପନିପରିବା ଚାରା ଉପରେ କାଗଜ କ୍ଯ଼ାପ୍ ସହିତ ଆଚ୍ଛାଦନ କରନ୍ତୁ |"
         ]
      },
      "black gram": {
         "advisory": [
            "କ୍ଷେତର ଚାରିପାଖରେ କ୍ଲୋରପିରିଫସ୍ 1.5% ଡି @10 କିଲୋଗ୍ରାମରେ ଧୂଳିସାତ୍ କରି କ୍ଯ଼ାଟର୍ପିଲାର୍ମାନଙ୍କର ସ୍ଥାନାନ୍ତରଣ ଯାଞ୍ଚ କରନ୍ତୁ | ରାସାଯ଼ନିକ ନିଯ଼ନ୍ତ୍ରଣ ପାଇଁ ନୋଭାଲୁରନ୍ 5.25% + ଇଣ୍ଡୋକ୍ସାକାର୍ବ 4.25% @400-ମିଲି/ଏକର ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "green gram": {
         "advisory": [
            "କ୍ଷେତର ଚାରିପାଖରେ କ୍ଲୋରପିରିଫସ୍ 1.5% ଡି @10 କିଲୋଗ୍ରାମରେ ଧୂଳିସାତ୍ କରି କ୍ଯ଼ାଟର୍ପିଲାର୍ମାନଙ୍କର ସ୍ଥାନାନ୍ତରଣ ଯାଞ୍ଚ କରନ୍ତୁ | ରାସାଯ଼ନିକ ନିଯ଼ନ୍ତ୍ରଣ ପାଇଁ ନୋଭାଲୁରନ୍ 5.25% + ଇଣ୍ଡୋକ୍ସାକାର୍ବ 4.25% @400-ମିଲି/ଏକର ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "onion": {
         "advisory": [
            "ପିଆଜର ଅମଳ ପରେ, କନ୍ଦ ଉପରେ 2-2.5 ସେ. ମି. ରଖି ଉପର ଭାଗକୁ କାଟି ଦିଅନ୍ତୁ। ଅମଳ ହୋଇଥିବା କନ୍ଦକୁ ଭଲ ଭାବେ ବାଯ଼ୁ ଚଳାଚଳ କରୁଥିବା କଂକ୍ରିଟ୍ ଚଟାଣ ଥିବା କୋଠରୀରେ ଶୁଖାଇବା ଉଚିତ।"
         ]
      },
      "okra": {
         "advisory": [
            "ଶ୍ୱେତ ମାଛି ସଂକ୍ରମଣଃ ଓକ୍ରାରେ ଶ୍ୱେତ ମାଛି ସଂକ୍ରମଣକୁ ରୋକିବା ପାଇଁ, ମଞ୍ଜି ବୁଣିବା ପୂର୍ବରୁ ଇମିଡାକ୍ଲୋପ୍ରିଡ୍ @7 ଗ୍ରାମ୍/କେଜି ମଞ୍ଜି ସହିତ ଚିକିତ୍ସା କରାଯିବା ଉଚିତ୍ |"
         ]
      },
      "mango": {
         "advisory": [
            "ଆମ୍ବ ହପରକୁ ନିଯ଼ନ୍ତ୍ରଣ କରିବା ପାଇଁ, ଇମିଡାକ୍ଲୋପ୍ରିଡ୍ 17.8% SL @5 ମିଲି/15 ଲିଟର ପାଣି ସ୍ପ୍ରେ କରନ୍ତୁ। ଗଛ ତଳେ ଧୂଆଁ ଲଗାଇବା ଦ୍ୱାରା କୀଟପତଙ୍ଗ ସଂଖ୍ଯ଼ା ହ୍ରାସ କରିବାରେ ମଧ୍ଯ଼ ସହାଯ଼କ ହୋଇଥାଏ।"
         ]
      }
   },
   "date": "02-04-2024"
}