{
   "weather_details": {
      "01-02-2025": {
         "rainfall": 0,
         "t_max": 33,
         "t_min": 16,
         "rh_max": 54,
         "rh_min": 22,
         "wind_speed": 4,
         "wind_direction": 233,
         "cloud_cover": 1
      },
      "02-02-2025": {
         "rainfall": 0,
         "t_max": 33,
         "t_min": 16,
         "rh_max": 52,
         "rh_min": 20,
         "wind_speed": 3,
         "wind_direction": 186,
         "cloud_cover": 1
      },
      "03-02-2025": {
         "rainfall": 0,
         "t_max": 34,
         "t_min": 17,
         "rh_max": 47,
         "rh_min": 20,
         "wind_speed": 3,
         "wind_direction": 240,
         "cloud_cover": 2
      },
      "04-02-2025": {
         "rainfall": 0,
         "t_max": 34,
         "t_min": 17,
         "rh_max": 46,
         "rh_min": 19,
         "wind_speed": 2,
         "wind_direction": 297,
         "cloud_cover": 3
      },
      "05-02-2025": {
         "rainfall": 0,
         "t_max": 33,
         "t_min": 17,
         "rh_max": 44,
         "rh_min": 21,
         "wind_speed": 2,
         "wind_direction": 194,
         "cloud_cover": 2
      }
   },
   "names_of_crops": [
      "ଧାନ।",
      "ଚଣା",
      "ଗ୍ରୀନଗ୍ରାମ",
      "ଚିନାବାଦାମ",
      "ସୋରିଷ",
      "ସୂର୍ଯ୍ୟମୁଖୀ",
      "ରସୁଣ",
      "ଟମାଟୋ",
      "ଲଙ୍କା",
      "ଗୋଲାପ।",
      "ମେରିଗୋଲ୍ଡ",
      "ଗୋରୁ ଏବଂ ମଇଁଷି",
      "ଛେଳି ଏବଂ ମେଣ୍ଢା",
      "କୁକୁଡ଼ା ମାଂସ"
   ],
   "general_advisory": "ସକାଳ କିମ୍ବା ସନ୍ଧ୍ୟା ସମୟରେ ସର୍ବଦା ମୃତ୍ତିକା ପରୀକ୍ଷା ରିପୋର୍ଟ ଏବଂ କୀଟନାଶକ ସୁପାରିସ କରାଯାଇଥିବା ମାତ୍ରା ଅନୁଯାୟୀ ସଠିକ୍ ପଦ୍ଧତିରେ ସାରର ସୁପାରିସ କରାଯାଇଥିବା ମାତ୍ରା ପ୍ରୟୋଗ କରନ୍ତୁ ଏବଂ ପ୍ରୟୋଗ ସମୟରେ ପବନର ଦିଗ ପ୍ରତି ଧ୍ୟାନ ଦିଅନ୍ତୁ। ବର୍ତ୍ତମାନର ଶୁଖିଲା ପାଗକୁ ଦୃଷ୍ଟିରେ ରଖି ଚିନାବାଦାମ, ସୂର୍ଯ୍ୟମୁଖୀ, ଚଣା, ମକା, ସବୁଜ ଚଣା ଏବଂ ପନିପରିବା ଭଳି ସ୍ଥାୟୀ ଫସଲକୁ ବାରମ୍ବାର ଜଳସେଚନ ପ୍ରଦାନ କରନ୍ତୁ। କୀଟପତଙ୍ଗ ସଂଖ୍ୟାକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ କୃଷକମାନଙ୍କୁ ଚଣା, ସବୁଜ ଚଣା, ଚିନାବାଦାମ ଏବଂ ପନିପରିବା ପରି ଫସଲ କ୍ଷେତ ଏବଂ ଆଖପାଖରେ \"ଟି\" ଆକୃତିର ପକ୍ଷୀ ପର୍ଚ୍ ସ୍ଥାପନ କରିବାକୁ ପରାମର୍ଶ ଦିଆଯାଇଛି। ବାଇଗଣ, ଫୁଲକୋବି, ବନ୍ଧାକୋବି, ଟମାଟୋ ଇତ୍ୟାଦି ପନିପରିବାରେ ଛେଦକ କୀଟ ଉପରେ ନଜର ରଖିବା ପାଇଁ ଏକର ପିଛା 8ରେ ଫେରୋମୋନ୍ ଫାନ୍ଦ ଲଗାନ୍ତୁ। ଉଦ୍ଭିଦ ପର୍ଯ୍ୟାୟରେ ପନିପରିବାରେ ହ୍ୱାଇଟ୍ ମାଛି, ଏଫିଡ୍, ଜ୍ଯାସିଡ୍ ଏବଂ ନୀଳ ଷ୍ଟିକ୍ ଫାନ୍ଦ ପରି ଶୋଷକ କୀଟ ଉପରେ ନଜର ରଖିବା ପାଇଁ ଏକର ପିଛା 8ରେ ହଳଦିଆ ଷ୍ଟିକ୍ ଫାନ୍ଦ ଲଗାନ୍ତୁ। ବର୍ତ୍ତମାନର ଶୁଖିଲା ପାଗକୁ ଦୃଷ୍ଟିରେ ରଖି, ନିୟମିତ ବ୍ୟବଧାନରେ ଠିଆ ହୋଇଥିବା ଫସଲକୁ ଜଳସେଚନ ପ୍ରଦାନ କରନ୍ତୁ।",
   "crops_data": {
      "paddy": {
         "advisory": [
            "ନିଡ୍ ମ୍ୟାନେଜମେଣ୍ଟଃ ଏକ ଏକର କ୍ଷେତ୍ର ପାଇଁ, ସମାନ ପରିମାଣର ବାଲି ସହିତ ରୋପଣ ପରେ 3ରୁ 5 ଦିନ ମଧ୍ୟରେ ଗ୍ରାନୁଲାର ହର୍ବିସାଇଡ୍ ବେନ୍ସଲ୍ଫୁରନ୍-ମିଥାଇଲ 0.6% + ପ୍ରିଟିଲାକ୍ଲୋର 6% @4 କିଲୋଗ୍ରାମ ପ୍ରୟୋଗ କରନ୍ତୁ ଏବଂ ଏହାକୁ ସମାନ ଭାବରେ କ୍ଷେତରେ ପ୍ରସାରଣ କରନ୍ତୁ କିମ୍ବା ପାଇରାଜୋସଲ୍ଫୁରନ୍-ଇଥାଇଲ 10% ଡବ୍ଲ୍ୟୁ. ପି. @100 ଗ୍ରାମ ସ୍ପ୍ରେ କରନ୍ତୁ 8-10 ପ୍ରତିରୋପଣର କିଛି ଦିନ ପରେ କିମ୍ବା ବିସ୍ପିରିବାକ୍ ସୋଡ଼ିଅମ 10% ଏସ୍. ସି. @120 ମିଲି. 15-20 ଡି. ଏ. ଟି. ରେ ସ୍ପ୍ରେ କରନ୍ତୁ କିମ୍ବା 20 ରୁ 25 ଡିଏ. ଟି./ଡି. ଏ. ଏସ୍. ରେ ଫେନାକ୍ସାପ୍ରପ୍-ପି-ଇଥାଇଲ 9% ଇସି @300 ମିଲି./ଏସି. ସ୍ପ୍ରେ କରନ୍ତୁ। କୀଟ ପରିଚାଳନାଃ କାଣ୍ଡ ଛେଦକ ଏବଂ ପତ୍ରର କୀଟ ସଂଖ୍ୟା ଉପରେ ନଜର ରଖିବା ପାଇଁ ଏକର ପିଛା 3ଟି ଫେରୋମୋନ୍ ଫାନ୍ଦ ଲଗାନ୍ତୁ।"
         ]
      },
      "chickpea": {
         "advisory": [
            "କୀଟ ପରିଚାଳନାଃ ପାଉଡର ଫଙ୍ଗୁରଃ ପ୍ରଚଳିତ ପାଣିପାଗ ସ୍ଥିତି ପାଉଡର ଫଙ୍ଗୁର ରୋଗର ବିକାଶକୁ ସମର୍ଥନ କରେ | ସ୍ପ୍ରେକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ, ସଲଫର୍ 80 ପ୍ରତିଶତ ଡବ୍ଲ୍ୟୁ. ପି. @800 ଗ୍ରାମ୍/ଏସି କିମ୍ବା ପ୍ରୋପିକୋନାଜୋଲ୍ 25 ପ୍ରତିଶତ ଇସି @200 ମିଲି/ଏସି ସହିତ 200 ଲିଟର ପାଣି ମିଶାଇ ଦିଅନ୍ତୁ। ଷ୍ଟେମ ରଟ୍/ରୁଟ୍ ରଟ୍/ୱିଲ୍ଟିଙ୍ଗ୍ଃ ପ୍ରଚଳିତ ପାଣିପାଗ ଅବସ୍ଥା କଲାର୍ ରଟ୍, ରୁଟ୍ ରଟ୍, ଷ୍ଟେମ ରଟ୍ ଏବଂ ୱିଲ୍ଟିଙ୍ଗ୍ ପରି ଫଙ୍ଗାଲ୍ ରୋଗର ବିକାଶକୁ ସମର୍ଥନ କରେ | ଯଦି ଲକ୍ଷଣ ଦେଖାଯାଏ, ତେବେ କାର୍ବେନଡାଜିମ୍ 50 ପ୍ରତିଶତ ଡବ୍ଲ୍ୟୁ. ପି. @400 ଗ୍ରାମ୍/ଏସି କିମ୍ବା ଭାଲିଡାମାଇସିନ୍ 3 ପ୍ରତିଶତ ଏଲ. @400 ମିଲି/ଏସି ସହିତ 200 ଲିଟର ପାଣି ମିଶାଇ ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "greengram": {
         "advisory": [
            "କୀଟ ପରିଚାଳନାଃ ଏଫିଡ୍ ଏବଂ ହ୍ୱାଇଟ୍ଫ୍ଲାଇଃ ଏଫିଡ୍ ଏବଂ ହ୍ୱାଇଟ୍ ମାଛି ପରି କୀଟ ଶୋଷିବା ଘଟଣା ପାଇଁ ପ୍ରଚଳିତ ପାଣିପାଗ ସ୍ଥିତି ଅନୁକୂଳ | କୀଟ ସଂଖ୍ୟା ଉପରେ ନଜର ରଖିବା ପାଇଁ ଉଦ୍ଭିଦ ସ୍ତରରେ ଏକର ପିଛା 8 ନିୟୁତ ହଳଦିଆ ଚଟପଟା ଜାଲ ଲଗାନ୍ତୁ ଏବଂ ସଂକ୍ରମଣର ପ୍ରାରମ୍ଭିକ ପର୍ଯ୍ୟାୟରେ ନିମ୍ବ ତେଲ ଆଧାରିତ କୀଟନାଶକ ଆଜାଦିରାକ୍ଟିନ 0.03% (300 ପିପିଏମ) ଲିଟର ପିଛା 5 ମିଲି ପାଣି ଲଗାନ୍ତୁ। ରାସାୟନିକ ନିୟନ୍ତ୍ରଣ ପାଇଁ, 15 ଲିଟର ପାଣି ସହିତ ମିଶ୍ରଣ କରି ଇମିଡାକ୍ଲୋପ୍ରିଡ୍ 17.8% ଏସଏଲ @4 ମିଲି କିମ୍ବା ଥିୟାମେଥୋକ୍ସାମ 25% ଡବ୍ଲୁଜି @3ଜି କିମ୍ବା କ୍ଲୋରପିରିଫସ୍ 20% ଇସି @35 ମିଲି ସ୍ପ୍ରେ କରନ୍ତୁ। ପାଉଡର ଫଙ୍ଗୁରଃ ବର୍ତ୍ତମାନର ପାଣିପାଗ ସ୍ଥିତିରେ ସଂକ୍ରମଣ ପାଉଡର ଫଙ୍ଗୁର ଦେଖାଯାଇପାରେ। ଏହାକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ, 15 ଲିଟର ପାଣି ସହିତ 60 ଗ୍ରାମ୍ ଭିଜେଇବା ଯୋଗ୍ୟ ସଲଫର୍ ମିଶାନ୍ତୁ।"
         ]
      },
      "groundnut": {
         "advisory": [
            "କୀଟ ପରିଚାଳନାଃ ଟିକ୍କାଃ ଯଦି ଲକ୍ଷଣ ଦେଖାଯାଏ, କ୍ଲୋରୋଥାଲୋନିଲ୍ 75 ପ୍ରତିଶତ ଡବ୍ଲ୍ୟୁ. ପି. @400 ଗ୍ରାମ୍/ଏସି କିମ୍ବା ହେକ୍ସାକୋନାଜୋଲ୍ 5 ପ୍ରତିଶତ ଇ. ସି. @300 ମିଲି/ଏସି କିମ୍ବା ମାନକୋଜେବ୍ 75 ପ୍ରତିଶତ ଡବ୍ଲ୍ୟୁ. ପି. @600 ଗ୍ରାମ୍/ଏସି ସହିତ 200 ଲିଟର ପାଣି ମିଶାଇ ପ୍ରୟୋଗ କରିବାକୁ ପରାମର୍ଶ ଦିଆଯାଇଛି।"
         ]
      },
      "mustard": {
         "advisory": [
            "କୀଟ ପରିଚାଳନାଃ ଧଳା ଜଙ୍କଃ ପ୍ରଚଳିତ ପାଣିପାଗ ସ୍ଥିତିରେ (କୁହୁଡ଼ି), ଧଳା ଜଙ୍କ ସଂକ୍ରମଣ ଦେଖିବାକୁ ମିଳିଥାଏ। ଲକ୍ଷଣ ଦେଖାଗଲେ ମେଟାଲାକ୍ସାଇଲ୍ ଏମ୍ 4 ପ୍ରତିଶତ + ମାନକୋଜେବ୍ 64 ପ୍ରତିଶତ ଡବ୍ଲ୍ୟୁ. ପି. @25 ଗ୍ରାମ୍ କିମ୍ବା କପର ଅକ୍ସିକ୍ଲୋରାଇଡ୍ 50 ପ୍ରତିଶତ ଡବ୍ଲ୍ୟୁ. ପି. @30 ଗ୍ରାମ୍ ସହିତ 10 ଲିଟର ପାଣି ମିଶାଇ ଲଗାନ୍ତୁ।"
         ]
      },
      "sunflower": {
         "advisory": [
            "କୀଟ ପରିଚାଳନାଃ ଶୋଷକ କୀଟ କମ୍ପ୍ଲେକ୍ସ (ଏଫିଡ୍, ହପର୍, ଥ୍ରିପ୍ସ ଏବଂ ହ୍ୱାଇଟ୍ ଫ୍ଲାଇ): ପ୍ରଚଳିତ ପାଣିପାଗ ସ୍ଥିତି ଶୋଷକ କୀଟଗୁଡ଼ିକର ବିକାଶକୁ ସମର୍ଥନ କରେ | ଏସିଟାମିପ୍ରିଡ୍ 20 ପ୍ରତିଶତ ଏସ. ପି. @50 ଗ୍ରାମ/ଏକର କିମ୍ବା ଇମିଡାକ୍ଲୋପ୍ରିଡ୍ 17.8% ଏସ. ଏଲ. @60 ମିଲି/ଏକରକୁ 200 ଲିଟର ପାଣି ସହିତ ମିଶାଇ ଆବଶ୍ୟକ ଅନୁଯାୟୀ ସ୍ପ୍ରେ କରିବା ପାଇଁ ପରାମର୍ଶ ଦିଆଯାଇଛି। ପାଉଡର ଫଙ୍ଗୁର ସଂକ୍ରମଣଃ ବର୍ତ୍ତମାନର ପାଣିପାଗ ସ୍ଥିତିରେ ପାଉଡର ଫଙ୍ଗୁର ସଂକ୍ରମଣ ହୋଇପାରେ। ନିୟନ୍ତ୍ରଣ ପଦକ୍ଷେପ ସ୍ୱରୂପ ପ୍ରୋପିକୋନାଜୋଲ 25 ପ୍ରତିଶତ ଇସି @1 ମିଲି/ଲିଟର କିମ୍ବା ଟ୍ରାୟାଡେମେଫନ୍ 25 ପ୍ରତିଶତ ଡବ୍ଲ୍ୟୁ. ପି. @1 ଗ୍ରାମ/ଲିଟର ପାଣି ସ୍ପ୍ରେ କରନ୍ତୁ। କେପିଟୁଲମ୍ ବୋରର୍ଃ ବାସିଲସ୍ ଥୁରିଙ୍ଗିଏନ୍ସିସ୍ ବାର୍ କୁର୍ଷ୍ଟାକି 5 ପ୍ରତିଶତ ଡବ୍ଲ୍ୟୁ. ପି. @1.5 ଗ୍ରାମ୍/ଲିଟର ପାଣି ସ୍ପ୍ରେ କରନ୍ତୁ। ହେଡ୍ ରୋଟ୍ଃ 0.40% ତମ୍ବା ଅକ୍ସିକ୍ଲୋରାଇଡ୍ 50% ଡବ୍ଲ୍ୟୁ. ପି. @3 ଗ୍ରାମ/ଲିଟର ପାଣି ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "onion": {
         "advisory": [
            "ପୋଷକ ତତ୍ତ୍ୱ ପରିଚାଳନାଃ ଛାଣିବା ଏବଂ ଆଗାଛା କାଟିବା ପରେ, 4-ସପ୍ତାହ ପର୍ଯ୍ୟାୟରେ 45 କିଲୋଗ୍ରାମ ୟୁରିଆକୁ ପ୍ରଥମ ଟପ୍ ଡ୍ରେସିଂ ଭାବରେ ଲଗାନ୍ତୁ ଏବଂ ପରେ ଜଳସେଚନ କରନ୍ତୁ। ହଏଙ୍ଗ୍ ଏବଂ ଆଗାଛା କାଟିବା ପରେ, ଜଳସେଚନ ପରେ 6 ରୁ 7 ସପ୍ତାହ ପର୍ଯ୍ୟାୟରେ ଦ୍ୱିତୀୟ ଶୀର୍ଷ ଡ୍ରେସିଙ୍ଗ୍ ଭାବରେ 23 କେଜି ୟୁରିଆ ଲଗାନ୍ତୁ |"
         ]
      },
      "tomato": {
         "advisory": [
            "କୀଟ ପରିଚାଳନାଃ ଫଳ ଏବଂ ଶୁଟ୍ ବୋରର୍ଃ କୀଟ ସଂଖ୍ୟା ଉପରେ ନଜର ରଖିବା ପାଇଁ ଏକର ପିଛା 8ନସ୍ ସଂଖ୍ୟାରେ ଫେରୋମୋନ୍ ଟ୍ରାପ୍ ଲଗାନ୍ତୁ। ରାସାୟନିକ ନିୟନ୍ତ୍ରଣ ପାଇଁ, ସ୍ପ୍ରେ କିମ୍ବା ଫ୍ଲୁବେଣ୍ଡିଆମାଇଡ୍ 39.35% SC @3 ମିଲି ସିଣ୍ଟ୍ରାନ୍ଲିପ୍ରୋଲେ 10.26% OD @30 ମିଲି କିମ୍ବା ଥିୟାମେଥୋକ୍ସାମ୍ 12.6% + ଲାମ୍ବଡା-ସାଇହାଲୋଥ୍ରିନ୍ 9.5% ZC @4 ମିଲି କିମ୍ବା ଇଣ୍ଡୋକ୍ସାକାର୍ବ 14.5% SC @15 ମିଲି 15 ଲିଟର ପାଣି ସହିତ ମିଶ୍ରିତ | ପତ୍ର କୁଞ୍ଚନ/ଧଳା ମାଛିଃ ଧଳା ମାଛି ସଂକ୍ରମଣ ହେତୁ ପତ୍ର କୁଞ୍ଚନ ଲକ୍ଷ୍ୟ କରାଯାଇପାରେ | କୀଟ ସଂଖ୍ୟା ଉପରେ ନଜର ରଖିବା ପାଇଁ ଏକର ପିଛା 8ନସ୍ ପିଛା ହଳଦିଆ ଚଟପଟା ଜାଲ ଲଗାନ୍ତୁ। ରାସାୟନିକ ନିୟନ୍ତ୍ରଣ ପାଇଁ ଡାଇମେଥୋଏଟ୍ 30 ପ୍ରତିଶତ ଇସି @20 ମିଲି କିମ୍ବା ସିଣ୍ଟ୍ରାନ୍ଲିପ୍ରୋଲ୍ 10.26% ଓଡି @30 ମିଲି କିମ୍ବା ଥାୟାମେଥୋକ୍ସାମ୍ 12.6% + ଲାମ୍ବଡା-ସାଇହାଲୋଥ୍ରିନ୍ 9.5 ପ୍ରତିଶତ @4 ମିଲି କିମ୍ବା ଇଣ୍ଡୋକ୍ସାକାର୍ବ 14.5% ଏସସି @15 ମିଲି 15 ଲିଟର ପାଣି ସହିତ ମିଶାଇ ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "chilli": {
         "advisory": [
            "କୀଟ ପରିଚାଳନାଃ ମାଇଟଃ ମାଇଟ ସଂକ୍ରମିତ ଲଙ୍କା ଗଛରେ ନିମ୍ନମୁଖୀ ବକ୍ରତା ଏବଂ ପତ୍ର ସଙ୍କୁଚିତ ହେବା ସହିତ ଷ୍ଟାଣ୍ଟେଡ ବୃଦ୍ଧି ଦେଖାଯାଏ | ମାଇଟ୍ ସଂକ୍ରମଣକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ ଇଥିୟନ୍ 50 ପ୍ରତିଶତ ଇସି କିମ୍ବା ପ୍ରୋପାର୍ଜାଇଟ୍ 57 ପ୍ରତିଶତ ଇସି @600-ମିଲି/ଏକର ସହିତ 200 ଲିଟର ପାଣି ମିଶାଇ ଲଗାନ୍ତୁ।"
         ]
      },
      "rose": {
         "advisory": [
            "ପାଉଡର ଫଙ୍ଗୁରଃ ପ୍ରଚଳିତ ପାଣିପାଗ ସ୍ଥିତିରେ ପାଉଡର ଫଙ୍ଗୁର ସଂକ୍ରମଣ ଗୋଲାପ ଗଛରେ ଦେଖାଯାଇପାରେ। ପ୍ରତିଷେଧକ ପଦକ୍ଷେପ ସ୍ୱରୂପ କାର୍ବେନଡାଜିମ୍ 50 ପ୍ରତିଶତ ଡବ୍ଲ୍ୟୁ. ପି. @2 ଗ୍ରାମ/ଲିଟର ପାଣି ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "merigold": {
         "advisory": [
            "ପୁଷ୍ପକ୍ରମ କ୍ଷୟଃ ମେରିଗୋଲ୍ଡ ସ୍ପ୍ରେରେ ପୁଷ୍ପକ୍ରମ କ୍ଷୟକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ ଏକ ଲିଟର ପାଣିରେ ମିଶାଇ ମାନକୋଜେବ୍ 75 ପ୍ରତିଶତ ଡବ୍ଲ୍ୟୁ. ପି. @2ଜି କିମ୍ବା କାର୍ବେଣ୍ଡାଜିମ୍ 50 ପ୍ରତିଶତ ଡବ୍ଲ୍ୟୁ. ପି. @1ଜି ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "cattle & buffalo": {
         "advisory": [
            "ବାୟୁରେ ଉତ୍ତାପ ଏବଂ ଆର୍ଦ୍ରତା କମ୍ ଥିବାରୁ ଗୋରୁ ଏବଂ ମଇଁଷି ଅସୁସ୍ଥ ହେବାର ସମ୍ଭାବନା କମ୍ ଥାଏ | ତେଣୁ, କୃଷକମାନେ ସ୍ତନ୍ୟପାନ ସମୟରେ ଶରୀରର ଅବସ୍ଥା ସ୍କୋରରେ ହୋଇଥିବା କ୍ଷତିର ଭରଣା ପାଇଁ ଯତ୍ନ ନେବା ଆବଶ୍ୟକ | ବାଛୁରୀ ହେବାର ଦୁଇ ମାସ ପୂର୍ବରୁ ଧୀରେ ଧୀରେ ଖାଦ୍ୟରେ ସାନ୍ଦ୍ରତାର ପରିମାଣ ବୃଦ୍ଧି କରିବାକୁ ପରାମର୍ଶ ଦିଆଯାଇଛି। ଏହା ଆଗାମୀ ସ୍ତନ୍ୟପାନ ସମୟରେ ଦୁଗ୍ଧ ଉତ୍ପାଦନ ବୃଦ୍ଧି କରିବାରେ ମଧ୍ୟ ସହାୟକ ହୋଇଥାଏ।"
         ]
      },
      "goat & sheep": {
         "advisory": [
            "ଯେହେତୁ ଛେଳିମାନେ ଥଣ୍ଡା ଦ୍ୱାରା ଅଧିକ ପ୍ରଭାବିତ ହୁଅନ୍ତି, ତେଣୁ ଛେଳି ଚାଷୀମାନଙ୍କୁ ସେମାନଙ୍କ ପଶୁମାନଙ୍କୁ ଥଣ୍ଡା ପବନ ଏବଂ ଚଟାଣରୁ ଦୂରେଇ ରଖିବାକୁ ପରାମର୍ଶ ଦିଆଯାଇଛି। ଯଦି ସେମାନେ ସେମାନଙ୍କ ଛେଳିମାନଙ୍କ ନାକରୁ ପାଣି ବୋହିବା ଏବଂ କ୍ରମାଗତ କାଶ ହେଉଥିବା ଚିହ୍ନଟ କରନ୍ତି, ତେବେ ତୁରନ୍ତ ପଶୁ ଚିକିତ୍ସକଙ୍କ ସହ ଯୋଗାଯୋଗ କରିବା ଆବଶ୍ୟକ।"
         ]
      },
      "poultry": {
         "advisory": [
            "କୁକୁଡ଼ା ପକ୍ଷୀମାନଙ୍କୁ ସେମାନଙ୍କର ମୃତ୍ୟୁହାର ଯାଞ୍ଚ କରିବା ପାଇଁ ତୀବ୍ର ଥଣ୍ଡା ପବନ ଏବଂ ଥଣ୍ଡା ଚଟାଣରୁ ରକ୍ଷା କରିବା ପରାମର୍ଶ ଦିଆଯାଏ | ଶୀତଳ ପବନରୁ ସେମାନଙ୍କ ପକ୍ଷୀମାନଙ୍କୁ ରକ୍ଷା କରିବା ପାଇଁ କୃଷକମାନେ କୁକୁଡ଼ା ଘରକୁ ମୋଟା ପଲିଥିନ୍ ଚାଦର ଦ୍ୱାରା ଆଚ୍ଛାଦିତ କରିବା ଆବଶ୍ୟକ ଏବଂ ସକାଳ 9ଟା ପରେ ସେଗୁଡ଼ିକୁ ବାହାର କରିଦେବା ଉଚିତ, ଯାହାଦ୍ୱାରା ସେଡରେ ସୂର୍ଯ୍ୟାଲୋକ ପ୍ରବେଶ କରିପାରିବ। କୃଷକମାନେ ଚଟାଣରେ ଆବର୍ଜନା ସାମଗ୍ରୀ ବିଷୟରେ ମଧ୍ୟ ସତର୍କ ରହିବା ଆବଶ୍ୟକ କାରଣ ଏହା ପକ୍ଷୀମାନଙ୍କୁ ଉଷ୍ମ ରଖିବାରେ ସାହାଯ୍ୟ କରେ ଏବଂ ପୁଷ୍ଟିକର ପୁନଃଚକ୍ରଣରେ ମଧ୍ୟ ସାହାଯ୍ୟ କରେ |"
         ]
      }
   },
   "date": "31-01-2025"
}