{
   "weather_details": {
      "20-07-2024": {
         "rainfall": 15,
         "t_max": 35,
         "t_min": 26,
         "rh_max": 89,
         "rh_min": 56,
         "wind_speed": 9,
         "wind_direction": 68,
         "cloud_cover": 8
      },
      "21-07-2024": {
         "rainfall": 10,
         "t_max": 34,
         "t_min": 25,
         "rh_max": 92,
         "rh_min": 62,
         "wind_speed": 11,
         "wind_direction": 248,
         "cloud_cover": 8
      },
      "22-07-2024": {
         "rainfall": 15,
         "t_max": 34,
         "t_min": 25,
         "rh_max": 87,
         "rh_min": 71,
         "wind_speed": 18,
         "wind_direction": 248,
         "cloud_cover": 8
      },
      "23-07-2024": {
         "rainfall": 15,
         "t_max": 35,
         "t_min": 26,
         "rh_max": 81,
         "rh_min": 66,
         "wind_speed": 23,
         "wind_direction": 248,
         "cloud_cover": 7
      },
      "24-07-2024": {
         "rainfall": 5,
         "t_max": 35,
         "t_min": 26,
         "rh_max": 78,
         "rh_min": 61,
         "wind_speed": 23,
         "wind_direction": 248,
         "cloud_cover": 6
      }
   },
   "names_of_crops": [
      "ସିଧାସଳଖ ବିହନ ବୁଣାଯାଇଥିବା ଧାନ",
      "ରୋପଣ କରାଯାଇଥିବା ଧାନ",
      "କପା",
      "ଅରହର",
      "ସଂକର ମକା",
      "ବାଇଗଣ ଏବଂ ଲଙ୍କା",
      "ଓକ୍ରା",
      "ରସୁଣ",
      "ଆମ୍ବ",
      "ପେଁପେ",
      "କୁକୁଡ଼ା ମାଂସ",
      "ଛେଳି ଏବଂ ମେଣ୍ଢା"
   ],
   "general_advisory": "ଆଇଏମଡି ଦ୍ୱାରା ପାଣିପାଗ ପୂର୍ବାନୁମାନକୁ ଦୃଷ୍ଟିରେ ରଖି କୃଷକମାନଙ୍କୁ ବର୍ତ୍ତମାନ ପାଇଁ ବୁଣିବା କାର୍ଯ୍ଯ଼ ବନ୍ଦ କରିବାକୁ ଏବଂ ଉପଲବ୍ଧ ମୃତ୍ତିକା ଆର୍ଦ୍ରତା ବ୍ଯ଼ବହାର କରି ବର୍ଷା ହ୍ରାସ ପାଇବା ପରେ ଶୀଘ୍ର ବୁଣିବା ଆରମ୍ଭ କରିବାକୁ ପରାମର୍ଶ ଦିଆଯାଇଛି। ଉପରୋକ୍ତ ପୂର୍ବାନୁମାନକୁ ଦୃଷ୍ଟିରେ ରଖି, ବର୍ଷା ହ୍ରାସ ନହେବା ପର୍ଯ୍ଯ଼ନ୍ତ ଠିଆ ହୋଇଥିବା ଫସଲରେ ସାର ଏବଂ କୀଟନାଶକ ପ୍ରଯ଼ୋଗରୁ ଦୂରେଇ ରହିବାକୁ କୃଷକମାନଙ୍କୁ ପରାମର୍ଶ ଦିଆଯାଇଛି। ମକା, ଅରହର, ଚିନାବାଦାମ ଏବଂ ପନିପରିବା କ୍ଷେତରୁ ଅତିରିକ୍ତ ଜଳ ନିଷ୍କାସନ ପାଇଁ ବ୍ଯ଼ବସ୍ଥା କରନ୍ତୁ। ଆସନ୍ନ ବର୍ଷା ପୂର୍ବରୁ ପରିପକ୍ୱ ପନିପରିବା ଅମଳ କରନ୍ତୁ। ନର୍ସରୀ ଶଯ୍ଯ଼ା ଉପରେ ପ୍ଲାଷ୍ଟିକ୍ କିମ୍ବା ପଲିଥିନ୍ ଚାଦରରେ ଆଚ୍ଛାଦନ କରି ନର୍ସରୀରେ ଥିବା ପନିପରିବା ଚାରା ଗୁଡ଼ିକୁ ପ୍ରବଳ ବର୍ଷାରୁ ରକ୍ଷା କରନ୍ତୁ |",
   "crops_data": {
      "direct seeded paddy": {
         "advisory": [
            "ଆଗାଛା ପରିଚାଳନାଃ କାର୍ଯ୍ଯ଼ସୂଚୀ ଅନୁଯାଯ଼ୀ ତୃଣନାଶକ ପ୍ରଯ଼ୋଗ କରନ୍ତୁ।",
            "ପୋଷକ ତତ୍ତ୍ୱ ପରିଚାଳନାଃ ଆଗାଛା କାଟିବା ପରେ ସୁପାରିସ କରାଯାଇଥିବା ଯ଼ୁରିଆ ଲଗାନ୍ତୁ।"
         ]
      },
      "transplanted paddy": {
         "advisory": [
            "ଜମି ପ୍ରସ୍ତୁତିଃ ଜମି ପ୍ରସ୍ତୁତି ପାଇଁ ସୁପାରିସ କରାଯାଇଥିବା ପଦକ୍ଷେପଗୁଡ଼ିକୁ ଅନୁସରଣ କରନ୍ତୁ।",
            "ସାର ପ୍ରଯ଼ୋଗଃ ଏକର ପିଛା ଡିଏପି, ଏମଓପି, ଏବଂ ଜେଡଏନଏସଓ4 ର ନିର୍ଦ୍ଦିଷ୍ଟ ମାତ୍ରା ପ୍ରଯ଼ୋଗ କରନ୍ତୁ।"
         ]
      },
      "cotton": {
         "advisory": [
            "ଡ୍ରେନେଜ୍ଃ ଅତିରିକ୍ତ ଜଳ ପାଇଁ ଡ୍ରେନେଜ୍ ଚ୍ଯ଼ାନେଲ୍ ସୃଷ୍ଟି କରନ୍ତୁ।",
            "ସାଂସ୍କୃତିକ ଅଭ୍ଯ଼ାସଃ ହୋଇଂ, ଆଗାଛା କାଟିବା ଏବଂ ଶୀର୍ଷ ପୋଷାକ ପିନ୍ଧିବା।"
         ]
      },
      "arhar": {
         "advisory": [
            "ଜଳ ନିଷ୍କାସନଃ ଜଳ ନିଷ୍କାସନ ପ୍ରଣାଳୀ ସ୍ଥାପନ କରନ୍ତୁ।",
            "ସାଂସ୍କୃତିକ ଅଭ୍ଯ଼ାସଃ ନିର୍ଦ୍ଦିଷ୍ଟ ପର୍ଯ୍ଯ଼ାଯ଼ରେ ହୋଇଂ, ନିଡ଼ାଇ, ଏବଂ ମୃତ୍ତିକା ଉତ୍ତୋଳନ।"
         ]
      },
      "hybrid maize": {
         "advisory": [
            "ଜଳ ନିଷ୍କାସନଃ ଏକ ଜଳ ନିଷ୍କାସନ ପ୍ରଣାଳୀ ବିକଶିତ କରନ୍ତୁ।",
            "ସାଂସ୍କୃତିକ ଅଭ୍ଯ଼ାସଃ ତିନି ସପ୍ତାହର ପର୍ଯ୍ଯ଼ାଯ଼ରେ ନିର୍ଦ୍ଧାରିତ କାର୍ଯ୍ଯ଼କଳାପମାନ ସମ୍ପାଦନ କରନ୍ତୁ।"
         ]
      },
      "brinjal & chilli": {
         "advisory": [
            "ନର୍ସରୀ ପ୍ରସ୍ତୁତିଃ ସମଯ଼ୋଚିତ ରୋପଣ ପାଇଁ ଉଠାଯାଇଥିବା ଶଯ୍ଯ଼ା ନର୍ସରୀ ପ୍ରସ୍ତୁତ କରନ୍ତୁ।",
            "ବୀଜ ଚିକିତ୍ସାଃ ରୋଗରୁ ରକ୍ଷା ପାଇବା ପାଇଁ ମଞ୍ଜି ଚିକିତ୍ସା କରନ୍ତୁ।"
         ]
      },
      "okra": {
         "advisory": [
            "ବୁଣିବା ସମଯ଼ଃ ବୁଣିବା ସମଯ଼ୋଚିତ ଭାବେ ସମ୍ପୂର୍ଣ୍ଣ କରିବା ସୁନିଶ୍ଚିତ କରନ୍ତୁ।",
            "ସାର ପ୍ରଯ଼ୋଗଃ ଜମି ପ୍ରସ୍ତୁତି ସମଯ଼ରେ ସୁପାରିସ କରାଯାଇଥିବା ଏଫ. ୱାଇ. ଏମ୍. ପ୍ରଯ଼ୋଗ କରନ୍ତୁ।"
         ]
      },
      "onion": {
         "advisory": [
            "ବିବିଧତା ଚଯ଼ନଃ ରୋପଣ ପାଇଁ ଉପଯୁକ୍ତ କିସମ ବାଛନ୍ତୁ।",
            "ଚାରା ରୋପଣ ଯତ୍ନଃ ନର୍ସରୀ ଚାରା ରୋପଣ ପାଇଁ ସୁପାରିସ କରାଯାଇଥିବା ପଦକ୍ଷେପଗୁଡ଼ିକୁ ଅନୁସରଣ କରନ୍ତୁ।"
         ]
      },
      "mango": {
         "advisory": [
            "ରୋପଣ ସମଯ଼ଃ ଆମ୍ବ ରୋପଣ ପାଇଁ ସର୍ବୋତ୍ତମ ସମଯ଼।",
            "ବିବିଧତା ଚଯ଼ନଃ ଉପଯୁକ୍ତ କିସମ ଆମ୍ବ ଚଯ଼ନ କରନ୍ତୁ।"
         ]
      },
      "papaya": {
         "advisory": [
            "ରୋପଣ ଋତୁଃ ପେଁପେ ରୋପଣ ପାଇଁ ଉପଯୁକ୍ତ ସମଯ଼।",
            "ଚାରା ରୋପଣଃ ନିର୍ଦ୍ଧାରିତ ବ୍ଯ଼ବଧାନ ଏବଂ ଗର୍ତ୍ତ ପ୍ରସ୍ତୁତି ଅନୁସରଣ କରନ୍ତୁ।"
         ]
      },
      "poultry": {
         "advisory": [
            "ଘରର ରକ୍ଷଣାବେକ୍ଷଣଃ ବର୍ଷା ଜଳ ପ୍ରବେଶକୁ ରୋକିବା ପାଇଁ କୁକୁଡ଼ା ଘର ମରାମତି କରନ୍ତୁ।",
            "ଖାଦ୍ଯ଼ ପରିଚାଳନାଃ ଫଙ୍ଗସ୍ ବୃଦ୍ଧିକୁ ଏଡ଼ାଇବା ପାଇଁ ଖାଦ୍ଯ଼ ସାମଗ୍ରୀଗୁଡ଼ିକ ଶୁଖିଲା ରହିବା ସୁନିଶ୍ଚିତ କରନ୍ତୁ।"
         ]
      },
      "goat & sheep": {
         "advisory": [
            "ସ୍ୱାସ୍ଥ୍ଯ଼ ପରିଚାଳନାଃ ଆଭ୍ଯ଼ନ୍ତରୀଣ ପରଜୀବୀ ହ୍ରାସ କରିବା ପାଇଁ ପଶୁମାନଙ୍କୁ କୃମି ମୁକ୍ତ କରନ୍ତୁ।",
            "ସ୍ୱଚ୍ଛତା ଅଭ୍ଯ଼ାସଃ ବର୍ଷା ସମଯ଼ରେ ପଶୁମାନଙ୍କୁ ଘର ଭିତରେ ରଖନ୍ତୁ।"
         ]
      }
   },
   "date": "19-07-2024"
}