{
   "weather_details": {
      "18-01-2025": {
         "rainfall": 0,
         "t_max": 26,
         "t_min": 13,
         "rh_max": 60,
         "rh_min": 26,
         "wind_speed": 3,
         "wind_direction": 264,
         "cloud_cover": 3
      },
      "19-01-2025": {
         "rainfall": 0,
         "t_max": 26,
         "t_min": 13,
         "rh_max": 53,
         "rh_min": 25,
         "wind_speed": 3,
         "wind_direction": 304,
         "cloud_cover": 3
      },
      "20-01-2025": {
         "rainfall": 0,
         "t_max": 27,
         "t_min": 13,
         "rh_max": 57,
         "rh_min": 28,
         "wind_speed": 2,
         "wind_direction": 321,
         "cloud_cover": 2
      },
      "21-01-2025": {
         "rainfall": 0,
         "t_max": 27,
         "t_min": 14,
         "rh_max": 54,
         "rh_min": 28,
         "wind_speed": 2,
         "wind_direction": 353,
         "cloud_cover": 2
      },
      "22-01-2025": {
         "rainfall": 0,
         "t_max": 27,
         "t_min": 14,
         "rh_max": 52,
         "rh_min": 29,
         "wind_speed": 1,
         "wind_direction": 382,
         "cloud_cover": 2
      }
   },
   "names_of_crops": [
      "ଧାନ।",
      "ଅରହର",
      "ଗ୍ରୀନଗ୍ରାମ/ବ୍ଲାକଗ୍ରାମ",
      "ଚିନାବାଦାମ",
      "ସୋରିଷ",
      "ସୂର୍ଯ୍ୟମୁଖୀ",
      "ରସୁଣ",
      "ଫୁଲକୋବି ଏବଂ ବନ୍ଧାକୋବି",
      "ଟମାଟୋ",
      "ଲଙ୍କା",
      "ଗୋରୁ ଏବଂ ମଇଁଷି",
      "ଛେଳି ଏବଂ ମେଣ୍ଢା",
      "କୁକୁଡ଼ା ମାଂସ"
   ],
   "general_advisory": "ରୋଗ ଏବଂ କୀଟପତଙ୍ଗର ପ୍ରକୋପକୁ କମ୍ କରିବା ପାଇଁ ଆପଣଙ୍କ ଫସଲ କ୍ଷେତ୍ରକୁ ଆଗାଛାରୁ ମୁକ୍ତ ରଖନ୍ତୁ | ଫସଲର ବୃଦ୍ଧି ପର୍ଯ୍ୟାୟ ଅନୁଯାୟୀ ସନ୍ତୁଳିତ ଏବଂ ଉପଯୁକ୍ତ ସାର ପ୍ରୟୋଗ କରନ୍ତୁ। ଉଦ୍ଭିଦ ପର୍ଯ୍ୟାୟରେ ପନିପରିବାରେ ଧଳା ମାଛି, ଏଫିଡ୍, ଜ୍ଯାସିଡ୍ ଏବଂ ଥ୍ରିପ୍ ପରି ଶୋଷକ କୀଟ ଉପରେ ନଜର ରଖିବା ପାଇଁ ଏକର ପିଛା 8ରେ ହଳଦିଆ ଚଟପଟା ଜାଲ ଲଗାନ୍ତୁ। କୀଟପତଙ୍ଗ ଏବଂ ରୋଗର ଘଟଣା ପାଇଁ ଫସଲର ନିୟମିତ ତଦାରଖ କରାଯିବା ଉଚିତ ଏବଂ କୀଟ ସଂଖ୍ୟା ଉପରେ ନଜର ରଖିବା ପାଇଁ ହାଲୁକା ଫାନ୍ଦ ବ୍ୟବହାର କରାଯିବା ଉଚିତ ଯାହା ଦ୍ୱାରା ସମୟୋଚିତ ନିୟନ୍ତ୍ରଣ ପଦକ୍ଷେପ ନିଆଯାଇପାରିବ। ଏକ ହାଲୁକା ଜାଲ ତିଆରି କରିବା ପାଇଁ, ପାଣି ଏବଂ କୌଣସି କୀଟନାଶକ ର କିଛି ବୁନ୍ଦା ମିଶ୍ରଣ ଥିବା ଏକ କଣ୍ଟେନର (ପ୍ଲାଷ୍ଟିକ୍ କିମ୍ବା ଟିନ୍) ଉପରେ ଏକ ବଲ୍ବ ଲଗାଇବା ଉଚିତ୍ | କୀଟପତଙ୍ଗମାନେ ଆଲୋକ ଆଡ଼କୁ ଆକର୍ଷିତ ହୁଅନ୍ତି, ଦ୍ରବଣରେ ପଡ଼ନ୍ତି ଏବଂ ମୃତ୍ୟୁବରଣ କରନ୍ତି। ସକାଳ କିମ୍ବା ମଧ୍ୟାହ୍ନ ସମୟରେ ସର୍ବଦା ସଠିକ୍ ପଦ୍ଧତିରେ କୀଟନାଶକ ସୁପାରିଶ ମାତ୍ରା ପ୍ରୟୋଗ କରନ୍ତୁ ଏବଂ ପ୍ରୟୋଗ ସମୟରେ ପବନର ଦିଗ ପ୍ରତି ଧ୍ୟାନ ଦିଅନ୍ତୁ | ଧାନ ରୋପଣ ପରେ ଶୀଘ୍ର କାଣ୍ଡ ଛେଦକ ଏବଂ ପତ୍ର ଫୋଲଡରର କୀଟ ସଂଖ୍ୟା ଉପରେ ନଜର ରଖିବା ପାଇଁ ଏକର ପିଛା 3ଟି ଫେରୋମୋନ୍ ଫାନ୍ଦ ଲଗାନ୍ତୁ।",
   "crops_data": {
      "paddy": {
         "advisory": [
            "ଆଗାଛା ପରିଚାଳନାଃ ଏକ ଏକର କ୍ଷେତ୍ର ପାଇଁ, ସମାନ ପରିମାଣର ବାଲି ସହିତ ମିଶ୍ରିତ ରୋପଣର 3-5 ଦିନ ପରେ ଗ୍ରାନୁଲାର ହର୍ବିସାଇଡ୍ ବେନ୍ସଲ୍ଫୁରନ୍-ମିଥାଇଲ 0.6% + ପ୍ରିଟିଲାକ୍ଲୋର 6% @4 କିଲୋଗ୍ରାମ ପ୍ରୟୋଗ କରନ୍ତୁ ଏବଂ ଏହାକୁ ସମାନ ଭାବରେ କ୍ଷେତରେ ପ୍ରସାରଣ କରନ୍ତୁ କିମ୍ବା ରୋପଣର କିଛି ଦିନ ପରେ 8-10 ରେ ପାଇରାଜୋସଲ୍ଫୁରନ୍-ଇଥାଇଲ 10% WP @100 ଗ୍ରାମ ସ୍ପ୍ରେ କରନ୍ତୁ କିମ୍ବା 200 ଲିଟର ପାଣି ସହିତ ମିଶ୍ରିତ 15-20 DAT ରେ ବିସ୍ପିରିବାକ୍ ସୋଡ଼ିଅମ 10% SC @120 ମିଲି ସ୍ପ୍ରେ କରନ୍ତୁ।",
            "କୀଟ ପରିଚାଳନାଃ ବୃକ୍ଷରୋପଣ ପରେ ଶୀଘ୍ର କାଣ୍ଡ ଛେଦକ ଏବଂ ପତ୍ର ଫୋଲଡରର କୀଟ ସଂଖ୍ୟା ଉପରେ ନଜର ରଖିବା ପାଇଁ ଏକର ପିଛା 3ଟି ଫେରୋମୋନ୍ ଫାନ୍ଦ ଲଗାନ୍ତୁ।"
         ]
      },
      "arhar": {
         "advisory": [
            "ଅମଳ ପାଇଁ ଉପଯୁକ୍ତ ସମୟ ଯେତେବେଳେ ଦୁଇ ତୃତୀୟାଂଶରୁ ତିନି ଚତୁର୍ଥାଂଶ ଶୁଆ ବାଦାମୀ ରଙ୍ଗରେ ପରିବର୍ତ୍ତିତ ହୋଇଥାଏ।",
            "ଅମଳ ହୋଇଥିବା ଗଛକୁ 3ରୁ 5 ଦିନ ପର୍ଯ୍ୟନ୍ତ ସୂର୍ଯ୍ୟାଲୋକରେ ଶୁଖାଇବା ପାଇଁ କ୍ଷେତରେ ଛାଡ଼ିଦେବା ଉଚିତ। ଲାଠିରେ ଶୁଣ୍ଢକୁ ପ୍ରହାର କରି କିମ୍ବା ପୁଲମ୍ୟାନ୍ ଥ୍ରେସର ବ୍ୟବହାର କରି ଥ୍ରେସିଂ କରାଯାଇପାରିବ |",
            "ନିରାପଦ ଏବଂ ଦୀର୍ଘକାଳୀନ ସଂରକ୍ଷଣ ପାଇଁ 9-10% ରେ ଆର୍ଦ୍ରତା ଆଣିବା ପାଇଁ ସଫା ମଞ୍ଜି 3ରୁ 4 ଦିନ ପର୍ଯ୍ୟନ୍ତ ସୂର୍ଯ୍ୟାଲୋକରେ ଶୁଖାଇବା ଉଚିତ।"
         ]
      },
      "greengram/blackgram": {
         "advisory": [
            "ଆଗାଛା ପରିଚାଳନାଃ 20-25 DAS ରେ 200 ଲିଟର ପାଣି ସହିତ ଏକର ପିଛା 5 ପ୍ରତିଶତ ଇ. ସି. କିମ୍ବା ଇମାଜେଥାପାଇର୍ 10 SL @300 ମି. ଲି. ମିଶ୍ରଣ କରନ୍ତୁ।",
            "କୀଟ ପରିଚାଳନାଃ ପତ୍ର ଖାଉଥିବା କ୍ୟାଟର୍ପିଲାର୍ଃ କୀଟପତଙ୍ଗମାନେ ସାଧାରଣତଃ କୋମଳ ଯୁବା ପତ୍ରକୁ ଖାଇଥାନ୍ତି। ଏହାର ନିୟନ୍ତ୍ରଣ ପାଇଁ ଏକର ପିଛା ପ୍ରୋଫେନୋଫସ୍ 50 ଇସି 400 ମିଲି ସହିତ 200 ଲିଟର ପାଣି ମିଶାଇ ସ୍ପ୍ରେ କରନ୍ତୁ। ଏଫିଡ୍ ଏବଂ ହ୍ୱାଇଟ୍ଫ୍ଲାଇଃ ପ୍ରଚଳିତ ପାଣିପାଗ ସ୍ଥିତି ଏଫିଡ୍ ଏବଂ ହ୍ୱାଇଟ୍ ମାଛି ପରି ଶୋଷକ କୀଟପତଙ୍ଗ ଘଟଣା ପାଇଁ ଅନୁକୂଳ | କୀଟ ସଂଖ୍ୟା ଉପରେ ନଜର ରଖିବା ପାଇଁ ଉଦ୍ଭିଦ ସ୍ତରରେ ଏକର ପିଛା 8 ନିୟୁତ ହଳଦିଆ ଚଟପଟା ଜାଲ ଲଗାନ୍ତୁ ଏବଂ ସଂକ୍ରମଣର ପ୍ରାରମ୍ଭିକ ପର୍ଯ୍ୟାୟରେ ନିମ୍ବ ତେଲ ଆଧାରିତ କୀଟନାଶକ ଆଜାଦିରାକ୍ଟିନ 0.03% (300 ପିପିଏମ) ଲିଟର ପିଛା 5 ମିଲି ପାଣି ଲଗାନ୍ତୁ।"
         ]
      },
      "groundnut": {
         "advisory": [
            "କୀଟ ପରିଚାଳନାଃ ଟିକ୍କାଃ ଯଦି ଲକ୍ଷଣ ଦେଖାଯାଏ, କ୍ଲୋରୋଥାଲୋନିଲ୍ 75 ପ୍ରତିଶତ ଡବ୍ଲ୍ୟୁ. ପି. @400 ଗ୍ରାମ୍/ଏସି କିମ୍ବା ହେକ୍ସାକୋନାଜୋଲ୍ 5 ପ୍ରତିଶତ ଇସି @300 ମିଲି/ଏସି କିମ୍ବା ମାନକୋଜେବ୍ 75 ପ୍ରତିଶତ ଡବ୍ଲ୍ୟୁ. ପି. @600 ଗ୍ରାମ୍/ଏସି ସହିତ 200 ଲିଟର ପାଣି ମିଶାଇ ପ୍ରୟୋଗ କରିବାକୁ ପରାମର୍ଶ ଦିଆଯାଇଛି।"
         ]
      },
      "mustard": {
         "advisory": [
            "କୀଟ ପରିଚାଳନାଃ ଧଳା ଜଙ୍କଃ ପ୍ରଚଳିତ ପାଣିପାଗ ସ୍ଥିତିରେ (କୁହୁଡ଼ି), ଧଳା ଜଙ୍କ ସଂକ୍ରମଣ ଦେଖିବାକୁ ମିଳିଥାଏ। ଲକ୍ଷଣ ଦେଖାଗଲେ ମେଟାଲାକ୍ସାଇଲ୍ ଏମ୍ 4 ପ୍ରତିଶତ + ମାନକୋଜେବ୍ 64 ପ୍ରତିଶତ ଡବ୍ଲ୍ୟୁ. ପି. @25 ଗ୍ରାମ୍ କିମ୍ବା କପର ଅକ୍ସିକ୍ଲୋରାଇଡ୍ 50 ପ୍ରତିଶତ ଡବ୍ଲ୍ୟୁ. ପି. @30 ଗ୍ରାମ୍ 10 ଲିଟର ପାଣି ସହିତ ମିଶାଇ ଲଗାନ୍ତୁ।"
         ]
      },
      "sunflower": {
         "advisory": [
            "ଶୋଷକ କୀଟ କମ୍ପ୍ଲେକ୍ସ (ଏଫିଡ୍, ହପର୍, ଥ୍ରିପ୍ସ ଏବଂ ହ୍ୱାଇଟ୍ ଫ୍ଲାଇ): ପ୍ରଚଳିତ ପାଣିପାଗ ସ୍ଥିତି ଶୋଷକ କୀଟଗୁଡ଼ିକର ବିକାଶକୁ ସମର୍ଥନ କରେ | ଏସିଟାମିପ୍ରିଡ୍ 20 ପ୍ରତିଶତ ଏସ. ପି. @50 ଗ୍ରାମ/ଏକର କିମ୍ବା ଇମିଡାକ୍ଲୋପ୍ରିଡ୍ 17.8% ଏସ. ଏଲ. @60 ମିଲି/ଏକରକୁ 200 ଲିଟର ପାଣି ସହିତ ମିଶାଇ ଆବଶ୍ୟକ ଅନୁଯାୟୀ ସ୍ପ୍ରେ କରିବା ପାଇଁ ପରାମର୍ଶ ଦିଆଯାଇଛି।",
            "ପାଉଡର ଫଙ୍ଗୁରଃ 2 ଗ୍ରାମ/ଲିଟର ପାଣି ଦେଇ 0.2% ଓଦା ସଲଫର୍ ସ୍ପ୍ରେ କରନ୍ତୁ।",
            "କେପିଟୁଲମ୍ ବୋରର୍ଃ ବାସିଲସ୍ ଥୁରିଙ୍ଗିଏନ୍ସିସ୍ ବାର୍ କୁର୍ଷ୍ଟାକି 5 ପ୍ରତିଶତ ଡବ୍ଲ୍ୟୁ. ପି. @1.5 ଗ୍ରାମ୍/ଲିଟର ପାଣି ସ୍ପ୍ରେ କରନ୍ତୁ।",
            "ହେଡ୍ ରୋଟ୍ଃ 0.40% ତମ୍ବା ଅକ୍ସିକ୍ଲୋରାଇଡ୍ 50% ଡବ୍ଲ୍ୟୁ. ପି. @3 ଗ୍ରାମ/ଲିଟର ପାଣି ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "onion": {
         "advisory": [
            "ନିୟମିତ ବ୍ୟବଧାନରେ ଫସଲକୁ ଜଳସେଚନ କରନ୍ତୁ।",
            "ଫସଲର 4-ସପ୍ତାହ ପର୍ଯ୍ୟାୟରେ, ଜଳସେଚନ ପରେ, ଏକର ପିଛା 45 କି. ଗ୍ରା. ୟୁରିଆ ନେଇ, ଘାସ କାଟିବା, ଘାସ କାଟିବା ଏବଂ ପ୍ରଥମେ ଉପର ଡ୍ରେସିଂ କରିବା।"
         ]
      },
      "cauliflower & cabbage": {
         "advisory": [
            "ପୋଷକ ତତ୍ତ୍ୱ ପରିଚାଳନାଃ ଛଅରୁ ସାତ ସପ୍ତାହର ପର୍ଯ୍ୟାୟରେ, ଜଳସେଚନ ପରେ, ଛାଣିବା, ଘାସ କାଟିବା ଏବଂ 27 କି. ଗ୍ରା. ୟୁରିଆ + 25 କି. ଗ୍ରା. ଏମ୍. ଓ. ପି. ପ୍ରୟୋଗ କରନ୍ତୁ।",
            "କୀଟ ପରିଚାଳନାଃ ପିଠି ପତଙ୍ଗଃ ନିୟନ୍ତ୍ରଣ ପଦକ୍ଷେପ ସ୍ୱରୂପ ଫାଇପ୍ରୋନିଲ୍ 5 ପ୍ରତିଶତ ଏସ୍. ସି. @2 ମିଲି/ଲିଟର କିମ୍ବା କ୍ଲୋରପାଇରିଫସ୍ 20 ପ୍ରତିଶତ ଇ. ସି. @4 ମିଲି/ଲିଟର ପାଣି ସ୍ପ୍ରେ କରନ୍ତୁ। ତମାଖୁ ପତ୍ର ଖାଉଥିବା କ୍ୟାଟର୍ପିଲାର୍ଃ କୀଟ ସଂଖ୍ୟାକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ ସାଇଣ୍ଟ୍ରାନିଲିପ୍ରୋଲ୍ 10.26% ଓଡି @6 ମିଲି/5 ଲିଟର ପାଣି ସ୍ପ୍ରେ କରନ୍ତୁ। ବନ୍ଧାକୋବି ଏଫିଡ୍ଃ ନିୟନ୍ତ୍ରଣ ପଦକ୍ଷେପ ସ୍ୱରୂପ ଥିୟାମେଥୋକ୍ସାମ୍ 25 ପ୍ରତିଶତ ଡବ୍ଲ୍ୟୁ. ଜି. @2 ଗ୍ରାମ/5 ଲିଟର ପାଣି ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "tomato": {
         "advisory": [
            "ପୋଷକ ତତ୍ତ୍ୱ ପରିଚାଳନାଃ ଛଅ ସପ୍ତାହର ପର୍ଯ୍ୟାୟରେ ସମ୍ପୂର୍ଣ୍ଣ ହୋଇଂ, ଆଗାଛା କାଟିବା ଏବଂ 27 କିଲୋଗ୍ରାମ ୟୁରିଆ ପ୍ରୟୋଗ କରିବା ପରେ ଜଳସେଚନ",
            "କୀଟ ପରିଚାଳନାଃ ଅଧିକ ଆର୍ଦ୍ର ଅବସ୍ଥାକୁ ଦୃଷ୍ଟିରେ ରଖି, ଏହି ପର୍ଯ୍ୟାୟରେ କ୍ଷୟ ହୋଇପାରେ। ଯଦି ଲକ୍ଷଣ ଦେଖାଯାଏ, ତେବେ ମାନକୋଜେବ୍ 75 ପ୍ରତିଶତ ଡବ୍ଲ୍ୟୁ. ପି. @2 ଗ୍ରାମ/ଲିଟର ପାଣି ସ୍ପ୍ରେ କରନ୍ତୁ। ଫଳ ଏବଂ ଶୁଟ୍ ବୋରର୍ଃ କୀଟପତଙ୍ଗ ସଂଖ୍ୟା ଉପରେ ନଜର ରଖିବା ପାଇଁ ଏକର ପିଛା 8ନସ୍ ହାରରେ ଏକ ଫେରୋମୋନ୍ ଫାନ୍ଦ ଲଗାନ୍ତୁ।"
         ]
      },
      "chilli": {
         "advisory": [
            "କୀଟ ପରିଚାଳନାଃ ମାଇଟଃ ମାଇଟ-ସଂକ୍ରମିତ ଲଙ୍କା ଗଛରେ ନିମ୍ନମୁଖୀ ବକ୍ରତା ଏବଂ ପତ୍ର ସଙ୍କୁଚିତ ହେବା ସହିତ ଷ୍ଟାଣ୍ଟେଡ ବୃଦ୍ଧି ଦେଖାଯାଏ | ମାଇଟ୍ ସଂକ୍ରମଣକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ ଇଥିୟନ୍ 50 ପ୍ରତିଶତ ଇସି କିମ୍ବା ପ୍ରୋପାର୍ଜାଇଟ୍ 57 ପ୍ରତିଶତ ଇସି @600-ମିଲି/ଏକର ସହିତ 200 ଲିଟର ପାଣି ମିଶାଇ ଲଗାନ୍ତୁ।"
         ]
      },
      "cattle & buffalo": {
         "advisory": [
            "ବାୟୁରେ ଉତ୍ତାପ ଏବଂ ଆର୍ଦ୍ରତା କମ୍ ଥିବାରୁ ଗୋରୁ ଏବଂ ମଇଁଷି ଅସୁସ୍ଥ ହେବାର ସମ୍ଭାବନା କମ୍ ଥାଏ | ତେଣୁ, କୃଷକମାନେ ସ୍ତନ୍ୟପାନ ସମୟରେ ଶରୀରର ଅବସ୍ଥା ସ୍କୋରରେ ହୋଇଥିବା କ୍ଷତିର ଭରଣା ପାଇଁ ଯତ୍ନ ନେବା ଆବଶ୍ୟକ | ବାଛୁରୀ ହେବାର ଦୁଇ ମାସ ପୂର୍ବରୁ ଧୀରେ ଧୀରେ ଖାଦ୍ୟରେ ସାନ୍ଦ୍ରତାର ପରିମାଣ ବୃଦ୍ଧି କରିବାକୁ ପରାମର୍ଶ ଦିଆଯାଇଛି। ଏହା ଆଗାମୀ ସ୍ତନ୍ୟପାନ ସମୟରେ ଦୁଗ୍ଧ ଉତ୍ପାଦନ ବୃଦ୍ଧି କରିବାରେ ମଧ୍ୟ ସହାୟକ ହୋଇଥାଏ।"
         ]
      },
      "goat & sheep": {
         "advisory": [
            "ଯେହେତୁ ଛେଳିମାନେ ଥଣ୍ଡା ଦ୍ୱାରା ଅଧିକ ପ୍ରଭାବିତ ହୁଅନ୍ତି, ତେଣୁ ଛେଳି ଚାଷୀମାନଙ୍କୁ ସେମାନଙ୍କ ପଶୁମାନଙ୍କୁ ଥଣ୍ଡା ପବନ ଏବଂ ଚଟାଣରୁ ଦୂରେଇ ରଖିବାକୁ ପରାମର୍ଶ ଦିଆଯାଇଛି। ଯଦି ସେମାନେ ଚିହ୍ନଟ କରନ୍ତି ଯେ ସେମାନଙ୍କ ଛେଳିମାନଙ୍କର ନାକ ପ୍ରବାହିତ ହେଉଛି ଏବଂ କ୍ରମାଗତ କାଶ ହେଉଛି, ତେବେ ଶୀଘ୍ର ପଶୁ ଚିକିତ୍ସକଙ୍କ ସହ ଯୋଗାଯୋଗ କରାଯିବା ଆବଶ୍ୟକ।"
         ]
      },
      "poultry": {
         "advisory": [
            "କୁକୁଡ଼ା ପକ୍ଷୀମାନଙ୍କୁ ସେମାନଙ୍କର ମୃତ୍ୟୁହାର ଯାଞ୍ଚ କରିବା ପାଇଁ ତୀବ୍ର ଥଣ୍ଡା ପବନ ଏବଂ ଥଣ୍ଡା ଚଟାଣରୁ ରକ୍ଷା କରିବା ପରାମର୍ଶ ଦିଆଯାଏ | ଶୀତଳ ପବନରୁ ସେମାନଙ୍କ ପକ୍ଷୀମାନଙ୍କୁ ରକ୍ଷା କରିବା ପାଇଁ କୃଷକମାନେ କୁକୁଡ଼ା ଘରକୁ ଏକ ମୋଟା ପଲିଥିନ୍ ଚାଦରରେ ଢାଙ୍କିବା ଆବଶ୍ୟକ ଏବଂ ସକାଳ 9ଟା ପରେ ସେଗୁଡ଼ିକୁ ବାହାର କରିଦେବା ଉଚିତ, ଯାହାଦ୍ୱାରା ସେଡରେ ସୂର୍ଯ୍ୟାଲୋକ ପ୍ରବେଶ କରିପାରିବ। କୃଷକମାନେ ଚଟାଣରେ ଆବର୍ଜନା ସାମଗ୍ରୀ ବିଷୟରେ ମଧ୍ୟ ସତର୍କ ରହିବା ଆବଶ୍ୟକ କାରଣ ଏହା ପକ୍ଷୀମାନଙ୍କୁ ଉଷ୍ମ ରଖିବାରେ ସାହାଯ୍ୟ କରେ ଏବଂ ପୁଷ୍ଟିକର ପୁନଃଚକ୍ରଣରେ ମଧ୍ୟ ସାହାଯ୍ୟ କରେ |"
         ]
      }
   },
   "date": "17-01-2025"
}