{
   "weather_details": {
      "30-10-2024": {
         "rainfall": 7,
         "t_max": 30,
         "t_min": 23,
         "rh_max": 95,
         "rh_min": 62,
         "wind_speed": 0,
         "wind_direction": 0,
         "cloud_cover": 0
      },
      "31-10-2024": {
         "rainfall": 2,
         "t_max": 30,
         "t_min": 22,
         "rh_max": 92,
         "rh_min": 61,
         "wind_speed": 1,
         "wind_direction": 225,
         "cloud_cover": 5
      },
      "01-11-2024": {
         "rainfall": 1,
         "t_max": 30,
         "t_min": 22,
         "rh_max": 91,
         "rh_min": 54,
         "wind_speed": 1,
         "wind_direction": 214,
         "cloud_cover": 5
      },
      "02-11-2024": {
         "rainfall": 0,
         "t_max": 31,
         "t_min": 23,
         "rh_max": 88,
         "rh_min": 44,
         "wind_speed": 2,
         "wind_direction": 284,
         "cloud_cover": 4
      },
      "03-11-2024": {
         "rainfall": 0,
         "t_max": 31,
         "t_min": 23,
         "rh_max": 79,
         "rh_min": 38,
         "wind_speed": 1,
         "wind_direction": 315,
         "cloud_cover": 4
      }
   },
   "names_of_crops": [
      "ଧାନ।",
      "ସୋରିଷ",
      "ତୋରିଆ",
      "ଅରହର",
      "ସଂକର ମକା",
      "ବାଇଗଣ",
      "ଲଙ୍କା",
      "କପା"
   ],
   "general_advisory": "ଆଇଏମଡିରୁ ମିଳିଥିବା ଉପରୋକ୍ତ ପାଞ୍ଚ ଦିନିଆ ପାଣିପାଗ ପୂର୍ବାନୁମାନ ଆଧାରରେ, କୃଷକମାନଙ୍କୁ ଆଗାମୀ 2 ରୁ 3 ଦିନ ପାଇଁ ଜଳସେଚନ ଏବଂ ରାସାଯ଼ନିକ ସିଞ୍ଚନ ବନ୍ଦ କରିବାକୁ ପରାମର୍ଶ ଦିଆଯାଇଛି। ଲଙ୍କା, ଟମାଟୋ, ପିଆଜ୍, କୋଲ୍ ଫସଲ ଏବଂ ବାଇଗଣ ଇତ୍ଯ଼ାଦି ପନିପରିବା ନର୍ସରୀକୁ ପ୍ଲାଷ୍ଟିକ୍ କିମ୍ବା ପଲିଥିନ୍ ଚାଦରରେ ଢାଙ୍କି ବର୍ଷାରୁ ରକ୍ଷା କରନ୍ତୁ | ପରିପକ୍ୱ ହୋଇଥିବା ପନିପରିବା ଏବଂ ଡାଲି ଅମଳ କରନ୍ତୁ ଏବଂ ଏକ ସୁରକ୍ଷିତ ସ୍ଥାନରେ ଷ୍ଟୋର୍ କରନ୍ତୁ | ରବି ଫସଲ ପାଇଁ କ୍ଷେତ ପ୍ରସ୍ତୁତି ଆରମ୍ଭ କରାଯିବା ଉଚିତ। ଡାଲି/କଳା ଚଣା/ସବୁଜ ଚଣା ଭଳି ଡାଲି ଗୁଡ଼ିକୁ ଅମଳ କରିବାର ଏକ ସପ୍ତାହ ପୂର୍ବରୁ ଠିଆ ହୋଇଥିବା ପରିପକ୍ୱ ଫସଲ (ଧାନ) ରେ ପ୍ରସାରଣ କରାଯାଇପାରିବ, ଯାହାଦ୍ୱାରା ମାଟିରେ ଥିବା ଅବଶିଷ୍ଟ ଆର୍ଦ୍ରତାକୁ ଉପଯୁକ୍ତ ସ୍ଥାନରେ ବ୍ଯ଼ବହାର କରାଯାଇପାରିବ। ସ୍ୱଚ୍ଛ ପାଗ ସମଯ଼ରେ ଫୁଲକୋବି, ବନ୍ଧାକୋବି, ବ୍ରୋକୋଲି, ଟମାଟୋ ଇତ୍ଯ଼ାଦି ପରିପକ୍ୱ ଚାରା (35-40 ଦିନ ପୁରୁଣା) ଉଠାଯାଇଥିବା ଶଯ୍ଯ଼ାରେ ରୋପଣ କରିବାକୁ କୃଷକମାନଙ୍କୁ ପରାମର୍ଶ ଦିଆଯାଇଛି।",
   "crops_data": {
      "paddy": {
         "advisory": [
            "ଯେତେବେଳେ 80-85% ଶସ୍ୟ ହାତ ଦ୍ୱାରା କିମ୍ବା କମ୍ବାଇନ୍ ହାରଭେଷ୍ଟର କିମ୍ବା ରିପ୍ପର୍ ବ୍ୟବହାର କରି ପରିପକ୍ୱ ହୁଏ ସେତେବେଳେ ଫସଲ ଅମଳ କରନ୍ତୁ | ସୂର୍ଯ୍ୟାଲୋକରେ ଶୁଖିଲା ଶସ୍ୟରେ ବ୍ୟବହାର ପାଇଁ 14 ପ୍ରତିଶତ ଆର୍ଦ୍ରତା ଏବଂ ମଞ୍ଜି ଉଦ୍ଦେଶ୍ୟରେ 12 ପ୍ରତିଶତ ଆର୍ଦ୍ରତା ରହିଥାଏ। ସମ୍ଭବ ହେଲେ ଅତିରିକ୍ତ ଜଳସେଚନ ବ୍ୟବସ୍ଥା କରନ୍ତୁ।"
         ]
      },
      "mustard": {
         "advisory": [
            "ବୁଣିବା ପୂର୍ବରୁ ଥିରମ୍ କିମ୍ବା ବାଭିଷ୍ଟିନ୍ ସହିତ ମଞ୍ଜି ଉପଚାର କରନ୍ତୁ। ପୁସା ବୋଲ୍ଡ, ପୁସା ଜଯ଼କିସାନ, ଜେଡି-6 ଭଳି ଉପଯୁକ୍ତ କିସମର ବ୍ଯ଼ବହାର କରନ୍ତୁ।"
         ]
      },
      "toria": {
         "advisory": [
            "ଅକ୍ଟୋବର ମଧ୍ଯ଼ଭାଗରୁ ନଭେମ୍ବର ମଧ୍ଯ଼ଭାଗ ପର୍ଯ୍ଯ଼ନ୍ତ ବୁଣିବା ସମଯ଼ ହୋଇଥାଏ। ବୁଣିବା ପୂର୍ବରୁ ଥିରମ୍ କିମ୍ବା ବାଭିଷ୍ଟିନ୍ ସହିତ ମଞ୍ଜି ଉପଚାର କରନ୍ତୁ। ଏମ29, ଅନୁରାଧା, ପାର୍ବତୀ ଭଳି ଉପଯୁକ୍ତ କିସମର ବ୍ଯ଼ବହାର କରନ୍ତୁ।"
         ]
      },
      "arhar": {
         "advisory": [
            "ରାସାୟନିକ ସ୍ପ୍ରେ ଦ୍ୱାରା ପତ୍ର ୱେବର/ପତ୍ର ଫୋଲଡର/ଡିଫୋଲିଏଟରକୁ ନିୟନ୍ତ୍ରଣ କରନ୍ତୁ। ନିମ୍ବ-ଆଧାରିତ କୀଟନାଶକ ଦ୍ୱାରା ଶୁଆ ଛେଦକକୁ ନିୟନ୍ତ୍ରଣ କରନ୍ତୁ।"
         ]
      },
      "hybrid maize": {
         "advisory": [
            "ଫ୍ଲୁବେଣ୍ଡିଆମାଇଡ୍ ପ୍ରୟୋଗ କରି ଆମେରିକୀୟ କୋବ୍ ବୋରରଙ୍କୁ ନିୟନ୍ତ୍ରଣ କରନ୍ତୁ। ବାଇଗଣରେ ଛେଦକ କୀଟକୁ ନିରୀକ୍ଷଣ କରିବା ଏବଂ ରାସାୟନିକ ସ୍ପ୍ରେ ଦ୍ୱାରା ନିୟନ୍ତ୍ରଣ କରିବା।"
         ]
      },
      "brinjal": {
         "advisory": [
            "ଛିଦ୍ରକାରୀ କୀଟ ଉପରେ ନଜର ରଖିବା ପାଇଁ ଫେରୋମୋନ୍ ଟ୍ରାପ୍ ବ୍ୟବହାର କରନ୍ତୁ। ସ୍ପାଇନୋସାଡ୍, ଏମାମେକ୍ଟିନ୍ ବେନ୍ଜୋଏଟ୍, କିମ୍ବା ଥିଓଡିକାର୍ବ ପରି ରାସାୟନିକ ସ୍ପ୍ରେ ସହିତ ନିୟନ୍ତ୍ରଣ କରନ୍ତୁ |"
         ]
      },
      "chilli": {
         "advisory": [
            "ଥ୍ରିପ୍ସ ସଂକ୍ରମଣର ପରିଚାଳନା ପାଇଁ ନୀଳ ଚଟପଟା ଜାଲ ଲଗାନ୍ତୁ। ଥ୍ରିପ୍ସକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ ଏମାମେକ୍ଟିନ୍ ବେନ୍ଜୋଏଟ୍, ଫିପ୍ରୋନିଲ୍, କିମ୍ବା ଇମିଡାକ୍ଲୋପ୍ରିଡ୍ ଭଳି ରାସାୟନିକ ସ୍ପ୍ରେ ବ୍ୟବହାର କରନ୍ତୁ।"
         ]
      },
      "cotton": {
         "advisory": [
            "ନିର୍ଦ୍ଦିଷ୍ଟ ରାସାଯ଼ନିକ ସ୍ପ୍ରେ ଦ୍ୱାରା ଆମେରିକୀଯ଼ ବୋଲୱର୍ମ, ବ୍ଯ଼ାକ୍ଟେରିଆ ଲିଫ୍ ବ୍ଲାଇଟ୍ ଏବଂ ଗ୍ରେ ଫଙ୍ଗୁକୁ ନିଯ଼ନ୍ତ୍ରଣ କରନ୍ତୁ।"
         ]
      }
   },
   "date": "29-10-2024"
}