{
   "weather_details": {
      "30-11-2024": {
         "rainfall": 0,
         "t_max": 28,
         "t_min": 16,
         "rh_max": 87,
         "rh_min": 52,
         "wind_speed": 6,
         "wind_direction": 36,
         "cloud_cover": 4
      },
      "01-12-2024": {
         "rainfall": 1,
         "t_max": 27,
         "t_min": 17,
         "rh_max": 93,
         "rh_min": 63,
         "wind_speed": 6,
         "wind_direction": 40,
         "cloud_cover": 5
      },
      "02-12-2024": {
         "rainfall": 1,
         "t_max": 26,
         "t_min": 17,
         "rh_max": 94,
         "rh_min": 62,
         "wind_speed": 5,
         "wind_direction": 56,
         "cloud_cover": 5
      },
      "03-12-2024": {
         "rainfall": 1,
         "t_max": 27,
         "t_min": 16,
         "rh_max": 90,
         "rh_min": 62,
         "wind_speed": 4,
         "wind_direction": 59,
         "cloud_cover": 4
      },
      "04-12-2024": {
         "rainfall": 2,
         "t_max": 28,
         "t_min": 16,
         "rh_max": 90,
         "rh_min": 56,
         "wind_speed": 3,
         "wind_direction": 50,
         "cloud_cover": 5
      }
   },
   "names_of_crops": [
      "ଧାନ।",
      "କପା",
      "ଅରହର",
      "ଗ୍ରୀନଗ୍ରାମ/ବ୍ଲାକଗ୍ରାମ",
      "ଚିନାବାଦାମ",
      "ସୋରିଷ ଏବଂ ତୋରିଆ",
      "ସୂର୍ଯ୍ୟମୁଖୀ",
      "ରସୁଣ",
      "ଟମାଟୋ",
      "ଲଙ୍କା",
      "ଗୋଲାପ।",
      "ଗୋରୁ ଏବଂ ମଇଁଷି",
      "ଛେଳି ଏବଂ ମେଣ୍ଢା",
      "କୁକୁଡ଼ା ମାଂସ"
   ],
   "general_advisory": "ଆଇଏମଡିରୁ ମିଳିଥିବା ପୂର୍ବାନୁମାନର ବର୍ଦ୍ଧିତ ପରିସର ଅନୁଯାୟୀ, ପ୍ରଥମ ସପ୍ତାହରେ (ନଭେମ୍ବର 29 ରୁ ଡିସେମ୍ବର 05,2024) ଓଡ଼ିଶାର ଅଧିକାଂଶ ଅଞ୍ଚଳରେ ହାଲୁକା ରୁ ମଧ୍ୟମ ବର୍ଷା ଏବଂ ଓଡ଼ିଶାର ଅବଶିଷ୍ଟ ଭାଗରେ ଶୁଖିଲା ହେବାର ସମ୍ଭାବନା ରହିଛି। ପ୍ରଥମ ସପ୍ତାହରେ ଉପକୂଳ ଓଡ଼ିଶା ଏବଂ ଉପକୂଳ ଓଡ଼ିଶାର ଆଖପାଖ ଜିଲ୍ଲାରେ ସର୍ବନିମ୍ନ ତାପମାତ୍ରା (ରାତି ତାପମାତ୍ରା) 16-18 °C, ଆଭ୍ୟନ୍ତରୀଣ ଓଡ଼ିଶାର କିଛି ଅଂଶରେ 14-16 °C, ଆଭ୍ୟନ୍ତରୀଣ ଓଡ଼ିଶାର ଅବଶିଷ୍ଟ ଅଂଶରେ 12-14 °C ଏବଂ ଚରମ ଦକ୍ଷିଣ ଓଡ଼ିଶାର କିଛି ଅଂଶରେ 18-20 °C ରହିବାର ସମ୍ଭାବନା ରହିଛି।",
   "crops_data": {
      "paddy": {
         "advisory": [
            "80-85% ଶସ୍ୟ ପରିପକ୍ୱ ହେବା ପରେ ଫସଲ ଅମଳ କରନ୍ତୁ। ଉନ୍ନତ ସ୍ୱୟଂ-ଜୀବନ ପାଇଁ ଧାନ ଶସ୍ୟକୁ 12-14% ଆର୍ଦ୍ରତା ପର୍ଯ୍ୟନ୍ତ ସୂର୍ଯ୍ୟାଲୋକରେ ଶୁଖାଇବା ଆବଶ୍ୟକ।",
            "ଅମଳ ହୋଇଥିବା ଧାନକୁ ସୁପର ଗ୍ରେନ୍ ବ୍ୟାଗ୍ରେ ଗଚ୍ଛିତ ରଖନ୍ତୁ, ଯାହାଦ୍ୱାରା ସାମଗ୍ରୀର ଗୁଣବତ୍ତା, ରଙ୍ଗ, ସୁଗନ୍ଧ, ସୁଗନ୍ଧ ଏବଂ ସ୍ୱାଦ ଦୀର୍ଘ ସମୟ ପର୍ଯ୍ୟନ୍ତ ସୁରକ୍ଷିତ ସ୍ଥାନରେ (ଉପଯୁକ୍ତ ଆଚ୍ଛାଦନ ସହିତ ସଠିକ୍ ଭାବରେ ଷ୍ଟ୍ୟାକ୍ ହୋଇଛି) କ୍ଷତି ଏଡ଼ାଇବା ପାଇଁ |",
            "ଉତ୍ପାଦର ଭଲ ମୂଲ୍ୟ ପାଇଁ ପ୍ରତ୍ୟେକ କିସମକୁ ମିଶ୍ରଣ ନକରି ଅଲଗା ଅଲଗା ପ୍ୟାକ୍ କରନ୍ତୁ |",
            "ମୂଷା/ମୂଷାଃ ଯଦି 'ମୂଷା/ମୂଷା' ସମସ୍ୟା ଦେଖାଯାଏ, ତେବେ ଫସଲ କ୍ଷେତ ଏବଂ ଆଖପାଖ ଅଞ୍ଚଳରେ ମୂଷା ଗର୍ତ୍ତକୁ ଚିହ୍ନଟ କରନ୍ତୁ। ଆଲୁମିନିୟମ୍ ଫସଫାଇଡ୍ 6 ପ୍ରତିଶତ ଟାବଲେଟ୍ ପ୍ରତି ଗର୍ତ୍ତରେ ଗୋଟିଏ ଟାବଲେଟ୍ (12 ଗ୍ରାମ୍) ରଖି ଗର୍ତ୍ତକୁ କାଦୁଅରେ ବନ୍ଦ କରିଦିଅନ୍ତୁ ଯାହା ମୂଷାଙ୍କୁ ମାରିଦେବ।"
         ]
      },
      "cotton": {
         "advisory": [
            "ଯେତେବେଳେ ବୋଲ୍ ଗୁଡ଼ିକ ସମ୍ପୂର୍ଣ୍ଣ ଭାବେ ଫୁଟିଯାଏ, ସେତେବେଳେ ଉଠାଇବା ଉଚିତ।",
            "ଆର୍ଦ୍ରତାକୁ 8-10% କୁ ହ୍ରାସ କରିବା ପାଇଁ ଏକ କଂକ୍ରିଟ୍ ଚଟାଣ କିମ୍ବା ତିରପାଲ ଶୀଟ୍ ଉପରେ ବୀଜ କପା ଶୁଖାଇ ଦିଅନ୍ତୁ | ଭଲ ମୂଲ୍ୟ ପାଇବା ପାଇଁ ପ୍ରଥମ ଉଠାଣରୁ ମିଳିଥିବା ବିହନ କପଡ଼ାକୁ ଅଲଗା ଭାବେ ରଖନ୍ତୁ।",
            "ଉତ୍ତମ ଉଦ୍ଭିଦ ବୃଦ୍ଧି ଏବଂ ଶୁଣ୍ଢର ବିକାଶ ପାଇଁ ଏନ. ପି. କେ.-19-19-19 ପରି ତରଳ ସାରର ପତ୍ର ସ୍ପ୍ରେ 20 ଗ୍ରାମ୍/10 ଲିଟର ପାଣିରେ କରାଯିବା ଉଚିତ।",
            "କୌଣସି ନୂତନ କୀଟପତଙ୍ଗ ଏବଂ ରୋଗର ପ୍ରକୋପ ବିଷୟରେ ଜାଣିବା ପାଇଁ ଫସଲର ନିୟମିତ ତଦାରଖ।",
            "ଲମ୍ବା ପ୍ରଧାନ କପା ପାଇଁ ଏମଏସପି (Rs.7521/qt) ପାଇବା ପାଇଁ କୃଷକମାନଙ୍କୁ ନିକଟସ୍ଥ 'ମଣ୍ଡି' ରେ ସେମାନଙ୍କ ବିହନ କପା ବିକ୍ରୟ କରିବାକୁ ପରାମର୍ଶ ଦିଆଯାଇଛି।"
         ]
      },
      "arhar": {
         "advisory": [
            "ପ୍ରଚଳିତ ପାଣିପାଗ ସ୍ଥିତି ପରବର୍ତ୍ତୀ କୀଟ ଆକ୍ରମଣକୁ ସମର୍ଥନ କରେ | ତେଣୁ, ଆବଶ୍ୟକତା ଅନୁଯାୟୀ ସୁପାରିସ କରାଯାଇଥିବା ନିୟନ୍ତ୍ରଣ ପଦକ୍ଷେପ ଅନୁସରଣ କରାଯିବା ଉଚିତ।",
            "ପୋଡ୍ ବୋରରକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁଃ ବେନ୍ଫୁରାକାର୍ବ 40 ପ୍ରତିଶତ ଇସି @1ଲିଟ୍/ଏସି କିମ୍ବା ଡେଲ୍ଟାମେଥ୍ରିନ୍ 2.8 ପ୍ରତିଶତ ଇସି @200 ମିଲି/ଏସି କିମ୍ବା ସ୍ପିନୋସାଡ୍ 45 ପ୍ରତିଶତ ଏସସି @60 ମିଲି/ଏସି କିମ୍ବା ଫ୍ଲୁବେଣ୍ଡିଆମାଇଡ୍ 39.35% ଏସସି @40 ମିଲି/ଏସି ସହିତ 200 ଲିଟର ପାଣି ମିଶାଇ ଲଗାନ୍ତୁ।",
            "ପୋଡ୍ ସୁକିଙ୍ଗ୍ ବଗ୍ ଏବଂ ଏଫିଡ୍ କୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁଃ ଥିୟାମେଥୋକ୍ସାମ୍ 25 ପ୍ରତିଶତ ଡବ୍ଲୁଜି @40 ଗ୍ରାମ୍/ଏସି କିମ୍ବା ଇମିଡାକ୍ଲୋପ୍ରିଡ୍ 17.8% ଏସ୍ଏଲ୍ @60 ମିଲି/ଏକର ସହିତ 200 ଲିଟର ପାଣି ମିଶାଇ ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "greengram/blackgram": {
         "advisory": [
            "ସବୁଜ ଚଣା ଏବଂ କଳା ଚଣା ବୁଣିବା ପାଇଁ ଉପଯୁକ୍ତ ସମୟ। ମଞ୍ଜି ଗୁଡ଼ିକୁ ବପନ କରିବାର ସାତ ଦିନ ପୂର୍ବରୁ ଥିରମ୍ 50 ଡବ୍ଲ୍ୟୁ. ପି. କିମ୍ବା କାର୍ବେଣ୍ଡାଜିମ୍ 50 ଡବ୍ଲ୍ୟୁ. ପି. @2 ଗ୍ରାମ୍/କେଜି ମଞ୍ଜି ଦେଇ ଚିକିତ୍ସା କରନ୍ତୁ।",
            "ବୁଣିବା ପୂର୍ବରୁ, 10 କିଲୋଗ୍ରାମ ମଞ୍ଜି ସହିତ 200 ଗ୍ରାମ ରାଇଜୋବିୟମ୍ କଲ୍ଚର ଏବଂ 250 ଗ୍ରାମ ପି. ଏସ୍. ବି. ଯୁକ୍ତ ସ୍ଲରି ମିଶ୍ରଣକୁ 600 ମିଲି. ପାଣି ସହିତ ମିଶାଇ ଉପଚାର କରନ୍ତୁ। ଅପରାହ୍ନରେ ବୁଣିବା ପୂର୍ବରୁ ବିଶୋଧିତ ମଞ୍ଜିଗୁଡ଼ିକୁ ଏକ ଛପରରେ ଶୁଖିବାକୁ ଦିଅନ୍ତୁ। ଏହା 15-20% ପର୍ଯ୍ୟନ୍ତ ଉତ୍ପାଦନ ବୃଦ୍ଧି କରିବ।",
            "ବିହନ ଦରଃ 8-10 କିଲୋଗ୍ରାମ/ଏକର",
            "ଉପଯୁକ୍ତ କିସମଃ ସବୁଜ ଚଣା-ଆଇ. ପି. ଏମ୍. 2-03, ବିରାଟ, ଶିଖା, ଏମ୍. ଏଚ୍. 1142, କେ-851, ପି. ଡି. ଏମ୍. 11, ପି. ଡି. ଏମ୍.-14, ଓ. ୟୁ. ଏମ୍.-115 ଇତ୍ୟାଦି। ଚଣା-ପି. ୟୁ.-10, ପି. ୟୁ.-11, ପି. ୟୁ.-19, ପି. ୟୁ.-30, ପି. ୟୁ.-31, ଟି. 9 ଇତ୍ୟାଦି।",
            "ପୋଷକ ତତ୍ତ୍ୱ ପରିଚାଳନାଃ ଏକ ଏକର ଜମି ପାଇଁ ଜମି ପ୍ରସ୍ତୁତ କରିବା ସମୟରେ 35 କିଲୋଗ୍ରାମ ଡିଏପି ଏବଂ 13 କିଲୋଗ୍ରାମ ଏମଓପି ପ୍ରୟୋଗ କରନ୍ତୁ।"
         ]
      },
      "groundnut": {
         "advisory": [
            "ରବି ଚିନାବାଦାମ ବୁଣିବା ପାଇଁ ଉପଯୁକ୍ତ ସମୟ। ବୀଜକୁ ବୁଣିବା ପୂର୍ବରୁ କାର୍ବେନଡାଜିମ୍ 25 ପ୍ରତିଶତ + ମାନକୋଜେବ୍ 50 ପ୍ରତିଶତ ଡବ୍ଲୁଏସ୍ @3-3.5 ଗ୍ରାମ୍/କେଜି ମଞ୍ଜି ସହିତ ଏବଂ ବୁଣିବା ସମୟରେ 25 କେଜି ମଞ୍ଜି ପିଛା 500 ଗ୍ରାମ୍ କିମ୍ବା 250 ମିଲିଲିଟର ରାଇଜୋବିୟମ୍ କଲ୍ଚର ସହିତ ଚିକିତ୍ସା କରନ୍ତୁ। ମଧ୍ୟାହ୍ନ ସମୟରେ ମଞ୍ଜି ବୁଣିବା ଉଚିତ।",
            "ଉପଯୁକ୍ତ କିସମଃ ଦେବୀ (ଆଇ. ସି. ଜି. ଭି.-91114), କାଦ୍ରି-6, କାଦ୍ରି-9, ଟି. ଏ. ଜି.-51, ଟି. ଏମ୍. ଭି.-2, ସ୍ମୃତି (ଓ. ଜି. 52-1), ସି. ଓ.-7, ଧରଣୀ ଇତ୍ୟାଦି।",
            "ବିହନ ଦରଃ ଏକର ପିଛା 40-50 କିଲୋଗ୍ରାମ ଚିନାବାଦାମ ମଞ୍ଜି।",
            "ପୋଷକ ତତ୍ତ୍ୱ ପରିଚାଳନାଃ ବୁଣିବା ପୂର୍ବରୁ ଏକର ପିଛା 40 କିଲୋଗ୍ରାମ ଡିଏପି, 25 କିଲୋଗ୍ରାମ ଏମଓପି ଏବଂ 12 କିଲୋଗ୍ରାମ ସଲଫର୍ ଲଗାନ୍ତୁ।",
            "ଆଗାଛା ପରିଚାଳନାଃ 2-3 ଡିଏଏସରେ 200 ଲିଟର ପାଣି ସହିତ 80 ମିଲି/ଏକର ପିଛା ଅକ୍ସିଫ୍ଲୋରଫେନ୍ ଇ. ସି. ଲଗାନ୍ତୁ।"
         ]
      },
      "mustard & toria": {
         "advisory": [
            "ନିଡ ମ୍ୟାନେଜମେଣ୍ଟଃ 1-2 ଡିଏଏସରେ 3 ମିଲି/ଲିଟର ଜଳ କିମ୍ବା କୁଇଜାଲୋଫପ-ଇଥାଇଲ 5 ପ୍ରତିଶତ ଇସିରେ 2 ମିଲି/ଲିଟର ଜଳ 15-20 ଡିଏଏସରେ ଆବିର୍ଭାବ ପରେ ଅକ୍ସାଡିଆର୍ଜିଲ 6 ପ୍ରତିଶତ ଇସି ପ୍ରୟୋଗ କରନ୍ତୁ।"
         ]
      },
      "sunflower": {
         "advisory": [
            "ନିଡ୍ ମ୍ୟାନେଜମେଣ୍ଟଃ ପ୍ରାକ୍-ଆବିର୍ଭାବ ହର୍ବିସାଇଡ୍ ଭାବରେ 200 ଲିଟର ପାଣି ସହିତ ମିଶ୍ରଣ କରି ଏକର ପିଛା 1.25 ଲିଟରରେ 30 ପ୍ରତିଶତ ଇ. ସି. ପେଣ୍ଡିମିଥାଲିନ୍ ସ୍ପ୍ରେ କରନ୍ତୁ। ଜଳସେଚନ ପୂର୍ବରୁ ଡି. ଏ. ଏସ୍. 21-28 ରେ ବିଦ୍ୟୁତ ଅପତୃଣ, ଅପତୃଣ ପରିଚାଳନା କରିବାରେ ଏକ ଗୁରୁତ୍ୱପୂର୍ଣ୍ଣ ଭୂମିକା ଗ୍ରହଣ କରିଥାଏ।"
         ]
      },
      "onion": {
         "advisory": [
            "ଏବେ ହେଉଛି ଆଳୁ ବୁଣିବା ପାଇଁ ଉପଯୁକ୍ତ ସମୟ।",
            "ଉପଯୁକ୍ତ ବିବିଧତାଃ ଭୀମ ରାଜ, ଭୀମ ଗାଢ଼ ଲାଲ, ଭୀମ ଶ୍ୱେତା, ଭୀମ ସୁଭ୍ରା, ଭୀମ ସଫେଦ୍, ଆଗ୍ରିଫାଉଣ୍ଡ୍ ଗାଢ଼ ଲାଲ, ଭୀମ ଶକ୍ତି, ଭୀମ ସୁପର, ଅର୍କ ନିକେତନ୍ ଇତ୍ୟାଦି ଶୀତ ଋତୁ ପାଇଁ ଉପଯୁକ୍ତ ଚାଷ।",
            "ବିହନ ଦରଃ ଏକର ପିଛା 4 କିଲୋଗ୍ରାମ"
         ]
      },
      "tomato": {
         "advisory": [
            "30-35 ଦିନର ପୁରୁଣା ଚାରା ଗୁଡ଼ିକୁ ମୁଖ୍ୟ କ୍ଷେତରେ 75-90 ସେ. ମି. ର ଧାଡ଼ି ଠାରୁ ଧାଡ଼ି ବ୍ୟବଧାନ ସହିତ ପ୍ରତିରୋପଣ କରନ୍ତୁ ଏବଂ 45-60 ସେ. ମି. ର ଚାରା ବ୍ୟବଧାନ ସହିତ ରୋପଣ କରନ୍ତୁ।",
            "ରୋପଣ ପୂର୍ବରୁ, ବାଭିଷ୍ଟିନ୍ @1.5 ଗ୍ରାମ ଏବଂ ପ୍ଲାଣ୍ଟୋମାଇସିନ୍ @1 ଗ୍ରାମ୍ର ଦ୍ରବଣକୁ 1 ଲିଟର ପାଣିରେ ମିଶାଇ 10 ରୁ 15 ମିନିଟ୍ ପର୍ଯ୍ୟନ୍ତ ଚାରା ରୋପଣ କରନ୍ତୁ, ଏବଂ ଅପରାହ୍ନରେ ପ୍ରତିରୋପଣ କରନ୍ତୁ।",
            "ପୋଷକ ତତ୍ତ୍ୱ ପରିଚାଳନାଃ ଏକର ପିଛା 66 କିଲୋଗ୍ରାମ ଡିଏପି, 33 କିଲୋଗ୍ରାମ ଏମଓପି ଏବଂ 80 କିଲୋଗ୍ରାମ ୟୁରିଆ ପ୍ରୟୋଗ କରନ୍ତୁ। ୟୁରିଆର ଏକ ତୃତୀୟାଂଶ + ସମ୍ପୂର୍ଣ୍ଣ ଡିଏପି + ଏକ ତୃତୀୟାଂଶ ଏମଓପିକୁ ଆଧାର ଭାବେ ପ୍ରୟୋଗ କରନ୍ତୁ।"
         ]
      },
      "chilli": {
         "advisory": [
            "ଉପଯୁକ୍ତ କିସମଃ ଏଚ. ୱାଇ. ଭି.-ଉତକଲା ଆଭା, ଉତକଲା ରଶ୍ମୀ, ଉତକଲା ରାଗିଣୀ, ପୁସା ଜ୍ୱାଲା, ପୁସା ସଦାବହାର। ହାଇବ୍ରିଡ୍-ଜ୍ୟୋତି, ଅଗ୍ନିରେଖା, ରୋଶନୀ, ତେଜସ୍ୱିନୀ ଇତ୍ୟାଦି।",
            "ବିହନ ହାରଃ ଏଚ. ୱାଇ. ଭି. ପାଇଁ ଏକର ପିଛା 200 ଗ୍ରାମ୍ ଏବଂ ହାଇବ୍ରିଡ୍ ପାଇଁ ଏକର ପିଛା 100 ଗ୍ରାମ୍।"
         ]
      },
      "rose": {
         "advisory": [
            "ପିଞ୍ଚିଂ 30-45 DAT ରେ କିମ୍ବା କଳ ଗଠନ ପୂର୍ବରୁ ଶାଖାକୁ ଉତ୍ସାହିତ କରିବା ସହିତ ସାମଗ୍ରିକ ଉତ୍ପାଦନ ବୃଦ୍ଧି କରିବା ପାଇଁ କରାଯିବା ଉଚିତ |"
         ]
      },
      "cattle & buffalo": {
         "advisory": [
            "ପର୍ଯ୍ୟାପ୍ତ ପରିମାଣର ସବୁଜ ଘାସ ଯୋଗାଇ ଦିଅନ୍ତୁ। ଉତ୍ତମ ଉତ୍ପାଦନ ପାଇଁ ସ୍ତନ୍ୟପାନ କରାଉଥିବା ପଶୁମାନଙ୍କୁ ଏକ ଘନୀଭୂତ ମିଶ୍ରଣ ପ୍ରଦାନ କରାଯିବା ଉଚିତ।"
         ]
      },
      "goat & sheep": {
         "advisory": [
            "ଶୀତ ଋତୁ ଆରମ୍ଭ ହେବା ପୂର୍ବରୁ ଛେଳି ଘର ମରାମତି କରିବାକୁ କୃଷକମାନଙ୍କୁ ପରାମର୍ଶ ଦିଆଯାଇଛି କାରଣ ଥଣ୍ଡା ପାଗ ହେତୁ ପିଲାମାନଙ୍କ ମଧ୍ୟରେ ମୃତ୍ୟୁ ହେବାର ଅଧିକ ସମ୍ଭାବନା ରହିଛି।"
         ]
      },
      "poultry": {
         "advisory": [
            "ମୃତ୍ୟୁ ହାର ହ୍ରାସ କରିବା ପାଇଁ ବିଶେଷ କରି ରାତିରେ ଛୁଆମାନଙ୍କୁ ଉତ୍ତାପ ପ୍ରଦାନ କରିବା ପାଇଁ ଆବଶ୍ୟକ ବ୍ୟବସ୍ଥା କରନ୍ତୁ। ଛୁଆମାନଙ୍କ ପାଇଁ ଉପଯୁକ୍ତ ପ୍ରଜନନ ବ୍ୟବସ୍ଥା କରନ୍ତୁ। କୁକୁଡ଼ା ଘରକୁ ସଫା ଏବଂ କ୍ଲାମ୍ପ-ମୁକ୍ତ ରଖନ୍ତୁ |"
         ]
      }
   },
   "date": "29-11-2024"
}