{
   "weather_details": {
      "21-09-2024": {
         "rainfall": 6,
         "t_max": 35,
         "t_min": 24,
         "rh_max": 90,
         "rh_min": 61,
         "wind_speed": 4,
         "wind_direction": 248,
         "cloud_cover": 6
      },
      "22-09-2024": {
         "rainfall": 5,
         "t_max": 35,
         "t_min": 24,
         "rh_max": 88,
         "rh_min": 62,
         "wind_speed": 5,
         "wind_direction": 72,
         "cloud_cover": 6
      },
      "23-09-2024": {
         "rainfall": 6,
         "t_max": 34,
         "t_min": 25,
         "rh_max": 86,
         "rh_min": 58,
         "wind_speed": 5,
         "wind_direction": 198,
         "cloud_cover": 7
      },
      "24-09-2024": {
         "rainfall": 10,
         "t_max": 33,
         "t_min": 25,
         "rh_max": 90,
         "rh_min": 60,
         "wind_speed": 4,
         "wind_direction": 90,
         "cloud_cover": 7
      },
      "25-09-2024": {
         "rainfall": 12,
         "t_max": 33,
         "t_min": 24,
         "rh_max": 93,
         "rh_min": 68,
         "wind_speed": 6,
         "wind_direction": 150,
         "cloud_cover": 8
      }
   },
   "names_of_crops": [
      "ସିଧାସଳଖ ବିହନ ବୁଣାଯାଇଥିବା ଧାନ",
      "ରୋପଣ କରାଯାଇଥିବା ଧାନ",
      "କପା",
      "ଅରହର",
      "ସଂକର ମକା",
      "ପନିପରିବା"
   ],
   "general_advisory": "ଏଫିଡ୍, ଜ୍ଯାସିଡ୍, ହ୍ୱାଇଟ୍ଫ୍ଲାଇ, ମିଲି ବଗ୍ ଏବଂ ଥ୍ରୀପ୍ ପରି ଶୋଷକ କୀଟପତଙ୍ଗ ସଂକ୍ରମଣ ପାଇଁ ପ୍ରଚଳିତ ପାଣିପାଗ ସ୍ଥିତି ଅନୁକୂଳ | ନିମ୍ବ-ଆଧାରିତ କୀଟନାଶକ ଆଜାଦିରାକ୍ଟିନ (1500 ପିପିଏମ) ପ୍ରୟୋଗ କରନ୍ତୁ @3 ମିଲି/ଲିଟର ପାଣି ପ୍ରାରମ୍ଭିକ ପର୍ଯ୍ୟାୟରେ ଶୋଷକ କୀଟ ସଂକ୍ରମଣର ପରିଚାଳନା ପାଇଁ | ଥ୍ରୀପ୍ ଉପରେ ନଜର ରଖିବା ପାଇଁ ଏଫିଡ୍, ଜ୍ଯାସିଡ୍, ହ୍ୱାଇଟ୍ଫ୍ଲାଇ, ମିଲି ବଗ୍ ଏବଂ ବ୍ଲୁ ଷ୍ଟିକ୍ ଟ୍ରାପ୍ ପରି ଶୋଷକ କୀଟ ଉପରେ ନଜର ରଖିବା ପାଇଁ ହଳଦିଆ ଷ୍ଟିକ୍ ଟ୍ରାପ୍ @8nos./acre ସ୍ଥାପନ କରନ୍ତୁ। ପନିପରିବାରେ ଶୋଷକ କୀଟ, ଫଳ ମାଛି ଏବଂ ଛେଦକ କୀଟ ଉପରେ ନଜର ରଖିବା ପାଇଁ କୃଷକମାନଙ୍କୁ ଏକର ପିଛା 8ନସ୍ ଫେରୋମନ୍ ଟ୍ରାପ୍ ବ୍ୟବହାର କରିବାକୁ ପରାମର୍ଶ ଦିଆଯାଇଛି। ରୋଗ ଏବଂ କୀଟପତଙ୍ଗର ପ୍ରକୋପକୁ କମ୍ କରିବା ପାଇଁ ଆପଣଙ୍କ ଫସଲ କ୍ଷେତ୍ରକୁ ଆଗାଛାରୁ ମୁକ୍ତ ରଖନ୍ତୁ | ଏସ୍. ଏମ୍. ଏସ୍. ପରାମର୍ଶଃ କାର୍ପାସରେ ଲକ୍ଷଣାତ୍ମକ ବାନ୍ତି ଏବଂ ମୂଳ କ୍ଷୟ ରୋଗକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ କାର୍ବେନଡାଜିମ୍ 50 ଡବ୍ଲ୍ୟୁ. ପି. @2 ଗ୍ରାମ୍/ଲିଟର ପାଣିରେ ମୂଳ ଅଞ୍ଚଳରେ ମୃତ୍ତିକାକୁ ଭିଜାଇ ଦିଅନ୍ତୁ।",
   "crops_data": {
      "direct seeded paddy": {
         "advisory": [
            "କୀଟ ପରିଚାଳନାଃ ବିସ୍ଫୋରଣ ସଂକ୍ରମଣ ସତର୍କ ସୂଚନା। ଟେବୁକୋନାଜୋଲ୍ 50 ପ୍ରତିଶତ + ଟ୍ରାଇଫ୍ଲୋକ୍ସିସ୍ଟ୍ରୋବିନ୍ 25 ପ୍ରତିଶତ ଡବ୍ଲୁଜି (ନାଟିଭୋ) @80 ଗ୍ରାମ/ଏକର କିମ୍ବା ଆଇସୋପ୍ରୋଥିଓଲେନ୍ 40 ଇସି (ସୁଲତାନ/ଫୁଜିଟା/ଫୁଜିଓନେ) @300 ମିଲି/ଏକରକୁ 200 ଲିଟର ଲିଟର ପାଣି ସହିତ ମିଶାଇ ସ୍ପ୍ରେ କରନ୍ତୁ। 7-10 ଦିନ ବ୍ଯ଼ବଧାନରେ ସ୍ପ୍ରେକୁ ପୁନରାବୃତ୍ତି କରନ୍ତୁ।"
         ]
      },
      "transplanted paddy": {
         "advisory": [
            "ପୋଷକ ତତ୍ତ୍ୱ ପରିଚାଳନାଃ ଉଚ୍ଚଭୂମି ସ୍ଥିତିରେ ଏକର ପିଛା 16 କିଲୋଗ୍ରାମ ଯ଼ୁରିଆ + 10 କିଲୋଗ୍ରାମ ଏମଓପି ଏବଂ ମଧ୍ଯ଼ମ ଏବଂ ନିମ୍ନ ଭୂମି ସ୍ଥିତିରେ ଏକର ପିଛା 20 କିଲୋଗ୍ରାମ ଯ଼ୁରିଆ + 13 କିଲୋଗ୍ରାମ ଏମଓପି ପ୍ରଯ଼ୋଗ କରନ୍ତୁ।",
            "କୀଟ ପରିଚାଳନାଃ କାଣ୍ଡ ଛେଦକ, ପତ୍ର ଫୋଲଡର ଏବଂ ଧାନ କାନ ଖାଉଥିବା କ୍ଯ଼ାଟର୍ପିଲରର ଜନସଂଖ୍ଯ଼ା ଉପରେ ନଜର ରଖିବା ଏବଂ ନିଯ଼ନ୍ତ୍ରଣ କରିବା ପାଇଁ ଫେରୋମୋନ୍ ଟ୍ରାପ୍ @8nos./acre ଏବଂ ଲାଇଟ୍ ଟ୍ରାପ୍ @1no./acre ସ୍ଥାପନ କରନ୍ତୁ ଏବଂ ତିନି ସପ୍ତାହ ପରେ ଲୋଭକୁ ବଦଳାନ୍ତୁ |"
         ]
      },
      "cotton": {
         "advisory": [
            "ପୋଷକ ତତ୍ତ୍ୱ ପରିଚାଳନାଃ ଜଳମଗ୍ନ ଅଞ୍ଚଳରେ 10 ଲିଟର ପାଣିରେ 100 ଗ୍ରାମ୍ ମ୍ଯ଼ାଗ୍ନେସିଯ଼ମ୍ ସଲଫେଟ୍ ସହିତ 100 ଗ୍ରାମ୍ ଯ଼ୁରିଆ ମିଶାଇ ସ୍ପ୍ରେ କରିବା।",
            "କୀଟ ପରିଚାଳନାଃ ଶୋଷକ କୀଟ (ଏଫିଡ୍, ଜାସିଡ୍, ଥ୍ରିପ୍ସ, ହ୍ୱାଇଟ୍ଫ୍ଲାଇ) ସତର୍କ | 200 ଲିଟର ପାଣି ସହିତ ମିଶ୍ରଣ କରି ଏକର ପିଛା 600-800 ମିଲି + 200 ଗ୍ରାମ ଡିଟର୍ଜେଣ୍ଟ ପାଉଡର ଭଳି ନିମ୍ବ ଆଧାରିତ କୀଟନାଶକ ପ୍ରୟୋଗ କରିବା ଉଚିତ।"
         ]
      },
      "arhar": {
         "advisory": [
            "କୀଟ ପରିଚାଳନାଃ ଲିଫ୍ ୱେବର୍ ଆଲର୍ଟ। ପ୍ରୋଫେନୋଫସ୍ 50 ପ୍ରତିଶତ ଇସି କିମ୍ବା କ୍ଲୋରପାଇରିଫସ୍ 50 ପ୍ରତିଶତ + ସାଇପର୍ମେଥ୍ରିନ 5 ପ୍ରତିଶତ ଇସି @2 ମିଲି/ଲିଟର @2 ମିଲି/ଲିଟର ପାଣି ସ୍ପ୍ରେ କରନ୍ତୁ।",
            "ଶୋଷକ କୀଟ (ଏଫିଡ୍, ଜାସିଡ୍, ଥ୍ରିପ୍ସ, ହ୍ୱାଇଟ୍ଫ୍ଲାଇ) ସତର୍କ। ନିମ୍ବ-ଆଧାରିତ କୀଟନାଶକ (1500 ପିପିଏମ) ସଂକ୍ରମଣର ପ୍ରାରମ୍ଭିକ ପର୍ଯ୍ଯ଼ାଯ଼ରେ 3 ମିଲି/ଲିଟର ପାଣିରେ ସିଞ୍ଚନ କରାଯାଇପାରେ।"
         ]
      },
      "hybrid maize": {
         "advisory": [
            "ପୋଷକ ତତ୍ତ୍ୱ ପରିଚାଳନାଃ ଯଦି ଫସଲ ଟାସେଲିଂ ପର୍ଯ୍ୟାୟରେ ଥାଏ, ତା \"ହେଲେ ଏସି ପିଛା 25 କିଲୋଗ୍ରାମ ୟୁରିଆ ଲଗାନ୍ତୁ ଏବଂ ଯଦି ପର୍ଯ୍ୟାପ୍ତ ପାଣି ନଥାଏ, ତେବେ ଜଳସେଚନ କରନ୍ତୁ।",
            "କୀଟ ପରିଚାଳନାଃ ଷ୍ଟେମ ବୋରର, ଏଫ. ଏ. ଡବ୍ଲ୍ୟୁ. ଏବଂ ବ୍ୟାଣ୍ଡେଡ ଲିଫ୍ ଏବଂ ସିଥ୍ ବ୍ଲାଇଟ ଆଲର୍ଟ। ନିୟମିତ ଭାବେ କ୍ଷେତ ଉପରେ ନଜର ରଖନ୍ତୁ ଏବଂ ସଂକ୍ରମିତ ଗଛର ଅଂଶଗୁଡ଼ିକୁ ବାହାର କରନ୍ତୁ।"
         ]
      },
      "vegetables": {
         "advisory": [
            "ବାଇଗଣଃ ବିଲ୍ଟକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ, 200 ଲିଟର ପାଣି ସହିତ ମିଶ୍ରିତ ମୂଳ ଅଞ୍ଚଳରେ ଟେବୁକୋନାଜୋଲ୍ 25.9% ଇସି @200-ମିଲି/ଏକର + ସ୍ଟ୍ରେପ୍ଟୋସାଇକ୍ଲିନ୍ @30 ଗ୍ରାମ୍/ଏକର ସ୍ପ୍ରେ କରନ୍ତୁ।",
            "ଟମାଟୋଃ ନର୍ସରୀରେ ଚାଷ ପାଇଁ ଉତ୍କଳ କୁମାରୀ (ବି. ଟି.-10), ଉତ୍କଳ ଦୀପ୍ତି (ବି. ଟି.-2), ଉତ୍କଳ ରାଜା, ଉତ୍କଳ ପ୍ରଜ୍ଞାନ ଏବଂ ସ୍ୱର୍ଣ୍ଣ ସମ୍ପଦ ଭଳି ଉପଯୁକ୍ତ କିସମ ବାଛନ୍ତୁ। ଏକ ଏକର ଜମିରେ ରୋପଣ କରିବା ପାଇଁ 150 ରୁ 200 ଗ୍ରାମ ମଞ୍ଜି ଆବଶ୍ଯ଼କ ହୋଇଥାଏ।"
         ]
      }
   },
   "date": "20-09-2024"
}