{
   "weather_details": {
      "05-10-2024": {
         "rainfall": 0,
         "t_max": 33,
         "t_min": 27,
         "rh_max": 68,
         "rh_min": 47,
         "wind_speed": 7,
         "wind_direction": 253,
         "cloud_cover": 4
      },
      "06-10-2024": {
         "rainfall": 0,
         "t_max": 32,
         "t_min": 27,
         "rh_max": 72,
         "rh_min": 46,
         "wind_speed": 5,
         "wind_direction": 248,
         "cloud_cover": 3
      },
      "07-10-2024": {
         "rainfall": 0,
         "t_max": 32,
         "t_min": 27,
         "rh_max": 75,
         "rh_min": 53,
         "wind_speed": 4,
         "wind_direction": 243,
         "cloud_cover": 5
      },
      "08-10-2024": {
         "rainfall": 0,
         "t_max": 32,
         "t_min": 26,
         "rh_max": 83,
         "rh_min": 51,
         "wind_speed": 4,
         "wind_direction": 180,
         "cloud_cover": 4
      },
      "09-10-2024": {
         "rainfall": 5,
         "t_max": 31,
         "t_min": 26,
         "rh_max": 89,
         "rh_min": 57,
         "wind_speed": 6,
         "wind_direction": 115,
         "cloud_cover": 6
      }
   },
   "names_of_crops": [
      "ଧାନ।"
   ],
   "general_advisory": "ଆଇଏମଡିରୁ ମିଳିଥିବା ପାଞ୍ଚ ଦିନିଆ ପାଣିପାଗ ପୂର୍ବାନୁମାନ ଆଧାରରେ, କୃଷକମାନେ ଆବଶ୍ଯ଼କତା ଅନୁଯାଯ଼ୀ ଆଗାମୀ ଚାରି ଦିନ ମଧ୍ଯ଼ରେ କୃଷି ସମ୍ବନ୍ଧୀଯ଼ ଅଭ୍ଯ଼ାସ, ଜଳସେଚନ, ପ୍ରଯ଼ୋଗ କୀଟନାଶକ ଏବଂ ସାର ଜାରି ରଖିପାରିବେ। କ୍ଷେତକୁ ଆଗାଛା ମୁକ୍ତ ରଖନ୍ତୁ ଏବଂ ସିପେଜ୍ କ୍ଷତିକୁ ରୋକିବା ପାଇଁ ବନ୍ଧରେ ଥିବା ଛିଦ୍ରଗୁଡ଼ିକୁ ପ୍ଲଗ୍ କରନ୍ତୁ | କୀଟପତଙ୍ଗ ଏବଂ ରୋଗର ଘଟଣା ପାଇଁ ଫସଲର ନିଯ଼ମିତ ତଦାରଖ କରାଯିବା ଉଚିତ ଏବଂ କୀଟ ସଂଖ୍ଯ଼ା ଉପରେ ନଜର ରଖିବା ପାଇଁ ହାଲୁକା ଫାନ୍ଦ ବ୍ଯ଼ବହାର କରାଯିବା ଉଚିତ ଯାହା ଦ୍ୱାରା ସମଯ଼ୋଚିତ ନିଯ଼ନ୍ତ୍ରଣ ପଦକ୍ଷେପ ନିଆଯାଇପାରିବ। ବର୍ତ୍ତମାନର ପାଣିପାଗ ସ୍ଥିତିରେ ଉଇପୋକା ଫସଲ ଏବଂ ପନିପରିବାକୁ କ୍ଷତି ପହଞ୍ଚାଇପାରେ। କୃଷକମାନଙ୍କୁ କ୍ଲୋରପିରିଫସ୍ 20 ଇସି @4 ମିଲି/ଲିଟର ପାଣି ସିଞ୍ଚନ କରିବାକୁ ପରାମର୍ଶ ଦିଆଯାଇଛି। ଏସ୍. ଏମ୍. ଏସ୍. ପରାମର୍ଶ-ଧାନରେ ବି. ପି. ଏଚ୍. ସଂକ୍ରମଣ ସମଯ଼ରେ ନାଇଟ୍ରୋଜେନଯୁକ୍ତ ସାର ବ୍ଯ଼ବହାର କରନ୍ତୁ ନାହିଁ।",
   "crops_data": {
      "paddy": {
         "advisory": [
            "କୀଟ ପରିଚାଳନାଃ ଧାନ କ୍ଷୀର ଦୋଇବା ସମୟରେ ଗୁଣ୍ଡି କୀଟ ସଂକ୍ରମଣ ସାଧାରଣତଃ ଦେଖାଯାଏ। ଯେତେବେଳେ ଗୁଣ୍ଡି ବଗ୍ର ସଂଖ୍ୟା ଆର୍ଥିକ ସୀମା ସ୍ତର (ଇ. ଟି. ଏଲ୍.) ଅର୍ଥାତ୍ 2 ଜଣ ବୟସ୍କ/ପାହାଡ କିମ୍ବା 5 ଜଣ ବୟସ୍କ/ବର୍ଗ ମିଟର ଅତିକ୍ରମ କରିଥାଏ, ସେତେବେଳେ ଇଟୋଫେନପ୍ରୋକ୍ସ 10 ଇ. ସି. @ଏକର ପିଛା 200 ମିଲି କିମ୍ବା କ୍ଲୋରୋପାଇରିଫସ୍ 20 ପ୍ରତିଶତ ଇ. ସି. @ଏକର ପିଛା 1000 ମିଲି. କୁ 200 ଲିଟର ପାଣି ସହିତ ମିଶାଇ ସ୍ପ୍ରେ କରନ୍ତୁ।",
            "କୀଟ ପରିଚାଳନାଃ ଧାନର ଏହି ପର୍ଯ୍ଯ଼ାଯ଼ରେ ବି. ପି. ଏଚ୍. ସଂକ୍ରମଣ ପରିଲକ୍ଷିତ ହୋଇପାରେ। ଯଦି ବ୍ରାଉନ୍ ପ୍ଲାଣ୍ଟପର୍ (ବିପିଏଚ) ର ଜନସଂଖ୍ଯ଼ା ଇଟିଏଲ (5-10 ହପର୍/ପାହାଡ) ରୁ ଅଧିକ ହୁଏ, ତେବେ କୃଷକମାନଙ୍କୁ ବିକଳ୍ପ ଭିଜା ଏବଂ ଶୁଖାଇବା କୌଶଳ ଗ୍ରହଣ କରିବାକୁ ପରାମର୍ଶ ଦିଆଯାଇଛି (ପାଣି ଦୀର୍ଘ ସମଯ଼ ଧରି କ୍ଷେତରେ ଠିଆ ହେବା ଉଚିତ ନୁହେଁ)। ଯଦି ସମସ୍ଯ଼ା ଜାରି ରହେ, ତେବେ ଏକର ପିଛା 120 ଗ୍ରାମ୍ ପାଇମେଟ୍ରୋଜିନ୍ 50 ପ୍ରତିଶତ ଡବ୍ଲୁ. ଜି. କିମ୍ବା ଏକର ପିଛା 80 ଗ୍ରାମ୍ ଡିନୋଟେଫୁରାନ୍ 20 ପ୍ରତିଶତ ଏସ୍. ଜି. କିମ୍ବା ଏକର ପିଛା 50 ମିଲି ଇମିଡାକ୍ଲୋପ୍ରିଡ୍ <ଆଇ. ଡି. 1> ଏସ୍. ଏଲ୍. କିମ୍ବା ଏକର ପିଛା 400 ଗ୍ରାମ୍ ବୁପ୍ରୋଫେଜିନ୍ 20 ପ୍ରତିଶତ + ଏସ୍ଫେଟ୍ 50 ପ୍ରତିଶତ ଡବ୍ଲ୍ଯ଼ୁ. ପି. କିମ୍ବା ଏକର ପିଛା 60 ଗ୍ରାମ୍ ଫ୍ଲୋନିକାମିଡ୍ 50 ପ୍ରତିଶତ ଡବ୍ଲୁ. ଜି. କୁ 200 ଲିଟର ପାଣିରେ ମିଶାଇ ସ୍ପ୍ରେ କରନ୍ତୁ। ବିପିଏଚ ସଂକ୍ରମଣ ସମଯ଼ରେ ନାଇଟ୍ରୋଜେନ ସାର ବ୍ଯ଼ବହାରରୁ ଦୂରେଇ ରୁହନ୍ତୁ।"
         ]
      }
   },
   "date": "04-10-2024"
}