{
   "weather_details": {
      "21-12-2024": {
         "rainfall": 5,
         "t_max": 29,
         "t_min": 15,
         "rh_max": 93,
         "rh_min": 53,
         "wind_speed": 4,
         "wind_direction": 49,
         "cloud_cover": 5
      },
      "22-12-2024": {
         "rainfall": 2,
         "t_max": 29,
         "t_min": 15,
         "rh_max": 87,
         "rh_min": 42,
         "wind_speed": 4,
         "wind_direction": 34,
         "cloud_cover": 5
      },
      "23-12-2024": {
         "rainfall": 1,
         "t_max": 29,
         "t_min": 14,
         "rh_max": 78,
         "rh_min": 34,
         "wind_speed": 3,
         "wind_direction": 36,
         "cloud_cover": 4
      },
      "24-12-2024": {
         "rainfall": 0,
         "t_max": 30,
         "t_min": 14,
         "rh_max": 71,
         "rh_min": 33,
         "wind_speed": 2,
         "wind_direction": 79,
         "cloud_cover": 4
      },
      "25-12-2024": {
         "rainfall": 0,
         "t_max": 30,
         "t_min": 14,
         "rh_max": 65,
         "rh_min": 31,
         "wind_speed": 2,
         "wind_direction": 37,
         "cloud_cover": 2
      }
   },
   "names_of_crops": [
      "ରୋପଣ କରାଯାଇଥିବା ଧାନ",
      "କପା",
      "ଗ୍ରୀନଗ୍ରାମ/ବ୍ଲାକଗ୍ରାମ",
      "ଚିନାବାଦାମ",
      "ସୋରିଷ ଏବଂ ତୋରିଆ",
      "ସୂର୍ଯ୍ୟମୁଖୀ",
      "ରସୁଣ",
      "ଫୁଲକୋବି ଏବଂ ବନ୍ଧାକୋବି",
      "ଟମାଟୋ",
      "ଗୋରୁ ଏବଂ ମଇଁଷି",
      "ଛେଳି।",
      "କୁକୁଡ଼ା ମାଂସ"
   ],
   "general_advisory": "ଆଇଏମଡିରୁ ମିଳିଥିବା ବର୍ଦ୍ଧିତ ରେଞ୍ଜ ପୂର୍ବାନୁମାନ ଅନୁଯାୟୀ, ସପ୍ତାହ-1 (20 ରୁ 26 ଡିସେମ୍ବର, 2024) ମଧ୍ୟରେ ଉପକୂଳ ଓଡ଼ିଶା ଏବଂ ଆଭ୍ୟନ୍ତରୀଣ ଓଡ଼ିଶାର ଆଖପାଖ ଜିଲ୍ଲାରେ ବହୁତ ହାଲୁକା ରୁ ହାଲୁକା ବର୍ଷା ହେବାର ସମ୍ଭାବନା ରହିଛି। ସପ୍ତାହ-1 ମଧ୍ୟରେ ଦକ୍ଷିଣ ଓଡ଼ିଶାର କେତେକ ସ୍ଥାନରେ ସର୍ବନିମ୍ନ ତାପମାତ୍ରା (ରାତ୍ରିକାଳୀନ ତାପମାତ୍ରା) 18-20 °ସେ., ଉପକୂଳ ଓଡ଼ିଶାର ଅଧିକାଂଶ ଭାଗରେ ଏବଂ ଆଭ୍ୟନ୍ତରୀଣ ଓଡ଼ିଶାର କେତେକ ଭାଗରେ 14-16 °ସେ. ଏବଂ ଆଭ୍ୟନ୍ତରୀଣ ଓଡ଼ିଶାର ଅବଶିଷ୍ଟ ଭାଗରେ 10-14 °ସେ. ରହିବ। ଦ୍ୱିତୀୟ ସପ୍ତାହରେ (ଡିସେମ୍ବର 27,2024ରୁ ଜାନୁଆରୀ 2,2025) ଓଡ଼ିଶାରେ ଶୁଖିଲା ପାଗ ରହିବାର ସମ୍ଭାବନା ରହିଛି। ସପ୍ତାହ-2 ମଧ୍ୟରେ ଦକ୍ଷିଣ ଓଡ଼ିଶାର କେତେକ ସ୍ଥାନରେ ସର୍ବନିମ୍ନ ତାପମାତ୍ରା (ରାତି ତାପମାତ୍ରା) 16-18 °C, ଉପକୂଳ ଓଡ଼ିଶାର ଅଧିକାଂଶ ଭାଗରେ ଏବଂ ଆଭ୍ୟନ୍ତରୀଣ ଓଡ଼ିଶାର କେତେକ ଭାଗରେ 14-16 °C ଏବଂ ଆଭ୍ୟନ୍ତରୀଣ ଓଡ଼ିଶାର ଅବଶିଷ୍ଟ ଭାଗରେ 10-14 °C ରହିବାର ସମ୍ଭାବନା ରହିଛି। ସପ୍ତାହର ଆଗାମୀ ତିନି ଦିନ ବର୍ଷା ହେବାର ସମ୍ଭାବନା ଥିବାରୁ କୃଷକମାନଙ୍କୁ ଧାନ ଅମଳ ସ୍ଥଗିତ ରଖିବାକୁ ପରାମର୍ଶ ଦିଆଯାଇଛି। ଯଦି ଧାନ ଅମଳ ହୋଇସାରିଛି, ତେବେ ପଲିଥିନ୍ ଚାଦରରେ ଆଚ୍ଛାଦନ କରି ସୁରକ୍ଷିତ ସଂରକ୍ଷଣ ସୁନିଶ୍ଚିତ କରନ୍ତୁ। ଆଶା କରାଯାଉଥିବା ହାଲୁକା ବର୍ଷା ହେତୁ, କପା ଚାଷୀ ମାନେ ସମ୍ପୂର୍ଣ୍ଣ ଭାବେ ଖୋଲାଯାଇଥିବା ଶୁଣ୍ଢଗୁଡ଼ିକୁ ଅମଳ କରିବା ଉଚିତ ଏବଂ ଗୁଣବତ୍ତା ବଜାୟ ରଖିବା ପାଇଁ ସେଗୁଡ଼ିକୁ ସୁରକ୍ଷିତ ଭାବେ ସଂରକ୍ଷଣ କରିବା ଉଚିତ। ବର୍ତ୍ତମାନ ପାଇଁ କୀଟନାଶକ ସିଞ୍ଚନ ବନ୍ଦ କରନ୍ତୁ। ପ୍ରତ୍ଯାଶିତ ବୃଷ୍ଟିପାତର ଉପଯୋଗ କରିବା ପାଇଁ ରବି ଫସଲର ବୁଣିବା ସମ୍ପୂର୍ଣ୍ଣ କରନ୍ତୁ। ବର୍ଷା କମିବା ପର୍ଯ୍ୟନ୍ତ ଗୃହପାଳିତ ପଶୁମାନଙ୍କୁ ଘର ଭିତରେ ବନ୍ଦ କରି ରଖନ୍ତୁ।",
   "crops_data": {
      "transplanted paddy": {
         "advisory": [
            "ରବି ଋତୁ ପାଇଁ ନର୍ସରୀ ପ୍ରସ୍ତୁତି ପାଇଁ ଏହା ହେଉଛି ଉପଯୁକ୍ତ ସମୟ। ଏକ ଏକର ଧାନ ଚାଷ ପାଇଁ ନର୍ସରୀ କ୍ଷେତ୍ରର 10 ଦଶମାଂଶ ଆବଶ୍ୟକ। ଏମ. ଟି. ୟୁ. 1010, ଏମ. ଟି. ୟୁ. 1001, ଡି. ଆର. ଆର. 44, ସହଭାଗି ଧନ, ଲଲାଟ, ଉନ୍ନତ ଲଲାଟ, ମନ୍ଦାକିନୀ, ବିନା 11 ଇତ୍ୟାଦି ଉପଯୁକ୍ତ ଉଚ୍ଚ ଉତ୍ପାଦନକାରୀ କିସମର ବ୍ୟବସ୍ଥା କରନ୍ତୁ। ନର୍ସରୀରେ ବୁଣିବା ପୂର୍ବରୁ ପ୍ରତି 1 କି. ଗ୍ରା. ମଞ୍ଜି ପିଛା 2 ଗ୍ରାମ୍ କାର୍ବେନଡାଜିମ୍ କିମ୍ବା 3 ଗ୍ରାମ୍ କାର୍ବୋକ୍ସିନ୍ କିମ୍ବା ଥିରାମ୍ ବ୍ୟବହାର କରନ୍ତୁ।",
            "ଧାନ ନର୍ସରୀକୁ ଥଣ୍ଡା ଆଘାତରୁ ରକ୍ଷା କରିବା ପାଇଁ, ଶଯ୍ୟାକୁ ଅପେକ୍ଷାକୃତ ଗରମ ରଖିବା ପାଇଁ ଓଦା ଶଯ୍ୟାରେ ମଞ୍ଜି ବୁଣିବା ପରେ ଭଲ ଭାବେ ଅପଘଟିତ ଏଫ୍. ଆଇ. ଏମ୍. ର ଏକ ପତଳା ସ୍ତର ଲଗାନ୍ତୁ। ସନ୍ଧ୍ୟାରେ ଜଳସେଚନ ପାଇଁ ବୋର କୂଅ ପାଣିର ବ୍ୟବହାର କରିବା ଉଚିତ ଏବଂ ମୃତ୍ତିକାର ତାପମାତ୍ରା ବୃଦ୍ଧି ପାଇଁ ଅନୁକୂଳ ରଖିବା ପାଇଁ ସକାଳେ ଥଣ୍ଡା ପାଣି ବାହାର କରିଦିଅନ୍ତୁ। ପ୍ରବଳ ଥଣ୍ଡା ପ୍ରଭାବିତ ଅଞ୍ଚଳରେ ରାତିରେ ପଲିଥିନ୍ କଭର ବ୍ୟବହାର କରନ୍ତୁ।",
            "ଚାରା ଗୁଡ଼ିକର ସୁସ୍ଥ ଉତ୍ପାଦନ ପାଇଁ 200 କିଲୋଗ୍ରାମ ଏଫୱାଇଏମ ଏବଂ 10 ଦଶମିକ ପିଛା 200 ଗ୍ରାମ ଜେଡଏନ ସହିତ 13-15 କିଲୋଗ୍ରାମ ଡିଏପି ଏବଂ 10-12 କିଲୋଗ୍ରାମ ଏମଓପିକୁ ମୂଳ ମାତ୍ରା ଭାବରେ ପ୍ରୟୋଗ କରନ୍ତୁ।"
         ]
      },
      "cotton": {
         "advisory": [
            "ଯେତେବେଳେ ବୋଲ୍ ଗୁଡ଼ିକ ସମ୍ପୂର୍ଣ୍ଣ ଭାବେ ଫୁଟିଯାଏ, ସେତେବେଳେ ଉଠାଇବା ଉଚିତ।",
            "ଆର୍ଦ୍ରତାକୁ 8-10% କୁ ହ୍ରାସ କରିବା ପାଇଁ କଂକ୍ରିଟ୍ ଚଟାଣ କିମ୍ବା ତିରପାଲ ଶୀଟ୍ ଉପରେ ବୀଜ କପା ଶୁଖାଇ ଦିଅନ୍ତୁ |",
            "ଲମ୍ବା ପ୍ରଧାନ କପା ପାଇଁ ଏମଏସପି (Rs.7521/qt) ପାଇବା ପାଇଁ କୃଷକମାନଙ୍କୁ ନିକଟସ୍ଥ \"ମଣ୍ଡି\" ରେ ସେମାନଙ୍କର ବିହନ କପା ବିକ୍ରୟ କରିବାକୁ ପରାମର୍ଶ ଦିଆଯାଇଛି।"
         ]
      },
      "greengram/blackgram": {
         "advisory": [
            "ଆଗାଛା ପରିଚାଳନାଃ 1-2 ଡିଏଏସରେ 200 ଲିଟର ପାଣି ସହିତ ପେଣ୍ଡିମିତାଲିନ୍ 30 ପ୍ରତିଶତ ଇସି @1.20 ଲିଟର/ଏକର ମିଶାନ୍ତୁ।"
         ]
      },
      "groundnut": {
         "advisory": [
            "ଆଗାଛା ପରିଚାଳନାଃ ଇମାଜେଥାପାଇର୍ 10 ପ୍ରତିଶତ ଏସ୍. ଏଲ୍. @3 ମିଲି/ଲିଟର ଜଳ 15 ଡିଏଏସ୍ରେ ପ୍ରୟୋଗ କରନ୍ତୁ, ଯଥାଶୀଘ୍ର ଉଦ୍ଭବ ପରବର୍ତ୍ତୀ ହର୍ବିସାଇଡ୍ ଭାବେ, କିମ୍ବା 15-20 ଡିଏଏସ୍ରେ ଫେନକ୍ସାପ୍ରପ-ପି-ଇଥାଇଲ 9.3 ପ୍ରତିଶତ @35 ମିଲି/ଡ୍ରମ୍ (15-ଲିଟର କ୍ଷମତା) ପ୍ରୟୋଗ କରନ୍ତୁ।"
         ]
      },
      "mustard & toria": {
         "advisory": [
            "ଆଗାଛା ପରିଚାଳନାଃ 15-20 ଡି. ଏ. ଏସ୍. ରେ 2 ମିଲି./ଲିଟର ଜଳ ଉଠିବା ପରେ କୁଇଜାଲୋଫପ୍-ଇଥାଇଲ 5 ପ୍ରତିଶତ ଇ. ସି. ଲଗାନ୍ତୁ।",
            "3-ସପ୍ତାହ ପର୍ଯ୍ୟାୟରେ ସାର ପ୍ରୟୋଗ (ୟୁରିଆ @35-40 କେଜି/ଏସି + ଏମଓପି @10 କେଜି/ଏସି) ଏବଂ ଜଳସେଚନ ଭଳି ଆନ୍ତଃସାଂସ୍କୃତିକ କାର୍ଯ୍ୟ ହାତକୁ ନିଅନ୍ତୁ।"
         ]
      },
      "sunflower": {
         "advisory": [
            "3-ସପ୍ତାହ ପର୍ଯ୍ୟାୟରେ ପ୍ରଥମ ଉପର ଡ୍ରେସିଂ (ୟୁରିଆ @6-10 କେଜି/ଏସି) ଏବଂ ଜଳସେଚନ ଭଳି ଆନ୍ତଃସାଂସ୍କୃତିକ କାର୍ଯ୍ୟକଳାପ ଆରମ୍ଭ କରନ୍ତୁ।",
            "ଶୋଷକ କୀଟ କମ୍ପ୍ଲେକ୍ସ (ଏଫିଡ୍, ହପର୍, ଥ୍ରିପ୍ସ ଏବଂ ହ୍ୱାଇଟ୍ ମାଛି): ପ୍ରଚଳିତ ପାଣିପାଗ ସ୍ଥିତି ଶୋଷକ କୀଟଗୁଡ଼ିକର ବିକାଶକୁ ସମର୍ଥନ କରେ | ଏସିଟାମିପ୍ରିଡ୍ 20 ପ୍ରତିଶତ ଏସ. ପି. @50 ଗ୍ରାମ/ଏକର କିମ୍ବା ଇମିଡାକ୍ଲୋପ୍ରିଡ୍ 17.8% ଏସ. ଏଲ. @60 ମିଲି/ଏକରକୁ 200 ଲିଟର ପାଣି ସହିତ ମିଶାଇ ଆବଶ୍ୟକ ଅନୁଯାୟୀ ସ୍ପ୍ରେ କରିବା ପାଇଁ ପରାମର୍ଶ ଦିଆଯାଇଛି।"
         ]
      },
      "onion": {
         "advisory": [
            "ଆଠ ସପ୍ତାହ ପର୍ଯ୍ୟାୟରେ ପିଆଜର ଚାରା ରୋପଣ ପାଇଁ ମୁଖ୍ୟ କ୍ଷେତ୍ର ପ୍ରସ୍ତୁତ କରନ୍ତୁ।",
            "ପୋଷକ ତତ୍ତ୍ୱ ପରିଚାଳନାଃ ଏକ ଏକର କ୍ଷେତ୍ର ପାଇଁ, ମୁଖ୍ୟ କ୍ଷେତରେ ପିଆଜର ଚାରା ରୋପଣ ପୂର୍ବରୁ 43 କିଲୋଗ୍ରାମ ଡିଏପି, 27 କିଲୋଗ୍ରାମ ୟୁରିଆ, 33 କିଲୋଗ୍ରାମ ଏମଓପି ଏବଂ 20 କିଲୋଗ୍ରାମ ସଲଫର୍ଡ୍ ଲଗାନ୍ତୁ।"
         ]
      },
      "cauliflower & cabbage": {
         "advisory": [
            "ପୋଷକ ତତ୍ତ୍ୱ ପରିଚାଳନାଃ ତିନି ସପ୍ତାହର ପର୍ଯ୍ୟାୟରେ, ହୋଇଂ, ନିଡ଼ାଇବାର କାର୍ଯ୍ୟ ହାତକୁ ନିଅନ୍ତୁ ଏବଂ 55 କିଲୋଗ୍ରାମ/ଏସି ୟୁରିଆ ଲଗାନ୍ତୁ ଏବଂ ପରେ ଜଳସେଚନ କରନ୍ତୁ।",
            "ଛଅରୁ ସାତ ସପ୍ତାହ ପରେ ଜଳସେଚନ ପାଇଁ 27 କି. ଗ୍ରା. ୟୁରିଆ + 25 କି. ଗ୍ରା. ଏମ୍. ଓ. ପି. ପ୍ରୟୋଗ କରନ୍ତୁ।"
         ]
      },
      "tomato": {
         "advisory": [
            "ଉଚ୍ଚ ଆର୍ଦ୍ର ଅବସ୍ଥାକୁ ଦୃଷ୍ଟିରେ ରଖି ଏହି ପର୍ଯ୍ୟାୟରେ ଶୁଷ୍କତା ଘଟିପାରେ। ଯଦି ଲକ୍ଷଣ ଦେଖାଯାଏ, ତେବେ ମାନକୋଜେବ୍ 75 ପ୍ରତିଶତ ଡବ୍ଲ୍ୟୁ. ପି. @2 ଗ୍ରାମ/ଲିଟର ପାଣି ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "cattle & buffalo": {
         "advisory": [
            "କୃଷକମାନଙ୍କୁ ଅନୁରୋଧ କରାଯାଉଛି ଯେ ସେମାନେ ଏନ୍. ଏ. ଡି. ସି. ପି. ଜରିଆରେ ସେମାନଙ୍କ ଗୋରୁ ଏବଂ ମଇଁଷିକୁ ଏଫ୍. ଏମ୍. ଡି. ଟିକା ଦିଅନ୍ତୁ।",
            "କୃଷକମାନେ ପାଦ ଏବଂ ମୁଖ ରୋଗ (ଏଫ୍. ଏମ୍. ଡି.) କୁ ନିୟନ୍ତ୍ରଣ ଏବଂ ପ୍ରତିରୋଧ କରି ଦୁଗ୍ଧ ଉତ୍ପାଦନ ବୃଦ୍ଧି କରିପାରିବେ।",
            "4 ରୁ 8 ମାସ ବୟସର ବାଛୁରୀମାନଙ୍କୁ ବ୍ରୁସେଲୋସିସ୍ ବିରୁଦ୍ଧରେ ଟୀକାକରଣ କରାଯିବା ଉଚିତ୍।"
         ]
      },
      "goat": {
         "advisory": [
            "ଥଣ୍ଡା ପବନ ଏବଂ ଆର୍ଦ୍ର ଚଟାଣରୁ ଛେଳିଙ୍କୁ ରକ୍ଷା କରନ୍ତୁ।"
         ]
      },
      "poultry": {
         "advisory": [
            "ମୃତ୍ୟୁ ହାର ହ୍ରାସ କରିବା ପାଇଁ ବିଶେଷ କରି ରାତିରେ ଛୁଆମାନଙ୍କୁ ଉତ୍ତାପ ପ୍ରଦାନ କରିବା ପାଇଁ ଆବଶ୍ୟକ ବ୍ୟବସ୍ଥା କରନ୍ତୁ। ଛୁଆମାନଙ୍କ ପାଇଁ ଉପଯୁକ୍ତ ପ୍ରଜନନ ବ୍ୟବସ୍ଥା କରନ୍ତୁ। କୁକୁଡ଼ା ଘରକୁ ସଫା ରଖନ୍ତୁ ଏବଂ କ୍ଲାମ୍ପ ମୁକ୍ତ ରଖନ୍ତୁ |"
         ]
      }
   },
   "date": "20-12-2024"
}