{
   "weather_details": {
      "20-07-2024": {
         "rainfall": 15,
         "t_max": 35,
         "t_min": 26,
         "rh_max": 89,
         "rh_min": 56,
         "wind_speed": 9,
         "wind_direction": 68,
         "cloud_cover": 8
      },
      "21-07-2024": {
         "rainfall": 10,
         "t_max": 34,
         "t_min": 25,
         "rh_max": 92,
         "rh_min": 62,
         "wind_speed": 11,
         "wind_direction": 248,
         "cloud_cover": 8
      },
      "22-07-2024": {
         "rainfall": 15,
         "t_max": 34,
         "t_min": 25,
         "rh_max": 87,
         "rh_min": 71,
         "wind_speed": 18,
         "wind_direction": 248,
         "cloud_cover": 8
      },
      "23-07-2024": {
         "rainfall": 15,
         "t_max": 35,
         "t_min": 26,
         "rh_max": 81,
         "rh_min": 66,
         "wind_speed": 23,
         "wind_direction": 248,
         "cloud_cover": 7
      },
      "24-07-2024": {
         "rainfall": 5,
         "t_max": 35,
         "t_min": 26,
         "rh_max": 78,
         "rh_min": 61,
         "wind_speed": 23,
         "wind_direction": 248,
         "cloud_cover": 6
      }
   },
   "names_of_crops": [
      "ସିଧାସଳଖ ବିହନ ବୁଣାଯାଇଥିବା ଧାନ",
      "ରୋପଣ କରାଯାଇଥିବା ଧାନ",
      "କପା",
      "ଅରହର",
      "ସଂକର ମକା",
      "ବାଇଗଣ ଏବଂ ଲଙ୍କା",
      "ଓକ୍ରା",
      "ରସୁଣ",
      "ଆମ୍ବ",
      "ପେଁପେ",
      "କୁକୁଡ଼ା ମାଂସ",
      "ଛେଳି ଏବଂ ମେଣ୍ଢା"
   ],
   "general_advisory": "ଆଇଏମଡି ଦ୍ୱାରା ପାଣିପାଗ ପୂର୍ବାନୁମାନକୁ ଦୃଷ୍ଟିରେ ରଖି କୃଷକମାନଙ୍କୁ ବର୍ତ୍ତମାନ ପାଇଁ ବୁଣିବା କାର୍ଯ୍ଯ଼ ବନ୍ଦ କରିବାକୁ ଏବଂ ଉପଲବ୍ଧ ମୃତ୍ତିକା ଆର୍ଦ୍ରତା ବ୍ଯ଼ବହାର କରି ବର୍ଷା ହ୍ରାସ ପାଇବା ପରେ ଶୀଘ୍ର ବୁଣିବା ଆରମ୍ଭ କରିବାକୁ ପରାମର୍ଶ ଦିଆଯାଇଛି। ଉପରୋକ୍ତ ପୂର୍ବାନୁମାନକୁ ଦୃଷ୍ଟିରେ ରଖି ବର୍ଷା ହ୍ରାସ ନହେବା ପର୍ଯ୍ଯ଼ନ୍ତ ଠିଆ ହୋଇଥିବା ଫସଲରେ ସାର ଏବଂ କୀଟନାଶକ ପ୍ରଯ଼ୋଗରୁ ଦୂରେଇ ରହିବାକୁ କୃଷକମାନଙ୍କୁ ପରାମର୍ଶ ଦିଆଯାଇଛି। ମକା, ଅରହର, ଚିନାବାଦାମ ଏବଂ ପନିପରିବା କ୍ଷେତରୁ ଅତିରିକ୍ତ ଜଳ ନିଷ୍କାସନ ପାଇଁ ବ୍ଯ଼ବସ୍ଥା କରନ୍ତୁ। ଆସନ୍ନ ବର୍ଷା ପୂର୍ବରୁ ପରିପକ୍ୱ ପନିପରିବା ଅମଳ କରନ୍ତୁ | ଏସ୍. ଏମ୍. ଏସ୍. ପରାମର୍ଶଃ ନର୍ସରୀ ଶଯ୍ଯ଼ା ଉପରେ ପ୍ଲାଷ୍ଟିକ୍ କିମ୍ବା ପଲିଥିନ୍ ଚାଦରରେ ଢାଙ୍କି ନର୍ସରୀରେ ଥିବା ପନିପରିବା ଚାରା ଗୁଡ଼ିକୁ ପ୍ରବଳ ବର୍ଷାରୁ ରକ୍ଷା କରନ୍ତୁ।",
   "crops_data": {
      "direct seeded paddy": {
         "advisory": [
            "ଆଗାଛା ପରିଚାଳନାଃ କାର୍ଯ୍ଯ଼ସୂଚୀ ଅନୁଯାଯ଼ୀ ତୃଣନାଶକ ପ୍ରଯ଼ୋଗ କରନ୍ତୁ।",
            "ପୋଷକ ତତ୍ତ୍ୱ ପରିଚାଳନାଃ କାର୍ଯ୍ଯ଼ସୂଚୀ ଅନୁଯାଯ଼ୀ ଯ଼ୁରିଆ ପ୍ରଯ଼ୋଗ କରନ୍ତୁ।"
         ]
      },
      "transplanted paddy": {
         "advisory": [
            "ଜମି ପ୍ରସ୍ତୁତିଃ କାଦୁଅ ଏବଂ ସମତଳ ଜମି ପାଇଁ ସୁପାରିସ କରାଯାଇଥିବା ଅଭ୍ଯ଼ାସ ଅନୁସରଣ କରନ୍ତୁ।",
            "ସାର ପ୍ରଯ଼ୋଗଃ ସାରର ସୁପାରିସ କରାଯାଇଥିବା ମାତ୍ରା ପ୍ରଯ଼ୋଗ କରନ୍ତୁ।"
         ]
      },
      "cotton": {
         "advisory": [
            "ଅଧିକ ବର୍ଷା ଜଳ ପାଇଁ ଡ୍ରେନେଜ୍ ଚ୍ଯ଼ାନେଲ୍ ତିଆରି କରନ୍ତୁ।",
            "ହୋଇଂ, ନିଡ଼ାଇ, ଏବଂ ଟପ୍ ଡ୍ରେସିଂ ଗ୍ରହଣ କରନ୍ତୁ |"
         ]
      },
      "arhar": {
         "advisory": [
            "ଅତିରିକ୍ତ ବର୍ଷା ଜଳ ନିଷ୍କାସନ ପାଇଁ ଡ୍ରେନେଜ୍ ଚ୍ଯ଼ାନେଲ୍ ସୃଷ୍ଟି କରନ୍ତୁ।",
            "ପରାମର୍ଶ ଅନୁଯାଯ଼ୀ ହୋଇଂ, ନିଡ଼ାଇ, ଏବଂ ମୃତ୍ତିକା ଉତ୍ତୋଳନ କରାଯିବା ଉଚିତ।"
         ]
      },
      "hybrid maize": {
         "advisory": [
            "ଜଳାବଦ୍ଧତା ଏଡ଼ାଇବା ପାଇଁ ଜଳ ନିଷ୍କାସନ ବ୍ଯ଼ବସ୍ଥାର ବିକାଶ କରନ୍ତୁ।",
            "ହୋଇଂ, ନିଡ଼ିଂ ଏବଂ ଟପ୍ ଡ୍ରେସିଂ ପାଇଁ ପରାମର୍ଶ ଦିଆଯାଇଥିବା ଅଭ୍ଯ଼ାସ ଅନୁସରଣ କରନ୍ତୁ |"
         ]
      },
      "brinjal & chilli": {
         "advisory": [
            "ସମଯ଼ୋଚିତ ରୋପଣ ପାଇଁ ଉଠାଯାଇଥିବା ଶଯ୍ଯ଼ା ନର୍ସରୀ ପ୍ରସ୍ତୁତ କରନ୍ତୁ।",
            "ସୁପାରିଶ ଅନୁଯାଯ଼ୀ ମଞ୍ଜି ଏବଂ ଟ୍ରାନ୍ ସ୍ପ୍ଲାଣ୍ଟ ଚାରା ଗୁଡ଼ିକୁ ଚିକିତ୍ସା କରନ୍ତୁ।"
         ]
      },
      "okra": {
         "advisory": [
            "ଅଧିକ ଉତ୍ପାଦନ ପାଇଁ ଜୁଲାଇ ଶେଷ ସୁଦ୍ଧା ବୁଣନ୍ତୁ।",
            "ଜମି ପ୍ରସ୍ତୁତି ସମଯ଼ରେ ଏଫ. ୱାଇ. ଏମ୍. ପ୍ରଯ଼ୋଗ କରନ୍ତୁ।"
         ]
      },
      "onion": {
         "advisory": [
            "ଉପଯୁକ୍ତ କିସମ ଚଯ଼ନ କରନ୍ତୁ ଏବଂ ଉଠାଯାଇଥିବା ନର୍ସରୀ ଶଯ୍ଯ଼ା ପ୍ରସ୍ତୁତ କରନ୍ତୁ।",
            "ବୀଜ ଚିକିତ୍ସା ଏବଂ ମଲ୍ଚିଙ୍ଗ ପାଇଁ ସୁପାରିସ କରାଯାଇଥିବା ଅଭ୍ଯ଼ାସ ଅନୁସରଣ କରନ୍ତୁ।"
         ]
      },
      "mango": {
         "advisory": [
            "ଉପଯୁକ୍ତ ସମଯ଼ରେ ସୁସ୍ଥ ଚାରା ବ୍ଯ଼ବହାର କରି ଗଛ ଲଗାନ୍ତୁ।",
            "ସୁପାରିସ କରାଯାଇଥିବା ବ୍ଯ଼ବଧାନ ଏବଂ ଗର୍ତ୍ତ ପ୍ରସ୍ତୁତି ଅନୁସରଣ କରନ୍ତୁ।"
         ]
      },
      "papaya": {
         "advisory": [
            "ଉପଯୁକ୍ତ ସମଯ଼ରେ ସୁପାରିସ କରାଯାଇଥିବା କିସମ ସହିତ ଗଛ ଲଗାନ୍ତୁ।",
            "ବ୍ଯ଼ବଧାନ ଏବଂ ଗର୍ତ୍ତ ପ୍ରସ୍ତୁତିର ନିର୍ଦ୍ଦେଶାବଳୀ ଅନୁସରଣ କରନ୍ତୁ।"
         ]
      },
      "poultry": {
         "advisory": [
            "ବର୍ଷା ଜଳ ପ୍ରବେଶକୁ ରୋକିବା ପାଇଁ କୁକୁଡ଼ା ଘର ମରାମତି କରନ୍ତୁ |",
            "ଖାଦ୍ଯ଼ ସାମଗ୍ରୀଗୁଡ଼ିକ ଓଦା ହେବାରୁ ରକ୍ଷା କରନ୍ତୁ।"
         ]
      },
      "goat & sheep": {
         "advisory": [
            "ଆଭ୍ଯ଼ନ୍ତରୀଣ ପରଜୀବୀ ହ୍ରାସ କରିବା ପାଇଁ ସେଗୁଡ଼ିକୁ ଶୁଖିଲା କରନ୍ତୁ।",
            "ବର୍ଷା ସମଯ଼ରେ ଆବଶ୍ଯ଼କ ଯତ୍ନ ଏବଂ ପରିମଳ ବ୍ଯ଼ବସ୍ଥା ପ୍ରଦାନ କରନ୍ତୁ।"
         ]
      }
   },
   "date": "19-07-2024"
}