{
   "weather_details": {
      "28-09-2024": {
         "rainfall": 5,
         "t_max": 29,
         "t_min": 23,
         "rh_max": 93,
         "rh_min": 75,
         "wind_speed": 11,
         "wind_direction": 193,
         "cloud_cover": 8
      },
      "29-09-2024": {
         "rainfall": 5,
         "t_max": 30,
         "t_min": 24,
         "rh_max": 93,
         "rh_min": 65,
         "wind_speed": 9,
         "wind_direction": 207,
         "cloud_cover": 6
      },
      "30-09-2024": {
         "rainfall": 2,
         "t_max": 31,
         "t_min": 24,
         "rh_max": 93,
         "rh_min": 62,
         "wind_speed": 8,
         "wind_direction": 246,
         "cloud_cover": 6
      },
      "01-10-2024": {
         "rainfall": 2,
         "t_max": 32,
         "t_min": 24,
         "rh_max": 94,
         "rh_min": 63,
         "wind_speed": 10,
         "wind_direction": 248,
         "cloud_cover": 4
      },
      "02-10-2024": {
         "rainfall": 2,
         "t_max": 33,
         "t_min": 24,
         "rh_max": 88,
         "rh_min": 65,
         "wind_speed": 9,
         "wind_direction": 252,
         "cloud_cover": 4
      }
   },
   "names_of_crops": [
      "ସିଧାସଳଖ ବିହନ ବୁଣାଯାଇଥିବା ଧାନ",
      "ରୋପଣ କରାଯାଇଥିବା ଧାନ",
      "କପା",
      "ଅରହର",
      "ସଂକର ମକା",
      "ପନିପରିବା",
      "ବାଇଗଣ",
      "ଓକ୍ରା",
      "ଲଙ୍କା",
      "ଫଳ",
      "କଦଳୀ",
      "ପେଁପେ",
      "ପଶୁପାଳନ",
      "ଗାଈ ଏବଂ ମଇଁଷି",
      "ଛେଳି ଏବଂ ମେଣ୍ଢା"
   ],
   "general_advisory": "ଆଇଏମଡିରୁ ମିଳିଥିବା ପାଞ୍ଚ ଦିନିଆ ପାଣିପାଗ ପୂର୍ବାନୁମାନ ଆଧାରରେ, କୃଷକମାନେ ଗୁରୁବାରଠାରୁ କୃଷି ସମ୍ବନ୍ଧୀୟ ଅଭ୍ୟାସ, ପ୍ରୟୋଗ କୀଟନାଶକ ଏବଂ ସାର ପୁନଃ ଆରମ୍ଭ କରିପାରିବେ। ଫସଲର ବୃଦ୍ଧି ପର୍ଯ୍ୟାୟ ଅନୁଯାୟୀ ସନ୍ତୁଳିତ ଏବଂ ଉପଯୁକ୍ତ ସାର ପ୍ରୟୋଗ କରନ୍ତୁ। ଅତ୍ୟଧିକ ନାଇଟ୍ରୋଜେନ୍ ଠାରୁ ଦୂରେଇ ରୁହନ୍ତୁ କାରଣ ଏହା ଅତ୍ୟଧିକ ଉଦ୍ଭିଦ ବୃଦ୍ଧିକୁ ପ୍ରୋତ୍ସାହିତ କରେ ଏବଂ ଜଳ ଚାହିଦା ବୃଦ୍ଧି କରେ | ଯଦି ଫସଲକୁ କୀଟପତଙ୍ଗରୁ ରକ୍ଷା କରିବା ପାଇଁ ଉପଲବ୍ଧ ଥାଏ, ତେବେ ଜୈବିକ ଚିକିତ୍ସା ସହିତ ସର୍ବଦା ପ୍ରତିଷେଧକ ପଦକ୍ଷେପଗୁଡ଼ିକର ଏକ ସମନ୍ୱିତ ଆଭିମୁଖ୍ୟ ଉପରେ ବିଚାର କରନ୍ତୁ। ବ୍ୟାପକ କୀଟନାଶକ ବ୍ୟବହାର କୀଟପତଙ୍ଗରେ ପ୍ରତିରୋଧ ସୃଷ୍ଟି କରିପାରେ। ଏହାକୁ ରୋକିବା ପାଇଁ, କୀଟନାଶକ ଏବଂ ମିଶ୍ରଣ ବ୍ୟବହାର ମଧ୍ୟରେ ଉପଯୁକ୍ତ ଘୂର୍ଣ୍ଣନ ନିଶ୍ଚିତ କରନ୍ତୁ |",
   "crops_data": {
      "direct seeded paddy": {
         "advisory": [
            "ଧାନର କ୍ଷୀର ଦୋଇବା ସମୟରେ ଗୁଣ୍ଡି ବଗ ସଂକ୍ରମଣ ସାଧାରଣତଃ ଦେଖାଯାଏ | ଯେତେବେଳେ ଗୁଣ୍ଡି ବଗ୍ର ସଂଖ୍ୟା ଆର୍ଥିକ ସୀମା ସ୍ତର (ଇ. ଟି. ଏଲ୍.) ଅତିକ୍ରମ କରେ, ଇଟୋଫେନପ୍ରୋକ୍ସ 10 ଇ. ସି. କିମ୍ବା କ୍ଲୋରୋପାଇରିଫୋସ୍ 20 ପ୍ରତିଶତ ଇ. ସି. ସ୍ପ୍ରେ କରନ୍ତୁ। ବିପିଏଚ ସଂକ୍ରମଣ ମଧ୍ୟ ପରିଲକ୍ଷିତ ହୋଇପାରେ। ଯଦି ଜନସଂଖ୍ୟା ଇ. ଟି. ଏଲ୍. ଠାରୁ ଅଧିକ ହୁଏ, ତେବେ ବିକଳ୍ପ ଓଦା ଏବଂ ଶୁଖାଇବା କୌଶଳ ଅବଲମ୍ବନ କରନ୍ତୁ। ସଂକ୍ରମଣ ସ୍ତର ଉପରେ ଆଧାର କରି ସୁପାରିସ କରାଯାଇଥିବା କୀଟନାଶକ ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "transplanted paddy": {
         "advisory": [
            "ପେନିକଲ୍ ଆରମ୍ଭ ପର୍ଯ୍ଯ଼ାଯ଼ରେ ଉପଯୁକ୍ତ ପୋଷକ ତତ୍ତ୍ୱ ପ୍ରଯ଼ୋଗ କରନ୍ତୁ | ଥ୍ରିପ୍ସ ସଂକ୍ରମଣ ହୋଇପାରେ, ଆବଶ୍ଯ଼କ ହେଲେ ଥିଯ଼ାମେଥୋକ୍ସାମ 25 ପ୍ରତିଶତ ଡବ୍ଲୁ. ଜି. ସ୍ପ୍ରେ କରନ୍ତୁ। ପତ୍ର ବିସ୍ଫୋରଣ ପରିଲକ୍ଷିତ ହୋଇପାରେ, ନିଯ଼ନ୍ତ୍ରଣ ପାଇଁ ଉପଯୁକ୍ତ ଫଙ୍ଗିସାଇଡ୍ ସ୍ପ୍ରେ କରନ୍ତୁ | କୀଟପତଙ୍ଗ ଏବଂ ରୋଗଗୁଡ଼ିକ ଉପରେ ନିଯ଼ମିତ ନଜର ରଖନ୍ତୁ।"
         ]
      },
      "cotton": {
         "advisory": [
            "ଗୋଲାପୀ ବୋଲୱର୍ମ, ଆମେରିକୀୟ ବୋଲୱର୍ମ, ଏଫିଡ୍, ଜାସିଡ୍, ଶୁଟ୍ ୱିଭିଲ୍, ପତ୍ର ସ୍ପଟ୍, ରୁଟ୍ ରଟ୍ ଏବଂ ୱିଲ୍ଟ ପାଇଁ କୀଟ ପରିଚାଳନା ରଣନୀତି କାର୍ଯ୍ୟକାରୀ କରନ୍ତୁ | ନିରୀକ୍ଷଣ ପାଇଁ ଫାନ୍ଦ ଲଗାନ୍ତୁ। ନିୟନ୍ତ୍ରଣ ପାଇଁ ସୁପାରିସ କରାଯାଇଥିବା କୀଟନାଶକ ବ୍ୟବହାର କରନ୍ତୁ।"
         ]
      },
      "arhar": {
         "advisory": [
            "ପତ୍ର ୱେବର୍, ପତ୍ର ଫୋଲଡର୍, ଡିଫୋଲିଏଟର୍ ଏବଂ ୱିଲ୍ଟିଙ୍ଗ୍ ପରି କୀଟପତଙ୍ଗ ପରିଚାଳନା କରନ୍ତୁ | ନିୟନ୍ତ୍ରଣ ପାଇଁ ସୁପାରିସ କରାଯାଇଥିବା କୀଟନାଶକ ପ୍ରୟୋଗ କରନ୍ତୁ। ଉଦ୍ଭିଦର ସ୍ୱାସ୍ଥ୍ୟ ଉପରେ ନଜର ରଖନ୍ତୁ ଏବଂ ଆବଶ୍ୟକ ପଦକ୍ଷେପ ନିଅନ୍ତୁ।"
         ]
      },
      "hybrid maize": {
         "advisory": [
            "ଷ୍ଟେମ ବୋରର, ଫଲ ଆର୍ମିୱର୍ମ, ବ୍ଯ଼ାଣ୍ଡେଡ ଲିଫ୍, ଏବଂ ସିଥ୍ ବ୍ଲାଇଟ୍ ପାଇଁ ମନିଟର କରନ୍ତୁ | ସଂକ୍ରମିତ ଗଛର ଅଂଶଗୁଡ଼ିକୁ ବାହାର କରିଦିଅନ୍ତୁ। ଫଳପ୍ରଦ ନିଯ଼ନ୍ତ୍ରଣ ପାଇଁ ଉପଯୁକ୍ତ କୀଟନାଶକ ବ୍ଯ଼ବହାର କରନ୍ତୁ। କୀଟପତଙ୍ଗର କୌଣସି ଲକ୍ଷଣ ପାଇଁ ସତର୍କ ରୁହନ୍ତୁ।"
         ]
      },
      "vegetables": {
         "advisory": [
            "ବାଇଗଣ, ଭେଣ୍ଡି, ଲଙ୍କା, କଦଳୀ ଏବଂ ଆଳୁ ପରି ବ୍ୟକ୍ତିଗତ ଫସଲ ପାଇଁ ନିର୍ଦ୍ଦିଷ୍ଟ ପରିଚାଳନା ଅଭ୍ୟାସ କାର୍ଯ୍ୟକାରୀ କରନ୍ତୁ | ଫସଲ ପର୍ଯ୍ୟାୟ ଅନୁଯାୟୀ ସୁପାରିଶ କରାଯାଇଥିବା କବକନାଶକ ଏବଂ କୀଟନାଶକ ବ୍ୟବହାର କରନ୍ତୁ। ନିୟମିତ ଭାବେ କୀଟପତଙ୍ଗ ଏବଂ ରୋଗ ଉପରେ ନଜର ରଖନ୍ତୁ।"
         ]
      },
      "brinjal": {
         "advisory": [
            "ବାଇଗଣ ପାଇଁ ନିର୍ଦ୍ଦିଷ୍ଟ ପରାମର୍ଶ ସୂଚନା।"
         ]
      },
      "okra": {
         "advisory": [
            "ଓକ୍ରା ପାଇଁ ନିର୍ଦ୍ଦିଷ୍ଟ ପରାମର୍ଶ ସୂଚନା।"
         ]
      },
      "chilli": {
         "advisory": [
            "ଲଙ୍କା ପାଇଁ ନିର୍ଦ୍ଦିଷ୍ଟ ପରାମର୍ଶ ସୂଚନା।"
         ]
      },
      "fruits": {
         "advisory": [
            "ଫଳ ପାଇଁ ନିର୍ଦ୍ଦିଷ୍ଟ ପରାମର୍ଶ ସୂଚନା।"
         ]
      },
      "banana": {
         "advisory": [
            "କଦଳୀ ପାଇଁ ନିର୍ଦ୍ଦିଷ୍ଟ ପରାମର୍ଶ ସୂଚନା।"
         ]
      },
      "papaya": {
         "advisory": [
            "ପେଁପେ ପାଇଁ ନିର୍ଦ୍ଦିଷ୍ଟ ପରାମର୍ଶ ସୂଚନା।"
         ]
      },
      "livestock": {
         "advisory": [
            "ବର୍ଷା ଦିନରେ ଗୋରୁମାନଙ୍କ ପାଇଁ ପର୍ଯ୍ୟାପ୍ତ ଖାଦ୍ୟ ଯୋଗାଇ ଦିଅନ୍ତୁ। ଛେଳି ଏବଂ ମେଣ୍ଢାଙ୍କ ପାଇଁ ସନ୍ତୁଳିତ ଖାଦ୍ୟ ଅଭ୍ୟାସ ଅନୁସରଣ କରନ୍ତୁ। ରେବିସ୍ ବିଷୟରେ ସଚେତନ ରୁହନ୍ତୁ ଏବଂ ଯଦି ପଶୁମାନେ ଲକ୍ଷଣ ଦେଖାନ୍ତି ତେବେ ତୁରନ୍ତ କାର୍ଯ୍ୟାନୁଷ୍ଠାନ ନିଅନ୍ତୁ | ସ୍ୱଚ୍ଛତା ବଜାୟ ରଖନ୍ତୁ ଏବଂ ଆବଶ୍ୟକ ହେଲେ ପଶୁ ଚିକିତ୍ସା ସହାୟତା ନିଅନ୍ତୁ।"
         ]
      },
      "cow & buffalo": {
         "advisory": [
            "ଗାଈ ଏବଂ ମଇଁଷି ପାଇଁ ନିର୍ଦ୍ଦିଷ୍ଟ ପରାମର୍ଶ ସୂଚନା।"
         ]
      },
      "goat & sheep": {
         "advisory": [
            "ଛେଳି ଏବଂ ମେଣ୍ଢା ପାଇଁ ନିର୍ଦ୍ଦିଷ୍ଟ ପରାମର୍ଶ ସୂଚନା।"
         ]
      }
   },
   "date": "27-09-2024"
}