{
   "weather_details": {
      "02-11-2024": {
         "rainfall": 0.4,
         "t_max": 32,
         "t_min": 24,
         "rh_max": 85.3,
         "rh_min": 39.9,
         "wind_speed": 2,
         "wind_direction": 296,
         "cloud_cover": 4
      },
      "03-11-2024": {
         "rainfall": 0.1,
         "t_max": 32,
         "t_min": 23,
         "rh_max": 73.6,
         "rh_min": 36.3,
         "wind_speed": 1,
         "wind_direction": 0,
         "cloud_cover": 4
      },
      "04-11-2024": {
         "rainfall": 0.1,
         "t_max": 32,
         "t_min": 23,
         "rh_max": 73.8,
         "rh_min": 35.3,
         "wind_speed": 2,
         "wind_direction": 258,
         "cloud_cover": 3
      },
      "05-11-2024": {
         "rainfall": 0.2,
         "t_max": 31,
         "t_min": 23,
         "rh_max": 73.9,
         "rh_min": 36.5,
         "wind_speed": 2,
         "wind_direction": 225,
         "cloud_cover": 3
      },
      "06-11-2024": {
         "rainfall": 0.2,
         "t_max": 31,
         "t_min": 22,
         "rh_max": 79.8,
         "rh_min": 41.4,
         "wind_speed": 1,
         "wind_direction": 236,
         "cloud_cover": 2
      }
   },
   "names_of_crops": [
      "ଧାନ।",
      "କପା",
      "ସୋରିଷ",
      "ତୋରିଆ",
      "ଅରହର",
      "ବାଇଗଣ",
      "ଲଙ୍କା",
      "ଗୋରୁ।",
      "ମଇଁଷି।",
      "ଛେଳି।",
      "ମେଣ୍ଢା",
      "କୁକୁଡ଼ା ମାଂସ"
   ],
   "general_advisory": "ପରିପକ୍ୱ ହୋଇଥିବା ପନିପରିବା ଏବଂ ଡାଲି ଅମଳ କରନ୍ତୁ ଏବଂ ଏକ ସୁରକ୍ଷିତ ସ୍ଥାନରେ ଷ୍ଟୋର୍ କରନ୍ତୁ | ପନିପରିବା ନର୍ସରୀକୁ ବର୍ଷାରୁ ରକ୍ଷା କରନ୍ତୁ। ରବି ଫସଲ ପାଇଁ କ୍ଷେତ ପ୍ରସ୍ତୁତି ଆରମ୍ଭ କରନ୍ତୁ। ସୋରିଷ, ସାରସନ୍, ସୂର୍ଯ୍ଯ଼ମୁଖୀ, କ୍ଷେତ ମଟର, ଗାଜର, ମୂଳା ବୁଣନ୍ତୁ | ପରିପକ୍ୱ ଧାନ ଫସଲରେ ଡାଲି ପ୍ରସାରଣ କରନ୍ତୁ। କୃମି ଦୂର କରନ୍ତୁ ଏବଂ ପଶୁମାନଙ୍କୁ ଟୀକାକରଣ କରନ୍ତୁ। କୁକୁଡ଼ା ଘରେ ସ୍ୱଚ୍ଛତା ବଜାଯ଼ ରଖନ୍ତୁ।",
   "crops_data": {
      "paddy": {
         "advisory": [
            "80-85% ଶସ୍ୟ ପରିପକ୍ୱ ହେବା ପରେ ଧାନ ଅମଳ କରନ୍ତୁ।",
            "ଶୁଖିଲା ଧାନ ଶସ୍ଯ଼ ବ୍ଯ଼ବହାର ପାଇଁ 14 ପ୍ରତିଶତ ଆର୍ଦ୍ରତା ଏବଂ ମଞ୍ଜି ଉଦ୍ଦେଶ୍ଯ଼ରେ 12 ପ୍ରତିଶତ।",
            "ବିକଳ୍ପ ଭିଜା ଏବଂ ଶୁଖାଇବା କୌଶଳ କିମ୍ବା ନିର୍ଦ୍ଦିଷ୍ଟ କୀଟନାଶକ ଦ୍ୱାରା ବିପିଏଚ ସଂକ୍ରମଣକୁ ନିୟନ୍ତ୍ରଣ କରନ୍ତୁ।"
         ]
      },
      "cotton": {
         "advisory": [
            "ଆମେରିକୀଯ଼ ବୋଲୱର୍ମ ନିଯ଼ନ୍ତ୍ରଣ ପାଇଁ ଇମାମେକ୍ଟିନ୍ ବେନ୍ଜୋଏଟ୍ କିମ୍ବା ପ୍ରୋଫେନୋଫସ୍ ପ୍ରଯ଼ୋଗ କରନ୍ତୁ।",
            "ନିର୍ଦ୍ଦିଷ୍ଟ ଚିକିତ୍ସା ଦ୍ୱାରା ଜୀବାଣୁଜନିତ ପତ୍ର ରୋଗକୁ ନିୟନ୍ତ୍ରଣ କରନ୍ତୁ।",
            "ଉପଯୁକ୍ତ ସ୍ପ୍ରେ ଦ୍ୱାରା ଧୂସର ଫଙ୍ଗୁର ସଂକ୍ରମଣର ସମାଧାନ କରନ୍ତୁ।"
         ]
      },
      "mustard": {
         "advisory": [
            "ଅକ୍ଟୋବର ମଧ୍ଯ଼ଭାଗରୁ ନଭେମ୍ବର ମଧ୍ଯ଼ଭାଗ ପର୍ଯ୍ଯ଼ନ୍ତ ସୋରିଷ ବୁଣନ୍ତୁ।",
            "ବୁଣିବା ପୂର୍ବରୁ ଥିରମ୍ କିମ୍ବା ବାଭିଷ୍ଟିନ୍ ସହିତ ମଞ୍ଜି ଉପଚାର କରନ୍ତୁ।",
            "ସର୍ବୋତ୍ତମ ଫଳାଫଳ ପାଇଁ ସୁପାରିସ କରାଯାଇଥିବା କିସମ ବ୍ଯ଼ବହାର କରନ୍ତୁ।"
         ]
      },
      "toria": {
         "advisory": [
            "ସୋରିଷ ପାଇଁ ସମାନ ବୁଣିବା ନିର୍ଦ୍ଦେଶାବଳୀ ଅନୁସରଣ କରନ୍ତୁ |",
            "ସର୍ବୋତ୍ତମ ବୃଦ୍ଧି ପାଇଁ ଉପଯୁକ୍ତ ବୀଜ ହାର ବ୍ଯ଼ବହାର କରନ୍ତୁ।"
         ]
      },
      "arhar": {
         "advisory": [
            "ନିର୍ଦ୍ଦିଷ୍ଟ କୀଟନାଶକ ଦ୍ୱାରା ପତ୍ର ୱେବର, ପତ୍ର ଫୋଲଡର ଏବଂ ଡିଫୋଲିଏଟରକୁ ନିୟନ୍ତ୍ରଣ କରନ୍ତୁ।",
            "ନିମ୍ବ-ଆଧାରିତ କୀଟନାଶକ ଦ୍ୱାରା ଶୁଆ ଛେଦକ ସଂକ୍ରମଣକୁ ପରିଚାଳନା କରନ୍ତୁ।"
         ]
      },
      "brinjal": {
         "advisory": [
            "ଛିଦ୍ରକାରୀ କୀଟ ନିରୀକ୍ଷଣ ପାଇଁ ଫେରୋମୋନ୍ ଟ୍ରାପ୍ ବ୍ୟବହାର କରନ୍ତୁ |",
            "ସୁପାରିଶ କରାଯାଇଥିବା ସ୍ପ୍ରେ ଦ୍ୱାରା ରାସାଯ଼ନିକ ଉପାଯ଼ରେ କୀଟପତଙ୍ଗକୁ ନିଯ଼ନ୍ତ୍ରଣ କରନ୍ତୁ।"
         ]
      },
      "chilli": {
         "advisory": [
            "ଥ୍ରିପ୍ସ ମନିଟରିଂ ପାଇଁ ଟ୍ରାପ୍ ସ୍ଥାପନ କରନ୍ତୁ।",
            "ନିର୍ଦ୍ଦିଷ୍ଟ ରାସାଯ଼ନିକ ପଦାର୍ଥ ଦ୍ୱାରା ଥ୍ରିପ୍ସ ସଂକ୍ରମଣକୁ ନିଯ଼ନ୍ତ୍ରଣ କରନ୍ତୁ।"
         ]
      },
      "cattle": {
         "advisory": [
            "ନିଯ଼ମିତ ଭାବରେ କୃମି ଅପସାରଣ ଏବଂ ଗୋରୁ ଏବଂ ମଇଁଷିକୁ ଟୀକାକରଣ କରନ୍ତୁ |",
            "ପ୍ରଜନନ ସମ୍ବନ୍ଧୀଯ଼ ସମସ୍ଯ଼ା ପାଇଁ ପଶୁ ଚିକିତ୍ସକଙ୍କ ସହ ପରାମର୍ଶ କରନ୍ତୁ।"
         ]
      },
      "buffalo": {
         "advisory": [
            "ଗୋରୁମାନଙ୍କ ପାଇଁ ସମାନ ଯତ୍ନ।"
         ]
      },
      "goat": {
         "advisory": [
            "ନିର୍ଜଲୀକରଣ, ଉତ୍ତାପ ଚାପ ଏବଂ ପରଜୀବୀ ସଂକ୍ରମଣ ପାଇଁ ପଶୁମାନଙ୍କୁ ଯାଞ୍ଚ କରନ୍ତୁ।",
            "ପଶୁମାନଙ୍କୁ ଉପଯୁକ୍ତ ଭାବରେ କୃମି ଦୂରୀକରଣ ଏବଂ ଟୀକାକରଣ କରନ୍ତୁ।"
         ]
      },
      "sheep": {
         "advisory": [
            "ଛେଳିମାନଙ୍କ ଭଳି ସମାନ ଯତ୍ନ।"
         ]
      },
      "poultry": {
         "advisory": [
            "କୁକୁଡ଼ା ଘରେ ଉଠାଯାଇଥିବା ମଞ୍ଚ ଏବଂ ଗଭୀର ଆବର୍ଜନା ପ୍ରଣାଳୀ ବ୍ଯ଼ବହାର କରନ୍ତୁ।",
            "ସ୍ୱଚ୍ଛତା ବଜାୟ ରଖନ୍ତୁ ଏବଂ ନିୟମିତ ଭାବେ କୀଟାଣୁମୁକ୍ତ କରନ୍ତୁ।",
            "ଚାପ ଏବଂ ଅତ୍ଯ଼ଧିକ ଉତ୍ତାପକୁ ରୋକିବା ପାଇଁ ଷ୍ଟକିଂ ଘନତ୍ୱକୁ ନିଯ଼ନ୍ତ୍ରଣ କରନ୍ତୁ |"
         ]
      }
   },
   "date": "01-11-2024",
   "ERROR": "ନିଯ଼ମିତ ତଥ୍ଯ଼ ମିଳୁନାହିଁ।"
}