{
   "weather_details": {
      "15/06/2024": {
         "rainfall": 4,
         "t_max": 34,
         "t_min": 25,
         "rh_max": 73,
         "rh_min": 62,
         "wind_speed": 30,
         "wind_direction": 212,
         "cloud_cover": 5
      },
      "16/06/2024": {
         "rainfall": 2,
         "t_max": 34,
         "t_min": 26,
         "rh_max": 78,
         "rh_min": 62,
         "wind_speed": 28,
         "wind_direction": 207,
         "cloud_cover": 5
      },
      "17/06/2024": {
         "rainfall": 3,
         "t_max": 34,
         "t_min": 26,
         "rh_max": 77,
         "rh_min": 65,
         "wind_speed": 27,
         "wind_direction": 204,
         "cloud_cover": 6
      },
      "18/06/2024": {
         "rainfall": 5,
         "t_max": 33,
         "t_min": 25,
         "rh_max": 82,
         "rh_min": 69,
         "wind_speed": 28,
         "wind_direction": 202,
         "cloud_cover": 7
      },
      "19/06/2024": {
         "rainfall": 10,
         "t_max": 32,
         "t_min": 25,
         "rh_max": 77,
         "rh_min": 66,
         "wind_speed": 29,
         "wind_direction": 205,
         "cloud_cover": 7
      }
   },
   "names_of_crops": [
      "ଧାନ।",
      "ମକା",
      "ଚିନାବାଦାମ",
      "ଯ଼ାମ୍",
      "ବାଇଗଣ",
      "ଓକ୍ରା",
      "ମତ୍ସ୍ଯ଼ଚାଷ"
   ],
   "general_advisory": "ନର୍ସରୀ ଶଯ୍ଯ଼ା ପ୍ରସ୍ତୁତ କରନ୍ତୁ ଏବଂ ବର୍ଷା ଉପରେ ନିର୍ଭରଶୀଳ ଧାନ ରୋପଣ ଅଞ୍ଚଳରେ ମୌସୁମୀ ବର୍ଷା ପରେ ବୁଣିବା କରାଯାଇପାରିବ। ଧାନ ଚାଷ ପାଇଁ ସର୍ବଦା ପ୍ରମାଣିତ ମଞ୍ଜି ବ୍ଯ଼ବହାର କରନ୍ତୁ। ବଗିଚା ଫସଲରେ ମାଟିରୁ ବାଷ୍ପୀକରଣ ହ୍ରାସ କରିବାକୁ ମଲ୍ଚିଙ୍ଗ ପରାମର୍ଶ ଦିଆଯାଇଛି | ଜମି ପ୍ରସ୍ତୁତିର ଶେଷ ପର୍ଯ୍ଯ଼ାଯ଼ରେ ଭଲ ଭାବେ ସଙ୍କୁଚିତ ଫାର୍ମ ଯ଼ାର୍ଡର ସାର କିମ୍ବା ଗାଈ ଗୋବରକୁ ଏକର ପିଛା 8 କ୍ୱିଣ୍ଟାଲ ଲେଖାଏଁ ସିଧାସଳଖ ବିହନ ବୁଣାଯାଇଥିବା ଚାଉଳରେ ମିଶାନ୍ତୁ। କୀଟ ସଂକ୍ରମଣରୁ ରକ୍ଷା ପାଇବା ପାଇଁ ମକା ପାଇଁ ବୀଜ ଚିକିତ୍ସା ବାଧ୍ଯ଼ତାମୂଳକ। ଉତ୍ତମ ଫଳାଫଳ ପାଇଁ ଉପଯୁକ୍ତ ପ୍ରକାରର ଚିନାବାଦାମ ବ୍ଯ଼ବହାର କରନ୍ତୁ। ମେ 'ରୁ ଜୁନ୍ ମାସ ହେଉଛି ଲେମ୍ବୁ ଗଛ ଲଗାଇବା ପାଇଁ ସର୍ବୋତ୍ତମ ସମଯ଼। ବାଇଗଣ ଚାରା ପାଇଁ ରୋଗ ନିଯ଼ନ୍ତ୍ରଣ ବନ୍ଦ କରିବାକୁ ପରାମର୍ଶ ଦିଆଯାଇଛି। ଓକ୍ରା ପାଇଁ ଉପଯୁକ୍ତ କୀଟ ନିଯ଼ନ୍ତ୍ରଣ ପଦକ୍ଷେପ ସୁପାରିଶ କରାଯାଏ |",
   "crops_data": {
      "paddy": {
         "advisory": [
            "ଆର୍ଦ୍ର ନର୍ସରୀ କ୍ଷେତ ପ୍ରସ୍ତୁତି-ନର୍ସରୀ କ୍ଷେତରେ ଜଳସେଚନ କରାଯିବା ଉଚିତ ଏବଂ ଏହାକୁ 2 ରୁ 3 ଥର ପୋଡ଼ିବା ପରେ ପ୍ଲାଙ୍କିଙ୍ଗ କରାଯିବା ଉଚିତ। ଶେଷ ପୁଡଲିଂ ସମଯ଼ରେ 200 କିଲୋଗ୍ରାମ ଏଫ୍. ଆଇ. ଏମ୍., 4 କିଲୋଗ୍ରାମ ଡି. ଏ. ପି., 2.5 କିଲୋଗ୍ରାମ ଏମ୍. ଓ. ପି. ଏବଂ 1 କିଲୋଗ୍ରାମ ଜିଙ୍କ୍ ସଲଫେଟ୍ ଲଗାନ୍ତୁ। ନର୍ସରୀ ଅଞ୍ଚଳକୁ 1.5-metre-long, 10 ସେ. ମି. ଉଚ୍ଚତା ଏବଂ ସୁବିଧାଜନକ ଲମ୍ବ ବିଶିଷ୍ଟ ଛୋଟ ଛୋଟ ପ୍ଲଟରେ ବିଭକ୍ତ କରନ୍ତୁ। ଜଳସେଚନ/ଜଳ ନିଷ୍କାସନ ପାଇଁ ଶଯ୍ଯ଼ା ସହିତ 30 ସେ. ମି. ଓସାରର ଜଳସେଚନ ଚ୍ଯ଼ାନେଲ ନିର୍ମାଣ କରାଯିବା ଉଚିତ। ପ୍ରତ୍ଯ଼େକ ଧାଡ଼ି କିମ୍ବା ସିଧାସଳଖ ପ୍ରସାରଣ ମଧ୍ଯ଼ରେ 5 ସେ. ମି. ବ୍ଯ଼ବଧାନ ସହିତ ଧାଡ଼ି ବୁଣିବା ଦ୍ୱାରା ଅଙ୍କୁରିତ ବୀଜଗୁଡିକ @40-50 ଗ୍ରାମ୍/ମି2 ଅଞ୍ଚଳରେ ବୀଜ ବିଛାଇବା ଉଚିତ ଏବଂ ମଞ୍ଜି ଉପରେ ଶୁଖିଲା କମ୍ପୋଷ୍ଟ ପକାଇବା ଉଚିତ | ବିଶେଷ କରି ସନ୍ଧ୍ଯ଼ାରେ ନର୍ସରୀ ଅଞ୍ଚଳରେ ହାଲୁକା ଜଳସେଚନ କରନ୍ତୁ, ଯାହାଦ୍ୱାରା କ୍ଷେତ ଓଦା ରହିବ ଏବଂ ପାଣି ଛିଡ଼ା ହୋଇ ରହିବ ନାହିଁ।"
         ]
      },
      "maize": {
         "advisory": [
            "ବୀଜ ଚିକିତ୍ସା-ଫଲ୍ ଆର୍ମିର ସଂକ୍ରମଣକୁ ଏଡ଼ାଇବା ପାଇଁ କୃମି ବୀଜ ଚିକିତ୍ସା ବାଧ୍ଯ଼ତାମୂଳକ ଯାହା ଫସଲ ବୃଦ୍ଧିର ପ୍ରାରମ୍ଭିକ ପର୍ଯ୍ଯ଼ାଯ଼ରେ ଉଦ୍ଭିଦକୁ କୀଟ ଆକ୍ରମଣରୁ ରକ୍ଷା କରେ | 1-କିଲୋଗ୍ରାମ ମଞ୍ଜି 4-ମିଲି ସାଇଣ୍ଟ୍ରାନିଲିପ୍ରୋଲ 19.8% + ଥିଓମେଥୋକ୍ସାମ 19.8% ଏଫ୍. ଏସ୍. ସହିତ ଚିକିତ୍ସା କରନ୍ତୁ।"
         ]
      },
      "groundnut": {
         "advisory": [
            "ଉପଯୁକ୍ତ ପ୍ରକାରର ଚିନାବାଦାମ ବ୍ଯ଼ବହାର କରନ୍ତୁ ଯେପରିକି ଦେବୀ (ଆଇ. ସି. ଜି. ଭି.-91114), କାଦ୍ରି-6, କାଦ୍ରି-9, ଟି. ଜି.-37ଏ, ଟି. ଏ. ଜି.-51, ଟି. ଏ. ଜି.-38, ଟି. ଏ. ଜି.-24, ସ୍ମୃତି, ସି. ଓ.-7, ଧରଣୀ ଇତ୍ଯ଼ାଦି। ବୁଣିବା 1 ଘଣ୍ଟା ପୂର୍ବରୁ 20 ଗ୍ରାମ୍/କି. ଗ୍ରା. ମୂଲ୍ଯ଼ର ସୁପାରିଶ କରାଯାଇଥିବା ପ୍ରଜାତିର ରାଇଜୋବିଯ଼ମ୍ ବ୍ଯ଼ାକ୍ଟେରିଆ କଲ୍ଚର୍ର ମଞ୍ଜି ବ୍ଯ଼ବହାର କରନ୍ତୁ।"
         ]
      },
      "yam": {
         "advisory": [
            "ମେ 'ରୁ ଜୁନ୍ ମାସ ହେଉଛି ଯମ୍ ରୋପଣ ପାଇଁ ସର୍ବୋତ୍ତମ ସମଯ଼। ଉପଯୁକ୍ତ ଉଚ୍ଚ ଉତ୍ପାଦନକ୍ଷମ କିସମ ଯମର ଚାଷ କରନ୍ତୁ। ଆମ୍ବକୁ ଖଣ୍ଡ ଖଣ୍ଡ କରି କାଟି ଦିଅନ୍ତୁ ଏବଂ ନିର୍ଦ୍ଧାରିତ ବ୍ଯ଼ବଧାନରେ ଗଛ ଲଗାନ୍ତୁ। ସୁପାରିସ ଅନୁଯାଯ଼ୀ ଭଲ ଭାବେ ଅପଘଟିତ ଏଫ୍. ଆଇ. ଏମ୍. ଏବଂ ସାର ପ୍ରଯ଼ୋଗ କରନ୍ତୁ।"
         ]
      },
      "brinjal": {
         "advisory": [
            "ବାଇଗଣ ଚାରା ପାଇଁ ରୋଗ ନିଯ଼ନ୍ତ୍ରଣକୁ ହ୍ରାସ କରିବା ଜରୁରୀ। ଚାରା ଗୁଡ଼ିକୁ ସୁରକ୍ଷିତ ରଖିବା ପାଇଁ ସୁପାରିସ କରାଯାଇଥିବା ଡ୍ରେଞ୍ଚିଂ ପ୍ରକ୍ରିଯ଼ା ଅନୁସରଣ କରନ୍ତୁ।"
         ]
      },
      "okra": {
         "advisory": [
            "ସଂକ୍ରମଣକୁ ରୋକିବା ପାଇଁ ଓକ୍ରା ପାଇଁ ଉପଯୁକ୍ତ କୀଟ ନିଯ଼ନ୍ତ୍ରଣ ପଦକ୍ଷେପ ଗୁରୁତ୍ୱପୂର୍ଣ୍ଣ | ସଂକ୍ରମଣର ପ୍ରାରମ୍ଭିକ ପର୍ଯ୍ଯ଼ାଯ଼ରେ ସୁପାରିସ କରାଯାଇଥିବା କୀଟନାଶକ ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "fishery": {
         "advisory": [
            "ଲାଭ ବଢ଼ାଇବା ପାଇଁ ରୋହୁ, କାଟଲା ଏବଂ ମୃଗାଲ୍ ଭଳି କାର୍ପ୍କୁ ଏକ ନିର୍ଦ୍ଦିଷ୍ଟ ଅନୁପାତରେ ମହଜୁଦ ରଖିବା ଉଚିତ। ଫିଙ୍ଗରଲିଙ୍ଗର ସୁପାରିସ କରାଯାଇଥିବା ଘନତ୍ୱ ବଜାଯ଼ ରଖନ୍ତୁ। ଉନ୍ନତ ଅଭିବୃଦ୍ଧି ପାଇଁ ଉପଯୁକ୍ତ ଖାଦ୍ଯ଼ ଏବଂ ପୋଖରୀ ପରିଚାଳନା ଅଭ୍ଯ଼ାସ ପ୍ରଦାନ କରନ୍ତୁ।"
         ]
      }
   },
   "date": "14-06-2024"
}