{
   "weather_details": {
      "10/07/2024": {
         "rainfall": 10,
         "t_max": 33,
         "t_min": 26,
         "rh_max": 81,
         "rh_min": 67,
         "wind_speed": 24,
         "wind_direction": 202,
         "cloud_cover": 8
      },
      "11/07/2024": {
         "rainfall": 3,
         "t_max": 34,
         "t_min": 27,
         "rh_max": 79,
         "rh_min": 69,
         "wind_speed": 30,
         "wind_direction": 202,
         "cloud_cover": 7
      },
      "12/07/2024": {
         "rainfall": 4,
         "t_max": 34,
         "t_min": 29,
         "rh_max": 79,
         "rh_min": 64,
         "wind_speed": 29,
         "wind_direction": 202,
         "cloud_cover": 6
      },
      "13/07/2024": {
         "rainfall": 3,
         "t_max": 34,
         "t_min": 29,
         "rh_max": 76,
         "rh_min": 63,
         "wind_speed": 20,
         "wind_direction": 208,
         "cloud_cover": 6
      },
      "14/07/2024": {
         "rainfall": 10,
         "t_max": 33,
         "t_min": 28,
         "rh_max": 78,
         "rh_min": 59,
         "wind_speed": 20,
         "wind_direction": 216,
         "cloud_cover": 7
      }
   },
   "names_of_crops": [
      "ଧାନ।",
      "ମକା",
      "ଡାଲିଗୁଡ଼ିକ",
      "ପନିପରିବା",
      "ପେଁପେ",
      "ଆମ୍ବ"
   ],
   "general_advisory": "ଠିକ୍ ସମଯ଼ରେ ପାଣି ନିଷ୍କାସନ ଏବଂ ରୋପଣ ପାଇଁ ମୁଖ୍ଯ଼ ଧାନ କ୍ଷେତରେ ବର୍ଷା ଜଳକୁ ବନ୍ଧ କରି ରଖନ୍ତୁ। ପ୍ରବଳ ବର୍ଷାରୁ ରକ୍ଷା ପାଇବା ପାଇଁ ପନିପରିବା ନର୍ସରୀକୁ ପଲିଥିନ୍ ଦ୍ୱାରା ଢାଙ୍କି ଦିଅନ୍ତୁ ଏବଂ ଜଳ ନିଷ୍କାସନ ବ୍ଯ଼ବସ୍ଥା କରନ୍ତୁ। ଶୀଘ୍ର ରୋପଣ କରାଯାଇଥିବା ମକା ଏବଂ ଝୋଟରେ ବର୍ଷା କମିବା ପରେ ନାଇଟ୍ରୋଜେନ୍ ସାର ପ୍ରଯ଼ୋଗ କରନ୍ତୁ। ଯେଉଁଠାରେ ଖରିଫ ମକା କିମ୍ବା ଡାଲି ଇତ୍ଯ଼ାଦି ରୋପଣ କରାଯାଇଛି, ସେଠାରେ ଜଳ ନିଷ୍କାସନ ବ୍ଯ଼ବସ୍ଥା କରନ୍ତୁ। ଯଦି ଆଖୁ ଫସଲ 4 ରୁ 5 ମାସ ପୁରୁଣା ହୋଇଥାଏ, ତେବେ ମଧ୍ଯ଼ମ ଏବଂ ଦୀର୍ଘକାଳୀନ କିସମ ପାଇଁ ଆଖୁ ଇରେକ୍ଟ ରଖିବା ପାଇଁ ରାପିଙ୍ଗ ଏବଂ ପ୍ରୋପିଙ୍ଗ କରାଯିବା ଉଚିତ।",
   "crops_data": {
      "paddy": {
         "advisory": [
            "10-ଦଶମିକ ନର୍ସରୀ ଅଞ୍ଚଳରେ ଶେଷ ପୁଡଲିଂ ସମଯ଼ରେ 200 କିଲୋଗ୍ରାମ ଏଫ୍. ୱାଇ. ଏମ୍., 4 କିଲୋଗ୍ରାମ ଡି. ଏ. ପି., 2.5 କିଲୋଗ୍ରାମ ଏମ୍. ଓ. ପି. ପ୍ରଯ଼ୋଗ କରନ୍ତୁ। ନର୍ସରୀ ଅଞ୍ଚଳରେ ହାଲୁକା ଜଳସେଚନ ପ୍ରଯ଼ୋଗ କରନ୍ତୁ ଯାହା ଦ୍ୱାରା କ୍ଷେତ ଓଦା ରହିବ ଏବଂ ପାଣି ଛିଡ଼ା ହେବ ନାହିଁ | ନର୍ସରୀ ଅଞ୍ଚଳରେ 15 ଡିଏଏସରେ 4 କିଲୋଗ୍ରାମ ଯ଼ୁରିଆ ଲଗାନ୍ତୁ।",
            "ପ୍ରତିରୋପଣର 3 ସପ୍ତାହ ପର୍ଯ୍ଯ଼ନ୍ତ ପିତ୍ତନଳୀ, ଷ୍ଟେମ ବୋରର, କେସୱର୍ମ, ପତ୍ର ଫୋଲଡର ଏବଂ ମୂଳ ଗଣ୍ଠି ସୂତ୍ରକୃମିର ପରିଚାଳନା ପାଇଁ ପ୍ରତିରୋପଣର 7 ଦିନ ପୂର୍ବରୁ 10 ଦଶମାଂଶ ନର୍ସରୀ ଅଞ୍ଚଳରେ କ୍ଲୋରାଣ୍ଟ୍ରାନିଲିପ୍ରୋଲ 0.4% ଜି @400-ଗ୍ରାମ କିମ୍ବା କାର୍ଟାପ୍ ହାଇଡ୍ରୋକ୍ଲୋରାଇଡ୍ 4% ଜିଆର @800-ଗ୍ରାମ କିମ୍ବା ଫିପ୍ରୋନିଲ 0.3% ଜିଆର @1-କିଲୋଗ୍ରାମ ପ୍ରଯ଼ୋଗ କରନ୍ତୁ।"
         ]
      },
      "maize": {
         "advisory": [
            "ପ୍ରାକ୍-ଉଦ୍ଭବ ହର୍ବିସାଇଡ୍ ଅକ୍ସିଫ୍ଲୁର୍ଫେନ 23.5% ଇସି (ଅକ୍ସିଗୋଲ୍ଡ/ଗାଲିଗାନ) @80 ମିଲି/ଏକର କିମ୍ବା ପେଣ୍ଡିମେଥାଲିନ୍ 30 ପ୍ରତିଶତ ଇସି (ଷ୍ଟମ୍ପ/ପେଣ୍ଡିହର୍ବ) @1-ଲିଟର/ଏକର କିମ୍ବା 1-2 ଡିଏଏସରେ ଲଗାନ୍ତୁ। ମାଟି ଆର୍ଦ୍ର ଥିବା ସମଯ଼ରେ ତୃଣନାଶକ ପ୍ରଯ଼ୋଗ କରନ୍ତୁ।"
         ]
      },
      "pulses": {
         "advisory": [
            "ପି. ଆର୍. ଜି.-235, ପି. ଆର୍. ଜି. 176, ଭି. ଏଲ୍. ଅରହର-1 ଇତ୍ଯ଼ାଦି ହେଉଛି ଅରହରର କେତେକ ଉନ୍ନତ ପ୍ରଜାତି। ଯଦି କ୍ଷେତରେ ଲାଇନ ବୁଣିବା କରାଯାଏ, ତେବେ ଶୀଘ୍ର ଏବଂ ବିଳମ୍ବରେ ପରିପକ୍ୱ ହେଉଥିବା କିସମ ପାଇଁ ପ୍ରସ୍ତାବିତ ବୀଜ ହାର ଏକର ପିଛା 8 ଏବଂ 6 କିଲୋଗ୍ରାମ ଅଟେ। କାର୍ବେଣ୍ଡାଜିମ୍ 50% ଡବ୍ଲ୍ଯ଼ୁ. ପି. @2-ଗ୍ରାମ୍/କେଜି ମଞ୍ଜି କିମ୍ବା କାରବକ୍ସିନ୍ <ଆଇ. ଡି. 1> + ଥିରମ୍ <ଆଇ. ଡି. 1> ଡି. ଏସ୍. ଡବ୍ଲ୍ଯ଼ୁ. ପି. ସହିତ ମଞ୍ଜି ଚିକିତ୍ସା କରାଯାଇପାରିବ।"
         ]
      },
      "vegetables": {
         "advisory": [
            "ପନିପରିବା ଫସଲରେ ଧଳା ମାଛି ଏବଂ ଅନ୍ଯ଼ାନ୍ଯ଼ ଶୋଷକ କୀଟପତଙ୍ଗ ଦ୍ୱାରା ମୋଜାଇକ ରୋଗ ସଂକ୍ରମିତ ହୁଏ | ଏହି ରୋଗକୁ ନିଯ଼ନ୍ତ୍ରଣ କରିବା ପାଇଁ ବୁଣିବା ଆରମ୍ଭରୁ ଯତ୍ନ ନେବା ଉଚିତ। ଇମିଡାକ୍ଲୋପ୍ରିଡ୍ 75 ପ୍ରତିଶତ ଡବ୍ଲୁ. ଜି. @4 ଗ୍ରାମ/କି. ଗ୍ରା. ମଞ୍ଜି ସାହାଯ୍ଯ଼ରେ ମଞ୍ଜି ଚିକିତ୍ସା କରାଯିବା ଉଚିତ। ଏହି ରୋଗର ବାହକମାନଙ୍କୁ ପରିଚାଳନା କରିବା ପାଇଁ, 10-12 DAS ରୁ ଆରମ୍ଭ କରି 8-10 ହଳଦିଆ ଚଟପଟା ଜାଲର ସଂଖ୍ଯ଼ା ସ୍ଥାପନ କରନ୍ତୁ। ନିମ୍ବ ଆଧାରିତ କୀଟନାଶକ (ନିମ୍ବ ତେଲ 1500 ପିପିଏମ @600-ମିଲି/ଏକର, ଏହାକୁ 15-ଡିଏଏସରୁ ଆରମ୍ଭ କରି 200 ଲିଟର ପାଣିରେ ମିଶାଇ ସ୍ପ୍ରେ କରନ୍ତୁ। ଗୁରୁତର ସଂକ୍ରମଣ କ୍ଷେତ୍ରରେ ଥିଯ଼ାମେଥୋକ୍ସାମ୍ 25 ପ୍ରତିଶତ ଡବ୍ଲୁଜି @40-ଗ୍ରାମ୍/ଏକର କିମ୍ବା ଏସିଟାମିପ୍ରିଡ୍ 20 ପ୍ରତିଶତ ଏସପି @50-ଗ୍ରାମ୍/ଏକରକୁ 200-ଲିଟର ପାଣିରେ ମିଶାଇ ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "papaya": {
         "advisory": [
            "ଏବେ ପାଗ ପିଆଜର ରୋପଣ ପାଇଁ ଅନୁକୂଳ ଅଟେ। ପେଁପେ ପାଇଁ ଏଚୱାଇଭି ହେଉଛି ହନିଡିଉ, କୁର୍ଗ ମହୁ ଶିଶିର, ସିଓ-1, ସିଓ-2, ପୁସା ସୁସ୍ୱାଦୁ, ପୁସା ମ୍ଯ଼ାଜେଷ୍ଟି ଏବଂ ପୁସା ଜଏଣ୍ଟ | ଚାରା ଗୁଡ଼ିକୁ 2.5 x 2.5 ମିଟର ଦୂରତା ଏବଂ 0.5 x 0.5 x 0.5 ମିଟର ଗର୍ତ୍ତରେ ରୋପଣ କରନ୍ତୁ। ରୋଗ ପ୍ରତିରୋଧକ ଏବଂ ଟିସ୍ଯ଼ୁ କଲ୍ଚର ଚାରା ବ୍ଯ଼ବହାର କରାଯିବା ଉଚିତ।"
         ]
      },
      "mango": {
         "advisory": [
            "ଜୁଲାଇ ଏବଂ ଅଗଷ୍ଟ ହେଉଛି ଆମ୍ବ ରୋପଣ ପାଇଁ ସର୍ବୋତ୍ତମ। ବୈଗାନପଲ୍ଲୀ, ତୋତାପୁରୀ, ବମ୍ବେ ଗ୍ରୀନ୍, ସୁବର୍ଣ୍ଣରେଖା, ନୀଲମ, ହିମସାଗର, ଲାଙ୍ଗ୍ରା, ଦଶେରୀ, ଆମ୍ରପାଲି, ମଲ୍ଲିକା, ରତ୍ନା, ରାମକେଲ୍ଲା, ରୁମ୍ମାନି, ସିନ୍ଧୁ, ଅଲ୍ଫାନ୍ସୋ ଏବଂ କେଶର ଇତ୍ଯ଼ାଦି ଚାଷ କରନ୍ତୁ | ସୁସ୍ଥ ଶାଖାବିହୀନ ଗ୍ରାଫ୍ଟେଡ ଚାରା ବ୍ଯ଼ବହାର କରନ୍ତୁ। 10x10 ମିଟର ଦୂରତାରେ 1x1x1 ମିଟର ଗର୍ତ୍ତରେ ଚାରା ରୋପଣ କରନ୍ତୁ। ରୋପଣ ପୂର୍ବରୁ ଏନ. ପି. କେ. ର <ଆଇ. ଡି. 1> ଗ୍ରାମ୍ ଏବଂ ଦୁଇଟି ବାସ୍କେଟ କମ୍ପୋଷ୍ଟ/ଗର୍ତ୍ତ ଲଗାନ୍ତୁ।"
         ]
      }
   },
   "date": "09-07-2024"
}