{
   "weather_details": {
      "21/09/2024": {
         "rainfall": 0,
         "t_max": 36,
         "t_min": 28,
         "rh_max": 81,
         "rh_min": 61,
         "wind_speed": 10,
         "wind_direction": 169,
         "cloud_cover": 5
      },
      "22/09/2024": {
         "rainfall": 0,
         "t_max": 36,
         "t_min": 29,
         "rh_max": 81,
         "rh_min": 62,
         "wind_speed": 10,
         "wind_direction": 169,
         "cloud_cover": 5
      },
      "23/09/2024": {
         "rainfall": 3,
         "t_max": 34,
         "t_min": 29,
         "rh_max": 79,
         "rh_min": 60,
         "wind_speed": 9,
         "wind_direction": 180,
         "cloud_cover": 6
      },
      "24/09/2024": {
         "rainfall": 12,
         "t_max": 33,
         "t_min": 28,
         "rh_max": 81,
         "rh_min": 63,
         "wind_speed": 8,
         "wind_direction": 158,
         "cloud_cover": 7
      },
      "25/09/2024": {
         "rainfall": 10,
         "t_max": 33,
         "t_min": 27,
         "rh_max": 83,
         "rh_min": 67,
         "wind_speed": 12,
         "wind_direction": 193,
         "cloud_cover": 7
      }
   },
   "names_of_crops": [
      "ଧାନ।",
      "ଚିନାବାଦାମ",
      "ଅରହର",
      "କାକୁଡ଼ି",
      "ପେଁପେ",
      "ମତ୍ସ୍ୟଚାଷ"
   ],
   "general_advisory": "କୁକୁଡ଼ା ଫାର୍ମକୁ ପରିଷ୍କାର ପରିଚ୍ଛନ୍ନ ରଖନ୍ତୁ, ଚାଷ ପାଇଁ ରୋଗମୁକ୍ତ ଛୁଆ ବାଛନ୍ତୁ ଏବଂ କୁକୁଡ଼ା ପକ୍ଷୀ ରୋଗରୁ ରକ୍ଷା ପାଇବା ପାଇଁ ପର୍ଯ୍ଯ଼ାପ୍ତ କୁକୁଡ଼ା ଖାଦ୍ଯ଼ ଏବଂ ସ୍ୱଚ୍ଛ ଜଳ ପ୍ରଦାନ କରନ୍ତୁ। ନର୍ସରୀରେ ଟମାଟୋ ଚାଷ ପାଇଁ ସେପ୍ଟେମ୍ବର ହେଉଛି ସର୍ବୋତ୍ତମ ସମଯ଼। ପନିପରିବାରେ ଶୋଷକ କୀଟ, ଫଳ ମାଛି ଏବଂ ଛେଦକ କୀଟ ଉପରେ ନଜର ରଖିବା ପାଇଁ କୃଷକମାନଙ୍କୁ ଫେରୋମୋନ୍ ଫାନ୍ଦ ବ୍ଯ଼ବହାର କରିବାକୁ ପରାମର୍ଶ ଦିଆଯାଇଛି। ମତ୍ସ୍ଯ଼ଚାଷ ପାଇଁ ପୋଖରୀରେ ଉପଯୁକ୍ତ ଅକ୍ସିଜେନ ସ୍ତର ସୁନିଶ୍ଚିତ କରନ୍ତୁ।",
   "crops_data": {
      "paddy": {
         "advisory": [
            "ବ୍ରାଉନ୍ ପ୍ଲାଣ୍ଟ ହପର୍-ଧାନରେ ବିପିଏଚ ସଂକ୍ରମଣ ହେବାର ସମ୍ଭାବନା ରହିଛି। ଯଦି 10-15 ହପର/ପାହାଡ ଲକ୍ଷ୍ୟ କରେ, ଗଛର ତଳେ ପାଇମେଟ୍ରୋଜିନ୍, ଡାଇନୋଟେଫୁରାନ୍, ଫ୍ଲୋନିକାମିଡ୍, କିମ୍ବା ଟ୍ରାଇଫ୍ଲୁମେଜୋପାଇରିମ୍ ସ୍ପ୍ରେ କରନ୍ତୁ |",
            "ବ୍ଯ଼ାକ୍ଟେରିଆଲ୍ ଲିଫ୍ ବ୍ଲାଇଟ୍-ଧାନରେ ବ୍ଯ଼ାକ୍ଟେରିଆଲ୍ ଲିଫ୍ ବ୍ଲାଇଟ୍ ରୋଗ ସଂକ୍ରମଣ ହେବାର ସମ୍ଭାବନା ରହିଛି। ଯଦି ଏହା ଦେଖାଯାଏ, ତେବେ କପର୍ ହାଇଡ୍ରୋକ୍ସାଇଡ୍ କିମ୍ବା ପ୍ଲାଣ୍ଟୋମାଇସିନ୍କୁ କପର୍ ଅକ୍ସି କ୍ଲୋରାଇଡ୍ ସହିତ ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "groundnut": {
         "advisory": [
            "ଷ୍ଟେମ ରଟ୍ ରୋଗ-କାର୍ବେଣ୍ଡାଜିମ୍ କିମ୍ବା କାରବକ୍ସିନ୍ + ଥିରାମ୍ ସହିତ ବୀଜ ଚିକିତ୍ସା କରାଯିବା ଉଚିତ୍ | ଷ୍ଟେମ ରୋଟ ରୋଗକୁ ପରିଚାଳନା କରିବା ପାଇଁ, ଭାଲିଡାମାଇସିନ କିମ୍ବା କ୍ୟାପଟାନ + ହେକ୍ସାକୋନାଜୋଲ ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "arhar": {
         "advisory": [
            "ଲିଫ୍ ୱେବର୍-ଲିଫ୍ ୱେବର୍ ନିୟନ୍ତ୍ରଣ ପାଇଁ ପ୍ରୋଫେନୋଫସ୍ କିମ୍ବା କ୍ଲୋରପିରିଫସ୍ + ସାଇପର୍ମେଥ୍ରିନ୍ ସ୍ପ୍ରେ କରନ୍ତୁ।",
            "ଶୋଷକ କୀଟ-ଶୋଷକ କୀଟ ପାଇଁ ନିମ୍ବ ଆଧାରିତ କୀଟନାଶକ ସିଞ୍ଚନ କରାଯାଇପାରେ।",
            "ୱିଲ୍ଟ-ନିଯ଼ନ୍ତ୍ରଣ ପାଇଁ ଗଛର ମୂଳ ଅଞ୍ଚଳରେ ମେଟିରାମ ଲଗାନ୍ତୁ।"
         ]
      },
      "cucurbits": {
         "advisory": [
            "ଏପିଲାକ୍ନା ବିଟଲ-ଏପିଲାଚନା ବିଟଲ୍ର ପରିଚାଳନା ପାଇଁ, ନିମ-ଆଧାରିତ କୀଟନାଶକ କିମ୍ବା କ୍ଲୋରପାଇରିଫସ୍ ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "papaya": {
         "advisory": [
            "ମିଳି ବଗ-ମିଳି ବଗକୁ ପରିଚାଳନା କରିବା ପାଇଁ, ନିମ୍ବ ଆଧାରିତ କୀଟନାଶକ କିମ୍ବା କୀଟନାଶକ ସାବୁନ ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "pisciculture": {
         "advisory": [
            "ଏରେଟର କିମ୍ବା ଜଳ ସଞ୍ଚାଳନ ପଦ୍ଧତି ବ୍ଯ଼ବହାର କରି ଆଦର୍ଶ ଦ୍ରବୀଭୂତ ଅମ୍ଳଜାନ ସ୍ତର ବଜାଯ଼ ରଖନ୍ତୁ |"
         ]
      }
   },
   "date": "20-09-2024"
}