{
   "weather_details": {
      "11/12/2024": {
         "rainfall": 0,
         "t_max": 30,
         "t_min": 23,
         "rh_max": 77,
         "rh_min": 46,
         "wind_speed": 11,
         "wind_direction": 33,
         "cloud_cover": 4
      },
      "12/12/2024": {
         "rainfall": 0,
         "t_max": 29,
         "t_min": 21,
         "rh_max": 67,
         "rh_min": 33,
         "wind_speed": 15,
         "wind_direction": 28,
         "cloud_cover": 2
      },
      "13/12/2024": {
         "rainfall": 0,
         "t_max": 29,
         "t_min": 20,
         "rh_max": 61,
         "rh_min": 28,
         "wind_speed": 12,
         "wind_direction": 27,
         "cloud_cover": 1
      },
      "14/12/2024": {
         "rainfall": 0,
         "t_max": 29,
         "t_min": 20,
         "rh_max": 54,
         "rh_min": 27,
         "wind_speed": 13,
         "wind_direction": 24,
         "cloud_cover": 0
      }
   },
   "names_of_crops": [
      "ଧାନ।",
      "କଳା ଗ୍ରାମ",
      "ଗ୍ରୀନଗ୍ରାମ",
      "ଚିନାବାଦାମ",
      "ଆଳୁ",
      "ଟମାଟୋ",
      "ବାଇଗଣ",
      "ମାରିଗୋଲ୍ଡ",
      "ମତ୍ସ୍ୟଚାଷ"
   ],
   "general_advisory": "ଧାନଶସ୍ୟକୁ 3ରୁ 4 ଦିନ ପର୍ଯ୍ୟନ୍ତ ସୂର୍ଯ୍ୟକିରଣ ତଳେ ଶୁଖାଇବା ଆବଶ୍ୟକ, ବ୍ୟବହାର ପାଇଁ 14 ପ୍ରତିଶତ ଆର୍ଦ୍ରତା ଏବଂ ବୀଜ ଉଦ୍ଦେଶ୍ୟରେ 12 ପ୍ରତିଶତ ଆର୍ଦ୍ରତା ରହିବା ଆବଶ୍ୟକ। ରାତିର ତାପମାତ୍ରା କମ୍ ଥିବାରୁ ଫସଲ ଏବଂ ପନିପରିବାରେ ଶୋଷକ କୀଟପତଙ୍ଗ, ପତ୍ର ରୋଗ, ପାଉଡର ଫଙ୍ଗୁର ସଂକ୍ରମଣ ହେବାର ସମ୍ଭାବନା ରହିଛି। ଫସଲ ଏବଂ ପନିପରିବା ଉପରେ ନଜର ରଖନ୍ତୁ, ଯଦି ଲକ୍ଷଣ ଦେଖାଯାଏ, ଉପଯୁକ୍ତ ଉଦ୍ଭିଦ ସୁରକ୍ଷା ପଦକ୍ଷେପ ଗ୍ରହଣ କରନ୍ତୁ। ଶୀତକାଳୀନ ପନିପରିବା ଫସଲର ସମ୍ପୂର୍ଣ୍ଣ ରୋପଣ। କମ୍ ତାପମାତ୍ରା କାରଣରୁ କମ୍ ଅଙ୍କୁରୋଦଗମକୁ ଏଡ଼ାଇବା ପାଇଁ ପନିପରିବା ନର୍ସରୀ ଉପରେ କମ୍ ମୂଲ୍ୟର ପଲିଥିନ୍ କଭର ବ୍ୟବହାର କରନ୍ତୁ। ଏକ ସଫଳ ରାଟୁନ୍ ଫସଲ ପାଇଁ ମାଟି ସ୍ତରରୁ ଏକ ଇଞ୍ଚ ତଳେ ପରିପକ୍ୱ ଚିନି ଅମଳ କରନ୍ତୁ |",
   "crops_data": {
      "paddy": {
         "advisory": [
            "ଅମଳ ପରବର୍ତ୍ତୀ ପର୍ଯ୍ୟାୟ-ମୂଷା ଅଞ୍ଚଳଃ ମୂଷାଙ୍କୁ ମାରିବା ପାଇଁ କାଦୁଅ ସହିତ ଆଲୁମିନିୟମ୍ ଫସଫାଇଡ୍ ରଖନ୍ତୁ |"
         ]
      },
      "blackgram": {
         "advisory": [
            "ଉଦ୍ଭିଦଗତ ପର୍ଯ୍ୟାୟ-ଏଫିଡ୍ଃ ଥାୟାମେଥୋକ୍ସାମ୍ କିମ୍ବା ଏସିଟାମିପ୍ରିଡ୍ ପରେ ନିମ ଆଧାରିତ କୀଟନାଶକ ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "greengram": {
         "advisory": [
            "ଉଦ୍ଭିଦଗତ ପର୍ଯ୍ୟାୟ-ଏଫିଡ୍ଃ ଥାୟାମେଥୋକ୍ସାମ୍ କିମ୍ବା ଏସିଟାମିପ୍ରିଡ୍ ପରେ ନିମ ଆଧାରିତ କୀଟନାଶକ ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "groundnut": {
         "advisory": [
            "ଉଦ୍ଭିଦଗତ ପର୍ଯ୍ୟାୟ-ତମାଖୁ କ୍ୟାଟରପିଲରଃ ସ୍ଥାନାନ୍ତରଣ ଉପରେ ନଜର ରଖନ୍ତୁ ଏବଂ ଉପଯୁକ୍ତ କୀଟନାଶକ ପ୍ରୟୋଗ କରନ୍ତୁ।"
         ]
      },
      "potato": {
         "advisory": [
            "ଉଦ୍ଭିଦଗତ ପର୍ଯ୍ୟାୟଃ ଘାସ କାଟିବା, ହାତରୁ ଆଗାଛା କାଟିବା, ଉଚ୍ଚ ପାହାଡ ଏବଂ ଉପଯୁକ୍ତ ଜଳସେଚନ"
         ]
      },
      "tomato": {
         "advisory": [
            "ଉଦ୍ଭିଦଗତ ପର୍ଯ୍ୟାୟଃ ନିର୍ଦ୍ଦିଷ୍ଟ ସ୍ପ୍ରେ ଦ୍ୱାରା ବିଳମ୍ବରେ ହେଉଥିବା ରୋଗକୁ ନିୟନ୍ତ୍ରଣ କରନ୍ତୁ।"
         ]
      },
      "brinjal": {
         "advisory": [
            "ଫଳ ତିଆରି ପାଇଁ ଉଦ୍ଭିଦ-ଫଳ ଏବଂ ଶୁଟ୍ ବୋରର୍ଃ ନିମ୍-ଆଧାରିତ କୀଟନାଶକ ସ୍ପ୍ରେ କରନ୍ତୁ, ତା 'ପରେ ସ୍ପାଇନୋସାଡ୍ ଏବଂ ଥିଓଡିକାର୍ବ୍ ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "marigold": {
         "advisory": [
            "ଫୁଲ ପାଇଁ ଉଦ୍ଭିଦ-ଥ୍ରୀପ୍ଃ ଫାନ୍ଦ ଲଗାନ୍ତୁ ଏବଂ ଫିପ୍ରୋନିଲ୍, ମିଲି ବଗ୍ ବ୍ୟବହାର କରନ୍ତୁଃ ପ୍ରୋଫେନୋଫସ୍ ପ୍ରୟୋଗ କରନ୍ତୁ"
         ]
      },
      "fisheries": {
         "advisory": [
            "ସିଫ୍ୟାକ୍ସ ଲଗାଇ ଇ. ୟୁ. ଏସ୍. ରୋଗରୁ ରକ୍ଷା ପାଆନ୍ତୁ, ମାଛମାନଙ୍କୁ ତୈଳ କେକ୍ ବ୍ରାନ୍ ମିଶ୍ରଣ ଦିଅନ୍ତୁ।"
         ]
      }
   },
   "date": "10-12-2024"
}