{
   "weather_details": {
      "20/11/2024": {
         "rainfall": 0,
         "t_max": 30,
         "t_min": 19,
         "rh_max": 75,
         "rh_min": 38,
         "wind_speed": 10,
         "wind_direction": 356,
         "cloud_cover": 1
      }
   },
   "names_of_crops": [
      "ଯୋଡ଼ି",
      "ଧାନ।",
      "ରବି ଡାଲି",
      "ତୈଳବୀଜ",
      "ପନିପରିବା",
      "କଳା ଚଣା",
      "ସବୁଜ ଚଣା",
      "ଚିନାବାଦାମ",
      "ଆଖୁ",
      "ସୁଚିନ୍ତିତ ଲାଉ",
      "କୋଇଲା ଫସଲ",
      "ମତ୍ସ୍ଯ଼ଚାଷ"
   ],
   "general_advisory": "ପରିପକ୍ୱ ଧାନ ଅମଳ କରନ୍ତୁ। ଯଦି 80 ପ୍ରତିଶତ ପାନିକଲ ପରିପକ୍ୱ ହୋଇଯାଏ, ତେବେ କୃଷକମାନେ ଅମଳ ପାଇଁ ଯାଇପାରିବେ। ଅମଳ ହୋଇଥିବା ଧାନକୁ ସୂର୍ଯ୍ଯ଼କିରଣରେ ଶୁଖାଇ ତାହାର ଆର୍ଦ୍ରତା ହ୍ରାସ କରନ୍ତୁ। ଧାନ କ୍ଷେତ ସଫା ରଖନ୍ତୁ। ମୂଷା-ଯଦି 'ମୂଷା/ମୂଷା' ସମସ୍ଯ଼ା ଦେଖାଯାଏ, ତେବେ ଫସଲ କ୍ଷେତ ଏବଂ ଆଖପାଖ ଅଞ୍ଚଳରେ ମୂଷା ଗର୍ତ୍ତକୁ ଚିହ୍ନଟ କରନ୍ତୁ। ଆଲୁମିନିଯ଼ମ୍ ଫସଫାଇଡ୍ 6 ପ୍ରତିଶତ ଟାବଲେଟ୍ ପ୍ରତି ଗର୍ତ୍ତରେ ଗୋଟିଏ ଟାବଲେଟ୍ (12 ଗ୍ରାମ୍) ରଖି ଗର୍ତ୍ତକୁ କାଦୁଅରେ ବନ୍ଦ କରିଦିଅନ୍ତୁ ଯାହା ମୂଷାଙ୍କୁ ମାରିଦେବ। ପାଉଡର ଫଙ୍ଗସ୍-କଳା ଚଣା ଏବଂ ସବୁଜ ଚଣା ଗୁଡ଼ିକରେ ପାଉଡର ଫଙ୍ଗସ୍ ରୋଗ ହେବାର ସମ୍ଭାବନା ରହିଛି। ଏହି ରୋଗକୁ ନିଯ଼ନ୍ତ୍ରଣ କରିବା ପାଇଁ ସଲଫର୍ 80 ପ୍ରତିଶତ ଡବ୍ଲ୍ଯ଼ୁ. ପି. <ଆଇ. ଡି. 1> ଗ୍ରାମ୍/ଏକର କିମ୍ବା ହେକ୍ସାକୋନାଜୋଲ୍ 5 ପ୍ରତିଶତ ଇ. ସି. @ଏକର ପିଛା 300 ମିଲି. ସ୍ପ୍ରେ କରନ୍ତୁ। ଆଗାଛା ପରିଚାଳନା-ପ୍ରାକ୍-ଉଦ୍ଭବ ହର୍ବିସାଇଡ୍ ଅକ୍ସିଫ୍ଲୁର୍ଫେନ 23.5% ଇସି @80 ମିଲି/ଏକର କିମ୍ବା ପେଣ୍ଡିମେଥାଲିନ୍ 30 ପ୍ରତିଶତ ଇସି @1 ଲିଟର/ଏକର କିମ୍ବା 1 ରୁ 2 ଡିଏଏସରେ ପ୍ରଯ଼ୋଗ କରନ୍ତୁ। ମାଟି ଆର୍ଦ୍ର ଥିବା ସମଯ଼ରେ ତୃଣନାଶକ ପ୍ରଯ଼ୋଗ କରନ୍ତୁ। ରେଡ୍ ରଟ୍ ରୋଗ-ଆଖୁରେ ରେଡ୍ ରଟ୍ ରୋଗକୁ ନିଯ଼ନ୍ତ୍ରଣ କରିବା ପାଇଁ, କାର୍ବେନଡାଜିମ୍ 12 ପ୍ରତିଶତ + ମାନକୋଜେବ୍ 63 ପ୍ରତିଶତ ଡବ୍ଲ୍ଯ଼ୁ. ପି. @400 ଗ୍ରାମ୍/ଏକର କିମ୍ବା ମେଟାଲାକ୍ସିଲ୍ 8 ପ୍ରତିଶତ + ମାନକୋଜେବ୍ 64 ପ୍ରତିଶତ ଡବ୍ଲ୍ଯ଼ୁ. ପି. @400 ଗ୍ରାମ୍/ଏକରକୁ 200 ଲିଟର ପାଣିରେ ମିଶାଇ ସ୍ପ୍ରେ କରନ୍ତୁ। ଡାଉନି ଫଙ୍ଗୁର-ପଇଣ୍ଟେଡ୍ ଲାଉରେ ଡାଉନି ଫଙ୍ଗୁରିକୁ ନିଯ଼ନ୍ତ୍ରଣ କରିବା ପାଇଁ, ମେଟାଲ୍ଯ଼ାକ୍ସିଲ୍ 8 ପ୍ରତିଶତ + ମାନକୋଜେବ୍ 64 ପ୍ରତିଶତ ଡବ୍ଲ୍ଯ଼ୁ. ପି. @400 ଗ୍ରାମ୍/ଏକର କିମ୍ବା ଫୋସେଟିଲ୍-ଏ. ଏଲ୍ 80 ପ୍ରତିଶତ ଡବ୍ଲ୍ଯ଼ୁ. ପି. @600 ଗ୍ରାମ୍/ଏକର ସ୍ପ୍ରେ କରନ୍ତୁ। ଡାଇମଣ୍ଡ ବ୍ଯ଼ାକ୍ ମଥ୍-ଏହି କୀଟପତଙ୍ଗକୁ ନିଯ଼ନ୍ତ୍ରଣ କରିବା ପାଇଁ ଏକର ପିଛା 6ରୁ 8ଟି ହାଲୁକା ଫାନ୍ଦ ଲଗାନ୍ତୁ। କୀଟ ସଂକ୍ରମଣର ପ୍ରାଥମିକ ପର୍ଯ୍ଯ଼ାଯ଼ରେ 200 ଲିଟର ପାଣିରେ ମିଶ୍ରଣ କରି ନିମ୍ବ-ଆଧାରିତ କୀଟନାଶକ (ଆଜାଦିରାକ୍ଟିନ 300 ପିପିଏମ @1 ଲିଟର/ଏକର) ସ୍ପ୍ରେ କରନ୍ତୁ। ଟଲ୍ଫେନ୍ପାଇରାଡ୍ 15 ପ୍ରତିଶତ ଇସି @400 ମିଲି/ଏକର କିମ୍ବା ଫ୍ଲୁବେଣ୍ଡିଆମାଇଡ୍ 20 ପ୍ରତିଶତ ଡବ୍ଲୁଜି @20 ଗ୍ରାମ୍/ଏକର କିମ୍ବା ଇମାମେକ୍ଟିନ୍ ବେନ୍ଜୋଏଟ୍ 5 ପ୍ରତିଶତ ଏସ୍ଜି @@80 ଗ୍ରାମ୍/ଏକରକୁ 200 ଲିଟର ପାଣିରେ ମିଶାଇ ସ୍ପ୍ରେ କରନ୍ତୁ। ଶୀତ ଋତୁରେ ପାଣିର ଗଭୀରତା 6 ଫୁଟ ପର୍ଯ୍ଯ଼ନ୍ତ ରଖିବାକୁ କୃଷକମାନଙ୍କୁ ପରାମର୍ଶ ଦିଆଯାଇଛି। ତାପମାତ୍ରା ହ୍ରାସ ପାଇବା ସହିତ ମାଛ ଖାଇବା ହ୍ରାସ ପାଇଥାଏ। ତେଣୁ ତାପମାତ୍ରା ଉପରେ ନିର୍ଭର କରି ଖାଦ୍ଯ଼ ହାରକୁ 75 ପ୍ରତିଶତ ହ୍ରାସ କରିବା ଜରୁରୀ। ପୋଖରୀରେ ଜୈବିକ ସାର ଯେପରିକି ଗାଈ ଗୋବର, କୁକୁଡ଼ା ମଳ ପକାଇବା ବନ୍ଦ କରନ୍ତୁ।",
   "crops_data": {
      "paira": {
         "advisory": [
            "ପାଇରା ଫସଲ ଉଠାଇବା ପାଇଁ ଉପଯୁକ୍ତ ସମଯ଼, ଯାହାକୁ ଧାନ ଅମଳ ହେବାର 15 ଦିନ ପୂର୍ବରୁ ବୁଣାଯାଇପାରିବ।"
         ]
      },
      "paddy": {
         "advisory": [
            "ପରିପକ୍ୱ ଧାନ ଫସଲ ଅମଳ କରନ୍ତୁ ଏବଂ 3ରୁ 4 ଦିନ ସୂର୍ଯ୍ଯ଼ାଲୋକରେ ଶୁଖିଯିବା ପରେ ସେଗୁଡ଼ିକୁ ସୁରକ୍ଷିତ ସ୍ଥାନରେ ରଖନ୍ତୁ।"
         ]
      },
      "rabi pulses": {
         "advisory": [
            "ରବି ଫସଲ ବୁଣିବା ପୂର୍ବରୁ ବୀଜ ଚିକିତ୍ସା ନିହାତି ଆବଶ୍ଯ଼କ।"
         ]
      },
      "oilseeds": {
         "advisory": [
            "ରବି ଫସଲ ବୁଣିବା ପୂର୍ବରୁ ବୀଜ ଚିକିତ୍ସା ନିହାତି ଆବଶ୍ଯ଼କ।"
         ]
      },
      "vegetables": {
         "advisory": [
            "ବାଇଗଣ, ଫୁଲକୋବି, ବନ୍ଧାକୋବି, ଲଙ୍କା ଏବଂ ଟମାଟୋ ପରି ଶୀତକାଳୀନ ପନିପରିବାରେ ପତ୍ର ଖାଉଥିବା କ୍ୟାଟର୍ପିଲର ଏବଂ ଫଳ ଛେଦକକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ ଲିଟର ପିଛା 0.5 ଗ୍ରାମ ଇମାମେକ୍ଟିନ୍ ବେନ୍ଜୋଏଟ୍ କିମ୍ବା 0.4 ମିଲି ସ୍ପିନୋସାଦ୍ ଲଗାନ୍ତୁ।",
            "କୃଷକମାନଙ୍କୁ ମୁଖ୍ଯ଼ କ୍ଷେତରେ ଲଙ୍କା, ଟମାଟୋ, କ୍ଯ଼ାପ୍ସିକମ୍, ବନ୍ଧାକୋବି, ଫୁଲକୋବି, ବାଇଗଣ ଇତ୍ଯ଼ାଦି ଦିନ ପୁରୁଣା ପନିପରିବା ଚାରା ରୋପଣ କରିବାକୁ ପରାମର୍ଶ ଦିଆଯାଇଛି।"
         ]
      },
      "black gram": {
         "advisory": [
            "କଳା ଚାଉଳରେ ପାଉଡର ଫଙ୍ଗୁର ରୋଗ ହେବାର ସମ୍ଭାବନା ରହିଛି।"
         ]
      },
      "green gram": {
         "advisory": [
            "ଗ୍ରୀନ୍ ଗ୍ରାମ୍ ରେ ପାଉଡର ଫଙ୍ଗ ରୋଗ ହେବାର ସମ୍ଭାବନା ଅଛି |"
         ]
      },
      "groundnut": {
         "advisory": [
            "ଚିନାବାଦାମ ବୁଣିବା ପର୍ଯ୍ୟାୟରେ ରହିଛି।"
         ]
      },
      "sugarcane": {
         "advisory": [
            "ପରିପକ୍ୱତା ପର୍ଯ୍ଯ଼ାଯ଼।"
         ]
      },
      "pointed gourd": {
         "advisory": [
            "ପଇଣ୍ଟେଡ୍ ଲାଉରେ ଡାଉନି ଫଙ୍ଗୁକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ, ମେଟାଲାକ୍ସିଲ୍ 8 ପ୍ରତିଶତ + ମାନକୋଜେବ୍ 64 ପ୍ରତିଶତ ଡବ୍ଲ୍ୟୁ. ପି. @400 ଗ୍ରାମ୍/ଏକର କିମ୍ବା ଫୋସେଟିଲ୍-ଏ. ଏଲ୍ 80 ପ୍ରତିଶତ ଡବ୍ଲ୍ୟୁ. ପି. @600 ଗ୍ରାମ୍/ଏକର ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "cole crops": {
         "advisory": [
            "କୋଇଲା ଫସଲ ବୃକ୍ଷରୋପଣ ପର୍ଯ୍ୟାୟରେ ଅଛି |"
         ]
      },
      "fisheries": {
         "advisory": [
            "ଶୀତ ଋତୁରେ ପାଣିର ଗଭୀରତା 6 ଫୁଟ ପର୍ଯ୍ଯ଼ନ୍ତ ରଖିବାକୁ କୃଷକମାନଙ୍କୁ ପରାମର୍ଶ ଦିଆଯାଇଛି। ତାପମାତ୍ରା ହ୍ରାସ ପାଇବା ସହିତ ମାଛ ଖାଇବା ହ୍ରାସ ପାଇଥାଏ। ତେଣୁ, ତାପମାତ୍ରା ଉପରେ ନିର୍ଭର କରି ଖାଦ୍ଯ଼ ହାରକୁ 50-75% ହ୍ରାସ କରିବା ଜରୁରୀ। ପୋଖରୀରେ ଜୈବିକ ସାର ଯେପରିକି ଗାଈ ଗୋବର, କୁକୁଡ଼ା ମଳ ପକାଇବା ବନ୍ଦ କରନ୍ତୁ।"
         ]
      }
   },
   "date": "19-11-2024"
}