{
   "weather_details": {
      "28-01-2025": {
         "rainfall": 0,
         "t_max": 28,
         "t_min": 20,
         "rh_max": 89,
         "rh_min": 63,
         "wind_speed": 15,
         "wind_direction": 211,
         "cloud_cover": 0
      },
      "29-01-2025": {
         "rainfall": 0,
         "t_max": 29,
         "t_min": 21,
         "rh_max": 91,
         "rh_min": 60,
         "wind_speed": 17,
         "wind_direction": 210,
         "cloud_cover": 0
      }
   },
   "names_of_crops": [
      "ଧାନ।",
      "ଚିନାବାଦାମ",
      "ସୋରିଷ",
      "କଳା ଚଣା",
      "ସବୁଜ ଚଣା",
      "ଆଳୁ",
      "କୋଇଲା ଫସଲ",
      "ଟମାଟୋ",
      "ବାଇଗଣ",
      "ଗୋଲାପ।",
      "ମତ୍ସ୍ୟଚାଷ"
   ],
   "general_advisory": "ପୁରୀ ଜିଲ୍ଲାରେ ଆଗାମୀ ପାଞ୍ଚ ଦିନ ପର୍ଯ୍ୟନ୍ତ ଶୁଖିଲା ପାଗ ରହିପାରେ। ସାମାନ୍ୟ ଶୁଖିଲା ପରିସ୍ଥିତି ଥିବାରୁ କୃଷକମାନଙ୍କୁ ସେମାନଙ୍କ କ୍ଷେତକୁ ଜଳସେଚନ କରିବାକୁ ପରାମର୍ଶ ଦିଆଯାଇଛି। ରୋଗ ଏବଂ କୀଟ ପରିଚାଳନା ପାଇଁ ବିଭିନ୍ନ ଫସଲ-ନିର୍ଦ୍ଦିଷ୍ଟ ପରାମର୍ଶ ପ୍ରଦାନ କରାଯାଇଥାଏ।",
   "crops_data": {
      "paddy": {
         "advisory": [
            "ଧାନରେ କାଣ୍ଡ ଛେଦକକୁ ପରିଚାଳନା କରିବା ପାଇଁ, ସପ୍ତାହରେ 6 ଥର ଟ୍ରାଇକୋଗ୍ରାମମାଜାପୋନିକମ୍ କାର୍ଡ ବ୍ୟବହାର କରନ୍ତୁ।",
            "କାଣ୍ଡ ଛେଦକକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ କାର୍ଟାପ୍ ହାଇଡ୍ରୋକ୍ଲୋରାଇଡ୍ କିମ୍ବା କ୍ଲୋରାଣ୍ଟ୍ରାନିଲିପ୍ରୋଲ୍ ଭଳି କୀଟନାଶକ ପ୍ରୟୋଗ କରନ୍ତୁ।"
         ]
      },
      "groundnut": {
         "advisory": [
            "ଚିନାବାଦାମରେ କାଣ୍ଡ କ୍ଷୟକୁ ପରିଚାଳନା କରିବା ପାଇଁ, ଭାଲିଡାମାଇସିନ୍ କିମ୍ବା କ୍ୟାପଟାନ + ହେକ୍ସାକୋନାଜୋଲ ସହିତ ମାଟିକୁ ଭିଜାଇ ଦିଅନ୍ତୁ |"
         ]
      },
      "mustard": {
         "advisory": [
            "ସୋରିଷରେ କୀଟ ସଂକ୍ରମଣର ପ୍ରାଥମିକ ପର୍ଯ୍ୟାୟରେ, ନିମ ଆଧାରିତ କୀଟନାଶକ ସ୍ପ୍ରେ କରନ୍ତୁ।",
            "କୀଟ ପରିଚାଳନା ପାଇଁ ରାସାୟନିକ ଭାବରେ ଥାୟାମେଥୋକ୍ସାମ୍, ଏସିଟାମିପ୍ରିଡ୍, କିମ୍ବା ଇମିଡାକ୍ଲୋପ୍ରିଡ୍ ସ୍ପ୍ରେ କରନ୍ତୁ |"
         ]
      },
      "black gram": {
         "advisory": [
            "ପାଉଡର ଫଙ୍ଗୁର ରୋଗକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ, ସଲଫର୍, ହେକ୍ସାକୋନାଜୋଲ୍, ପ୍ରୋପିକୋନାଜୋଲ୍, କିମ୍ବା ପେନ୍କୋନାଜୋଲ୍ ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "green gram": {
         "advisory": [
            "ପାଉଡର ଫଙ୍ଗୁର ରୋଗକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ, ସଲଫର୍, ହେକ୍ସାକୋନାଜୋଲ୍, ପ୍ରୋପିକୋନାଜୋଲ୍, କିମ୍ବା ପେନ୍କୋନାଜୋଲ୍ ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "potato": {
         "advisory": [
            "ଆଳୁରେ ପ୍ରାରମ୍ଭିକ ବ୍ଲାଇଟ୍ ରୋଗ ପରିଚାଳନା କରିବାକୁ, ମାନକୋଜେବ୍ କିମ୍ବା କାର୍ବେଣ୍ଡାଜିମ୍ ସ୍ପ୍ରେ କରନ୍ତୁ |",
            "ବିଳମ୍ବରେ ହେଉଥିବା ବ୍ଲାଇଟ୍କୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ, 10 ଦିନ ବ୍ୟବଧାନରେ ମେଟାଲାକ୍ସିଲ + ମାନକୋଜେବ ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "cole crops": {
         "advisory": [
            "ବିଳମ୍ବରେ ବୁଣାଯାଇଥିବା ଫୁଲକୋବି ଏବଂ ବନ୍ଧାକୋବି ଫସଲରେ ଡାଇମଣ୍ଡ ବ୍ୟାକ୍ ମଥ୍ ଏବଂ ହେଡ୍ ବୋରର୍ ପାଇଁ ଅନୁକୂଳ ପରିସ୍ଥିତି।",
            "କ୍ୟାଟର୍ପିଲରଗୁଡ଼ିକୁ ସଂଗ୍ରହ କରି ନଷ୍ଟ କରନ୍ତୁ ଏବଂ ନିମ୍ବ ଆଧାରିତ କୀଟନାଶକ କିମ୍ବା ରାସାୟନିକ ସ୍ପ୍ରେ ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "tomato": {
         "advisory": [
            "ପ୍ରଚଳିତ କୁହୁଡ଼ି ଅବସ୍ଥା ଟମାଟୋରେ ଏଫିଡ୍ ସଂକ୍ରମଣ ବୃଦ୍ଧି କରିପାରେ | ନିମ୍ବ ତେଲ ପ୍ରସ୍ତୁତି କିମ୍ବା ଫ୍ଲୋନିକାମ ଦ୍ୱାରା ନିୟନ୍ତ୍ରଣ କରନ୍ତୁ।"
         ]
      },
      "brinjal": {
         "advisory": [
            "ଏପିଲାକ୍ନା ବିଟଲ୍କୁ ପରିଚାଳନା କରିବା ପାଇଁ, ଘାସକୁ ହଟାଇବା ପାଇଁ ଗଛକୁ ହଲାନ୍ତୁ ଏବଂ ନିମ-ଆଧାରିତ କୀଟନାଶକ କିମ୍ବା ରାସାୟନିକ ସ୍ପ୍ରେ ସ୍ପ୍ରେ କରନ୍ତୁ |"
         ]
      },
      "rose": {
         "advisory": [
            "ଗୋଲାପ ଫୁଲରେ ଥ୍ରିପ୍ସକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ ଫେନ୍ପାଇରୋକ୍ସିମେଟ୍ କିମ୍ବା ଆବାମାକ୍ଟିନ୍ ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "pisciculture": {
         "advisory": [
            "ଜଳର ଗଭୀରତା 6 ଫୁଟ ପର୍ଯ୍ୟନ୍ତ ବଜାୟ ରଖନ୍ତୁ, ଯାହାଦ୍ୱାରା ଅଧିକ ଉଷ୍ମ ତଳିଆ ଅଞ୍ଚଳରେ ମାଛମାନେ ଶୀତନିଦ୍ରା ମଧ୍ୟରେ ରହିପାରିବେ।"
         ]
      }
   },
   "date": "28-01-2025"
}