{
   "weather_details": {
      "11/09/2024": {
         "rainfall": 2,
         "t_max": 34,
         "t_min": 28,
         "rh_max": 63,
         "rh_min": 81,
         "wind_speed": 15,
         "wind_direction": 223,
         "cloud_cover": 6
      },
      "12/09/2024": {
         "rainfall": 2,
         "t_max": 34,
         "t_min": 27,
         "rh_max": 65,
         "rh_min": 80,
         "wind_speed": 15,
         "wind_direction": 228,
         "cloud_cover": 6
      },
      "13/09/2024": {
         "rainfall": 5,
         "t_max": 35,
         "t_min": 27,
         "rh_max": 58,
         "rh_min": 77,
         "wind_speed": 17,
         "wind_direction": 234,
         "cloud_cover": 6
      },
      "14/09/2024": {
         "rainfall": 2,
         "t_max": 35,
         "t_min": 27,
         "rh_max": 60,
         "rh_min": 75,
         "wind_speed": 16,
         "wind_direction": 233,
         "cloud_cover": 5
      },
      "15/09/2024": {
         "rainfall": 2,
         "t_max": 35,
         "t_min": 28,
         "rh_max": 59,
         "rh_min": 73,
         "wind_speed": 17,
         "wind_direction": 221,
         "cloud_cover": 5
      }
   },
   "names_of_crops": [
      "ଧାନ।",
      "ମକା",
      "କାକୁଡ଼ି",
      "ପନିପରିବା"
   ],
   "general_advisory": "ବର୍ଷାର ପୂର୍ବାନୁମାନକୁ ଧ୍ୟାନରେ ରଖି କୃଷକମାନଙ୍କୁ ମଧ୍ୟମ ଜମିରେ ପାଣି ବାନ୍ଧି ରଖିବା ପାଇଁ ପରାମର୍ଶ ଦିଆଯାଇଛି। ଟିଲରିଙ୍ଗ୍ ସମୟରେ 2 ରୁ 3 ସେ. ମି. ପାଣି ଏବଂ ପେନିକଲ୍ ଇନିସିଏସନ ପର୍ଯ୍ୟାୟରେ <ଆଇ. ଡି. 1> ସେ. ମି. ପାଣି ରଖନ୍ତୁ। ଆଗାଛାକୁ ବାହାର କରି କ୍ଷେତକୁ ସଫା ରଖନ୍ତୁ। ଲୁହା ବିଷାକ୍ତତାର ଲକ୍ଷଣ ଦେଖାଯିବା ସମ୍ଭାବନା ରହିଛି, ଯେପରିକି କମ୍ ଚାଷ, ପତ୍ର ହଳଦିଆ ହେବା ଏବଂ ପାଣି ଅଟକି ରହିବା କାରଣରୁ ବୃଦ୍ଧି ବନ୍ଦ ହେବା। ଏଭଳି ସ୍ଥିତିରେ ଅଟକି ରହିଥିବା ପାଣି ବାହାର କରିଦିଅନ୍ତୁ ଏବଂ ଏକର ପିଛା 10 କିଲୋଗ୍ରାମ ଏମ୍. ଓ. ପି. ଏବଂ 10 କିଲୋଗ୍ରାମ ଜିଙ୍କ୍ ସଲ୍ଫେଟ୍ 21 ପ୍ରତିଶତ ଲଗାନ୍ତୁ। ପ୍ରବଳ ବର୍ଷା ହେତୁ ରହିବା ଦ୍ୱାରା କ୍ଷତିଗ୍ରସ୍ତ ହୋଇଥିବା ଫସଲକୁ ସହାୟତା ପ୍ରଦାନ କରନ୍ତୁ। ଉଚ୍ଚ ଆର୍ଦ୍ରତା ସହିତ ଜଡିତ ପ୍ରଚଳିତ ମେଘୁଆ ପାଣିପାଗ ହେତୁ ଫସଲରେ କୀଟପତଙ୍ଗ ଏବଂ ରୋଗ ଘଟଣା ପାଇଁ ନିୟମିତ ତଦାରଖ କରିବାକୁ ପରାମର୍ଶ ଦିଆଯାଇଛି।",
   "crops_data": {
      "paddy": {
         "advisory": [
            "ପେନିକଲ୍ ଇନିସିଏସନ ପର୍ଯ୍ୟାୟରେ ଟିଲରିଙ୍ଗ୍ଃ ସ୍ୱାର୍ମିଂ କ୍ୟାଟରପିଲର-ଏହି ସ୍ପ୍ରେ ପରିଚାଳନା କରିବା ପାଇଁ କ୍ଲୋରପିରିଫସ୍ 50 ପ୍ରତିଶତ + ସାଇପର୍ମେଥ୍ରିନ୍ 5 ପ୍ରତିଶତ ଇସି @400-ମିଲି/ଏକର କିମ୍ବା ଲାମ୍ବଡା-ସାଇହାଲୋଥ୍ରିନ୍ @400-ମିଲି/ଏକର।",
            "ଶୀଥ୍ ରଟ୍ ଏବଂ ଶୀଥ୍ ବ୍ଲାଇଟ୍-ଏହି ରୋଗକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ ଟେବୁକୋନାଜୋଲ୍ 50 ପ୍ରତିଶତ + ଟ୍ରାଇଫ୍ଲୋକ୍ସିସ୍ଟ୍ରୋବିନ୍ 25 ପ୍ରତିଶତ ଡବ୍ଲୁଜି @80-ଗ୍ରାମ୍/ଏକର କିମ୍ବା ପ୍ରୋପିକୋନାଜୋଲ୍ 25 ପ୍ରତିଶତ ଇସି @200 ମିଲି/ଏକର ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "maize": {
         "advisory": [
            "ଅମଳ ପର୍ଯ୍ୟାୟରେ ପରିପକ୍ୱତାଃ ପତନ ସେନା କୃମି-ଶୁଖିଲା ଋତୁ ପରେ ବର୍ଷା ମକା ରେ ପତନ ସେନା କୃମିର ସଂକ୍ରମଣକୁ ବୃଦ୍ଧି କରିପାରେ | କୀଟ ପରିଚାଳନା ପାଇଁ ବାୟୋପେଷ୍ଟିସାଇଡ୍ ବିଉଭେରିଆ ବାସିଆନାକୁ 200 ଲିଟର ପାଣିରେ ମିଶାଇ ଏକର ପିଛା 1200 ଗ୍ରାମ ଲେଖାଏଁ ସ୍ପ୍ରେ କରନ୍ତୁ। ପତ୍ର ଚକ୍ର ଭିତରେ ବାଲି, ମାଟି ଏବଂ କାଠର ଛାଇର ଧୂଳି ମିଶ୍ରଣ ଯାହା ଦ୍ୱାରା କ୍ୟାଟର୍ପିଲାର୍ମାନେ ପତ୍ରକୁ ଖାଇପାରିବେ ନାହିଁ | ରାସାୟନିକ ଉପାୟରେ ଏହି କୀଟକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ ଏକର ପିଛା 80 ଗ୍ରାମ୍ ବିଶିଷ୍ଟ ଏମାମେକ୍ଟିନ୍ ବେନ୍ଜୋଏଟ୍ 5 ପ୍ରତିଶତ ଏସ୍. ଜି. କିମ୍ବା ଏକର ପିଛା 100 ମିଲି ବିଶିଷ୍ଟ ସ୍ପିନେଟୋରାମ୍ ଏସ୍. ସି. କିମ୍ବା ଏକର ପିଛା 80 ମିଲି ବିଶିଷ୍ଟ କ୍ଲୋରାଣ୍ଟ୍ରାନିଲିପ୍ରୋଲ୍ ଏସ୍. ସି. ସ୍ପ୍ରେ କରନ୍ତୁ। କୀଟନାଶକ ସିଞ୍ଚନ ପାଇଁ ଏକର ପିଛା 200 ଲିଟର ପାଣି ଆବଶ୍ୟକ ହୋଇଥାଏ।"
         ]
      },
      "cucurbits": {
         "advisory": [
            "ଫଳ ଧାରଣ କରିବା ପର୍ଯ୍ୟାୟର ଉଦ୍ଭିଦଃ ଡାଉନି ମିଲ୍ଡିଉ-ପ୍ରବଳ ବର୍ଷା ପରେ କାକୁଡ଼ି ପନିପରିବାରେ ଡାଉନି ମିଲ୍ଡିଉ ରୋଗର ସଂକ୍ରମଣ ହେବାର ସମ୍ଭାବନା ରହିଛି। କାକୁଡ଼ିରେ ଡାଉନି ମାଇଲ୍ଡ୍ୟୁ ରୋଗ ପରିଚାଳନା ପାଇଁ କପର୍ ହାଇଡ୍ରୋକ୍ସାଇଡ୍ 77 ପ୍ରତିଶତ ଡବ୍ଲ୍ୟୁ. ପି. @3-ଗ୍ରାମ୍/ଲିଟର କିମ୍ବା ଫୋସେଟିଲ୍-ଏ. ଏଲ୍. 80 ପ୍ରତିଶତ ଡବ୍ଲ୍ୟୁ. ପି. @3-ଗ୍ରାମ୍/ଲିଟର କିମ୍ବା କାର୍ବେନଡାଜିମ୍ 12 ପ୍ରତିଶତ + ମାନକୋଜେବ୍ 63 ପ୍ରତିଶତ ଡବ୍ଲ୍ୟୁ. ପି. @2-ଗ୍ରାମ୍/ଲିଟର ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "vegetables": {
         "advisory": [
            "ନର୍ସରୀ/ପନିପରିବା ଫଳ ଧାରଣ କରିବା ପର୍ଯ୍ୟାୟଃ ରୋଗକୁ ହ୍ରାସ କରିବା-ଟମାଟୋ, ବାଇଗଣ, ଲଙ୍କା ପରି ପନିପରିବା ନର୍ସରୀରେ ରୋଗ ହ୍ରାସ ହେବାର ସମ୍ଭାବନା ରହିଛି। ଏହାକୁ ପରିଚାଳନା କରିବା ପାଇଁ ନର୍ସରୀ ଶଯ୍ୟାକୁ 2 ଗ୍ରାମ କ୍ୟାପଟାନ/ଲିଟର ପାଣି କିମ୍ବା 2.5-gram କପର୍ ଅକ୍ସିକ୍ଲୋରାଇଡ୍/ଲିଟର ପାଣିରେ ଭିଜାଇ ଦିଅନ୍ତୁ। ୱିଲ୍ଟ ଏବଂ ରଟ୍-ପନିପରିବା ଫସଲରେ ୱିଲ୍ଟ ଏବଂ ରଟ୍ ରୋଗକୁ ପରିଚାଳନା କରିବା ପାଇଁ, 10 ଲିଟର ପାଣିରେ ମିଶାଯାଇଥିବା 1.5-gram ସ୍ଟ୍ରେପ୍ଟୋସାଇକ୍ଲିନ୍ ଏବଂ 20-ଗ୍ରାମ୍ ମେଟାଲାକ୍ସିଲ୍ 8% + ମାନକୋଜେବ୍ 64% WP ର ଦ୍ରବଣ ସହିତ ମୂଳ ଅଞ୍ଚଳକୁ ଭିଜାଇ ଦିଅନ୍ତୁ |"
         ]
      }
   },
   "date": "10-09-2024"
}