{
   "weather_details": {
      "2024-10-19": {
         "rainfall": 2,
         "t_max": 34,
         "t_min": 24,
         "rh_max": 98,
         "rh_min": 60,
         "wind_speed": 1,
         "wind_direction": 0,
         "cloud_cover": 5
      },
      "2024-10-20": {
         "rainfall": 2,
         "t_max": 34,
         "t_min": 24,
         "rh_max": 97,
         "rh_min": 61,
         "wind_speed": 1,
         "wind_direction": 0,
         "cloud_cover": 7
      },
      "2024-10-21": {
         "rainfall": 2,
         "t_max": 34,
         "t_min": 23,
         "rh_max": 96,
         "rh_min": 59,
         "wind_speed": 1,
         "wind_direction": 34,
         "cloud_cover": 6
      },
      "2024-10-22": {
         "rainfall": 0,
         "t_max": 33,
         "t_min": 23,
         "rh_max": 92,
         "rh_min": 47,
         "wind_speed": 2,
         "wind_direction": 11,
         "cloud_cover": 5
      },
      "2024-10-23": {
         "rainfall": 5,
         "t_max": 33,
         "t_min": 23,
         "rh_max": 84,
         "rh_min": 48,
         "wind_speed": 4,
         "wind_direction": 355,
         "cloud_cover": 6
      }
   },
   "names_of_crops": [
      "ଚାଉଳ",
      "କପା",
      "କଦଳୀ"
   ],
   "general_advisory": "ଉଚ୍ଚଭୂମି/ମଧ୍ଯ଼ମ ଜମିରେ ଚିନାବାଦାମ, ଚଣା, ସବୁଜ ଚଣା, କଳା ଚଣା, କାଉପି, ମିଠା ଆଳୁ ଏବଂ ତିଲ ଭଳି ରବି ଫସଲ ବୁଣିବା ପାଇଁ ମୃତ୍ତିକାର ଆର୍ଦ୍ରତା ଯଥେଷ୍ଟ। କୋଲ ଫସଲ (ବନ୍ଧାକୋବି, ବିଳମ୍ବିତ ଫୁଲକୋବି ଏବଂ ବ୍ରୋକୋଲି), ସୋଲାନାସିଯ଼ସ୍ ପନିପରିବା (ବାଇଗଣ, ଟମାଟୋ, ଲଙ୍କା ଏବଂ କ୍ଯ଼ାପ୍ସିକମ୍) ଭଳି ପନିପରିବା ବୁଣିବା ପାଇଁ ଏହା ସର୍ବୋତ୍ତମ ସମଯ଼। ଗାଜର, ମୂଳା, ସୋରିଷ, ରସୁଣ, ଡାଳିମ୍ବ ଇତ୍ଯ଼ାଦି ପନିପରିବା ରୋପଣ କରନ୍ତୁ। ଶାଖାଗୁଡ଼ିକର ଏକ ଭଲ ବ୍ଯ଼ବଧାନ ଢାଞ୍ଚାରେ ପ୍ରଚୁର ଫୁଲ କଳ ଉତ୍ପାଦନ କରିବା ପାଇଁ ଗୋଲାପରେ କଠିନ ଛାଣିବା ପାଇଁ ଅକ୍ଟୋବର ହେଉଛି ଆଦର୍ଶ ସମଯ଼ | ଧନିଆ, ଟମାଟୋ, ଫୁଲକୋବି ଏବଂ ତିଲର ନର୍ସରୀ ବୁଣିବା ପାଇଁ ଯାଆନ୍ତୁ। କୋଲେ ଫସଲ ରୋପଣ ପାଇଁ ଯାଆନ୍ତୁ। କୋଲ୍ ଫସଲ ଚାରା ନର୍ସରୀରେ 3-ସପ୍ତାହ ପର୍ଯ୍ଯ଼ାଯ଼ରେ ଅଛି | ମୁଖ୍ଯ଼ କ୍ଷେତରେ ରୋପଣ କରନ୍ତୁ। ବିନ୍ ରୋପଣ ପାଇଁ ପାଗ ଅନୁକୂଳ ଅଟେ।",
   "crops_data": {
      "rice": {
         "advisory": [
            "ବିସ୍ଫୋରଣ ରୋଗ ନିୟନ୍ତ୍ରଣ ପାଇଁ ହେକ୍ଟର ପିଛା 400-ମିଲି ହେକ୍ସାକୋନାଜୋଲ 5 ପ୍ରତିଶତ ଏସ୍. ସି. କିମ୍ବା ଏକର ପିଛା 200-ମିଲି ଡିଫେନୋକୋନାଜୋଲ ଏସ୍. ସି. କିମ୍ବା ଏକର ପିଛା 50 ପ୍ରତିଶତ ଟେବୁକୋନାଜୋଲ, ଟ୍ରାଇଫ୍ଲୋକ୍ସିସ୍ଟ୍ରୋବିନ 25 ପ୍ରତିଶତ ଡବ୍ଲୁ. ଜି., ଏକର ପିଛା 80-ଗ୍ରାମ୍ ସ୍ପ୍ରେ କରନ୍ତୁ। ଧାନରେ ଲିଫ୍ ଫୋଲ୍ଡର୍ ଏବଂ କେସ୍ ୱର୍ମ୍ କୀଟପତଙ୍ଗ ପରିଚାଳନା ପାଇଁ ଏକର ପିଛା 200 ମିଲି. ରେ ବାଇଫେନ୍ଥ୍ରିନ 10 ପ୍ରତିଶତ ଇସି କିମ୍ବା ଏକର ପିଛା 200 ମିଲି. ରେ ଲାମ୍ବଡା ସାଇହାଲୋଥ୍ରିନ 5 ପ୍ରତିଶତ ଇସି କିମ୍ବା ଏକର ପିଛା 400 ମିଲି. ରେ ଫିପ୍ରୋନିଲ 5 ପ୍ରତିଶତ ଏସସି କିମ୍ବା ଏକର ପିଛା 60 ମିଲି. ରେ କ୍ଲୋରାଣ୍ଟ୍ରାନିଲିପ୍ରୋଲ 18.5% ଏସସି ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "cotton": {
         "advisory": [
            "ଯଦି କପା ଫସଲରେ ଏଫିଡ୍ ଏବଂ ଜ୍ଯାସିଡ୍, ଥ୍ରିପ୍ସ ଏବଂ ମିଲିବଗ୍ ପରି ଶୋଷକ କୀଟ ସଂକ୍ରମଣ ହୁଏ, ତେବେ ନିମ୍ ଆଧାରିତ କୀଟନାଶକ (ନିମ୍ ତେଲ 1500 ପିପିଏମ୍) @600-ମିଲି/ଏକରକୁ 200 ଲିଟର ପାଣିରେ ମିଶାଇ ସ୍ପ୍ରେ କରନ୍ତୁ। ଯଦି ଶୋଷକ କୀଟ ସଂଖ୍ୟା ଇ. ଟି. ଏଲ୍. ଠାରୁ ଅଧିକ ବୋଲି ଜଣାପଡ଼େ, ତେବେ ଫ୍ଲୋନିକାମିଡ୍ 50 ପ୍ରତିଶତ ଡବ୍ଲୁ. ଜି. @60 ଗ୍ରାମ୍/ଏକର କିମ୍ବା ଥିୟାମେଥୋକ୍ସାମ୍ 25 ପ୍ରତିଶତ ଡବ୍ଲୁ. ଜି. @40 ଗ୍ରାମ୍/ଏକର କିମ୍ବା ଡିନୋଟେଫୁରାନ୍ 20 ପ୍ରତିଶତ ଏସ୍. ଜି. @80 ଗ୍ରାମ୍/ଏକର ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "cabbage": {
         "advisory": [
            "ନର୍ସରୀରେ ଥିବା ବନ୍ଧାକୋବି ଚାରା ହେଉଛି ଅଙ୍କୁରୋଦଗମ ପର୍ଯ୍ଯ଼ାଯ଼। ନର୍ସରୀ ପ୍ରସ୍ତୁତି ଏବଂ ବନ୍ଧାକୋବି ମଞ୍ଜି ବୁଣିବା ଆରମ୍ଭ କରନ୍ତୁ। ବନ୍ଧାକୋବି ପାଇଁ ଉପଯୁକ୍ତ କିସମଗୁଡ଼ିକ ହେଉଛି ଗୋଲ୍ଡେନ୍ ଏକର, ପ୍ରାଇଡ୍ ଅଫ୍ ଇଣ୍ଡିଆ ଇତ୍ଯ଼ାଦି ଏବଂ ବିହନ ହାର ଏକର ପିଛା 200 ଗ୍ରାମ୍ | 1 ଏକର ଫସଲ ପାଇଁ ନର୍ସରୀ କ୍ଷେତ୍ର 50 ବର୍ଗ ମିଟର (ଆକାର 3 ମି. X1 ମି. X 0.15m) ହେବା ଉଚିତ। ନର୍ସରୀରେ ବୁଣିବା ପୂର୍ବରୁ ପ୍ରତି କିଲୋଗ୍ରାମ ମଞ୍ଜି ପିଛା ବାଭିଷ୍ଟିନ୍ 1 ଗ୍ରାମ୍ + ଥ୍ରିଯ଼ମ୍ 2 ଗ୍ରାମ୍ ସହିତ ମଞ୍ଜି ଚିକିତ୍ସା କରାଯିବା ଉଚିତ। ଚାରା ଗୁଡ଼ିକୁ f ର ଆର୍ଦ୍ରତାରୁ ରକ୍ଷା କରିବା ପାଇଁ ଏକ ଲିଟର ପାଣିରେ କାର୍ବେନଡାଜିମ୍ 1g ମିଶାଇ ସ୍ଟ୍ରେପ୍ଟୋସାଇକ୍ଲିନ୍ 0.1g ସହିତ ବୀଜ ଶଯ୍ଯ଼ାକୁ ଭିଜାଇ ଦିଅନ୍ତୁ |"
         ]
      }
   },
   "date": "18-10-2024"
}