{
   "weather_details": {
      "2025-02-08": {
         "rainfall": 0,
         "t_max": 32,
         "t_min": 18,
         "rh_max": 75,
         "rh_min": 21,
         "wind_speed": 3,
         "wind_direction": 344,
         "cloud_cover": 1
      },
      "2025-02-09": {
         "rainfall": 0,
         "t_max": 32,
         "t_min": 16,
         "rh_max": 82,
         "rh_min": 17,
         "wind_speed": 3,
         "wind_direction": 337,
         "cloud_cover": 1
      },
      "2025-02-10": {
         "rainfall": 0,
         "t_max": 32,
         "t_min": 16,
         "rh_max": 86,
         "rh_min": 15,
         "wind_speed": 1,
         "wind_direction": 334,
         "cloud_cover": 0
      },
      "2025-02-11": {
         "rainfall": 0,
         "t_max": 34,
         "t_min": 18,
         "rh_max": 84,
         "rh_min": 17,
         "wind_speed": 1,
         "wind_direction": 243,
         "cloud_cover": 1
      },
      "2025-02-12": {
         "rainfall": 0,
         "t_max": 34,
         "t_min": 18,
         "rh_max": 73,
         "rh_min": 16,
         "wind_speed": 2,
         "wind_direction": 225,
         "cloud_cover": 1
      }
   },
   "names_of_crops": [
      "କଳା ଚଣା",
      "ସବୁଜ ଚଣା",
      "ବାଇଗଣ"
   ],
   "general_advisory": "ଶୀଘ୍ର ବୁଣାଯାଇଥିବା ଗ୍ରୀଷ୍ମକାଳୀନ ସୂର୍ଯ୍ୟମୁଖୀ ପାଇଁ, ହୋଇଂ ଏବଂ ନିଡ଼ାଇ ପାଇଁ ଯାଆନ୍ତୁ। ଉନ୍ନତ କିସମ ପାଇଁ 3 କେଜି ଏନ୍ ଏବଂ ହାଇବ୍ରିଡ୍ ପ୍ରଜାତି ପାଇଁ 6 କେଜି ପ୍ରୟୋଗ କରନ୍ତୁ। ପ୍ରତି ପାହାଡ଼ରେ ଗୋଟିଏ ସୁସ୍ଥ ଗଛ ରଖି ଗଛଗୁଡ଼ିକୁ ପତଳା କରନ୍ତୁ। ଗାଈର ଏଫ୍. ଏମ୍. ଡି. ରୋଗରୁ ରକ୍ଷା ପାଇବା ପାଇଁ, ଗୋଟିଏ ବର୍ଷରେ ଫେବୃଆରୀ ଏବଂ ସେପ୍ଟେମ୍ବର ମଧ୍ୟରେ ଛଅ ମାସ ବ୍ୟବଧାନରେ ଟୀକାକରଣ କରାଯିବା ଆବଶ୍ୟକ।",
   "crops_data": {
      "black gram": {
         "advisory": [
            "କଳା ଚାଉଳରେ ପାଉଡର ଫଙ୍ଗୁର ରୋଗ ପରିଲକ୍ଷିତ ହୋଇଛି। ପାଉଡର ଫଙ୍ଗୁରିକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ ଏକର ପିଛା 200 ଲିଟର ପାଣିରେ 800 ଗ୍ରାମ ହାରରେ 80 ଡବ୍ଲ୍ୟୁ. ପି. ସଲଫର୍ ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "green gram": {
         "advisory": [
            "ଏହି ଭୂତାଣୁ ପତ୍ର ପୃଷ୍ଠରେ ସବୁଜ ଏବଂ ହଳଦିଆ ରଙ୍ଗର ସାଧାରଣ ମୋଜାଇକ ଲକ୍ଷଣ ସୃଷ୍ଟି କରିଥାଏ। ଶ୍ୱେତ ମାଛି ଏହି ରୋଗର ବାହକ ଭାବେ କାର୍ଯ୍ୟ କରିଥାଏ। କ୍ଷେତରେ ଭେକ୍ଟରର ଜନସଂଖ୍ୟାକୁ ପରିଚାଳନା କରିବା ପାଇଁ ପ୍ରଥମେ ଗୁରୁତର ସଂକ୍ରମିତ ଗଛଗୁଡ଼ିକୁ କ୍ଷେତରୁ ବହୁ ଦୂରରେ ମୂଳୋତ୍ପାଟନ କରି ନଷ୍ଟ କରିଦିଅନ୍ତୁ। ଏକର ପିଛା 20ଟି ହଳଦିଆ ଚଟପଟା ଜାଲ ଲଗାନ୍ତୁ। ଧଳା ମାଛି ଗୁଡ଼ିକୁ ରାସାୟନିକ ଉପାୟରେ ପରିଚାଳନା କରିବା ପାଇଁ 200 ଲିଟର ପାଣିରେ ମିଶାଇ ଏକର ପିଛା 40 ଗ୍ରାମ୍ ଥାଇମେଥୋକ୍ସାମ୍ (ଆକ୍ଟାରା କିମ୍ବା ଆରେଭା) କିମ୍ବା ଏକର ପିଛା 50 ଗ୍ରାମ୍ ଏସିଟାମିପ୍ରିଡ୍ (ଧନପ୍ରୀତ୍/ମାଣିକ) କିମ୍ବା ଏକର ପିଛା ପାଇରିପ୍ରୋକ୍ସିଫେନ୍ 10 ପ୍ରତିଶତ ଇସି (ବୁଲନ୍/ଲାନୋ) ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "brinjal": {
         "advisory": [
            "ଫଳ ଏବଂ ଶୁଟ୍ ଛେଦକ ପାଇଁ, ଲାମ୍ବଡା-ସିହାଲୋଥ୍ରିନ୍ 5 ପ୍ରତିଶତ ଇ. ସି. ହେକ୍ଟର ପିଛା 300 ମିଲି କିମ୍ବା ନୋଭାଲୁରନ୍ 10 ପ୍ରତିଶତ ଇ. ସି. 500 ମିଲି କିମ୍ବା ସ୍ପିନୋସାଡ୍ 45 ପ୍ରତିଶତ ଏସ୍. ସି. ହେକ୍ଟର ପିଛା 187.5 ମିଲି କିମ୍ବା ଥିଓଡିକାର୍ବ 75 ପ୍ରତିଶତ ଡବ୍ଲ୍ୟୁ. ପି. @625-1000 ଗ୍ରାମ୍/ହେକ୍ଟର ସହିତ 500 ଲିଟର ପାଣି ମିଶାଇ ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      }
   },
   "date": "07-02-2025"
}