{
   "weather_details": {
      "01-02-2025": {
         "rainfall": 0,
         "t_max": 35,
         "t_min": 20,
         "rh_max": 27,
         "rh_min": 74,
         "wind_speed": 2,
         "wind_direction": 207,
         "cloud_cover": 1
      },
      "02-02-2025": {
         "rainfall": 0,
         "t_max": 35,
         "t_min": 20,
         "rh_max": 24,
         "rh_min": 81,
         "wind_speed": 3,
         "wind_direction": 202,
         "cloud_cover": 1
      },
      "03-02-2025": {
         "rainfall": 0,
         "t_max": 34,
         "t_min": 21,
         "rh_max": 20,
         "rh_min": 61,
         "wind_speed": 3,
         "wind_direction": 0,
         "cloud_cover": 2
      },
      "04-02-2025": {
         "rainfall": 0,
         "t_max": 34,
         "t_min": 20,
         "rh_max": 24,
         "rh_min": 73,
         "wind_speed": 4,
         "wind_direction": 63,
         "cloud_cover": 3
      },
      "05-02-2025": {
         "rainfall": 0,
         "t_max": 34,
         "t_min": 20,
         "rh_max": 23,
         "rh_min": 63,
         "wind_speed": 5,
         "wind_direction": 79,
         "cloud_cover": 3
      }
   },
   "names_of_crops": [
      "ଶୁଖିଲା ଋତୁ ଚାଉଳ",
      "ସବୁଜ ଚଣା/କଳା ଚଣା",
      "ଆମ୍ବ",
      "ପନିପରିବା ଫସଲ",
      "ପଶୁପାଳନ"
   ],
   "general_advisory": "ଆଇଏମଡି, ମ୍ୟୁନିସିପାଲିଟି କର୍ପୋରେସନ୍, ଭୁବନେଶ୍ୱରର ବର୍ଦ୍ଧିତ ପରିସର ପୂର୍ବାନୁମାନ ଅନୁଯାୟୀ, ଓଡ଼ିଶାର ଜିଲ୍ଲାଗୁଡ଼ିକରେ ପ୍ରଥମ ସପ୍ତାହରେ (ଜାନୁଆରୀ 31 ରୁ ଫେବୃଆରୀ 6,2025) ଏବଂ ଦ୍ୱିତୀୟ ସପ୍ତାହରେ (ଫେବୃଆରୀ 7 ରୁ ଫେବୃଆରୀ 13,2025) ସର୍ବନିମ୍ନ ତାପମାତ୍ରା ସ୍ୱାଭାବିକ ରହିବାର ସମ୍ଭାବନା ରହିଛି। ଆଗାମୀ ଦିନରେ ଶୁଖିଲା ପାଗକୁ ଦୃଷ୍ଟିରେ ରଖି କୃଷକମାନଙ୍କୁ ଫସଲ କ୍ଷେତରେ ଗୋଟିଏ ଜଳସେଚନ କରିବାକୁ ଏବଂ ଠିଆ ହୋଇଥିବା ଫସଲ କ୍ଷେତରେ ସମସ୍ତ ପ୍ରକାରର ସ୍ପ୍ରେ ଏବଂ ଆନ୍ତଃସାଂସ୍କୃତିକ କାର୍ଯ୍ୟ କରିବାକୁ ପରାମର୍ଶ ଦିଆଯାଇଛି। ଉପଯୁକ୍ତ ଫସଲ ବୃଦ୍ଧି ପାଇଁ କୃଷକମାନେ ନିଜ କ୍ଷେତକୁ ଆଗାଛା ମୁକ୍ତ ରଖିବା ଉଚିତ। ପ୍ରଚଳିତ ତାପମାତ୍ରା ସ୍ଥିତି (ଦିନ ଏବଂ ରାତି ତାପମାତ୍ରାରେ ଉଚ୍ଚ ବ୍ୟବଧାନ) ବିଭିନ୍ନ ପ୍ରକାରର ଫସଲ (ବିଭିନ୍ନ ପ୍ରକାରର କୀଟ ଆକ୍ରମଣକୁ ପସନ୍ଦ କରେ) ତଥା ପଶୁମାନଙ୍କୁ ପ୍ରଭାବିତ କରିପାରେ |",
   "crops_data": {
      "dry season rice": {
         "advisory": [
            "3 ରୁ 5 ସପ୍ତାହ ପୁରୁଣା ଚାରା ଗୁଡ଼ିକୁ 15 ସେ. ମି. x 15 ସେ. ମି. ବ୍ୟବଧାନରେ ଭଲ ଭାବରେ କାଦୁଅ ହୋଇଥିବା ମାଟିରେ ପ୍ରତି ପାହାଡ଼ରେ 3 ରୁ 4 ଚାରା ସହିତ ଅଗଭୀର ଗଭୀରତାରେ ରୋପଣ କରିବାକୁ ପରାମର୍ଶ ଦିଆଯିବା ଉଚିତ। ଅନ୍ତିମ ପୁଡଲିଂ ସମୟରେ (ଡିଏପି 44 କେଜି + ଏମଓପି 22 କେଜି) କିମ୍ବା (ୟୁରିଆ 22 କେଜି + ଏସଏସପି 125 କେଜି + ଏମଓପି 22 କେଜି) ବେସାଲ୍ ମାତ୍ରା ଭାବରେ ପ୍ରୟୋଗ କରନ୍ତୁ।",
            "ଯେଉଁ କୃଷକମାନେ ପୂର୍ବରୁ ରୋପଣ ସମାପ୍ତ କରିସାରିଛନ୍ତି, ସେମାନେ 5-8 ଡିଏଟିରେ ଏକର ପିଛା 4 କିଲୋଗ୍ରାମ ଦରରେ ଗ୍ରାନୁଲାର ହର୍ବିସାଇଡ୍ ବେନ୍ସଲ୍ଫୁରନ୍-ମିଥାଇଲ + ପ୍ରିଟିଲାକ୍ଲୋର ଲଗାନ୍ତୁ। ଦାନାଦାର ତୃଣନାଶକକୁ ଏକର ପିଛା 4 କିଲୋଗ୍ରାମ ବାଲି ସହିତ ମିଶାନ୍ତୁ ଏବଂ ଏହାକୁ ସମାନ ଭାବରେ କ୍ଷେତରେ ପ୍ରସାରଣ କରନ୍ତୁ କିମ୍ବା ପାଇରାଜୋସଲ୍ଫୁରନ୍-ଇଥାଇଲ 10 ଡବ୍ଲ୍ୟୁ. ପି. @80 ଗ୍ରାମ୍/ଏକରରେ 140 ଲିଟର ପାଣିରେ 3-5 ଡିଏ. ଟି. ରେ ସ୍ପ୍ରେ କରନ୍ତୁ କିମ୍ବା 10-15 ଡିଏ. ଟି. ରେ 120 ମିଲି/ଏକରରେ ବିସ୍ପିରିବାକ୍ ସୋଡ଼ିଅମ୍ ସ୍ପ୍ରେ କରନ୍ତୁ କିମ୍ବା 140 ଲିଟର ପାଣିରେ 2-3 ପତ୍ର ସ୍ତରର ଆଗାଛା ସ୍ପ୍ରେ କରନ୍ତୁ।",
            "କେବଳ ପ୍ରତିରୋପଣ କରାଯାଇଥିବା କ୍ଷେତରେ ଗ୍ରାମୀଣ କୃଷି ମୌସୁମୀ ସେବା ଭାରତ ପାଣିପାଗ ବିଭାଗ ଓଡ଼ିଶା କୃଷି ଏବଂ ପ୍ରଯୁକ୍ତିବିଦ୍ୟା ବିଶ୍ୱବିଦ୍ୟାଳୟ ଆର. ଆର. ଟି. ଟି. ଏସ., ଚିପ୍ଲିମା, ସମ୍ବଲପୁରରେ ଏକର ପିଛା 5 ମି. ଗ୍ରା. ଲୁଚକାଳି ସହିତ 3ଟି ଫେରୋମୋନ୍ ଫାନ୍ଦ ବ୍ୟବହାର କରନ୍ତୁ।",
            "ଯେତେବେଳେ ଫାନ୍ଦରେ ପୁରୁଷ ପତଙ୍ଗ ସଂଖ୍ୟା 4 କିମ୍ବା 5 ରେ ପହଞ୍ଚେ, ଆଜାଦିରାକ୍ଟିନ 0.15% ନିମ୍ବ ମଞ୍ଜି କର୍ଣ୍ଣଲ ଆଧାରିତ ଇସି ଫର୍ମୁଲେସନ @800 ମିଲି/ଏକର ସ୍ପ୍ରେ କରିବାକୁ ପରାମର୍ଶ ଦିଆଯିବା ଉଚିତ। କୃଷକମାନେ ଏହି କୀଟପତଙ୍ଗକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ ଧାନଯୁକ୍ତ କୀଟନାଶକ କ୍ଲୋରାନ୍ଟ୍ରାନିଲିପ୍ରୋଲ 4 ପ୍ରତିଶତ ଜିଆର ପ୍ରତି ଏକର କିମ୍ବା କାର୍ଟାପ ହାଇଡ୍ରୋକ୍ଲୋରାଇଡ 4ଜି ପ୍ରତି ଏକର 10 କିଲୋଗ୍ରାମ ବାଲିରେ 1:1 ଅନୁପାତରେ ମିଶାଇ ପ୍ରସାରଣ କରିପାରିବେ କିମ୍ବା କ୍ଲୋରାନ୍ଟ୍ରାନିଲିପ୍ରୋଲ 18.5% ଏସସି ପ୍ରତି ଏକର 60 ମିଲି ସ୍ପ୍ରେ କରିପାରିବେ।"
         ]
      },
      "green gram/black gram": {
         "advisory": [
            "ଯଦି ସବୁଜ/କଳା ଗହମ କ୍ଷେତରେ ଶୋଷକ କୀଟ ଆକ୍ରମଣ ଦେଖାଯାଏ, ତେବେ କୃଷକମାନେ ବୃକ୍ଷରୋପଣ ପର୍ଯ୍ୟାୟରେ ଏହି କୀଟକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ ଏକର ପିଛା 8ଟି ହଳଦିଆ ଚଟପଟା ଜାଲ ବ୍ୟବହାର କରିବା ଉଚିତ। ଆକ୍ରମଣର ପ୍ରାରମ୍ଭିକ ପର୍ଯ୍ୟାୟରେ, କୃଷକମାନେ ଏହି କୀଟପତଙ୍ଗକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ ଲିଟର ପିଛା 5 ମିଲି ନିମ ତେଲ ସିଞ୍ଚନ କରିବା ଉଚିତ।",
            "ଫୁଲ ଫୁଟିବା ସମୟରେ କୀଟନାଶକ ପ୍ରୟୋଗରୁ ଦୂରେଇ ରହିବା ଉଚିତ।"
         ]
      },
      "mango": {
         "advisory": [
            "ଆମ୍ବ ଗୁଳ୍ମକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ ଆମ୍ବ ଗଛରେ ପଲିଥିନ୍/ଆଲ୍କାଥେନ୍ ଚାଦରକୁ ଜୋରରେ ବାନ୍ଧି ରଖନ୍ତୁ। ରୋଗାକ୍ରାନ୍ତ ଏବଂ ଅନାବଶ୍ୟକ ଶାଖା ଏବଂ ପତ୍ର ଗୁଡ଼ିକର ପ୍ରଶିକ୍ଷଣ ଏବଂ ଛାଣିବା ପାଇଁ ପରାମର୍ଶ ଦିଆଯିବା ଉଚିତ।",
            "ଯଦି ଆମ୍ବ ବଗିଚାରେ ପାଉଡର ଫଙ୍ଗସ୍ ସଂକ୍ରମଣ କିମ୍ବା କୌଣସି ଫଙ୍ଗସ୍ ସଂକ୍ରମଣ ଦେଖାଯାଏ, ତେବେ ଲିଟର ପିଛା 2 ଗ୍ରାମ୍ ଓଦା ସଲଫର୍ ସିଞ୍ଚନ କରିବାକୁ ପରାମର୍ଶ ଦିଆଯିବା ଉଚିତ।"
         ]
      },
      "vegetable crops": {
         "advisory": [
            "ଟମାଟୋ ଏବଂ ବାଇଗଣରେ ପତ୍ର ଖାଉଥିବା କ୍ୟାଟର୍ପିଲର ଏବଂ ଫଳ ଛେଦକ/ଶୁଟ୍ ଏବଂ ଫଳ ଛେଦକକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ, ଲିଟର ପିଛା 0.40 ଗ୍ରାମ୍ ଇମାମେକ୍ଟିନ୍ ବେନ୍ଜୋଏଟ୍ ସିଞ୍ଚନ କରିବାକୁ ପରାମର୍ଶ ଦିଆଯିବା ଉଚିତ।",
            "ଫୁଲକୋବିରେ ଡାଇମଣ୍ଡ ବ୍ୟାକ୍ ମଥ୍ ଆକ୍ରମଣ ପାଇଁ, ସ୍ପିନୋସାଡ୍ 45 ଏସ୍. ସି. @0.5 ମିଲି କିମ୍ବା ଫିପ୍ରୋନିଲ୍ 5 ପ୍ରତିଶତ ଏସ୍. ସି. @2 ମିଲି କିମ୍ବା ନିମ୍ବ ତେଲ @5 ମିଲି ପ୍ରତି ଲିଟର ପାଣି ସିଞ୍ଚନ କରିବାକୁ ପରାମର୍ଶ ଦିଆଯିବା ଉଚିତ।",
            "ଚୋଷୁଥିବା କୀଟ ଆକ୍ରମଣ ବିରୁଦ୍ଧରେ ନିୟମିତ ତଦାରଖ କରିବାକୁ ପରାମର୍ଶ ଦିଆଯିବା ଉଚିତ।",
            "ଫୁଲ ଫୁଟିବା ସମୟରେ ରାସାୟନିକ ପ୍ରୟୋଗରୁ ଦୂରେଇ ରୁହନ୍ତୁ।"
         ]
      },
      "livestock": {
         "advisory": [
            "ପ୍ରଚଳିତ ପାଣିପାଗ ପରିସ୍ଥିତିରେ (ଦିନ ଏବଂ ରାତିର ତାପମାତ୍ରାରେ ବଡ଼ ବ୍ୟବଧାନ) ପଶୁମାନଙ୍କ ଶରୀରର ତାପମାତ୍ରା ବଜାୟ ରଖିବା ପାଇଁ, ସେମାନଙ୍କୁ ଥଣ୍ଡା ସମୟରେ ଶରୀରକୁ ଆଚ୍ଛାଦନ କରିବା ସହିତ ତୈଳ କେକ୍ ଏବଂ ଗୁଡ଼୍ର ମିଶ୍ରଣ ସହିତ ଖାଇବାକୁ ଦେବା ଉଚିତ୍ | ଗର୍ଭବତୀ ପଶୁମାନଙ୍କୁ (> 6 ମାସ) ଅତିରିକ୍ତ ଖାଦ୍ୟ ଦିଆଯିବା ଉଚିତ।",
            "ଏଫ୍. ଏମ୍. ଏଫ୍., ଏଚ୍. ଏସ୍., ବି. କ୍ୟୁ. ଇତ୍ୟାଦି ବିରୁଦ୍ଧରେ ଟୀକାକରଣ ପାଇଁ ପରାମର୍ଶ ଦିଆଯିବା ଉଚିତ। କ୍ଷତିକାରକ କୃମିକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ ପଶୁମାନଙ୍କୁ କୃମି ମୁକ୍ତ କରିବା ପାଇଁ ପରାମର୍ଶ ଦିଆଯାଇଛି।"
         ]
      }
   },
   "date": "31-01-2025"
}