{
   "weather_details": {
      "18-01-2025": {
         "rainfall": 0,
         "t_max": 28,
         "t_min": 15,
         "rh_max": 23,
         "rh_min": 21,
         "wind_speed": 2,
         "wind_direction": 90,
         "cloud_cover": 3
      },
      "19-01-2025": {
         "rainfall": 0,
         "t_max": 28,
         "t_min": 15,
         "rh_max": 21,
         "rh_min": 15,
         "wind_speed": 4,
         "wind_direction": 323,
         "cloud_cover": 2
      },
      "20-01-2025": {
         "rainfall": 0,
         "t_max": 28,
         "t_min": 15,
         "rh_max": 22,
         "rh_min": 15,
         "wind_speed": 5,
         "wind_direction": 53,
         "cloud_cover": 2
      },
      "21-01-2025": {
         "rainfall": 0,
         "t_max": 28,
         "t_min": 15,
         "rh_max": 21,
         "rh_min": 21,
         "wind_speed": 4,
         "wind_direction": 118,
         "cloud_cover": 3
      },
      "22-01-2025": {
         "rainfall": 0,
         "t_max": 29,
         "t_min": 16,
         "rh_max": 22,
         "rh_min": 22,
         "wind_speed": 5,
         "wind_direction": 100,
         "cloud_cover": 2
      }
   },
   "names_of_crops": [
      "ଶୁଖିଲା ଋତୁ ଚାଉଳ",
      "ସୋରିଷ",
      "ଫଳ ଏବଂ ପନିପରିବା ଫସଲ",
      "ପଶୁପାଳନ"
   ],
   "general_advisory": "ଆଇଏମଡି, ମ୍ୟୁନିସିପାଲିଟି କର୍ପୋରେସନ୍, ଭୁବନେଶ୍ୱରର ବର୍ଦ୍ଧିତ ରେଞ୍ଜ ପୂର୍ବାନୁମାନ ଅନୁଯାୟୀ, ଓଡ଼ିଶାର ଜିଲ୍ଲାଗୁଡ଼ିକରେ ଶୁଖିଲା ପାଗ ସହିତ ସ୍ୱାଭାବିକ ଠାରୁ ସର୍ବନିମ୍ନ ତାପମାତ୍ରା ରହିବ ବୋଲି ଆଶା କରାଯାଉଛି। ଫସଲ ଏବଂ ପଶୁମାନଙ୍କୁ ଥଣ୍ଡାରୁ ରକ୍ଷା କରିବା ପାଇଁ କୃଷକମାନଙ୍କୁ ପରାମର୍ଶ ଦିଆଯାଇଛି। କୁହୁଡ଼ି ଦିନ ଏବଂ ଶୀତ ଲହରୀ ସମୟରେ ପଶୁମାନଙ୍କ ଟୀକାକରଣରୁ ଦୂରେଇ ରହିବା ଉଚିତ୍।",
   "crops_data": {
      "dry season rice": {
         "advisory": [
            "ନର୍ସରୀରେ ଆଗାଛାକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ କୃଷକମାନେ ଚାରା ବୁଣିବା ପରେ 3ରୁ 5 ଦିନ ମଧ୍ୟରେ ଏକର ପିଛା 80 ଗ୍ରାମ ପିଛା ପାଇରାଜୋସଲ୍ଫୁରନ୍-ଇଥାଇଲ 10 ପ୍ରତିଶତ ଡବ୍ଲ୍ୟୁ. ପି. ସ୍ପ୍ରେ କରିବା ଉଚିତ କିମ୍ବା 10-12 ଡି. ଏ. ଏସ୍. ରେ ଏକର ପିଛା 120 ମିଲିଲିଟର ପିଛା ବିସ୍ପିରିବାକ୍ ସୋଡ଼ିଅମ ସ୍ପ୍ରେ କରିବା ଉଚିତ।",
            "3 ରୁ 5 ସପ୍ତାହ ପୁରୁଣା ଚାରା ଗୁଡ଼ିକୁ ଭଲ ଭାବରେ କାଦୁଅ ହୋଇଥିବା ମାଟିରେ, 15 ସେ. ମି. x 15 ସେ. ମି. ବ୍ୟବଧାନରେ, ପ୍ରତି ପାହାଡ଼ରେ 3 ରୁ 4 ଚାରା, ଅଗଭୀର ଗଭୀରତାରେ ରୋପଣ କରିବା, ଡିଏପି + ଏମଓପି କିମ୍ବା ୟୁରିଆ + ଏସଏସପି + ଏମଓପିକୁ ମୂଳ ମାତ୍ରା ଭାବରେ ପ୍ରୟୋଗ କରିବା ପାଇଁ ପରାମର୍ଶ ଦିଆଯିବା ଉଚିତ।"
         ]
      },
      "mustard": {
         "advisory": [
            "ସୋରିଷରେ ଏଫିଡ୍ ଆକ୍ରମଣ ପାଇଁ ପ୍ରଚଳିତ ପାଣିପାଗ ପରିସ୍ଥିତି ଅନୁକୂଳ, ଏହି କୀଟ ବିରୁଦ୍ଧରେ ନିୟମିତ ତଦାରଖ କରିବାକୁ ପରାମର୍ଶ ଦିଆଯାଇଛି",
            "ବର୍ତ୍ତମାନ, କେତେକ କ୍ଷେତ୍ରରେ ଏଫିଡ୍ ଆକ୍ରମଣ ପରିଲକ୍ଷିତ ହେଉଛି, ଶୁଖିଲା ପାଗ ସ୍ଥିତିରେ ଏସିଟାମିପ୍ରିଡ୍ କିମ୍ବା ଇମିଡାକ୍ଲୋପ୍ରିଡ୍ ସିଞ୍ଚନ କରିବାକୁ ପରାମର୍ଶ ଦିଆଯିବା ଉଚିତ।"
         ]
      },
      "fruit and vegetable crops": {
         "advisory": [
            "ଆମ୍ବ ଗୁଳ୍ମକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ ଆମ୍ବ ଗଛରେ ପଲିଥିନ୍/ଆଲ୍କାଥେନ୍ ଚାଦରକୁ ଜୋରରେ ବାନ୍ଧି ରଖନ୍ତୁ।",
            "ରୋଗାକ୍ରାନ୍ତ ଏବଂ ଅନାବଶ୍ୟକ ଶାଖା ଏବଂ ପତ୍ର ଗୁଡ଼ିକର ପ୍ରଶିକ୍ଷଣ ଏବଂ ଛାଣିବା ପାଇଁ ପରାମର୍ଶ ଦିଆଯିବା ଉଚିତ।",
            "ଶୀତ ଋତୁରେ ମୃତ୍ତିକାର ଆର୍ଦ୍ରତା ଏବଂ ତାପମାତ୍ରା ବଜାୟ ରଖିବା ପାଇଁ ଷ୍ଟ୍ରା ମଲ୍ଚିଙ୍ଗ ସାମଗ୍ରୀ ଭାବରେ ବ୍ୟବହୃତ ହୋଇପାରେ |",
            "ପରିପକ୍ୱ ଫସଲ ଅମଳ ଏବଂ ଉଦ୍ଭିଦ ବୃଦ୍ଧି ପର୍ଯ୍ୟାୟରେ ଫସଲରେ ଗୋଟିଏ ହାଲୁକା ଜଳସେଚନ ପାଇଁ ପରାମର୍ଶ ଦିଆଯିବା ଉଚିତ।"
         ]
      },
      "livestock": {
         "advisory": [
            "ଶୀତଳ ପବନର ସିଧାସଳଖ ସଂସ୍ପର୍ଶରେ ନ ଆସିବା ପାଇଁ ରାତିରେ ସବୁ ପାର୍ଶ୍ୱରୁ ପଶୁମାନଙ୍କ ଆଶ୍ରୟସ୍ଥଳୀକୁ ଘୋଡାଇ ରଖନ୍ତୁ, ଶୁଖିଲା ନଡ଼ିଆକୁ ପଶୁମାନଙ୍କ ଶଯ୍ୟା ଭାବେ ବ୍ୟବହାର କରନ୍ତୁ।",
            "ଦୁର୍ବଳ ଏବଂ ଅସୁସ୍ଥ ପଶୁମାନଙ୍କୁ ଥଣ୍ଡାରୁ ରକ୍ଷା କରିବା ପାଇଁ ବସ୍ତା କପଡ଼ାରେ ଢାଙ୍କି ରଖିବା ଉଚିତ, ରାତିରେ ସମସ୍ତ ପଶୁମାନଙ୍କୁ ଏକ ଆଚ୍ଛାଦିତ ଆଶ୍ରୟସ୍ଥଳୀରେ ରଖିବା ଉଚିତ।",
            "ପଶୁମାନଙ୍କୁ ଆର୍ଦ୍ର ସ୍ଥାନରେ ରଖିବା ଠାରୁ ଦୂରେଇ ରୁହନ୍ତୁ, ନିମୋନିଆକୁ ରୋକିବା ପାଇଁ ସେମାନଙ୍କୁ ଧୂଆଁରୁ ରକ୍ଷା କରନ୍ତୁ, ପଶୁମାନଙ୍କୁ ତୈଳ କେକ୍ ଏବଂ ଗୁଡ଼ ମିଶ୍ରଣ ସହିତ ଖାଇବାକୁ ଦିଅନ୍ତୁ, ଗର୍ଭବତୀ ପଶୁମାନଙ୍କୁ ଅତିରିକ୍ତ ଖାଦ୍ୟ ଦିଆଯିବା ଉଚିତ |"
         ]
      }
   },
   "date": "17-01-2025"
}