{
   "weather_details": {
      "31-07-2024": {
         "rainfall": 15,
         "t_max": 32,
         "t_min": 27,
         "rh_max": 92,
         "rh_min": 66,
         "wind_speed": 13,
         "wind_direction": 248,
         "cloud_cover": 8
      },
      "01-08-2024": {
         "rainfall": 20,
         "t_max": 30,
         "t_min": 26,
         "rh_max": 93,
         "rh_min": 74,
         "wind_speed": 13,
         "wind_direction": 249,
         "cloud_cover": 8
      },
      "02-08-2024": {
         "rainfall": 15,
         "t_max": 30,
         "t_min": 25,
         "rh_max": 92,
         "rh_min": 73,
         "wind_speed": 17,
         "wind_direction": 248,
         "cloud_cover": 8
      },
      "03-08-2024": {
         "rainfall": 12,
         "t_max": 31,
         "t_min": 25,
         "rh_max": 92,
         "rh_min": 82,
         "wind_speed": 14,
         "wind_direction": 248,
         "cloud_cover": 8
      },
      "04-08-2024": {
         "rainfall": 10,
         "t_max": 32,
         "t_min": 26,
         "rh_max": 92,
         "rh_min": 71,
         "wind_speed": 13,
         "wind_direction": 243,
         "cloud_cover": 7
      }
   },
   "names_of_crops": [
      "ଚାଉଳ",
      "ମକା",
      "କପା",
      "ପନିପରିବା ଫସଲ",
      "ପଶୁପାଳନ"
   ],
   "general_advisory": "ଆଇଏମଡିର ବର୍ଦ୍ଧିତ ରେଞ୍ଜ ପୂର୍ବାନୁମାନ ଅନୁଯାଯ଼ୀ, ବର୍ଷା ସ୍ୱାଭାବିକଠାରୁ ଅଧିକ, 04.08.2024 ରୁ 10.08.2024 ମଧ୍ଯ଼ରେ ଓଡ଼ିଶା ରାଜ୍ଯ଼ରେ ଉଭଯ଼ ସର୍ବାଧିକ ଏବଂ ସର୍ବନିମ୍ନ ତାପମାତ୍ରା ସ୍ୱାଭାବିକ ରହିବ ବୋଲି ଆଶା କରାଯାଉଛି। ସମ୍ଭାବ୍ଯ଼ ବର୍ଷା ସମଯ଼ରେ ଜଳସେଚନ ଏବଂ ସିଞ୍ଚନ କାର୍ଯ୍ଯ଼ରୁ ଦୂରେଇ ରହିବାକୁ କୃଷକମାନଙ୍କୁ ପରାମର୍ଶ ଦିଆଯାଇଛି। ରୋଗ ଏବଂ କୀଟ ଆକ୍ରମଣ ପାଇଁ ଫସଲର ନିଯ଼ମିତ ନିରୀକ୍ଷଣ ସୁପାରିଶ କରାଯାଏ |",
   "crops_data": {
      "rice": {
         "advisory": [
            "ଦିନ ବ୍ଯ଼ବଧାନରେ 7-10 ଦୁଇଥର କ୍ଷେତକୁ କାଦୁଅ କରି ଏବଂ ସମାନ ଫସଲ ଷ୍ଟାଣ୍ଡ ପାଇଁ ଜମି ସମତଳ କରି ମୁଖ୍ଯ଼ କ୍ଷେତ୍ର ଜମି ପ୍ରସ୍ତୁତି କରାଯିବା ଉଚିତ। ପ୍ରାଯ଼ 0.8t/acre ଭଲ ଭାବେ ଅପଘଟିତ ଏଫ୍. ୱାଇ. ଏମ୍. କୁ ପ୍ରଥମ ପୁଡଲିଂ ପୂର୍ବରୁ ପ୍ରଯ଼ୋଗ କରାଯାଇପାରେ। ମୁଖ୍ଯ଼ କ୍ଷେତର ପ୍ରାରମ୍ଭିକ କାଦୁଅ କରିବା ସମଯ଼ରେ ଧାଇଞ୍ଚା ସବୁଜ ସାର ଫସଲକୁ ସାମିଲ କରନ୍ତୁ।",
            "ଅଧିକ ଉତ୍ପାଦନକ୍ଷମ କିସମଗୁଡ଼ିକ ପାଇଁ ଜମି ପ୍ରସ୍ତୁତି ଏବଂ ରୋପଣର ବିଭିନ୍ନ ପର୍ଯ୍ଯ଼ାଯ଼ରେ ନିର୍ଦ୍ଦିଷ୍ଟ ପରିମାଣର ସାର ପ୍ରଯ଼ୋଗ କରାଯାଏ।",
            "25-30 ଦିନର ପୁରୁଣା ଚାରା ରୋପଣ ପୂର୍ବରୁ ପ୍ରସ୍ତୁତ ହୋଇଥିବା କ୍ଷେତରେ ନିର୍ଦ୍ଦିଷ୍ଟ ସ୍ଥାନରେ କରାଯିବା ଉଚିତ। ଶୁଷ୍କ ଋତୁରେ ଭବିଷ୍ଯ଼ତରେ ବ୍ଯ଼ବହାର ପାଇଁ ବର୍ଷାଜଳ ସଞ୍ଚଯ଼ କରିବାକୁ କୃଷକମାନଙ୍କୁ ପରାମର୍ଶ ଦିଆଯାଇଛି।"
         ]
      },
      "maize": {
         "advisory": [
            "ବୁଣିବା ପରେ 15-45 ଦିନ ମଧ୍ଯ଼ରେ ଗୁରୁତ୍ୱପୂର୍ଣ୍ଣ ଆଗାଛା ବୃଦ୍ଧି ଅବଧିକୁ ହସ୍ତଚାଳିତ ହୋଇଂ ଏବଂ ତୃଣନାଶକ ପ୍ରଯ଼ୋଗ ସହିତ ପରିଚାଳନା କରାଯିବା ଉଚିତ୍। ଆଗାମୀ ବର୍ଷା ପୂର୍ବାନୁମାନ କାରଣରୁ ସିଞ୍ଚନ ଏବଂ ଆନ୍ତଃସାଂସ୍କୃତିକ କାର୍ଯ୍ଯ଼ରେ ବିଳମ୍ବ।"
         ]
      },
      "cotton": {
         "advisory": [
            "କ୍ଷେତରୁ ଅତିରିକ୍ତ ଜଳର ଉପଯୁକ୍ତ ନିଷ୍କାସନ ଗୁରୁତ୍ୱପୂର୍ଣ୍ଣ। ପ୍ରଚଳିତ ବର୍ଷା ପରିସ୍ଥିତି ଆଧାରରେ ନାଇଟ୍ରୋଜେନ୍ ସାର ଶୀର୍ଷ ଡ୍ରେସିଙ୍ଗ୍ ଏବଂ ଆନ୍ତଃସାଂସ୍କୃତିକ କାର୍ଯ୍ଯ଼କଳାପକୁ ବିଳମ୍ବ କରନ୍ତୁ।"
         ]
      },
      "vegetable crops": {
         "advisory": [
            "ଉପଯୁକ୍ତ ଡ୍ରେନେଜ୍ ସିଷ୍ଟମ୍ ସହିତ ଉଠାଯାଇଥିବା ଶଯ୍ଯ଼ା ନର୍ସରୀ ପ୍ରସ୍ତୁତି ଆରମ୍ଭ କରନ୍ତୁ | ପ୍ରବଳ ବର୍ଷା ସମଯ଼ରେ ରୋପଣ ଏବଂ ଆନ୍ତଃସାଂସ୍କୃତିକ କାର୍ଯ୍ଯ଼କଳାପରୁ ଦୂରେଇ ରୁହନ୍ତୁ।"
         ]
      },
      "animal husbandry": {
         "advisory": [
            "ବର୍ଷା ଋତୁରେ ପଶୁମାନଙ୍କର କୃମି ନିବାରଣ ଏବଂ ଟୀକାକରଣ ସୁନିଶ୍ଚିତ କରନ୍ତୁ। ସଂକ୍ରାମକ ରୋଗକୁ ରୋକିବା ପାଇଁ ପଶୁମାନଙ୍କୁ ସ୍ୱଚ୍ଛ ପାନୀଯ଼ ଜଳ ଏବଂ ନିରାପଦ ଆଶ୍ରଯ଼ ପ୍ରଦାନ କରନ୍ତୁ।"
         ]
      }
   },
   "date": "30-07-2024"
}