{
   "weather_details": {
      "11-12-2024": {
         "rainfall": 0,
         "t_max": 29,
         "t_min": 18,
         "rh_max": 35,
         "rh_min": 84,
         "wind_speed": 5,
         "wind_direction": 344,
         "cloud_cover": 3
      },
      "12-12-2024": {
         "rainfall": 0,
         "t_max": 29,
         "t_min": 17,
         "rh_max": 31,
         "rh_min": 72,
         "wind_speed": 4,
         "wind_direction": 11,
         "cloud_cover": 1
      },
      "13-12-2024": {
         "rainfall": 0,
         "t_max": 28,
         "t_min": 16,
         "rh_max": 27,
         "rh_min": 69,
         "wind_speed": 4,
         "wind_direction": 27,
         "cloud_cover": 0
      },
      "14-12-2024": {
         "rainfall": 0,
         "t_max": 28,
         "t_min": 15,
         "rh_max": 23,
         "rh_min": 62,
         "wind_speed": 4,
         "wind_direction": 7,
         "cloud_cover": 0
      },
      "15-12-2024": {
         "rainfall": 0,
         "t_max": 28,
         "t_min": 14,
         "rh_max": 21,
         "rh_min": 59,
         "wind_speed": 5,
         "wind_direction": 6,
         "cloud_cover": 1
      }
   },
   "names_of_crops": [
      "ଚାଉଳ",
      "ସବୁଜ ଚଣା/କଳା ଚଣା",
      "ଚିନାବାଦାମ",
      "କୋଲେ ଫସଲ",
      "ପଶୁପାଳନ",
      "କୁକୁଡ଼ା ମାଂସ"
   ],
   "general_advisory": "ଆଇଏମଡି, ମ୍ୟୁନିସିପାଲିଟି କର୍ପୋରେସନ୍, ଭୁବନେଶ୍ୱରର ମଧ୍ୟମ ରେଞ୍ଜ୍ ପାଣିପାଗ ପୂର୍ବାନୁମାନ ଅନୁଯାୟୀ, ଆଗାମୀ ସପ୍ତାହରେ ବର୍ଷା ହେବାର କୌଣସି ସମ୍ଭାବନା ନାହିଁ ଏବଂ ସେହି ସମୟରେ ଆକାଶ ସ୍ୱଚ୍ଛରୁ ଆଂଶିକ ସ୍ୱଚ୍ଛ ହେବାର ସମ୍ଭାବନା ରହିଛି। ଏହି ସପ୍ତାହରେ ସର୍ବାଧିକ ଏବଂ ସର୍ବନିମ୍ନ ତାପମାତ୍ରା ଯଥାକ୍ରମେ 28-29 °C ଏବଂ 14-18 °C ମଧ୍ୟରେ ରହିବାର ସମ୍ଭାବନା ରହିଛି। ସର୍ବାଧିକ ଏବଂ ସର୍ବନିମ୍ନ ଆପେକ୍ଷିକ ଆର୍ଦ୍ରତା ଯଥାକ୍ରମେ 59-84% ଏବଂ 21-35% ମଧ୍ୟରେ ଭିନ୍ନ ହୋଇପାରେ। ଆଗାମୀ ଦିନରେ ଘଣ୍ଟାପ୍ରତି 4 ରୁ 5 କିଲୋମିଟର ବେଗରେ ଉତ୍ତର-ପୂର୍ବ ଏବଂ ଉତ୍ତର-ପଶ୍ଚିମ ପବନ ବହିବାର ପୂର୍ବାନୁମାନ କରାଯାଇଛି। ଆଗାମୀ ଦିନରେ ଶୁଖିଲା ପାଗକୁ ଦୃଷ୍ଟିରେ ରଖି କୃଷକମାନଙ୍କୁ ସେମାନଙ୍କ ପରିପକ୍ୱ ଫସଲ ଅମଳ କରିବାକୁ ଏବଂ ସେହି ସମୟରେ ସିଞ୍ଚନ କାର୍ଯ୍ୟ କରିବାକୁ ପରାମର୍ଶ ଦିଆଯାଇଛି। କୃଷକମାନଙ୍କୁ ପରାମର୍ଶ ଦିଆଯାଇଛି ଯେ ସେମାନେ ସୋରିଷ, ଚଣା, ଚିନାବାଦାମ, ସବୁଜ ଚଣା/କଳା ଚଣା ଇତ୍ୟାଦି ରବି ଫସଲର ବୁଣିବା ସମ୍ପୂର୍ଣ୍ଣ କରନ୍ତୁ ଏବଂ ଜଳସେଚନ ସୁବିଧା ଉପଲବ୍ଧ ଥିବା ସ୍ଥାନରେ ରବି ଧାନର ନର୍ସରୀ ବୁଣିବା ପାଇଁ ଜମି ପ୍ରସ୍ତୁତି ଆରମ୍ଭ କରନ୍ତୁ। ରୋଗ ପ୍ରତିରୋଧକ ଶକ୍ତି ବୃଦ୍ଧି କରିବା ଏବଂ କୌଣସି କ୍ଷତିକାରକ ରୋଗରୁ ରକ୍ଷା କରିବା ପାଇଁ ପଶୁମାନଙ୍କୁ କୃମି ଦୂରୀକରଣ ଏବଂ ଟୀକାକରଣ ପରାମର୍ଶ ଦିଆଯିବା ଉଚିତ।",
   "crops_data": {
      "rice": {
         "advisory": [
            "ଆଗାମୀ ଦିନରେ କୌଣସି ବର୍ଷା ହେବାର ସମ୍ଭାବନା ନାହିଁ ତେଣୁ କୃଷକମାନଙ୍କୁ ଅମଳ କାର୍ଯ୍ୟ କରିବାକୁ ଏବଂ ଅଧିକ କ୍ଷତି ଏଡ଼ାଇବା ପାଇଁ ଅମଳ ହୋଇଥିବା ଧାନ ଫସଲକୁ ସୁରକ୍ଷିତ ସ୍ଥାନରେ ରଖିବା ପାଇଁ ବ୍ୟବସ୍ଥା କରିବାକୁ ପରାମର୍ଶ ଦିଆଯାଇଛି।",
            "ଅମଳ ପରେ ଧାନକୁ 2ରୁ 3 ଦିନ ପାଇଁ କ୍ଷେତରେ ଶୁଖାଇବା ଉଚିତ ଏବଂ ତା 'ପରେ ଅମଳ କରିବା ଉଚିତ। ଚାଉଳ 12 ପ୍ରତିଶତ ଆର୍ଦ୍ରତା ସ୍ତରରେ ସୁରକ୍ଷିତ ସ୍ଥାନରେ ରଖିବା ଉଚିତ।",
            "ବିଳମ୍ବରେ ପରିପକ୍ୱ ହେଉଥିବା ଧାନ କିସମର ମିଥ୍ୟା ରୋଗ ସଂକ୍ରମଣ ପାଇଁ ପ୍ରଚଳିତ ପାଣିପାଗ ସ୍ଥିତି ଅନୁକୂଳ, ତେଣୁ ଏହାର ନିୟମିତ ତଦାରଖ ପାଇଁ ପରାମର୍ଶ ଦିଆଯିବା ଉଚିତ। ଯଦି ସଂକ୍ରମଣ ଲକ୍ଷ୍ୟ କରାଯାଏ, ତେବେ ଆକାଶ ସ୍ୱଚ୍ଛ ଥିବାବେଳେ କପର୍ ହାଇଡ୍ରୋକ୍ସାଇଡ୍ 77 ପ୍ରତିଶତ @2 ଗ୍ରାମ୍/ଲିଟର କିମ୍ବା ଟେବୁକୋନାଜୋଲ୍ 25 ପ୍ରତିଶତ @2 ଗ୍ରାମ୍/ଲିଟର ସିଞ୍ଚନ କରିବାକୁ ପରାମର୍ଶ ଦିଆଯିବା ଉଚିତ। ଏହାର ପ୍ରଭାବଶାଳୀ ନିୟନ୍ତ୍ରଣ ପାଇଁ 7-10 ଦିନ ପରେ ସ୍ପ୍ରେକୁ ପୁନରାବୃତ୍ତି କରନ୍ତୁ।"
         ]
      },
      "green gram/black gram": {
         "advisory": [
            "ଆଗାମୀ ସପ୍ତାହରେ ସବୁଜ ଚଣା/କଳା ଚଣା ବୁଣିବା ସମ୍ପୂର୍ଣ୍ଣ କରିବାକୁ କୃଷକମାନଙ୍କୁ ପରାମର୍ଶ ଦିଆଯାଇଛି।",
            "ବୁଣିବାର ଏକ ସପ୍ତାହ ପୂର୍ବରୁ, ପ୍ରତି କିଲୋଗ୍ରାମ ମଞ୍ଜି ପିଛା କାର୍ବେନଡାଜିମ୍ @1.5-2.0g ଏବଂ ଇମିଡାକ୍ଲୋପ୍ରିଡ୍ @5 ଗ୍ରାମ୍ ସହିତ ମଞ୍ଜି ଚିକିତ୍ସା କରାଯିବା ଉଚିତ। ଏହି ଚିକିତ୍ସାର ସାତ ଦିନ ପରେ, 200 ଗ୍ରାମ୍ ରିଜୋବିୟମ୍ କଲ୍ଚର ଏବଂ 3-4 ଗ୍ରାମ୍ ସୋଡ଼ିଅମ୍ ମଲିବଡେଟ୍ 10 କି. ଗ୍ରା. ମଞ୍ଜି ସହିତ 400 ମିଲି. ପାଣିରେ ମିଶାଇ ଭଲ ଭାବେ ମିଶାଇ ଛାୟାରେ ଅଧା ଘଣ୍ଟା ଶୁଖାନ୍ତୁ, ତା 'ପରେ କ୍ଷେତରେ ବୁଣିବା ପାଇଁ ଯାଆନ୍ତୁ। 30 ସେ. ମି. × 10 ସେ. ମି. ବ୍ୟବଧାନରେ ପ୍ରତି ଏକରରେ 8-10 କି. ଗ୍ରା. ହାରରେ ବୀଜ ବୁଣିବା ଉଚିତ।",
            "ପ୍ରକାରଃ ସବୁଜ ଗ୍ରାମଃ-କାମଦେବ, ଦୁର୍ଗା, ଆଇ. ପି. ଏମ୍. 02-3, ଆଇ. ପି. ଏମ୍. 02-14, ଟି. ଏ. ଆର୍. ଏମ୍. 1। ବ୍ଲାକ୍ ଗ୍ରାମ୍ଃ-ପ୍ରସାଦ, ଉସାଲା, ପି. ୟୁ. 31, ଆଇ. ପି. ୟୁ. 2-43, ମାହୁରୀ"
         ]
      },
      "groundnut": {
         "advisory": [
            "ଯେଉଁ କୃଷକମାନେ ଏପର୍ଯ୍ୟନ୍ତ ମଞ୍ଜି ବୁଣିନାହାନ୍ତି, ସେମାନେ ଉନ୍ନତ ଚିନାବାଦାମ କିସମ ଯଥା ଟିଏଜି-24, ଜେଏଲ-24, ଗିରନାର-3, ସ୍ମୃତି, ଟିଜି-3, ଟିଜି-22, କାଦ୍ରି-5, କାଦ୍ରି-6, କାଦ୍ରି-9, ଟିପିଜି-41, ଜିପିବିଡି-4, ଦେବୀ, ସିଓ-7, ଧରଣୀ ଏବଂ ଦିବ୍ୟା ଇତ୍ୟାଦି ବ୍ୟବହାର କରିପାରିବେ। ଏହି ସମସ୍ତ କିସମ 100 ରୁ 130 ଦିନ ମଧ୍ୟରେ ଅମଳ କରାଯାଏ |",
            "ମଞ୍ଜି ବୁଣିବା ପୂର୍ବରୁ ମଞ୍ଜି ଚିକିତ୍ସା ସୁନିଶ୍ଚିତ କରନ୍ତୁ ଏବଂ ଯଦି ସମ୍ଭବ, ଚିକିତ୍ସାର 7 ଦିନ ପରେ ବ୍ୟାକ୍ଟେରିଆ କିମ୍ବା ଫସଫୋ କଲ୍ଚର ସହିତ ଚିକିତ୍ସା କରନ୍ତୁ। 10 କିଲୋଗ୍ରାମ ମଞ୍ଜି ପାଇଁ ଜଣେ କୃଷକ ବୁଣିବା 3 ଘଣ୍ଟା ମଧ୍ୟରେ 200 ଗ୍ରାମ ରାଇଜୋବିୟମ କଲ୍ଚର ଏବଂ 200 ଗ୍ରାମ ଫସଫୋ କଲ୍ଚର ବ୍ୟବହାର କରିପାରିବେ। ଏକର ପିଛା 40 ରୁ 50 କିଲୋଗ୍ରାମ ମଞ୍ଜି କିମ୍ବା 60 ରୁ 70 କିଲୋଗ୍ରାମ ମଞ୍ଜି ଆବଶ୍ୟକ ହୁଏ। ଖୋଳ ବୋହିବାର 2ରୁ 3 ଦିନ ମଧ୍ୟରେ 5 ସେ. ମି. ଗଭୀରତାରେ ମଞ୍ଜି ବୁଣିବା ଉଚିତ।",
            "ଯଦି ଚାରା 10 ଦିନ ପୁରୁଣା ହୋଇଥାଏ, ତେବେ ଯେଉଁ ସ୍ଥାନରେ ଚାରା ବାହାରି ନାହିଁ, ସେହି ସ୍ଥାନରେ ଶୂନ୍ୟସ୍ଥାନ ପୂରଣ କରିବା ପାଇଁ ପରାମର୍ଶ ଦିଆଯାଏ।"
         ]
      },
      "cole crop": {
         "advisory": [
            "ରୋପଣ ସମୟରେ, ପଲିଥିନକୁ ମଲ୍ଚିଙ୍ଗ ସାମଗ୍ରୀ ଭାବରେ ବ୍ୟବହାର କରାଯାଇପାରିବ କିମ୍ବା ଯଦି ପୂର୍ବରୁ କରାଯାଇଥିବା ନଡ଼ିଆ ରୋପଣ ଆର୍ଦ୍ରତା ତଥା ପନିପରିବା ଫସଲର ମୃତ୍ତିକା ତାପମାତ୍ରା ବଜାୟ ରଖିବା ପାଇଁ ସମାନ ଉଦ୍ଦେଶ୍ୟରେ ବ୍ୟବହାର କରାଯାଇପାରିବ |",
            "ଫୁଲକୋବିରେ ଡାଇମଣ୍ଡ ବ୍ୟାକ୍ ମଥ୍ର ଆକ୍ରମଣ ବିରୁଦ୍ଧରେ ନିୟମିତ ତଦାରଖ କରିବାକୁ ପରାମର୍ଶ ଦିଆଯିବା ଉଚିତ ଏବଂ ଯଦି ସମ୍ଭବ, କୃଷକମାନେ ଏହି ଉଦ୍ଦେଶ୍ୟରେ କ୍ଷେତରେ ଏକ ଫେରୋମୋନ୍ ଟ୍ରାପ୍ ବ୍ୟବହାର କରିବା ଉଚିତ୍ |",
            "ଯଦି ଆକ୍ରମଣ ପରିଲକ୍ଷିତ ହୁଏ, ତେବେ ବର୍ଷା ହେବା ପରେ ନିମ୍ବ ତେଲ ଲିଟର ପିଛା 5 ମିଲି କିମ୍ବା ଇମାମେକ୍ଟିନ୍ ବେନ୍ଜୋଏଟ୍ ଲିଟର ପିଛା 0.40 ଗ୍ରାମ୍ ସିଞ୍ଚନ କରିବା ଉଚିତ।"
         ]
      },
      "livestock": {
         "advisory": [
            "ଶୀତ ଋତୁରେ ପଶୁମାନଙ୍କୁ ଥଣ୍ଡାରୁ ରକ୍ଷା କରିବା ପାଇଁ କୃଷକମାନେ ବ୍ୟବସ୍ଥା କରିବା ଉଚିତ (ଯଦି ସମ୍ଭବ ପଶୁମାନଙ୍କୁ ଆଚ୍ଛାଦନ କରିବା ପାଇଁ ଝୋଟ ବ୍ୟାଗ ଏବଂ ଶଯ୍ୟା ସାମଗ୍ରୀ ଭାବରେ ନଡ଼ିଆ ବ୍ୟବହାର କରନ୍ତୁ) ଏବଂ ଗୋରୁମାନଙ୍କୁ ସ୍ୱଚ୍ଛ ପାନୀୟ ଜଳ ଯୋଗାଇବା ଏବଂ ସେମାନଙ୍କ ଛପର ସଫା ରଖିବା ଉଚିତ। ସେଡ୍ ଚାରିପାଖରେ ପରିସ୍ରା କିମ୍ବା ମଳମୂତ୍ର ଜମା ହେବାକୁ ଦିଅନ୍ତୁ ନାହିଁ ଯାହା ମାଛି ସୃଷ୍ଟି କରିପାରେ ଏବଂ ସେଡ୍ ଭିତରକୁ ବର୍ଷା ଜଳ ପ୍ରବେଶକୁ ସୀମିତ କରିବାର ବ୍ୟବସ୍ଥା କରନ୍ତୁ |",
            "ବିଭିନ୍ନ କ୍ଷତିକାରକ ରୋଗ ଏବଂ ପାକସ୍ଥଳୀ କୃମିକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ ଟୀକାକରଣ ଏବଂ କୃମି ଦୂରୀକରଣ କରାଯିବା ଉଚିତ।"
         ]
      },
      "poultry": {
         "advisory": [
            "ଶୁଦ୍ଧ ବାୟୁ ଯୋଗାଇବା ଏବଂ ଘର ଭିତରେ ଥିବା ଗ୍ୟାସଗୁଡ଼ିକୁ ବାହାର କରିବା ପାଇଁ ଉପଯୁକ୍ତ ବାୟୁ ସଞ୍ଚାରଣର ଆବଶ୍ୟକତା ରହିଛି।",
            "କୁକୁଡ଼ା ପାଳିକୁ ଗରମ ଏବଂ ଶୁଖିଲା ରଖିବା ପାଇଁ ବାହ୍ୟ ଉତ୍ତାପ ଉତ୍ସ ଯୋଗାଇ ଦିଆଯାଏ | କ୍ଷେତକୁ ସୁରକ୍ଷିତ ରଖିବା ପାଇଁ ବିଭିନ୍ନ ପ୍ରକାରର ପରଦା ଏବଂ ଝୋଟ ବସ୍ତା ବ୍ୟବହାର କରାଯାଇଥାଏ।",
            "ଜଳ ଗ୍ରହଣକୁ ପ୍ରୋତ୍ସାହିତ କରିବା ପାଇଁ ପାନୀୟ ଜଳକୁ ଉପଯୁକ୍ତ ତାପମାତ୍ରାରେ ବଜାୟ ରଖିବା ଉଚିତ୍।"
         ]
      }
   },
   "date": "10-12-2024"
}