{
    "weather_details": {
        "07-09-2024": {
            "rainfall": 5,
            "t_max": 35,
            "t_min": 27,
            "rh_max": 87,
            "rh_min": 52,
            "wind_speed": 6,
            "wind_direction": 202,
            "cloud_cover": 7
        },
        "08-09-2024": {
            "rainfall": 10,
            "t_max": 34,
            "t_min": 26,
            "rh_max": 92,
            "rh_min": 58,
            "wind_speed": 6,
            "wind_direction": 289,
            "cloud_cover": 7
        },
        "09-09-2024": {
            "rainfall": 20,
            "t_max": 32,
            "t_min": 25,
            "rh_max": 93,
            "rh_min": 61,
            "wind_speed": 7,
            "wind_direction": 248,
            "cloud_cover": 7
        },
        "10-09-2024": {
            "rainfall": 30,
            "t_max": 30,
            "t_min": 25,
            "rh_max": 95,
            "rh_min": 61,
            "wind_speed": 8,
            "wind_direction": 252,
            "cloud_cover": 8
        },
        "11-09-2024": {
            "rainfall": 15,
            "t_max": 30,
            "t_min": 25,
            "rh_max": 94,
            "rh_min": 71,
            "wind_speed": 11,
            "wind_direction": 248,
            "cloud_cover": 8
        }
    },
    "names_of_crops": [
        "ଚାଉଳ",
        "କପା",
        "ପନିପରିବା ଫସଲ",
        "କଦଳୀ"
    ],
    "general_advisory": "ଆଗାମୀ ଦିନରେ ବଜ୍ରପାତ ଏବଂ ବଜ୍ରପାତ ସହିତ ଗୋଟିଏ କିମ୍ବା ଦୁଇଟି ସ୍ଥାନରେ ପ୍ରବଳ ବର୍ଷା ସହିତ ହାଲୁକା ରୁ ମଧ୍ୟମ ବର୍ଷା ହେବାର ସମ୍ଭାବନା ରହିଛି, ତେଣୁ କୃଷକମାନଙ୍କୁ ଜଳସେଚନ ପାଇଁ କିଛି ଦିନ ଅପେକ୍ଷା କରିବାକୁ ପରାମର୍ଶ ଦିଆଯାଇଛି ଏବଂ ଏହା ପୂର୍ବରୁ ସିଞ୍ଚନ କାର୍ଯ୍ୟ କରାଯିବା ଉଚିତ ଏବଂ ସେମାନଙ୍କ ପଶୁମାନଙ୍କୁ କୌଣସି ବୈଦ୍ୟୁତିକ ଉପକରଣରୁ ଦୂରରେ ରଖିବା ଉଚିତ। ପ୍ରଚଳିତ ପାଣିପାଗ ସ୍ଥିତି ବିଭିନ୍ନ ରୋଗ ଏବଂ ବିଭିନ୍ନ ଫସଲରେ କୀଟପତଙ୍ଗ ଆକ୍ରମଣ ପାଇଁ ଅନୁକୂଳ, ତେଣୁ ଏହାର ନିୟମିତ ତଦାରଖ ପାଇଁ ପରାମର୍ଶ ଦିଆଯିବା ଉଚିତ।",
    "crops_data": {
        "rice": {
            "advisory": [
                "ଯଦି ବର୍ଷା ହୋଇନଥାଏ, ତେବେ ଧାନ କ୍ଷେତରେ 5 ସେ. ମି. ଜଳ ସ୍ତର ବଜାୟ ରଖିବା ପାଇଁ କୃଷକମାନେ ଏହି ପର୍ଯ୍ୟାୟରେ ଗୋଟିଏ ଜଳସେଚନ କରିବା ଉଚିତ।",
                "ବର୍ଷା ପରେ ଧାନ କ୍ଷେତରେ ଶୀଥ୍ ବ୍ଲାଇଟ୍ ଏବଂ ଶୀଥ୍ ରଟ୍ ରୋଗର ସଂକ୍ରମଣ ହେବାର ସମ୍ଭାବନା ଥାଏ, ତେଣୁ ଏହି ରୋଗକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ କୃଷକମାନେ ଟ୍ରାଇଫ୍ଲୋକ୍ସିସ୍ଟ୍ରୋବିନ୍ 25 ପ୍ରତିଶତ + ଟେବୁକୋନାଜୋଲ୍ 50 ପ୍ରତିଶତ ଡବ୍ଲୁଜି @80 ଗ୍ରାମ୍ କିମ୍ବା ପ୍ରୋପିକୋନାଜୋଲ୍ 25 ପ୍ରତିଶତ @200 ମିଲି କିମ୍ବା ହେକ୍ଟର ପିଛା 200 ଲିଟର ପାଣିରେ ହେକ୍ସାକୋନାଜୋଲ୍ 5 ପ୍ରତିଶତ ଏସ୍ସି @250 ମିଲି ସ୍ପ୍ରେ କରିବା ଉଚିତ୍। 7-10 ଦିନ ବ୍ୟବଧାନରେ ସ୍ପ୍ରେକୁ ପୁନରାବୃତ୍ତି କରନ୍ତୁ।",
                "କାଣ୍ଡ ଛେଦକ ଏବଂ ପତ୍ର ଫୋଲଡର ସଂକ୍ରମଣ ଉପରେ ନଜର ରଖିବା ପାଇଁ ଧାନ କ୍ଷେତରେ ଏକର ପିଛା 3ଟି ଫେରୋମୋନ୍ ଫାନ୍ଦ ରଖନ୍ତୁ। ଯେତେବେଳେ ପୁରୁଷ ପତଙ୍ଗ/ଫାନ୍ଦ ସଂଖ୍ୟା 4 କିମ୍ବା 5ରେ ପହଞ୍ଚେ, ସେତେବେଳେ ଆଜାଦିରାକ୍ଟିନ 0.15% ଇସି @ଏକର ପିଛା 800 ମିଲି କିମ୍ବା କ୍ଲୋରାଣ୍ଟ୍ରାନିଲିପ୍ରୋଲେ 0.4% ଜିଆର @ଏକର ପିଛା 4 କେଜି ବାଲିରେ 1:1 ଅନୁପାତରେ ମିଶାଇ ଲଗାନ୍ତୁ କିମ୍ବା ଆକାଶ ସଫା ଥିବା ସମୟରେ 200 ଲିଟର ପାଣିରେ କ୍ଲୋରାଣ୍ଟ୍ରାନିଲିପ୍ରୋଲେ 18.5% ଏସସି @ଏକର ପିଛା 60 ମିଲି ସ୍ପ୍ରେ କରନ୍ତୁ।",
                "ଅଧିକ ଆର୍ଦ୍ରତା ସହିତ ମେଘୁଆ ପାଗ ଧାନ କ୍ଷେତରେ ପିତ୍ତ ମିଜ୍ ଆକ୍ରମଣକୁ ସମର୍ଥନ କରେ ଏବଂ ପ୍ରାୟତଃ ବିଳମ୍ବରେ ବୁଣାଯାଇଥିବା ଫସଲରେ ଦେଖାଯାଏ | ଏହାର ନିୟନ୍ତ୍ରଣ ପାଇଁ କୃଷକମାନେ ସ୍ୱଚ୍ଛ ଏବଂ ଶାନ୍ତ ପାଣିପାଗ ସ୍ଥିତିରେ ଏକର ପିଛା 200 ଲିଟର ପାଣିରେ ଥାଇମେଥୋକ୍ସାମ୍ 25 ପ୍ରତିଶତ ଡବ୍ଲୁଜି @40 ଗ୍ରାମ୍ କିମ୍ବା ଫିପ୍ରୋନିଲ୍ 5 ପ୍ରତିଶତ ଏସ୍ସି @400 ମିଲି କିମ୍ବା କ୍ଲୋରୋପାଇରିଫସ୍ 20 ଇସି @500 ମିଲି ସିଞ୍ଚନ କରିବା ଉଚିତ।"
            ]
        },
        "cotton": {
            "advisory": [
                "କପା ଫସଲରେ ଫୁଲ ହ୍ରାସକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ, ବିହନ ବୁଣିବା ପରେ 60-65 ଦିନ ପରେ ଏକର ପିଛା 200 ଲିଟର ପାଣିରେ 90 ମିଲି ପ୍ଲାନୋଫିକ୍ସ ଲଗାନ୍ତୁ।",
                "କପା ଫସଲରେ ଶୋଷକ କୀଟ (ଏଫିଡ୍, ଥ୍ରିପ୍ ଇତ୍ୟାଦି) ଆକ୍ରମଣକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ, ନିମ୍ ଆଧାରିତ କୀଟନାଶକ ଯେପରିକି ନିମ୍ ତେଲ @600-800 ମିଲି + 200 ଗ୍ରାମ୍ ଡିଟର୍ଜେଣ୍ଟ୍ ପାଉଡରକୁ ଏକର ପିଛା 200 ଲିଟର ପାଣିରେ ମିଶାଇ 30-45 ଦିନ ଫସଲ ପର୍ଯ୍ୟାୟରେ ସଫା ପାଗରେ ବ୍ୟବହାର କରିବା ଉଚିତ।",
                "ଫୁଲ ଫୁଟିବାର ପ୍ରାରମ୍ଭିକ ପର୍ଯ୍ୟାୟରେ କୃଷକମାନେ କପା ଫସଲରେ କୌଣସି ରାସାୟନିକ ପ୍ରୟୋଗରୁ ଦୂରେଇ ରହିବା ଉଚିତ୍।"
            ]
        },
        "vegetable crops": {
            "advisory": [
                "ଯଦି ଶୋଷକ କୀଟ ଆକ୍ରମଣ ଲକ୍ଷ୍ୟ କରାଯାଏ, ତେବେ ଥାଇମେଥୋକ୍ସାମ୍ @0.20 ଗ୍ରାମ୍ କିମ୍ବା ଇମିଡାକ୍ଲୋପ୍ରିଡ୍ @0.33 ମିଲି ଲିଟର ପ୍ରତି ପାଣି ସିଞ୍ଚନ କରିବାକୁ ପରାମର୍ଶ ଦିଆଯିବା ଉଚିତ।",
                "ୱିଲ୍ଟ, ରୁଟ୍ ରଟ୍ ଇତ୍ୟାଦି କେତେକ ରୋଗକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ କୃଷକମାନେ ବିନା ବର୍ଷା ଅବସ୍ଥାରେ ଲିଟର ପିଛା 2 ଗ୍ରାମ୍ କାର୍ବେନଡାଜିମ୍ କିମ୍ବା 3 ମିଲି ଲିଟର କପର୍ ଅକ୍ସିକୋରାଇଡ୍ ବ୍ୟବହାର କରିବା ଉଚିତ।"
            ]
        },
        "banana": {
            "advisory": [
                "ପ୍ରଚଳିତ ପାଣିପାଗ ସ୍ଥିତି କଦଳୀ ଗଛରେ ଥ୍ରୀପ୍ ଆକ୍ରମଣ ପାଇଁ ଅନୁକୂଳ, ତେଣୁ ପ୍ରାରମ୍ଭିକ ପର୍ଯ୍ୟାୟରେ ଢାଙ୍କୁଣି କିମ୍ବା ବଣ୍ଡିଲ୍କୁ ଝୋଟ ବ୍ୟାଗରେ ଆବୃତ କରନ୍ତୁ, କ୍ଷେତ୍ରଟି ଆଗାଛା ମୁକ୍ତ ହେବା ଉଚିତ ଏବଂ ଏହି କୀଟକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ ଏକର ପିଛା 15-20 ନମ୍ବର ନୀଳ ଷ୍ଟିକ୍ କାର୍ଡ ବ୍ୟବହାର କରିବାକୁ ପରାମର୍ଶ ଦିଆଯିବା ଉଚିତ। ରାସାୟନିକ ନିୟନ୍ତ୍ରଣ ପାଇଁ, ଲିଟର ପିଛା 2 ଗ୍ରାମ୍ (15 ଦିନ ବ୍ୟବଧାନରେ ଦୁଇଥର) ରେ 50 ପ୍ରତିଶତ ଡବ୍ଲ୍ୟୁ. ପି. ଡାଏଫେନ୍ଥିଓରନ୍ ସିଞ୍ଚନ କରିବା ଉଚିତ।"
            ]
        }
    },
    "date": "06-09-2024"
}