{
   "weather_details": {
      "28-12-2024": {
         "rainfall": 0,
         "t_max": 29,
         "t_min": 18,
         "rh_max": 36,
         "rh_min": 79,
         "wind_speed": 5,
         "wind_direction": 69,
         "cloud_cover": 1
      },
      "29-12-2024": {
         "rainfall": 5,
         "t_max": 28,
         "t_min": 17,
         "rh_max": 39,
         "rh_min": 77,
         "wind_speed": 4,
         "wind_direction": 0,
         "cloud_cover": 6
      },
      "30-12-2024": {
         "rainfall": 5,
         "t_max": 28,
         "t_min": 16,
         "rh_max": 45,
         "rh_min": 82,
         "wind_speed": 4,
         "wind_direction": 18,
         "cloud_cover": 5
      },
      "31-12-2024": {
         "rainfall": 0,
         "t_max": 28,
         "t_min": 15,
         "rh_max": 37,
         "rh_min": 80,
         "wind_speed": 6,
         "wind_direction": 5,
         "cloud_cover": 2
      },
      "01-01-2025": {
         "rainfall": 0,
         "t_max": 29,
         "t_min": 14,
         "rh_max": 31,
         "rh_min": 77,
         "wind_speed": 5,
         "wind_direction": 355,
         "cloud_cover": 1
      }
   },
   "names_of_crops": [
      "ଖରିଫ ଚାଉଳ",
      "ଗ୍ରୀଷ୍ମକାଳୀନ ଚାଉଳ",
      "ମାଟି ବାଦାମ",
      "କୋଲେ ଫସଲ",
      "ପଶୁପାଳନ",
      "କୁକୁଡ଼ା ମାଂସ"
   ],
   "general_advisory": "ସେହି ଅନୁଯାୟୀ ଅମଳ, ବୁଣିବା ଏବଂ ସିଞ୍ଚନ କାର୍ଯ୍ୟ କରିବାକୁ କୃଷକମାନଙ୍କୁ ପରାମର୍ଶ ଦିଆଯାଇଛି। ସେମାନେ ଫସଲ ଏବଂ ପଶୁମାନଙ୍କୁ ଥଣ୍ଡାରୁ ରକ୍ଷା କରିବା ପାଇଁ ଉପଯୁକ୍ତ ଯତ୍ନ ନେବା ଉଚିତ୍। ସୋରିଷ, ତିଲ, ଚଣା, ଚିନାବାଦାମ ଭଳି ରବି ଫସଲର ବୁଣିବା ସମ୍ପୂର୍ଣ୍ଣ କରନ୍ତୁ ଏବଂ ଯେଉଁଠାରେ ଜଳସେଚନ ସୁବିଧା ଉପଲବ୍ଧ, ସେଠାରେ ଗ୍ରୀଷ୍ମକାଳୀନ ଧାନର ନର୍ସରୀ ବୁଣିବା ଆରମ୍ଭ କରନ୍ତୁ।",
   "crops_data": {
      "kharif rice": {
         "advisory": [
            "ଆଗାମୀ ଦିନର ପ୍ରଥମାର୍ଦ୍ଧରେ କିଛି ବର୍ଷା ହେବାର ସମ୍ଭାବନା ରହିଛି, ତେଣୁ କୃଷକମାନଙ୍କୁ ଅମଳ କାର୍ଯ୍ୟ ପାଇଁ ଅପେକ୍ଷା କରିବାକୁ ଏବଂ ଅମଳ ହୋଇଥିବା ଧାନ ଫସଲକୁ ସୁରକ୍ଷିତ ଭାବରେ ସଂରକ୍ଷଣ କରିବାକୁ ପରାମର୍ଶ ଦିଆଯାଇଛି।"
         ]
      },
      "summer rice": {
         "advisory": [
            "ଗ୍ରୀଷ୍ମ ଋତୁ ଧାନ ଚାଷ ପାଇଁ କୃଷକମାନେ କ୍ଷେତ ପ୍ରସ୍ତୁତି ଆରମ୍ଭ କରିବା ଉଚିତ ଏବଂ ଏମ୍ଟିୟୁ 1010, ଏମ୍ଟିୟୁ 1156, ଏମ୍ଟିୟୁ 1001 ଇତ୍ୟାଦି ଉନ୍ନତ କିସମର ଚୟନ କରିବା ଉଚିତ।"
         ]
      },
      "ground nut": {
         "advisory": [
            "ଅନୁକୂଳ ପାଣିପାଗ କାରଣରୁ ଚିନାବାଦାମ ଫସଲରେ କୀଟ ଆକ୍ରମଣ ଉପରେ ନିୟମିତ ନଜର ରଖନ୍ତୁ।",
            "ଆକ୍ରମଣ କ୍ଷେତ୍ରରେ ସ୍ପ୍ରେ କରିବା ପାଇଁ ଆଜାଦିରାକ୍ଟିନ କିମ୍ବା ନିମ-ଆଧାରିତ କୀଟନାଶକ ବ୍ୟବହାର କରନ୍ତୁ।",
            "ଆଶା କରାଯାଉଥିବା ବର୍ଷା କାରଣରୁ ଜଳସେଚନ ଏବଂ ସିଞ୍ଚନ କାର୍ଯ୍ୟ ପାଇଁ ଅପେକ୍ଷା କରନ୍ତୁ।"
         ]
      },
      "cole crop": {
         "advisory": [
            "ମାଟିର ଆର୍ଦ୍ରତା ଏବଂ ତାପମାତ୍ରା ବଜାୟ ରଖିବା ପାଇଁ ପନିପରିବା ଫସଲରେ ମଲ୍ଚିଙ୍ଗ ସାମଗ୍ରୀ ଭାବରେ ଷ୍ଟ୍ରା ବ୍ୟବହାର କରନ୍ତୁ |",
            "ଫୁଲକୋବିରେ ଡାଇମଣ୍ଡ ବ୍ୟାକ୍ ମଥ୍ ଆକ୍ରମଣ ବିରୁଦ୍ଧରେ ନିରୀକ୍ଷଣ କରନ୍ତୁ ଏବଂ ଫେରୋମୋନ୍ ଟ୍ରାପ୍ ବ୍ୟବହାର କରନ୍ତୁ |",
            "ଯଦି ଆକ୍ରମଣ ଦେଖାଯାଏ, ତେବେ ବର୍ଷା ପରେ ନିମ୍ବ ତେଲ କିମ୍ବା ଇମାମେକ୍ଟିନ୍ ବେନ୍ଜୋଏଟ୍ ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "livestock": {
         "advisory": [
            "ଝୋଟ ବସ୍ତା ବ୍ୟବହାର କରି ପଶୁମାନଙ୍କୁ ଥଣ୍ଡାରୁ ରକ୍ଷା କରନ୍ତୁ ଏବଂ ସ୍ୱଚ୍ଛ ପାନୀୟ ଜଳ ଯୋଗାଇ ଦିଅନ୍ତୁ।",
            "ଟୀକାକରଣ ଏବଂ କୃମି ଦୂରୀକରଣ ମାଧ୍ୟମରେ କ୍ଷତିକାରକ ରୋଗ ଏବଂ ପାକସ୍ଥଳୀ କୃମିକୁ ନିୟନ୍ତ୍ରଣ କରନ୍ତୁ।"
         ]
      },
      "poultry": {
         "advisory": [
            "ତାଜା ବାୟୁ ପାଇଁ ଉପଯୁକ୍ତ ଭେଣ୍ଟିଲେସନ୍ ନିଶ୍ଚିତ କରନ୍ତୁ ଏବଂ କୁକୁଡ଼ା ଘର ଭିତରେ ଗ୍ୟାସ୍ ଅପସାରଣ କରନ୍ତୁ |",
            "କୁକୁଡ଼ା ପାଳିକୁ ଗରମ ଏବଂ ଶୁଖିଲା ରଖିବା ପାଇଁ ବାହ୍ୟ ଉତ୍ତାପ ଉତ୍ସ ପ୍ରଦାନ କରନ୍ତୁ |",
            "ପାଣି ପିଇବା ପାଇଁ ଉପଯୁକ୍ତ ତାପମାତ୍ରାରେ ପାନୀୟ ଜଳ ବଜାୟ ରଖନ୍ତୁ।"
         ]
      }
   },
   "date": "27-12-2024"
}