{
   "weather_details": {
      "14-08-2024": {
         "rainfall": 5,
         "t_max": 36,
         "t_min": 27,
         "rh_max": 92,
         "rh_min": 63,
         "wind_speed": 8,
         "wind_direction": 206,
         "cloud_cover": 6
      },
      "15-08-2024": {
         "rainfall": 6,
         "t_max": 36,
         "t_min": 27,
         "rh_max": 93,
         "rh_min": 76,
         "wind_speed": 9,
         "wind_direction": 204,
         "cloud_cover": 6
      },
      "16-08-2024": {
         "rainfall": 6,
         "t_max": 36,
         "t_min": 28,
         "rh_max": 95,
         "rh_min": 85,
         "wind_speed": 7,
         "wind_direction": 225,
         "cloud_cover": 7
      },
      "17-08-2024": {
         "rainfall": 7,
         "t_max": 35,
         "t_min": 28,
         "rh_max": 90,
         "rh_min": 70,
         "wind_speed": 8,
         "wind_direction": 225,
         "cloud_cover": 7
      },
      "18-08-2024": {
         "rainfall": 7,
         "t_max": 35,
         "t_min": 27,
         "rh_max": 92,
         "rh_min": 70,
         "wind_speed": 7,
         "wind_direction": 281,
         "cloud_cover": 7
      }
   },
   "names_of_crops": [
      "ଚାଉଳ",
      "ମକା",
      "ପନିପରିବା ଫସଲ",
      "କଦଳୀ",
      "ଗାଈ/ମଇଁଷି"
   ],
   "general_advisory": "ପୂର୍ବ ସପ୍ତାହ ତୁଳନାରେ ଆଗାମୀ ଦିନରେ ବୃଷ୍ଟିପାତର ପରିମାଣ ହ୍ରାସ ଏବଂ ତାପମାତ୍ରା ବୃଦ୍ଧି ହେବାର ସମ୍ଭାବନା ରହିଛି, ତେଣୁ କୃଷକମାନଙ୍କୁ ଫସଲ କ୍ଷେତରେ ଆବଶ୍ଯ଼କତା ଆଧାରିତ ଜଳସେଚନ କରିବାକୁ ପରାମର୍ଶ ଦିଆଯାଇଛି। ଯେତେବେଳେ ସ୍ୱାଭାବିକ ପବନର ବେଗ ସହିତ ଆକାଶ ସ୍ୱଚ୍ଛ ଥାଏ, ସେତେବେଳେ ବିନା ବର୍ଷା ଅବସ୍ଥାରେ କୀଟନାଶକ ଏବଂ ତୃଣନାଶକ ସିଞ୍ଚନ କରାଯିବା ଉଚିତ। ପ୍ରଚଳିତ ପାଣିପାଗ ସ୍ଥିତି ବିଭିନ୍ନ ଫସଲରେ ବିଭିନ୍ନ ରୋଗ ଏବଂ କୀଟ ଆକ୍ରମଣ ପାଇଁ ଅନୁକୂଳ, ତେଣୁ ସେମାନଙ୍କର ନିଯ଼ମିତ ତଦାରଖ ପାଇଁ ପରାମର୍ଶ ଦିଆଯିବା ଉଚିତ। କୌଣସି ଶୁଖିଲା ଋତୁରେ ଭବିଷ୍ଯ଼ତରେ ବ୍ଯ଼ବହାର ପାଇଁ ବ୍ଯ଼ାପକ ଏବଂ ଉନ୍ନତ ବନ୍ଧ ତିଆରି କରି ବର୍ଷାଜଳ ସଞ୍ଚଯ଼ କରିବାକୁ କୃଷକମାନଙ୍କୁ ପରାମର୍ଶ ଦିଆଯାଇଛି।",
   "crops_data": {
      "rice": {
         "advisory": [
            "ପୂର୍ବରୁ ପ୍ରସ୍ତୁତ ହୋଇଥିବା କ୍ଷେତରେ 20x15 ସେ. ମି. ବ୍ଯ଼ବଧାନରେ ଅଗଭୀର ଗଭୀରତାରେ <ଆଇ. ଡି. 1> ଦିନ ପୁରୁଣା ଚାରା ରୋପଣ କରାଯିବା ଉଚିତ, ଅଧିକ ଉତ୍ପାଦନକ୍ଷମ ପ୍ରଜାତି ପାଇଁ ପ୍ରତି ପାହାଡ଼ରେ କେବଳ 2-3 ଚାରା ବ୍ଯ଼ବହାର କରନ୍ତୁ। ହାଇବ୍ରିଡ୍ ପାଇଁ ପ୍ରତି ପାହାଡ଼ରେ 1ରୁ 2 ଚାରା ବ୍ଯ଼ବହାର କରନ୍ତୁ। ଉତ୍ତମ ଉଦ୍ଭିଦ ବୃଦ୍ଧି ପାଇଁ ଧାନ କ୍ଷେତରେ 5 ସେ. ମି. ଜଳ ରଖନ୍ତୁ।",
            "ସାର ପରିଚାଳନାଃ ଯ଼ୁରିଆ ସାରର ପ୍ରଥମ ଟପ୍ ଡ୍ରେସିଂ ପ୍ରତିରୋପଣର କିଛି ଦିନ ପରେ 20-25 ପ୍ରଯ଼ୋଗ କରିବାକୁ ପରାମର୍ଶ ଦିଆଯିବା ଉଚିତ।",
            "ଆଗାଛା ପରିଚାଳନାଃ ଆଗାଛାକୁ ନିଯ଼ନ୍ତ୍ରଣ କରିବା ପାଇଁ, ଚାରା ସୃଷ୍ଟି ହେବାର କିଛି ଦିନ ପରେ (କିମ୍ବା ଯେତେବେଳେ ଆଗାଛା 2-3ଟି ପତ୍ର ସ୍ତରରେ ଥାଏ) 4 କିଲୋଗ୍ରାମ ବାଲି ସହିତ 4 କିଲୋଗ୍ରାମ ପ୍ରତି ଏକର ପିଛା 6 ପ୍ରତିଶତ ଜିଆର ବା ବିସ୍ପିରିବାକ୍ ସୋଡ଼ିଅମ୍ 10 ପ୍ରତିଶତ ଏସ୍. ସି. ପ୍ରତି ଏକର ପିଛା 120 ମିଲିଲିଟର ପିଛା 16 ଲିଟର କ୍ଷମତା ବିଶିଷ୍ଟ ସ୍ପ୍ରେଯ଼ରର 8ଟି ଟାଙ୍କିରେ (କିମ୍ବା ଯେତେବେଳେ ଆଗାଛା 2-3ଟି ପତ୍ର ସ୍ତରରେ ଥାଏ) ପ୍ରଯ଼ୋଗ କରିବା ଉଚିତ।",
            "ବ୍ରାଉନ୍ ସ୍ପଟ୍ କ୍ଷେତ୍ରରେ, ପ୍ରୋପିକୋନାଜୋଲ୍ 25ଇସି (ଟିଲ୍ଟ/ଜେରୋକ୍ସ/ଧାନ/ବମ୍ପର) @1 ମିଲି କିମ୍ବା ମାନକୋଜେବ୍ 75 ଡବ୍ଲ୍ଯ଼ୁ. ପି. କିମ୍ବା କାର୍ବେଣ୍ଡାଜିମ୍ 64 ପ୍ରତିଶତ + ମାନକୋଜେବ୍ 8 ପ୍ରତିଶତ 75 ଡବ୍ଲ୍ଯ଼ୁ. ପି. (ସାଫ୍/ସେଫ/ସରାଫା) ଲିଟର ପିଛା 1.5 ଗ୍ରାମ୍ ପାଣି ସିଞ୍ଚନ କରିବା ଉଚିତ।",
            "କାଣ୍ଡ ଛେଦକ ଏବଂ ପତ୍ର ଫୋଲଡର ସଂକ୍ରମଣ ଉପରେ ନଜର ରଖିବା ପାଇଁ ଧାନ କ୍ଷେତର ଏକର ପିଛା 3ଟି ଫେରୋମୋନ୍ ଫାନ୍ଦ ରଖନ୍ତୁ। ଯେତେବେଳେ ପୁରୁଷ ପତଙ୍ଗ/ଫାନ୍ଦ ସଂଖ୍ଯ଼ା 4 କିମ୍ବା 5ରେ ପହଞ୍ଚିବ, ସେତେବେଳେ ଏକର ପିଛା 800 ମି. ଲି. ରେ ଆଜାଦିରାକ୍ଟିନ ଇ. ସି. ଲଗାନ୍ତୁ କିମ୍ବା ଏକର ପିଛା 4 କି. ଗ୍ରା. ରେ କ୍ଲୋରାଣ୍ଟ୍ରାନିଲିପ୍ରୋଲେ..................................................................................।"
         ]
      },
      "maize": {
         "advisory": [
            "ମକା ଫସଲରେ କାଣ୍ଡ ଛେଦକ ଆକ୍ରମଣକୁ ନିଯ଼ନ୍ତ୍ରଣ କରିବା ପାଇଁ, ସ୍ୱଚ୍ଛ ପାଣିପାଗ ସ୍ଥିତିରେ ଲିଟର ପିଛା 0.40 ଗ୍ରାମ୍ ଇମାମେକ୍ଟିନ୍ ବେନ୍ଜୋଏଟ୍ କିମ୍ବା କ୍ଲୋରାଣ୍ଟ୍ରାନିଲିପ୍ରୋଲେ <ଆଇ. ଡି. 1> ଏସ୍. ସି. @0.3 ମିଲି. ସିଞ୍ଚନ କରିବା ଉଚିତ।"
         ]
      },
      "vegetable crops": {
         "advisory": [
            "ପ୍ରଚଳିତ ପାଣିପାଗ ସ୍ଥିତି ବିଭିନ୍ନ ରୋଗ ଏବଂ ପନିପରିବା ଫସଲରେ କୀଟ ଆକ୍ରମଣ ପାଇଁ ଅନୁକୂଳ, ତେଣୁ ସେମାନଙ୍କର ନିଯ଼ମିତ ତଦାରଖ କରିବାକୁ ପରାମର୍ଶ ଦିଆଯିବା ଉଚିତ |",
            "ଯଦି ଏକ ଶୋଷକ କୀଟ ଆକ୍ରମଣ ଲକ୍ଷ୍ଯ଼ କରାଯାଏ, ତେବେ ଥାଇମେଥୋକ୍ସାମ୍ @0.20 ଗ୍ରାମ୍ କିମ୍ବା ଇମିଡାକ୍ଲୋପ୍ରିଡ୍ @0.33 ମିଲି ଲିଟର ପ୍ରତି ପାଣି ସିଞ୍ଚନ କରିବାକୁ ପରାମର୍ଶ ଦିଆଯିବା ଉଚିତ।",
            "ୱିଲ୍ଟ, ରୁଟ୍ ରଟ୍ ଇତ୍ଯ଼ାଦି କିଛି ରୋଗକୁ ନିଯ଼ନ୍ତ୍ରଣ କରିବା ପାଇଁ କୃଷକମାନେ ବିନା ବର୍ଷା ଅବସ୍ଥାରେ ଲିଟର ପିଛା 2 ଗ୍ରାମ୍ କାର୍ବେନଡାଜିମ୍ କିମ୍ବା 3 ମିଲି ଲିଟର କପାର୍ ଅକ୍ସାଇକ୍ଲୋରାଇଡ୍ ବ୍ଯ଼ବହାର କରିବା ଉଚିତ୍।"
         ]
      },
      "banana": {
         "advisory": [
            "ଅତୀତର ପାଣିପାଗ (ଉଚ୍ଚ ଆର୍ଦ୍ରତା/ଆର୍ଦ୍ରତା ଏବଂ ଉଚ୍ଚ ପବନର ବେଗ) ସ୍ଥିତି ଛିଡ଼ା ହୋଇଥିବା କଦଳୀ ଫସଲରେ ବିଭିନ୍ନ ସଂକ୍ରାମକ ରୋଗ ବିସ୍ତାର କରିବା ପାଇଁ ଅନୁକୂଳ, ଯେପରିକି ସିଗଟୋକା କିମ୍ବା କଳା ପତ୍ରର ଧାଡ଼ି, ମୂଳ କ୍ଷଯ଼, ପତ୍ର ଦାଗ ଇତ୍ଯ଼ାଦି, ତେଣୁ ସେମାନଙ୍କର ନିଯ଼ମିତ ନିରୀକ୍ଷଣ ପରାମର୍ଶ ଦିଆଯିବା ଉଚିତ |"
         ]
      },
      "cow/buffalo": {
         "advisory": [
            "ଏଫ୍. ଏମ୍. ଡି., ଏଚ୍. ଏସ୍., ବି. କ୍ଯ଼ୁ., ଏଣ୍ଟେରୋକ୍ସେମିଆ ଇତ୍ଯ଼ାଦି ବିରୁଦ୍ଧରେ ପଶୁର କୃମି ଦୂରୀକରଣ ଏବଂ ଟୀକାକରଣ ସୁନିଶ୍ଚିତ କରାଯିବା ଉଚିତ। ବର୍ତ୍ତମାନର ଅବସ୍ଥାରେ କେତେକ ପଶୁମାନଙ୍କଠାରେ ମାସ୍ତାଇଟିସ୍ ରୋଗ ମଧ୍ଯ଼ ଦେଖାଯାଏ, ଯେଉଁ କାରଣରୁ ଦୁଗ୍ଧ ଉତ୍ପାଦନ ଏବଂ ଗୁଣବତ୍ତା ବାଧାପ୍ରାପ୍ତ ହୋଇପାରେ, ତେଣୁ କେତେକ ପ୍ରତିଷେଧକ ତଥା ନିଯ଼ନ୍ତ୍ରଣ ପଦକ୍ଷେପ ଯେପରିକି ଆଣ୍ଟିସେପ୍ଟିକ୍ ତରଳ ପଦାର୍ଥ ସହିତ ବୁଡ଼ାଇବା ପୂର୍ବରୁ ଏବଂ ପରେ, ଉପଯୁକ୍ତ ପରିମଳ, ଓଦା ଚଟାଣକୁ ରୋକିବା, କ୍ଷୀର ଦୋଇବା ସମଯ଼ରେ ଏବଂ ଠିକ୍ ପରେ ଖାଇବା ଦ୍ୱାରା ଟିଟ୍ ସ୍ପିଙ୍କଟର୍ ବନ୍ଦ ହେବା ପୂର୍ବରୁ ପଶୁମାନଙ୍କର ବସିବା ଏଡ଼ାଇବା, ବିଶ୍ରାମ ଚଟାଣରେ ଚୂନ ଲଗାଇବା, ସକାଳେ ଏବଂ ସନ୍ଧ୍ଯ଼ାରେ 1 ଲିଟର ପାଣିରେ 2 ଲେମ୍ବୁ ଏବଂ 200 ଗ୍ରାମ୍ ଚିନି ମିଶ୍ରଣ ପ୍ରଦାନ କରିବା ଇତ୍ଯ଼ାଦି ଏହି ରୋଗକୁ ନିଯ଼ନ୍ତ୍ରଣ କରିବା ପାଇଁ ଗ୍ରହଣ କରାଯିବା ଉଚିତ। କ୍ଷେତରେ ମଧୁର ଜଳର ଉପଲବ୍ଧତା ସୁନିଶ୍ଚିତ କରାଯିବା ଉଚିତ।"
         ]
      }
   },
   "date": "13-08-2024"
}