{
   "weather_details": {
      "19-10-2024": {
         "rainfall": 2,
         "t_max": 35,
         "t_min": 26,
         "rh_max": 59,
         "rh_min": 94,
         "wind_speed": 4,
         "wind_direction": 84,
         "cloud_cover": 4
      },
      "20-10-2024": {
         "rainfall": 2,
         "t_max": 35,
         "t_min": 25,
         "rh_max": 53,
         "rh_min": 92,
         "wind_speed": 4,
         "wind_direction": 68,
         "cloud_cover": 6
      },
      "21-10-2024": {
         "rainfall": 0,
         "t_max": 34,
         "t_min": 25,
         "rh_max": 47,
         "rh_min": 89,
         "wind_speed": 4,
         "wind_direction": 70,
         "cloud_cover": 6
      },
      "22-10-2024": {
         "rainfall": 0,
         "t_max": 34,
         "t_min": 25,
         "rh_max": 41,
         "rh_min": 85,
         "wind_speed": 4,
         "wind_direction": 36,
         "cloud_cover": 4
      },
      "23-10-2024": {
         "rainfall": 0,
         "t_max": 34,
         "t_min": 25,
         "rh_max": 42,
         "rh_min": 79,
         "wind_speed": 5,
         "wind_direction": 17,
         "cloud_cover": 4
      }
   },
   "names_of_crops": [
      "ଚାଉଳ",
      "କପା",
      "ଓକ୍ରା",
      "କୋଲେ ଫସଲ",
      "ଆମ୍ବ",
      "ଗାଈ/ମଇଁଷି"
   ],
   "general_advisory": "ଆଗାମୀ ଦିନରେ ପାଗ ଶୁଖିଲା ରହିବ ବୋଲି ଆଶା କରାଯାଉଛି, ତେଣୁ କୃଷକମାନଙ୍କୁ ସେହି ସମଯ଼ରେ କୃଷି କାର୍ଯ୍ଯ଼ (ଜଳସେଚନ, ସିଞ୍ଚନ, ଆନ୍ତଃସାଂସ୍କୃତିକ କାର୍ଯ୍ଯ଼ ଇତ୍ଯ଼ାଦି) କରିବାକୁ ପରାମର୍ଶ ଦିଆଯାଇଛି। ପଶୁମାନଙ୍କୁ ଉପଯୁକ୍ତ ଖାଦ୍ଯ଼ ପାଇବା ପାଇଁ ସବୁଜ ପଶୁଖାଦ୍ଯ଼ ବୁଣିବା ପାଇଁ ପରାମର୍ଶ ଦିଆଯିବା ଉଚିତ। କୃଷକମାନେ ନର୍ସରୀ ବୁଣିବା ଏବଂ କୋଲ୍ ଫସଲ ଏବଂ ଅନ୍ଯ଼ାନ୍ଯ଼ ଶୀତ ଋତୁ ପନିପରିବା ରୋପଣ କରିବା ଆରମ୍ଭ କରିବା ଉଚିତ୍। ପଶୁମାନଙ୍କୁ ପାଦ ଏବଂ ମୁଖ ରୋଗ ଏବଂ ବ୍ରୁସେଲୋସିସ୍ ବିରୁଦ୍ଧରେ କୃମି ଦୂରୀକରଣ ଏବଂ ଟୀକାକରଣ ପରାମର୍ଶ ଦିଆଯିବା ଉଚିତ।",
   "crops_data": {
      "rice": {
         "advisory": [
            "ଆଗାମୀ ଦିନରେ ବର୍ଷା ହେବାର ସମ୍ଭାବନା ବହୁତ କମ୍ ଥିବାରୁ କୃଷକମାନେ ଗୋଟିଏ ଜଳସେଚନ କରି ଧାନ କ୍ଷେତରେ ପର୍ଯ୍ୟାପ୍ତ ଆର୍ଦ୍ରତା ବଜାୟ ରଖିବା ଉଚିତ।",
            "ଧାନ କ୍ଷେତରେ ପିତ୍ତ ମିଜ୍ ଆକ୍ରମଣକୁ ନିଯ଼ନ୍ତ୍ରଣ କରିବା ପାଇଁ, କୃଷକମାନେ ସ୍ୱଚ୍ଛ ଏବଂ ଶାନ୍ତ ପାଣିପାଗ ସ୍ଥିତିରେ ଲାମ୍ବଡା-ସାଇହାଲୋଥ୍ରିନ୍ 05 ପ୍ରତିଶତ ଇସି, ଥାଯ଼ାମେଥୋକ୍ସାମ୍ 25 ପ୍ରତିଶତ ଡବ୍ଲୁଜି, ଫିପ୍ରୋନିଲ୍ 5 ପ୍ରତିଶତ ଏସସି, କିମ୍ବା କ୍ଲୋରୋପାଇରିଫସ୍ 20 ଇସି ସ୍ପ୍ରେ କରିବା ଉଚିତ୍।",
            "ପତ୍ର ଫୋଲଡରକୁ ନିଯ଼ନ୍ତ୍ରଣ କରିବା ପାଇଁ, କ୍ଲୋରାଣ୍ଟ୍ରାନିଲିପ୍ରୋଲ 18.5% SC, ଟେଟ୍ରାନିଲିପ୍ରୋଲ 200 SC, କିମ୍ବା ଫ୍ଲୁବେଣ୍ଡିଆମାଇଡ୍ 20 WG କୁ ସ୍ୱଚ୍ଛ ପାଗରେ ସ୍ପ୍ରେ କରିବାକୁ ପରାମର୍ଶ ଦିଆଯିବା ଉଚିତ।"
         ]
      },
      "cotton": {
         "advisory": [
            "କପା ଫସଲରେ ବୋଲୱର୍ମ କମ୍ପ୍ଲେକ୍ସକୁ ନିଯ଼ନ୍ତ୍ରଣ କରିବା ପାଇଁ, କୃଷକମାନଙ୍କୁ ସ୍ୱଚ୍ଛ ପାଗରେ ଇମାମେକ୍ଟିନ୍ ବେନ୍ଜୋଏଟ୍ 5 ପ୍ରତିଶତ ଏସ୍ଜି କିମ୍ବା ପ୍ରୋଫେନୋଫସ୍ 50 ପ୍ରତିଶତ ଇସି ସ୍ପ୍ରେ କରିବାକୁ ପରାମର୍ଶ ଦିଆଯାଇଛି।"
         ]
      },
      "okra": {
         "advisory": [
            "ଓକ୍ରାରେ ଫଳ ଏବଂ ଶୁଟ୍ ଛେଦକକୁ ନିଯ଼ନ୍ତ୍ରଣ କରିବା ପାଇଁ, ପ୍ରାରମ୍ଭିକ ପର୍ଯ୍ଯ଼ାଯ଼ରେ ନିମ୍ ଆଧାରିତ କୀଟନାଶକ 1500 ପିପିଏମ୍ ସିଞ୍ଚନ କରିବାକୁ ପରାମର୍ଶ ଦିଆଯିବା ଉଚିତ।"
         ]
      },
      "cole crop": {
         "advisory": [
            "ନର୍ସରୀ ଶଯ୍ଯ଼ା ନିର୍ଦ୍ଦିଷ୍ଟ ଆକାରରେ ପ୍ରସ୍ତୁତ ହେବା ଉଚିତ ଏବଂ ଭଲ ଭାବରେ ଅପଘଟିତ ଏଫ୍. ୱାଇ. ଏମ୍. ଏବଂ କ୍ଲୋରପାଇରିଫୋସ୍ ଧୂଳି ପ୍ରଯ଼ୋଗ କରିବାକୁ ପରାମର୍ଶ ଦିଆଯିବା ଉଚିତ।",
            "ଯେଉଁଠାରେ ଜଳସେଚନ ସୁବିଧା ଉପଲବ୍ଧ ଅଛି, ସେଠାରେ ପୂର୍ବରୁ ପ୍ରସ୍ତୁତ ଜମିରେ ଫସଲ ରୋପଣ କରିବାକୁ ପରାମର୍ଶ ଦିଆଯାଇଛି।"
         ]
      },
      "mango": {
         "advisory": [
            "ପୁରୁଣା ଆମ୍ବ ବଗିଚାରେ, ତାଲିମ, ଛାଣିବା, ଆଗାଛା ସଫା କରିବା, ରୋଗାକ୍ରାନ୍ତ ଏବଂ ସଂକ୍ରମିତ ଶାଖା ଏବଂ ପତ୍ର ସଫା କରିବା ପାଇଁ ପରାମର୍ଶ ଦିଆଯିବା ଉଚିତ।",
            "ନୂତନ ଭାବରେ ରୋପଣ କରାଯାଇଥିବା ଆମ୍ବ ବଗିଚାରେ, କୀଟ ନିଯ଼ନ୍ତ୍ରଣ ପାଇଁ ନିର୍ଦ୍ଦିଷ୍ଟ ସ୍ପ୍ରେ ପରାମର୍ଶ ଦିଆଯିବା ଉଚିତ |"
         ]
      },
      "cow/buffalo": {
         "advisory": [
            "ଗାଈ ଏବଂ ମଇଁଷିରେ ପାଦ ଏବଂ ପାଟି ରୋଗ ପାଇଁ ପ୍ରତିଷେଧକ ଏବଂ ନିଯ଼ନ୍ତ୍ରଣ ପଦକ୍ଷେପ ଅନୁସରଣ କରାଯିବା ଉଚିତ।"
         ]
      }
   },
   "date": "18-10-2024"
}