{
   "weather_details": {
      "10-07-2024": {
         "rainfall": 7,
         "t_max": 33,
         "t_min": 25,
         "rh_max": 71,
         "rh_min": 38,
         "wind_speed": 10,
         "wind_direction": 163,
         "cloud_cover": 7
      },
      "11-07-2024": {
         "rainfall": 4,
         "t_max": 34,
         "t_min": 25,
         "rh_max": 67,
         "rh_min": 41,
         "wind_speed": 13,
         "wind_direction": 214,
         "cloud_cover": 6
      },
      "12-07-2024": {
         "rainfall": 5,
         "t_max": 35,
         "t_min": 25,
         "rh_max": 74,
         "rh_min": 42,
         "wind_speed": 13,
         "wind_direction": 225,
         "cloud_cover": 6
      },
      "13-07-2024": {
         "rainfall": 6,
         "t_max": 35,
         "t_min": 24,
         "rh_max": 79,
         "rh_min": 44,
         "wind_speed": 13,
         "wind_direction": 252,
         "cloud_cover": 6
      },
      "14-07-2024": {
         "rainfall": 7,
         "t_max": 34,
         "t_min": 23,
         "rh_max": 80,
         "rh_min": 46,
         "wind_speed": 15,
         "wind_direction": 252,
         "cloud_cover": 7
      }
   },
   "names_of_crops": [
      "ଖରିଫ ଚାଉଳ",
      "କପା",
      "ପନିପରିବା ଫସଲ",
      "ଗାଈ/ମଇଁଷି",
      "କୁକୁଡ଼ା ମାଂସ"
   ],
   "general_advisory": "ଆଇଏମଡିର ବର୍ଦ୍ଧିତ ପରିସୀମା ପୂର୍ବାନୁମାନ ଅନୁଯାଯ଼ୀ, ବର୍ଷା ସ୍ୱାଭାବିକ ଏବଂ 14 ରୁ 20 ଜୁଲାଇ, 2024 ମଧ୍ଯ଼ରେ ଓଡ଼ିଶା ରାଜ୍ଯ଼ରେ ଉଭଯ଼ ସର୍ବାଧିକ ଏବଂ ସର୍ବନିମ୍ନ ତାପମାତ୍ରା ସ୍ୱାଭାବିକ ହେବାର ଆଶା କରାଯାଉଛି, ତେଣୁ ଖରିଫ ଫସଲ ଚାଷ ଦିଗରେ କୃଷକମାନଙ୍କୁ ଆବଶ୍ଯ଼କ ପଦକ୍ଷେପ ନେବାକୁ ପରାମର୍ଶ ଦିଆଯାଇଛି। ଧାନ ଚାରା ଏବଂ ପନିପରିବା ଫସଲ ରୋପଣ ପାଇଁ କୃଷକମାନେ ମୁଖ୍ଯ଼ କ୍ଷେତ୍ର ପ୍ରସ୍ତୁତି ଆରମ୍ଭ କରିବା ଉଚିତ ଏବଂ ପ୍ରଚଳିତ ବର୍ଷା ଅବସ୍ଥାର ଲାଭ ଉଠାଇ ଉଦ୍ଯ଼ାନରେ ନୂତନ ଫଳ ଫସଲ ରୋପଣ ମଧ୍ଯ଼ ଆରମ୍ଭ କରିବା ଉଚିତ। ପ୍ରଚଳିତ ପାଣିପାଗ ସ୍ଥିତି ସମସ୍ତ ପ୍ରକାରର ଫସଲରେ କୀଟପତଙ୍ଗ ଯେପରିକି ମିଲି ବଗ, ଏଫିଡ ଇତ୍ଯ଼ାଦି ଆକ୍ରମଣ ପାଇଁ ଅନୁକୂଳ, ତେଣୁ କୃଷକମାନେ ଏହି କୀଟକୁ ନିଯ଼ନ୍ତ୍ରଣ କରିବା ପାଇଁ ପ୍ରତି ଲିଟର ପାଣିରେ 25 ପ୍ରତିଶତ ଡବ୍ଲୁଜି @0.5-0.6g କିମ୍ବା ଇମିଡାକ୍ଲୋପ୍ରିଡ 17.8% ଏସଏଲ @0.5ml କିମ୍ବା ଲାମ୍ବଡା ସାଇହାଲୋଥ୍ରିନ୍ 4.9 ପ୍ରତିଶତ ସିଏସ ସ୍ପ୍ରେ କରିବା ଉଚିତ୍। ଅଧିକ ଆପେକ୍ଷିକ ଆର୍ଦ୍ରତା ସହିତ ମେଘୁଆ ପାଗ ସ୍ଥାଯ଼ୀ ଫସଲରେ ବିଭିନ୍ନ ରୋଗ ସଂକ୍ରମଣକୁ ସମର୍ଥନ କରିପାରେ, ତେଣୁ ଏହାର ନିଯ଼ମିତ ତଦାରଖ ପାଇଁ ପରାମର୍ଶ ଦିଆଯିବା ଉଚିତ। କୌଣସି ଶୁଖିଲା ଋତୁରେ ଭବିଷ୍ଯ଼ତରେ ବ୍ଯ଼ବହାର ପାଇଁ ବ୍ଯ଼ାପକ ଏବଂ ଉନ୍ନତ ବନ୍ଧ ତିଆରି କରି ବର୍ଷା ଜଳକୁ ସଂରକ୍ଷଣ କରିବାକୁ କୃଷକମାନଙ୍କୁ ପରାମର୍ଶ ଦିଆଯାଇଛି।",
   "crops_data": {
      "kharif rice": {
         "advisory": [
            "ପୂର୍ବ ବର୍ଷାର ଫାଇଦା ଉଠାଇ କୃଷକମାନେ ଧାନ ବୁଣିବା ପାଇଁ କ୍ଷେତ ପ୍ରସ୍ତୁତି ଆରମ୍ଭ କରିବା ଉଚିତ। ଉତ୍ତମ ଜଳ ନିଷ୍କାସନ ସୁବିଧା ସହିତ ଜଳସେଚନ ଜଳ ଉତ୍ସ ନିକଟବର୍ତ୍ତୀ ସୁନିଶ୍ଚିତ ଜଳସେଚିତ ଅଞ୍ଚଳ ପାଇଁ ଆର୍ଦ୍ର ଶଯ୍ଯ଼ା ନର୍ସରୀ ଚଯ଼ନ କରାଯିବା ଉଚିତ। ନର୍ସରୀ ଅଞ୍ଚଳକୁ 1.5-metre-long, 10-15 ସେ. ମି. ଉଚ୍ଚତା ଏବଂ ସୁବିଧାଜନକ ଦୈର୍ଘ୍ଯ଼ର ଛୋଟ ଛୋଟ ପ୍ଲଟରେ ବିଭକ୍ତ କରନ୍ତୁ। ଜଳସେଚନ/ଜଳ ନିଷ୍କାସନ ପାଇଁ ଶଯ୍ଯ଼ା ସହିତ 30 ସେ. ମି. ଓସାରର ଜଳସେଚନ ଚ୍ଯ଼ାନେଲ ନିର୍ମାଣ କରାଯିବା ଉଚିତ।",
            "ବୁଣିବା ପୂର୍ବରୁ, କାର୍ବେଣ୍ଡାଜିମ୍ 50 ପ୍ରତିଶତ ଡବ୍ଲ୍ଯ଼ୁ. ପି. @2 ଗ୍ରାମ୍/କି. ଗ୍ରା. ମଞ୍ଜି କିମ୍ବା ଟ୍ରାଇକୋଡର୍ମା @10 ଗ୍ରାମ୍/କି. ଗ୍ରା. ମଞ୍ଜି ସହିତ ମଞ୍ଜି ଚିକିତ୍ସା କରାଯିବା ଉଚିତ।",
            "ମଞ୍ଜିଗୁଡ଼ିକୁ 24 ଘଣ୍ଟା ପାଇଁ ପାଣିରେ ଭିଜାଇ ରଖନ୍ତୁ ଏବଂ ତା 'ପରେ ପାଣି ବାହାର କରି ଦିଅନ୍ତୁ ଏବଂ ମଞ୍ଜିଗୁଡ଼ିକୁ ଏକ ବସ୍ତା ଭିତରେ ରଖନ୍ତୁ। ଥରେ ମଞ୍ଜି ଅଙ୍କୁରିତ ହୋଇଗଲେ, ଏହାକୁ ବୁଣିବା ପାଇଁ ବ୍ଯ଼ବହାର କରନ୍ତୁ।"
         ]
      },
      "cotton": {
         "advisory": [
            "ଯେଉଁ କୃଷକମାନେ ପୂର୍ବରୁ ବୁଣି ସାରିଛନ୍ତି, ସେମାନଙ୍କୁ ଅଙ୍କୁରୋଦଗମ ପରେ 10-12 ଦିନରେ କପା କ୍ଷେତରେ ଦୁର୍ବଳ ଗଛଗୁଡ଼ିକୁ ପତଳା କରିବାକୁ ପରାମର୍ଶ ଦିଆଯାଏ ଏବଂ ପଲିଥିନ୍ ବ୍ଯ଼ାଗରେ ଉଠାଯାଇଥିବା ଚାରା ରୋପଣ ସହିତ ଶୂନ୍ଯ଼ସ୍ଥାନ ପୂରଣ କରାଯାଏ | ବୁଣିବା ପରେ 60 ଦିନ ପର୍ଯ୍ଯ଼ନ୍ତ କ୍ଷେତକୁ ଆଗାଛା ମୁକ୍ତ ରଖନ୍ତୁ।"
         ]
      },
      "vegetable crops": {
         "advisory": [
            "ପନିପରିବା ଫସଲର ନର୍ସରୀରେ କୀଟପତଙ୍ଗ ଆକ୍ରମଣକୁ ଶୋଷିବା ପାଇଁ ପ୍ରଚଳିତ ପାଣିପାଗ ସ୍ଥିତି ଅନୁକୂଳ, ତେଣୁ ଏହାର ନିଯ଼ମିତ ତଦାରଖ ପାଇଁ ପରାମର୍ଶ ଦିଆଯିବା ଉଚିତ ଏବଂ ଆକ୍ରମଣକୁ ଲକ୍ଷ୍ଯ଼ କରିବା ପରେ, ପରିଷ୍କାର ପାଗରେ ପ୍ରତି ଲିଟର ପାଣିରେ 25 ପ୍ରତିଶତ ଡବ୍ଲୁଜି @0.5-0.6g କିମ୍ବା ଇମିଡାକ୍ଲୋପ୍ରିଡ୍ 17.8% ଏସଏଲ @0.5ml ସିଞ୍ଚନ କରିବାକୁ ପରାମର୍ଶ ଦିଆଯିବା ଉଚିତ।",
            "କୃଷକମାନେ ଖରିଫ ପନିପରିବା ଫସଲ ପାଇଁ ଉପଯୁକ୍ତ ଜଳ ନିଷ୍କାସନ ବ୍ଯ଼ବସ୍ଥା ସହିତ ଉଠାଯାଇଥିବା ଶଯ୍ଯ଼ା ନର୍ସରୀ ପ୍ରସ୍ତୁତି ଆରମ୍ଭ କରିବା ଉଚିତ।"
         ]
      },
      "cow/buffalo": {
         "advisory": [
            "ମୌସୁମୀ (ବର୍ଷା ଋତୁ) ଆରମ୍ଭ ହେବା ପୂର୍ବରୁ ଏଫ୍. ଏମ୍. ଡି., ଏଚ୍. ଏସ୍. ଏବଂ ବି. କ୍ଯ଼ୁ. ବିରୁଦ୍ଧରେ ପଶୁମାନଙ୍କର କୃମି ଦୂରୀକରଣ ଏବଂ ଟୀକାକରଣ ସୁନିଶ୍ଚିତ କରାଯିବା ଉଚିତ କାରଣ ବର୍ଷା ଋତୁରେ ତାପମାତ୍ରା ହ୍ରାସ ଏବଂ ଆର୍ଦ୍ରତା ବୃଦ୍ଧି ସହିତ, ମଶା, ମାଛି ଏବଂ ବିଭିନ୍ନ ଅଣୁଜୀବ ଏବଂ ଅନେକ ପ୍ରକାରର ସଂକ୍ରାମକ ରୋଗ ସଂଖ୍ଯ଼ା ବୃଦ୍ଧି ପାଉଛି ଯାହା ଏହି ଋତୁରେ ପଶୁମାନଙ୍କ ମଧ୍ଯ଼ରେ ଦ୍ରୁତ ଗତିରେ ବ୍ଯ଼ାପିଥାଏ।",
            "ନରମ ଏବଂ କୋମଳ ଘାସ ଗୋରୁମାନଙ୍କ ପାଇଁ ଅଧିକ ସ୍ୱାଦିଷ୍ଟ, କିନ୍ତୁ ଅଧିକ ଅଳିଆ ଖାଇବା ସମଯ଼ରେ ଦୁଗ୍ଧ ଗାଈମାନଙ୍କଠାରେ ମ୍ଯ଼ାଗ୍ନେସିଯ଼ମ୍ ଅଭାବ ଦେଖାଯାଏ, ତେଣୁ କେବଳ ନରମ ଘାସ ପରିବର୍ତ୍ତେ ବିଭିନ୍ନ ପ୍ରକାରର ଘାସ ଖୁଆଇବା ଉଚିତ |"
         ]
      },
      "poultry": {
         "advisory": [
            "ବର୍ଷା ଋତୁରେ, ଦିନରେ ପାର୍ଶ୍ୱ ପର୍ଦାର ଶୀର୍ଷରେ 1 ରୁ 2 ଫୁଟ ଖୋଲିବାକୁ ଅନୁମତି ଦେଇ ଉପଯୁକ୍ତ ଭେଣ୍ଟିଲେସନ୍ ନିଶ୍ଚିତ କରିବାକୁ ବ୍ଯ଼ବସ୍ଥା କରନ୍ତୁ ଏବଂ ଖାଲି ସେଡର ପାର୍ଶ୍ୱ କାନ୍ଥ ସମ୍ପୂର୍ଣ୍ଣ ପଲିଥିନ୍ ପର୍ଦ୍ଦା ଦ୍ୱାରା ଆଚ୍ଛାଦିତ ହେବା ଉଚିତ୍ | ମାଛି, କୀଟପତଙ୍ଗ ଆକ୍ରମଣ ଏଡ଼ାଇବା ପାଇଁ ସେଡ୍ ଚାରିପାଖରେ ଡ୍ରେନେଜ୍ ଖାଲ ସଫା/ସଫା ହେବା ଉଚିତ ଏବଂ ଯଦି ସମ୍ଭବ, କୁକୁଡ଼ା ଫାର୍ମରେ ମାଛି ଏବଂ କୀଟପତଙ୍ଗ ନିଯ଼ନ୍ତ୍ରଣ ପାଇଁ ନିଯ଼ମିତ କୀଟନାଶକ ପ୍ରଯ଼ୋଗ କରାଯିବା ଉଚିତ | ଛାତରେ, ପାର୍ଶ୍ୱ ଓଭରହାଙ୍ଗଗୁଡିକ ସର୍ବନିମ୍ନ 3 ରୁ 4 ଫୁଟ ହେବା ଉଚିତ ଯାହା ସିଧାସଳଖ ବର୍ଷା ଜଳକୁ ସେଡ୍ ଭିତରକୁ ପ୍ରବେଶ କରିବ ନାହିଁ | ରାଣୀଖେତ୍ ରୋଗ ବିରୁଦ୍ଧରେ କୁକୁଡ଼ା ପକ୍ଷୀଙ୍କ କୃମି ଦୂରୀକରଣ ଏବଂ ଟୀକାକରଣ ନିଶ୍ଚିତ କରାଯିବା ଆବଶ୍ଯ଼କ।"
         ]
      }
   },
   "date": "09-07-2024"
}