{
   "weather_details": {
      "31-07-2024": {
         "rainfall": 15,
         "t_max": 31,
         "t_min": 23,
         "rh_max": 86,
         "rh_min": 60,
         "wind_speed": 15,
         "wind_direction": 248,
         "cloud_cover": 8
      },
      "01-08-2024": {
         "rainfall": 20,
         "t_max": 30,
         "t_min": 22,
         "rh_max": 90,
         "rh_min": 70,
         "wind_speed": 16,
         "wind_direction": 249,
         "cloud_cover": 8
      },
      "02-08-2024": {
         "rainfall": 10,
         "t_max": 29,
         "t_min": 22,
         "rh_max": 88,
         "rh_min": 69,
         "wind_speed": 18,
         "wind_direction": 248,
         "cloud_cover": 8
      },
      "03-08-2024": {
         "rainfall": 5,
         "t_max": 29,
         "t_min": 24,
         "rh_max": 88,
         "rh_min": 72,
         "wind_speed": 15,
         "wind_direction": 248,
         "cloud_cover": 7
      },
      "04-08-2024": {
         "rainfall": 5,
         "t_max": 28,
         "t_min": 24,
         "rh_max": 89,
         "rh_min": 64,
         "wind_speed": 14,
         "wind_direction": 243,
         "cloud_cover": 7
      }
   },
   "names_of_crops": [
      "ଚାଉଳ",
      "ମକା",
      "କପା",
      "ପନିପରିବା ଫସଲ",
      "ପଶୁପାଳନ"
   ],
   "general_advisory": "ଆଇଏମଡିର ବର୍ଦ୍ଧିତ ରେଞ୍ଜ ପୂର୍ବାନୁମାନ ଅନୁଯାଯ଼ୀ, ବର୍ଷା ସ୍ୱାଭାବିକଠାରୁ ଅଧିକ, 04.08.2024 ରୁ 10.08.2024 ମଧ୍ଯ଼ରେ ଓଡ଼ିଶା ରାଜ୍ଯ଼ରେ ଉଭଯ଼ ସର୍ବାଧିକ ଏବଂ ସର୍ବନିମ୍ନ ତାପମାତ୍ରା ସ୍ୱାଭାବିକ ରହିବ ବୋଲି ଆଶା କରାଯାଉଛି। ଯେହେତୁ ଆଗାମୀ ଦିନରେ ଗୋଟିଏ କିମ୍ବା ଦୁଇଟି ସ୍ଥାନରେ ପ୍ରବଳ ବର୍ଷା ସହିତ ହାଲୁକା ରୁ ମଧ୍ଯ଼ମ ବର୍ଷା ହେବାର ସମ୍ଭାବନା ରହିଛି, ତେଣୁ କୃଷକମାନଙ୍କୁ ସେହି ସମଯ଼ରେ ଜଳସେଚନ ତଥା ସିଞ୍ଚନ କାର୍ଯ୍ଯ଼ ଏଡ଼ାଇବାକୁ ପରାମର୍ଶ ଦିଆଯାଇଛି ଏବଂ ଧାନ ଚାରା ରୋପଣ ପାଇଁ ଯଥାଶୀଘ୍ର ଶେଷ କ୍ଷେତ୍ର ପ୍ରସ୍ତୁତି ସମ୍ପୂର୍ଣ୍ଣ କରିବାକୁ ଏବଂ ଫସଲ କ୍ଷେତରୁ ଅତିରିକ୍ତ ବର୍ଷା ଜଳ ନିଷ୍କାସନ ପାଇଁ ବ୍ଯ଼ବସ୍ଥା କରିବାକୁ ପରାମର୍ଶ ଦିଆଯାଇଛି। ପ୍ରଚଳିତ ପାଣିପାଗ ସ୍ଥିତି ବିଭିନ୍ନ ରୋଗ ପାଇଁ ଅନୁକୂଳ ଏବଂ ବିଭିନ୍ନ ଫସଲରେ କୀଟପତଙ୍ଗ ଆକ୍ରମଣ କରନ୍ତି ତେଣୁ ଏହାର ନିଯ଼ମିତ ତଦାରଖ କରିବାକୁ ପରାମର୍ଶ ଦିଆଯିବା ଉଚିତ |",
   "crops_data": {
      "rice": {
         "advisory": [
            "ଦିନ ବ୍ଯ଼ବଧାନରେ ଦୁଇଥର କ୍ଷେତକୁ କାଦୁଅ କରି ଏବଂ ସମାନ ଫସଲ ଷ୍ଟାଣ୍ଡ ପାଇଁ ଜମି ସମତଳ କରି ମୁଖ୍ଯ଼ କ୍ଷେତ୍ର ଜମି ପ୍ରସ୍ତୁତି କରାଯିବା ଉଚିତ। ପ୍ରାଯ଼ 0.8t/acre ଭଲ ଭାବେ ଅପଘଟିତ ଏଫ୍. ୱାଇ. ଏମ୍. କୁ ପ୍ରଥମ ପୁଡଲିଂ ପୂର୍ବରୁ ପ୍ରଯ଼ୋଗ କରାଯାଇପାରେ। ମୁଖ୍ଯ଼ କ୍ଷେତର ପ୍ରାରମ୍ଭିକ କାଦୁଅ କରିବା ସମଯ଼ରେ ଧାଇଞ୍ଚା ସବୁଜ ସାର ଫସଲକୁ ସାମିଲ କରନ୍ତୁ।",
            "ଅଧିକ ଉତ୍ପାଦନକ୍ଷମ କିସମଗୁଡ଼ିକ ପାଇଁ ଶେଷ ପୁଡଲିଂ ସମଯ଼ରେ ମୌଳିକ ମାତ୍ରା ଭାବରେ ନିର୍ଦ୍ଦିଷ୍ଟ ପରିମାଣର ସାର ପ୍ରଯ଼ୋଗ କରନ୍ତୁ |",
            "25-30 ଦିନର ପୁରୁଣା ଚାରା ରୋପଣ ଏକ ନିର୍ଦ୍ଦିଷ୍ଟ ବ୍ଯ଼ବଧାନ ଏବଂ ଗଭୀରତାରେ ପୂର୍ବରୁ ପ୍ରସ୍ତୁତ ଜମିରେ କରାଯିବା ଉଚିତ।",
            "କୃଷକମାନଙ୍କୁ ବିସ୍ତୃତ ଏବଂ ଉନ୍ନତ ବନ୍ଧ ତିଆରି କରି ଭବିଷ୍ଯ଼ତରେ ବ୍ଯ଼ବହାର ପାଇଁ ବର୍ଷା ଜଳ ସଞ୍ଚଯ଼ କରିବାକୁ ପରାମର୍ଶ ଦିଆଯାଇଛି।",
            "ପ୍ରତି ପାହାଡ଼ରେ ସଂକର ଏବଂ ଚାରା ପାଇଁ ନିର୍ଦ୍ଦିଷ୍ଟ ପରାମର୍ଶ।"
         ]
      },
      "maize": {
         "advisory": [
            "ଆଗାଛା ବୃଦ୍ଧି ପାଇଁ ବୁଣିବା ପରେ ସମଯ଼ ଗୁରୁତ୍ୱପୂର୍ଣ୍ଣ, ହାତ ଦ୍ୱାରା ହୋଇଂ ଏବଂ ତୃଣନାଶକର ପ୍ରାକ-ଉତ୍ଥାନ ପ୍ରଯ଼ୋଗ ସୁପାରିଶ କରାଯାଏ |",
            "ଆଗାମୀ ବର୍ଷା ପୂର୍ବାନୁମାନ ଆଧାରରେ ସିଞ୍ଚନ ଏବଂ ଆନ୍ତଃସାଂସ୍କୃତିକ କାର୍ଯ୍ଯ଼ରେ ବିଳମ୍ବ କରନ୍ତୁ।"
         ]
      },
      "cotton": {
         "advisory": [
            "କ୍ଷେତରୁ ଅତିରିକ୍ତ ଜଳ ନିଷ୍କାସନ ଏବଂ ନାଇଟ୍ରୋଜେନ୍ ସାର ଟପ୍ ଡ୍ରେସିଂ ଏବଂ ଅନ୍ଯ଼ାନ୍ଯ଼ କାର୍ଯ୍ଯ଼କଳାପକୁ ବର୍ଷା ପରିସ୍ଥିତି ଉପରେ ଆଧାର କରି ବିଳମ୍ବ କରିବାର ବ୍ଯ଼ବସ୍ଥା।"
         ]
      },
      "vegetable crops": {
         "advisory": [
            "ଖରିଫ ପନିପରିବା ଫସଲ ପାଇଁ ଉପଯୁକ୍ତ ଜଳ ନିଷ୍କାସନ ବ୍ଯ଼ବସ୍ଥା ସହିତ ଉଠାଯାଇଥିବା ଶଯ୍ଯ଼ା ନର୍ସରୀ ପ୍ରସ୍ତୁତି ଆରମ୍ଭ କରନ୍ତୁ।",
            "ନିର୍ଦ୍ଦିଷ୍ଟ ସମଯ଼ରେ ରୋପଣ ଏବଂ ଆନ୍ତଃସାଂସ୍କୃତିକ କାର୍ଯ୍ଯ଼କଳାପରୁ ଦୂରେଇ ରୁହନ୍ତୁ ଏବଂ କ୍ଷେତରୁ ଅତିରିକ୍ତ ଜଳ ବାହାର କରନ୍ତୁ |"
         ]
      },
      "animal husbandry": {
         "advisory": [
            "ବର୍ଷା ଋତୁରେ ମଶା, ମାଛି ଏବଂ ଅଣୁଜୀବ କାର୍ଯ୍ଯ଼କଳାପ ବୃଦ୍ଧି ହେତୁ ପଶୁମାନଙ୍କର କୃମି ଦୂରୀକରଣ ଏବଂ ଟୀକାକରଣ ନିଶ୍ଚିତ କରାଯିବା ଉଚିତ।",
            "ପଶୁମାନଙ୍କ ପାଇଁ ନିରାପଦ ଆଶ୍ରଯ଼ ପ୍ରଦାନ କରନ୍ତୁ, ପାନୀଯ଼ ଜଳ ସହିତ ବର୍ଷା ଜଳ ମିଶ୍ରଣରୁ ଦୂରେଇ ରୁହନ୍ତୁ ଏବଂ ପଶୁମାନଙ୍କୁ ସ୍ୱଚ୍ଛ ଜଳ ପ୍ରଦାନ କରନ୍ତୁ।"
         ]
      }
   },
   "date": "30-07-2024"
}