{
   "weather_details": {
      "21-09-2024": {
         "rainfall": 2,
         "t_max": 34,
         "t_min": 26,
         "rh_max": 55,
         "rh_min": 84,
         "wind_speed": 4,
         "wind_direction": 165,
         "cloud_cover": 5
      },
      "22-09-2024": {
         "rainfall": 2,
         "t_max": 35,
         "t_min": 26,
         "rh_max": 52,
         "rh_min": 83,
         "wind_speed": 5,
         "wind_direction": 150,
         "cloud_cover": 5
      },
      "23-09-2024": {
         "rainfall": 5,
         "t_max": 35,
         "t_min": 26,
         "rh_max": 55,
         "rh_min": 83,
         "wind_speed": 5,
         "wind_direction": 150,
         "cloud_cover": 7
      },
      "24-09-2024": {
         "rainfall": 7,
         "t_max": 34,
         "t_min": 25,
         "rh_max": 56,
         "rh_min": 84,
         "wind_speed": 6,
         "wind_direction": 108,
         "cloud_cover": 7
      },
      "25-09-2024": {
         "rainfall": 10,
         "t_max": 32,
         "t_min": 24,
         "rh_max": 52,
         "rh_min": 90,
         "wind_speed": 8,
         "wind_direction": 103,
         "cloud_cover": 7
      }
   },
   "names_of_crops": [
      "ଚାଉଳ",
      "କପା",
      "ପନିପରିବା ଫସଲ",
      "ଗାଈ/ମଇଁଷି"
   ],
   "general_advisory": "ବର୍ଷା ନହୋଇଥିବା କ୍ଷେତ୍ରରେ କ୍ଷେତରେ ଆବଶ୍ଯ଼କତା ଆଧାରିତ ଜଳସେଚନ କରାଯାଇଥାଏ। ଫଳ ବଗିଚା ଏବଂ ପନିପରିବା କ୍ଷେତରେ ଭଲ ଜଳ ନିଷ୍କାସନ ବ୍ଯ଼ବସ୍ଥା ପାଇଁ ବ୍ଯ଼ବସ୍ଥା କରନ୍ତୁ। ପ୍ରଚଳିତ ପାଣିପାଗ ସ୍ଥିତି ସମସ୍ତ ପ୍ରକାରର ଫସଲରେ କ୍ଷୁଦ୍ର କୀଟ ଆକ୍ରମଣ ପାଇଁ ଅନୁକୂଳ, ତେଣୁ ଏହାର ନିଯ଼ମିତ ତଦାରଖ ପାଇଁ ପରାମର୍ଶ ଦିଆଯିବା ଉଚିତ। କୃଷକମାନେ ଫସଲରେ ନାଇଟ୍ରୋଜେନ୍ ସାରର ଅତ୍ଯ଼ଧିକ ବ୍ଯ଼ବହାରରୁ ଦୂରେଇ ରହିବା ଉଚିତ କାରଣ ଏହା ଉଦ୍ଭିଦ ବୃଦ୍ଧି ଅବଧିକୁ ବୃଦ୍ଧି କରିପାରେ ଏବଂ ବିଭିନ୍ନ କୀଟପତଙ୍ଗକୁ ମଧ୍ଯ଼ ଆକର୍ଷିତ କରିପାରେ।",
   "crops_data": {
      "rice": {
         "advisory": [
            "ସଠିକ ବୃଦ୍ଧି ପାଇଁ କୃଷକମାନେ ଧାନ କ୍ଷେତରେ 5 ସେ. ମି. ଜଳ ସ୍ତର ବଜାଯ଼ ରଖିବା ଉଚିତ।",
            "ରୋଗ ପରିଚାଳନାଃ ବ୍ୟାକ୍ଟେରିଆଲ୍ ଲିଫ୍ ବ୍ଲାଇଟ୍ ଆକ୍ରମଣ ମଧ୍ୟ ପରିଲକ୍ଷିତ ହୁଏ, ତେଣୁ ସ୍ୱଚ୍ଛ ଏବଂ ଶାନ୍ତ ପାଗରେ କପର ଅକ୍ସିକ୍ଲୋରାଇଡ୍ ଏବଂ ସ୍ଟ୍ରେପ୍ଟୋସାଇକ୍ଲିନ୍ ସିଞ୍ଚନ କରିବାକୁ ପରାମର୍ଶ ଦିଆଯାଏ |",
            "କୀଟ ପରିଚାଳନାଃ କେସ୍ କୃମି ଆକ୍ରମଣ ପରିଲକ୍ଷିତ ହୁଏ, କୃଷକମାନଙ୍କୁ ସ୍ୱଚ୍ଛ ପାଗରେ ଫିପ୍ରୋନିଲ୍ କିମ୍ବା ପ୍ରୋଫେନୋଫସ୍ ସ୍ପ୍ରେ କରିବାକୁ ପରାମର୍ଶ ଦିଆଯାଏ | ପୂର୍ବ ପାଣିପାଗ ସ୍ଥିତି ଧାନ କ୍ଷେତରେ ପିତ୍ତ ମିଜ୍ ଆକ୍ରମଣ ପାଇଁ ଅନୁକୂଳ ଥିଲା, ଯେଉଁଥିପାଇଁ ନିୟନ୍ତ୍ରଣ ପଦକ୍ଷେପ ନେବାକୁ ପରାମର୍ଶ ଦିଆଯାଇଛି।"
         ]
      },
      "cotton": {
         "advisory": [
            "କପା ଫସଲରେ ଫୁଲର ହ୍ରାସକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ, ବୁଣିବା ପରେ ଏକ ନିର୍ଦ୍ଦିଷ୍ଟ ସମୟ ପରେ ପ୍ଲାନୋଫିକ୍ସ ପ୍ରୟୋଗ କରିବାକୁ ପରାମର୍ଶ ଦିଆଯାଏ |",
            "ଶୋଷକ କୀଟ ଆକ୍ରମଣକୁ ନିଯ଼ନ୍ତ୍ରଣ କରିବା ପାଇଁ, ଏକ ନିର୍ଦ୍ଦିଷ୍ଟ ଫସଲ ପର୍ଯ୍ଯ଼ାଯ଼ରେ ନିମ ଆଧାରିତ କୀଟନାଶକ ପ୍ରଯ଼ୋଗ କରିବାକୁ ପରାମର୍ଶ ଦିଆଯାଏ |",
            "ଫୁଲ ଫୁଟିବାର ପ୍ରାରମ୍ଭିକ ପର୍ଯ୍ୟାୟରେ, କପା ଫସଲରେ କୌଣସି ରାସାୟନିକ ପ୍ରୟୋଗରୁ ଦୂରେଇ ରୁହନ୍ତୁ।"
         ]
      },
      "vegetable crops": {
         "advisory": [
            "ବାଇଗଣ, ଟମାଟୋ, ଓକ୍ରା ଆଦିରେ ଫଳ ଏବଂ ଅଙ୍କୁର ଛେଦକକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ, ପ୍ରାରମ୍ଭିକ ପର୍ଯ୍ୟାୟରେ ନିମ୍ବ ଆଧାରିତ କୀଟନାଶକ ସିଞ୍ଚନ କରିବାକୁ ପରାମର୍ଶ ଦିଆଯାଇଛି।",
            "ଯଦି ଶୋଷକ କୀଟପତଙ୍ଗ ଆକ୍ରମଣ ଲକ୍ଷ୍ୟ କରାଯାଏ, ତେବେ ନିର୍ଦ୍ଦିଷ୍ଟ କୀଟନାଶକ ସିଞ୍ଚନ କରିବାକୁ ପରାମର୍ଶ ଦିଆଯାଏ |",
            "ୱିଲ୍ଟ, ରୁଟ୍ ରଟ୍ ଇତ୍ଯ଼ାଦି ରୋଗକୁ ନିଯ଼ନ୍ତ୍ରଣ କରିବା ପାଇଁ, ନିର୍ଦ୍ଦିଷ୍ଟ ଫଙ୍ଗିସାଇଡ୍ ବ୍ଯ଼ବହାର କରାଯିବା ଉଚିତ୍ |"
         ]
      },
      "cow/buffalo": {
         "advisory": [
            "ମାଷ୍ଟାଇଟିସ୍ ରୋଗ ପ୍ରତିରୋଧ ଏବଂ ନିଯ଼ନ୍ତ୍ରଣ ପଦକ୍ଷେପଗୁଡିକ ପରିମଳ, ଆର୍ଦ୍ର ଚଟାଣ ପୃଷ୍ଠକୁ ରୋକିବା ଏବଂ ମଧୁର ଜଳ ଉପଲବ୍ଧତା ସୁନିଶ୍ଚିତ କରିବା ସହିତ ପରାମର୍ଶ ଦିଆଯାଇଛି |",
            "ଗୁରୁତର କ୍ଷେତ୍ରରେ ନିକଟସ୍ଥ ପଶୁ ସ୍ୱାସ୍ଥ୍ଯ଼ କେନ୍ଦ୍ରରୁ ଡାକ୍ତରଙ୍କ ପରାମର୍ଶ ନିଅନ୍ତୁ।"
         ]
      }
   },
   "date": "20-09-2024"
}