{
   "weather_details": {
      "18-01-2025": {
         "rainfall": 0,
         "t_max": 28,
         "t_min": 12,
         "rh_max": 64,
         "rh_min": 23,
         "wind_speed": 0,
         "wind_direction": 90,
         "cloud_cover": 3
      },
      "19-01-2025": {
         "rainfall": 0,
         "t_max": 28,
         "t_min": 12,
         "rh_max": 54,
         "rh_min": 20,
         "wind_speed": 2,
         "wind_direction": 323,
         "cloud_cover": 3
      },
      "20-01-2025": {
         "rainfall": 0,
         "t_max": 28,
         "t_min": 12,
         "rh_max": 57,
         "rh_min": 24,
         "wind_speed": 2,
         "wind_direction": 53,
         "cloud_cover": 2
      },
      "21-01-2025": {
         "rainfall": 0,
         "t_max": 28,
         "t_min": 12,
         "rh_max": 51,
         "rh_min": 23,
         "wind_speed": 3,
         "wind_direction": 118,
         "cloud_cover": 3
      },
      "22-01-2025": {
         "rainfall": 0,
         "t_max": 29,
         "t_min": 13,
         "rh_max": 48,
         "rh_min": 24,
         "wind_speed": 3,
         "wind_direction": 100,
         "cloud_cover": 3
      }
   },
   "names_of_crops": [
      "ଶୁଖିଲା ଋତୁ ଚାଉଳ",
      "ସୋରିଷ",
      "ଫଳ ଏବଂ ପନିପରିବା ଫସଲ",
      "ପଶୁପାଳନ"
   ],
   "general_advisory": "ବର୍ଦ୍ଧିତ ପରିସର ପୂର୍ବାନୁମାନ. ଫିଡ୍ ଅନୁଯାୟୀ।",
   "crops_data": {
      "dry season rice": {
         "advisory": [
            "ନର୍ସରୀରେ ଆଗାଛାକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ କୃଷକମାନେ ଚାରା ବୁଣିବା (ଡିଏଏସ) ର 3-5 ଦିନ ପରେ ଏକର ପିଛା 80 ଗ୍ରାମ ପିଛା ପାଇରାଜୋସଲ୍ଫୁରନ-ଇଥାଇଲ 10 ପ୍ରତିଶତ ଡବ୍ଲ୍ୟୁ. ପି. କିମ୍ବା 140 ଲିଟର ପାଣିରେ 10-12 ଡିଏଏସ (କିମ୍ବା 2-3 ପତ୍ର ସ୍ତର) ରେ ଏକର ପିଛା 120 ମିଲିଲିଟର ପିଛା ବିସ୍ପିରିବାକ୍ ସୋଡ଼ିଅମ ସ୍ପ୍ରେ କରିବା ଉଚିତ।",
            "ଯଦି ଚାରା ରୋଗ ସଂକ୍ରମଣ ଦେଖାଯାଏ, ତେବେ 200 ଲିଟର ପାଣିରେ ଏକର ପିଛା 400 ଗ୍ରାମ୍ କାର୍ବେନଡାଜିମ୍ କିମ୍ବା ଏକର ପିଛା 200 ଗ୍ରାମ୍ ପ୍ରୋପିକୋନାଜୋଲ୍ ସ୍ପ୍ରେ କରନ୍ତୁ।",
            "3 ରୁ 5 ସପ୍ତାହ ପୁରୁଣା ଚାରା ଗୁଡ଼ିକୁ 15 ସେ. ମି. × 15 ସେ. ମି. ବ୍ୟବଧାନରେ ଭଲ ଭାବରେ କାଦୁଅ ହୋଇଥିବା ମାଟିରେ, ଅଗଭୀର ଗଭୀରତାରେ ପ୍ରତି ପାହାଡ଼ରେ 3 ରୁ 4 ଚାରା ସହିତ ରୋପଣ କରିବା ପାଇଁ ପରାମର୍ଶ ଦିଆଯିବା ଉଚିତ। ଅନ୍ତିମ ପୁଡଲିଂ ସମୟରେ (ଡିଏପି 44 କେଜି + ଏମଓପି 22 କେଜି) କିମ୍ବା (ୟୁରିଆ 22 କେଜି + ଏସଏସପି 125 କେଜି + ଏମଓପି 22 କେଜି) ବେସାଲ୍ ମାତ୍ରା ଭାବରେ ପ୍ରୟୋଗ କରନ୍ତୁ।"
         ]
      },
      "mustard": {
         "advisory": [
            "ପ୍ରଚଳିତ ପାଣିପାଗ ସ୍ଥିତି ସୋରିଷ ଫସଲରେ ଏଫିଡ୍ ଆକ୍ରମଣକୁ ପସନ୍ଦ କରେ ତେଣୁ ଏହି କୀଟ ବିରୁଦ୍ଧରେ ନିୟମିତ ତଦାରଖ କରିବାକୁ ପରାମର୍ଶ ଦିଆଯିବା ଉଚିତ |",
            "ବର୍ତ୍ତମାନ, କେତେକ କୃଷକଙ୍କ କ୍ଷେତରେ ଏହି ପତଙ୍ଗର ଆକ୍ରମଣ ଦେଖିବାକୁ ମିଳୁଛି, ତେଣୁ ଶୁଖିଲା ପାଗ ସ୍ଥିତିରେ ହେକ୍ଟର ପିଛା 500 ଲିଟର ପାଣି ପିଛା ଏସିଟାମିପ୍ରିଡ୍ @125 ଗ୍ରାମ୍ କିମ୍ବା ଲିଟର ପିଛା 0.5 ମିଲି ଇମିଡାକ୍ଲୋପ୍ରିଡ୍ ସିଞ୍ଚନ କରିବା ଉଚିତ।",
            "ଫୁଲ ଫୁଟିବାର ପ୍ରାରମ୍ଭିକ ପର୍ଯ୍ୟାୟରେ କୀଟନାଶକ ପ୍ରୟୋଗରୁ ଦୂରେଇ ରହିବା ଉଚିତ।"
         ]
      },
      "fruit and vegetable crops": {
         "advisory": [
            "ଆମ୍ବ ଗୁଳ୍ମକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ ଆମ୍ବ ଗଛରେ ପଲିଥିନ୍/ଆଲ୍କାଥେନ୍ ଚାଦରକୁ ଜୋରରେ ବାନ୍ଧି ରଖନ୍ତୁ। ରୋଗାକ୍ରାନ୍ତ ଏବଂ ଅନାବଶ୍ୟକ ଶାଖା ଏବଂ ପତ୍ର ଗୁଡ଼ିକର ପ୍ରଶିକ୍ଷଣ ଏବଂ ଛାଣିବା ପାଇଁ ପରାମର୍ଶ ଦିଆଯିବା ଉଚିତ।",
            "ଶୀତ ଋତୁରେ କ୍ଷେତରେ ମୃତ୍ତିକାର ଆର୍ଦ୍ରତା ତଥା ତାପମାତ୍ରା ବଜାୟ ରଖିବା ପାଇଁ ଷ୍ଟ୍ରା ମଲ୍ଚିଙ୍ଗ ସାମଗ୍ରୀ ଭାବରେ ବ୍ୟବହୃତ ହୋଇପାରେ |",
            "ପରିପକ୍ୱ ଫସଲର ଅମଳ ତଥା ଉଦ୍ଭିଦ ବୃଦ୍ଧି ପର୍ଯ୍ୟାୟରେ ଥିବା ଫସଲରେ ଗୋଟିଏ ହାଲୁକା ଜଳସେଚନ ପରାମର୍ଶ ଦିଆଯିବା ଉଚିତ କାରଣ ଆଗାମୀ ସପ୍ତାହରେ ଶୁଖିଲା ପାଗ ଆଶା କରାଯାଏ |"
         ]
      },
      "livestock": {
         "advisory": [
            "ପଶୁମାନଙ୍କ ଶଯ୍ୟା ଭାବରେ ଶୁଖିଲା ନଡ଼ିଆ ସମେତ ଶୀତଳ ପବନରେ ପଶୁମାନଙ୍କର ସିଧାସଳଖ ସଂସ୍ପର୍ଶରେ ଆସିବାକୁ ଏଡ଼ାଇବା ପାଇଁ ରାତିରେ ପଶୁ ଆଶ୍ରୟସ୍ଥଳକୁ ଚାରି ପାର୍ଶ୍ୱରୁ ଆଚ୍ଛାଦନ କରନ୍ତୁ |",
            "ଦୁର୍ବଳ ଏବଂ ଅସୁସ୍ଥ ପଶୁମାନଙ୍କୁ ଥଣ୍ଡାରୁ ରକ୍ଷା କରିବା ପାଇଁ ବସ୍ତା କପଡ଼ାରେ ଢାଙ୍କିବା ଉଚିତ। ଏଥି ସହିତ, ରାତିରେ, ସମସ୍ତ ପଶୁମାନଙ୍କୁ ଏକ ଆଚ୍ଛାଦିତ ଆଶ୍ରୟସ୍ଥଳୀରେ ରଖିବା ଉଚିତ୍ |",
            "ପଶୁମାନଙ୍କୁ ଆର୍ଦ୍ର ସ୍ଥାନରେ ରଖିବା ଠାରୁ ଦୂରେଇ ରୁହନ୍ତୁ, ଏବଂ ସେମାନଙ୍କୁ ନିଆଁରୁ ଧୂଆଁରୁ ରକ୍ଷା କରନ୍ତୁ ଯାହା ଉତ୍ତାପ ପ୍ରଦାନ କରିବା ପାଇଁ ଜଳାଯାଏ | ଆର୍ଦ୍ରତା ଏବଂ ଧୂଆଁ ନିମୋନିଆ ସଂକ୍ରମିତ ହେବାର ସମ୍ଭାବନାକୁ ବୃଦ୍ଧି କରେ |",
            "ପଶୁମାନଙ୍କ ଶରୀରର ତାପମାତ୍ରା ବଜାୟ ରଖିବା ପାଇଁ, ସେମାନଙ୍କୁ ଥଣ୍ଡା ସମୟରେ ଶରୀରକୁ ଆଚ୍ଛାଦନ କରିବା ସହିତ ତୈଳ କେକ୍ ଏବଂ ଗୁଡ଼୍ର ମିଶ୍ରଣ ସହିତ ଖାଇବାକୁ ଦେବା ଉଚିତ୍ | ଗର୍ଭବତୀ ପଶୁମାନଙ୍କୁ (> 6 ମାସ) ଅତିରିକ୍ତ ଖାଦ୍ୟ ଦିଆଯିବା ଉଚିତ।"
         ]
      }
   },
   "date": "17-01-2025"
}