{
   "weather_details": {
      "20/11/2024": {
         "rainfall": 0,
         "t_max": 30,
         "t_min": 13,
         "rh_max": 72,
         "rh_min": 30,
         "wind_speed": 4,
         "wind_direction": 22,
         "cloud_cover": 1
      },
      "21/11/2024": {
         "rainfall": 0,
         "t_max": 30,
         "t_min": 12,
         "rh_max": 74,
         "rh_min": 31,
         "wind_speed": 4,
         "wind_direction": 29,
         "cloud_cover": 0
      },
      "22/11/2024": {
         "rainfall": 0,
         "t_max": 30,
         "t_min": 12,
         "rh_max": 74,
         "rh_min": 31,
         "wind_speed": 4,
         "wind_direction": 29,
         "cloud_cover": 2
      },
      "23/11/2024": {
         "rainfall": 0,
         "t_max": 30,
         "t_min": 12,
         "rh_max": 71,
         "rh_min": 29,
         "wind_speed": 4,
         "wind_direction": 29,
         "cloud_cover": 0
      },
      "24/11/2024": {
         "rainfall": 0,
         "t_max": 29,
         "t_min": 11,
         "rh_max": 66,
         "rh_min": 27,
         "wind_speed": 4,
         "wind_direction": 31,
         "cloud_cover": 1
      }
   },
   "names_of_crops": [
      "ଧାନ।",
      "ଚିନାବାଦାମ",
      "ଗ୍ରାମ୍",
      "ଆଳୁ",
      "ସୋରିଷ",
      "ପନିପରିବା",
      "କୁକୁଡ଼ା ମାଂସ",
      "ପଶୁପାଳନ"
   ],
   "general_advisory": "ରବି ଫସଲ ପାଇଁ, କୃଷକମାନେ ନଭେମ୍ବର ମାସରେ ପତିତ କ୍ଷେତରେ ସେମାନଙ୍କର କ୍ଷେତ୍ର କାର୍ଯ୍ୟ ଆରମ୍ଭ କରିପାରିବେ। କ୍ଷେତରେ ପର୍ଯ୍ୟାପ୍ତ ଆର୍ଦ୍ରତା ଥିଲେ, ଯୋଡ଼ା ଫସଲ ବୁଣନ୍ତୁ।",
   "crops_data": {
      "paddy": {
         "advisory": [
            "ଫିଜିଓଲୋଜିକାଲ୍ ପରିପକ୍ୱତା ପର୍ଯ୍ଯ଼ାଯ଼-ମିଥ୍ଯ଼ା ସ୍ଥାନୀଯ଼ କ୍ଷେତ୍ର, କପର୍ ହାଇଡ୍ରୋକ୍ସାଇଡ୍ 77 ପ୍ରତିଶତ @2 ଗ୍ରାମ୍/ଲିଟର କିମ୍ବା ଟେବୁକୋନାଜୋଲ୍ 25 ପ୍ରତିଶତ @2 ଗ୍ରାମ୍/ଲିଟର ସ୍ପ୍ରେ କରନ୍ତୁ ମିଥ୍ଯ଼ା ସ୍ମଟ୍ର ପ୍ରଭାବଶାଳୀ ନିଯ଼ନ୍ତ୍ରଣ ପାଇଁ ସାତ ଦିନ ବ୍ଯ଼ବଧାନରେ ସ୍ପ୍ରେ ପୁନରାବୃତ୍ତି କରନ୍ତୁ |"
         ]
      },
      "groundnut": {
         "advisory": [
            "ବୁଣିବା ପର୍ଯ୍ଯ଼ାଯ଼-ତାପମାତ୍ରା ହ୍ରାସ ହେତୁ, ବିଳମ୍ବ ନକରି ଧରଣୀ, କଳିଙ୍ଗ ଚିନାବାଦାମ, କଦ୍ରି ପରି ଚିନାବାଦାମ ବୁଣିବା ପାଇଁ ଯାଆନ୍ତୁ। ବୁଣିବା ପୂର୍ବରୁ ଏକର ପିଛା 35 କି. ଗ୍ରା. ଡିଏପି ଏବଂ 4 କି. ଗ୍ରା. ଯ଼ୁରିଆ ଏବଂ 26 କି. ଗ୍ରା. ଏମ୍. ଓ. ପି. ପ୍ରଯ଼ୋଗ କରନ୍ତୁ। ଧାଡ଼ି ଠାରୁ ଧାଡ଼ି ମଧ୍ଯ଼ରେ 25 ସେ. ମି. ବ୍ଯ଼ବଧାନ ରଖନ୍ତୁ ଏବଂ ଗଛ ଠାରୁ ଗଛ ମଧ୍ଯ଼ରେ 10 ସେ. ମି. ବ୍ଯ଼ବଧାନ ରଖନ୍ତୁ ଏବଂ ବୀଜକୁ 3 ସେ. ମି. ଗଭୀରତାରେ ରଖନ୍ତୁ।"
         ]
      },
      "gram": {
         "advisory": [
            "ବୁଣିବା ପର୍ଯ୍ଯ଼ାଯ଼-ଚଣା ବୁଣିବା ଉଚିତ। ବୁଣିବା ପୂର୍ବରୁ କୃଷକମାନଙ୍କୁ ଗ୍ରାମୀଣ କୃଷି ମୌସୁମୀ ସେବା ଭାରତୀଯ଼ ପାଣିପାଗ ବିଭାଗକୁ ଉତ୍ତମ ବିହନ ଅଙ୍କୁରୋଦଗମ ପାଇଁ ମୃତ୍ତିକାର ସର୍ବୋତ୍ତମ ଆର୍ଦ୍ରତା ସୁନିଶ୍ଚିତ କରିବାକୁ ପରାମର୍ଶ ଦିଆଯାଇଛି। ବୀଜ ହାରଃ-60-80 ଛୋଟ ଏବଂ ମଧ୍ଯ଼ମ ଆକାରର କିସମ ପାଇଁ କିଲୋଗ୍ରାମ ଏବଂ ବଡ଼ ଆକାରର ପ୍ରଜାତି ପାଇଁ 80-100 କିଲୋଗ୍ରାମ। R x R ବ୍ଯ଼ବଧାନ 30-35 ସେ. ମି. ବଜାଯ଼ ରଖାଯିବ। ବୁଣିବା ପୂର୍ବରୁ, ବୀଜକୁ ରାଇଜୋବିଯ଼ମ୍ ସଂସ୍କୃତି ଏବଂ ଫସଫରସ୍ ଦ୍ରବଣୀଯ଼ ବ୍ଯ଼ାକ୍ଟେରିଆ ସହିତ ଚିକିତ୍ସା କରାଯିବା ଉଚିତ୍ |"
         ]
      },
      "potato": {
         "advisory": [
            "ବୁଣିବା ପର୍ଯ୍ଯ଼ାଯ଼-କେ. ପୋଖରାଜ, କେ. ଲଲିମା, କେ. ସିନ୍ଦୁରୀ, କେ. ସୂର୍ଯ୍ଯ଼ ପରି ମଞ୍ଜି ସଂଗ୍ରହ କରନ୍ତୁ @608 କ୍ଯ଼ୁ/ଏସି। ଉପଯୁକ୍ତ ଅଙ୍କୁରୋଦଗମ ପାଇଁ ମଞ୍ଜି ସାମଗ୍ରୀକୁ ବସ୍ତା ଭିତରେ 5-7 ଦିନ ରଖନ୍ତୁ। 20 ଗ୍ରାମ୍ ମାନକୋଜେବ୍, 1 ଗ୍ରାମ୍ ଷ୍ଟ୍ରେପ୍ଟୋସାଇକ୍ଲିନ୍ ସହିତ 10 ଲିଟର ପାଣିରେ ମଞ୍ଜି ମିଶାନ୍ତୁ ଏବଂ କନ୍ଦଗୁଡ଼ିକୁ 30 ମିନିଟ୍ ଗଭୀର କରନ୍ତୁ ଏବଂ ତା 'ପରେ ଶୁଖାନ୍ତୁ ଏବଂ ଛାଣି ଦିଅନ୍ତୁ | ଅନ୍ତିମ ଜମି ପ୍ରସ୍ତୁତି ସମଯ଼ରେ ଏକର ପିଛା 5 ଟନ ଏଫ୍. ୱାଇ. ଏମ୍. ପ୍ରଯ଼ୋଗ କରନ୍ତୁ।"
         ]
      },
      "mustard": {
         "advisory": [
            "ବୁଣିବା ପର୍ଯ୍ଯ଼ାଯ଼-ବୁଣିବା ପରେ 10 ଦିନ ପରେ ପତଳା କରିବା କାର୍ଯ୍ଯ଼ କରନ୍ତୁ ଏବଂ ସୁସ୍ଥ ଉଦ୍ଭିଦ ରଖନ୍ତୁ ଏବଂ ଉପଯୁକ୍ତ ଉଦ୍ଭିଦ ସଂଖ୍ଯ଼ା ବଜାଯ଼ ରଖନ୍ତୁ |"
         ]
      },
      "vegetables": {
         "advisory": [
            "ବୁଣିବା ପର୍ଯ୍ଯ଼ାଯ଼-ବର୍ତ୍ତମାନ କୃଷକମାନେ ଶୀତକାଳୀନ ପନିପରିବା ଯେପରିକି ଫୁଲକୋବି, ବନ୍ଧାକୋବି, ଲଙ୍କା, ଟମାଟୋ, ବାଇଗଣ ଇତ୍ଯ଼ାଦି ଚାରା ରୋପଣ କରିପାରିବେ। ବୁଣିବା ପୂର୍ବରୁ ମଞ୍ଜି ଗୁଡ଼ିକୁ କବକନାଶକ ଦ୍ୱାରା ଚିକିତ୍ସା କରାଯିବା ଉଚିତ।"
         ]
      },
      "poultry": {
         "advisory": [
            "କୁକୁଡ଼ା ଘରକୁ ଗରମ ରଖିବା ପାଇଁ ତାପମାତ୍ରା ବଜାଯ଼ ରଖିବା ପାଇଁ କନ୍ଦ ରଖନ୍ତୁ | ଘରଟିକୁ ବ୍ଯ଼ାଗରେ ଢାଙ୍କି ଦିଅନ୍ତୁ।"
         ]
      },
      "animal husbandry": {
         "advisory": [
            "ଥଣ୍ଡାରୁ ସୁରକ୍ଷା ପାଇଁ ଛପର ଘରକୁ ଗରମ ରଖନ୍ତୁ।"
         ]
      }
   },
   "date": "19-11-2024"
}