{
   "weather_details": {
      "14/08/2024": {
         "rainfall": 16,
         "t_max": 34,
         "t_min": 26,
         "rh_max": 91,
         "rh_min": 63,
         "wind_speed": 9,
         "wind_direction": 212,
         "cloud_cover": 6
      },
      "15/08/2024": {
         "rainfall": 6,
         "t_max": 35,
         "t_min": 26,
         "rh_max": 92,
         "rh_min": 71,
         "wind_speed": 10,
         "wind_direction": 207,
         "cloud_cover": 6
      },
      "16/08/2024": {
         "rainfall": 7,
         "t_max": 35,
         "t_min": 27,
         "rh_max": 93,
         "rh_min": 81,
         "wind_speed": 11,
         "wind_direction": 225,
         "cloud_cover": 7
      },
      "17/08/2024": {
         "rainfall": 7,
         "t_max": 35,
         "t_min": 27,
         "rh_max": 92,
         "rh_min": 75,
         "wind_speed": 9,
         "wind_direction": 225,
         "cloud_cover": 7
      },
      "18/08/2024": {
         "rainfall": 10,
         "t_max": 34,
         "t_min": 26,
         "rh_max": 93,
         "rh_min": 73,
         "wind_speed": 8,
         "wind_direction": 243,
         "cloud_cover": 7
      }
   },
   "names_of_crops": [
      "ଧାନ।",
      "ଡାଲିଗୁଡ଼ିକ",
      "ଅରହର",
      "ସିଧାସଳଖ ବୁଣାଯାଇଥିବା ଧାନ",
      "ରାଗି।",
      "ସେସମମ୍",
      "ମକା",
      "ଚିନାବାଦାମ",
      "ହଳଦୀ",
      "ପନିପରିବା",
      "ଟମାଟୋ",
      "ମତ୍ସ୍ଯ଼ଚାଷ",
      "ପଶୁପାଳନ"
   ],
   "general_advisory": "ଖରିଫ ଫସଲ 2024: ଆଗାମୀ ପାଞ୍ଚ ଦିନ ମଧ୍ଯ଼ରେ ସ୍ୱଳ୍ପରୁ ମଧ୍ଯ଼ମ ବର୍ଷା ହେବାର ପୂର୍ବାନୁମାନ ହେତୁ, ରୋପଣ କାର୍ଯ୍ଯ଼ ସମ୍ପୂର୍ଣ୍ଣ କରନ୍ତୁ। ଗତ ସପ୍ତାହରେ ବର୍ଷା ହେତୁ, ବନ୍ଧକୁ ମଜବୁତ କରି କ୍ଷେତରେ ବର୍ଷା ଜଳ ସଞ୍ଚଯ଼ କରନ୍ତୁ। ପନିପରିବା ଏବଂ ମକା ଫସଲରୁ ଅତିରିକ୍ତ ପାଣି ବାହାର କରନ୍ତୁ। ଯଦି ଉପଯୁକ୍ତ ଅଙ୍କୁରୋଦଗମ ପରିଲକ୍ଷିତ ନହୁଏ, ତେବେ ଧାନ, ମକା, ବାଜରା ଭଳି ମଞ୍ଜିଗୁଡ଼ିକର ପୁନଃ ରୋପଣ କରାଯାଇପାରିବ। ଯଦି ପୂର୍ବରୁ ପ୍ରତିରୋପଣ ନହୁଏ, ତେବେ ପୁରୁଣା ଚାରା ମଧ୍ଯ଼ ସାଧାରଣ ତୁଳନାରେ 33 ପ୍ରତିଶତ ଅଧିକ ଜନସଂଖ୍ଯ଼ା ଏବଂ 10 ପ୍ରତିଶତ ଅଧିକ ସାର ସହିତ ପ୍ରତିରୋପଣ କରାଯାଇପାରିବ।",
   "crops_data": {
      "paddy": {
         "advisory": [
            "ଫଳପ୍ରଦ ଆଗାଛା ନିଯ଼ନ୍ତ୍ରଣ ପାଇଁ ରୋପଣର 8-10 ଦିନ ପରେ 200 ଲିଟର ପାଣିରେ ଏକର ପିଛା 80 ମିଲି ବିସ୍ପିରିବାକ୍ ସୋଡିଯ଼ମ୍ ଲଗାନ୍ତୁ।"
         ]
      },
      "pulses": {
         "advisory": [
            "ଯେକୌଣସି କୀଟପତଙ୍ଗ ଏବଂ କୀଟପତଙ୍ଗ ପାଇଁ ସର୍ଭେ କରନ୍ତୁ ଏବଂ ଆବଶ୍ଯ଼କ ପଦକ୍ଷେପ ନିଅନ୍ତୁ। ଶୋଷକ କୀଟପତଙ୍ଗ ବିରୁଦ୍ଧରେ ପ୍ରତିଷେଧକ ପଦକ୍ଷେପ ପାଇଁ ଲିଟର ପିଛା 5 ମିଲିଲିଟରରେ ଆଜାଦିରାକ୍ଟିନ ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "arhar": {
         "advisory": [
            "ଆନ୍ତଃ ଚାଷ ପାଇଁ ଯାଆନ୍ତୁ"
         ]
      },
      "direct sown paddy": {
         "advisory": [
            "ଯେଉଁଠାରେ ଅସମାନ ଜନସଂଖ୍ଯ଼ା ଅଛି, ସେଠାରେ କ୍ଲୋନାଲ୍ ପଦ୍ଧତି ଦ୍ୱାରା ଶୂନ୍ଯ଼ସ୍ଥାନ ପୂରଣ କରନ୍ତୁ।"
         ]
      },
      "ragi": {
         "advisory": [
            "ବୃଦ୍ଧି ପର୍ଯ୍ଯ଼ାଯ଼ରେ ମୋଟ ନାଇଟ୍ରୋଜେନର 50 ପ୍ରତିଶତ ପ୍ରଯ଼ୋଗ କରନ୍ତୁ। ଫଳପ୍ରଦ ଆଗାଛା ନିଯ଼ନ୍ତ୍ରଣ ପାଇଁ ଲିଟର ପିଛା 3-4 ମିଲି ସୋଡ଼ିଅମ ଲୁଣ ଦେଇ 2,4-ଡି ଲଗାନ୍ତୁ।"
         ]
      },
      "sesamum": {
         "advisory": [
            "ଯଦି ପୂର୍ବରୁ ଫସଲ ବୁଣାଯାଏ ନାହିଁ, ତେବେ ଯଥାଶୀଘ୍ର ସମ୍ଭବ ଅମୃତ, ପ୍ରାଚି ଭଳି ଭଲ କିସମ ସହିତ ଏକର ପିଛା 203 କିଲୋଗ୍ରାମ ଲେଖାଏଁ 30 x 10 ସେ. ମି. ବ୍ଯ଼ବଧାନରେ ବୁଣିବା ସମ୍ପୂର୍ଣ୍ଣ କରନ୍ତୁ।"
         ]
      },
      "maize": {
         "advisory": [
            "ପାଣିପାଗ ପ୍ରଭାବ ହେତୁ ଫଲ୍ ଆର୍ମି କୃମିର ସମ୍ଭାବନା ରହିଛି, ଫଲ୍ ଆର୍ମି କୃମିର ଆକ୍ରମଣକୁ ପରିଚାଳନା କରିବା ପାଇଁ, ଇମାମେକ୍ଟିନ୍ ବେନ୍ଜୋଏଟ୍ 5 ପ୍ରତିଶତ SG @4 ଗ୍ରାମ/10lt ପାଣି ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "groundnut": {
         "advisory": [
            "ଯେକୌଣସି କୀଟ ଏବଂ କୀଟପତଙ୍ଗ ପାଇଁ ସର୍ଭେ କରନ୍ତୁ ଏବଂ ଆବଶ୍ଯ଼କ ପଦକ୍ଷେପ ନିଅନ୍ତୁ।"
         ]
      },
      "turmeric": {
         "advisory": [
            "ଆନ୍ତଃସାଂସ୍କୃତିକ କାର୍ଯ୍ଯ଼କଳାପ ପାଇଁ ଯାଆନ୍ତୁ ଏବଂ ରୋପଣର 45 ଦିନ ପରେ ଏକର ପିଛା 26 କିଲୋଗ୍ରାମ ଯ଼ୁରିଆ ଲଗାନ୍ତୁ ଏବଂ ଏକର ପିଛା 2 ଟନରେ ମଲ୍ଚିଙ୍ଗ ଲଗାନ୍ତୁ।"
         ]
      },
      "vegetables": {
         "advisory": [
            "ଗତ ସପ୍ତାହରେ ବର୍ଷା ଏବଂ ଅତ୍ଯ଼ଧିକ ଆର୍ଦ୍ରତା କାରଣରୁ ପନିପରିବା ଗଛରେ ଶୁଷ୍କତା ଦେଖାଯିବାର ସମ୍ଭାବନା ରହିଛି। କ୍ଷେତରୁ ପାଣି ବାହାର କରନ୍ତୁ। 200 ଲିଟର ପାଣିରେ ଏକର ପିଛା କାରବକ୍ସିନ + ଥିରାମ @400g କିମ୍ବା ମେଟାଲାକ୍ସିଲ 8 ପ୍ରତିଶତ + ମାନକୋଜେବ 64 ପ୍ରତିଶତ ଡବ୍ଲ୍ଯ଼ୁ. ପି. @400g ସହିତ Streoptocyline@20g ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "tomato": {
         "advisory": [
            "ଅଗଷ୍ଟ ଏବଂ ସେପ୍ଟେମ୍ବର ହେଉଛି ଟମାଟୋ ରୋପଣ ପାଇଁ ସର୍ବୋତ୍ତମ ସମଯ଼ | ଉତ୍କଳ ପ୍ରଜ୍ଞାନ ଏବଂ ସ୍ୱର୍ଣ୍ଣ ସମ୍ପଦ ଭଳି ଟମାଟୋ କିସମ ଚାଷ କରନ୍ତୁ। ଗୋଟିଏ ଏକର ଜମିରେ 150ରୁ 200 ଗ୍ରାମ ମଞ୍ଜି ଲଗାଇବା ଆବଶ୍ଯ଼କ।"
         ]
      },
      "pisciculture": {
         "advisory": [
            "ପ୍ରତି 1 ହେକ୍ଟର କ୍ଷେତ୍ର ପାଇଁ 3000-5000 ଫିଙ୍ଗରଲିଙ୍ଗ ଛାଡ଼ନ୍ତୁ। 30-40% ସର୍ଫେସ୍ ଫିଡର୍ ସିଲଭର୍ କାର୍ପ୍ ଏବଂ ଭାକୁର୍ ହେବା ଉଚିତ ଏବଂ ବାକି ମିଡ୍ ଫିଡର୍ ଏବଂ ବଟମ୍ ଫିଡର୍ ସହିତ ସମାନ ହେବା ଉଚିତ।"
         ]
      },
      "livestock": {
         "advisory": [
            "ଆର୍ଦ୍ର ଏବଂ ଆର୍ଦ୍ର ପରିବେଶ ସେଡ୍ ଭିତରେ ରୋଗ ବିସ୍ତାର କରିପାରେ ତେଣୁ ଏହାକୁ ନିଯ଼ମିତ ସଫା କରନ୍ତୁ | ବିଭାଗୀଯ଼ ଅଧିକାରୀଙ୍କ ସହ ପରାମର୍ଶ କରି ଟୀକାକରଣ ପାଇଁ ଯାଆନ୍ତୁ।"
         ]
      }
   },
   "date": "13-08-2024"
}