{
   "weather_details": {
      "2024-11-20": {
         "rainfall": 0,
         "t_max": 30,
         "t_min": 12,
         "rh_max": 76,
         "rh_min": 35,
         "wind_speed": 3,
         "wind_direction": 337,
         "cloud_cover": 2
      },
      "2024-11-21": {
         "rainfall": 0,
         "t_max": 29,
         "t_min": 12,
         "rh_max": 76,
         "rh_min": 35,
         "wind_speed": 3,
         "wind_direction": 330,
         "cloud_cover": 1
      },
      "2024-11-22": {
         "rainfall": 0,
         "t_max": 29,
         "t_min": 12,
         "rh_max": 76,
         "rh_min": 34,
         "wind_speed": 2,
         "wind_direction": 338,
         "cloud_cover": 2
      },
      "2024-11-23": {
         "rainfall": 0,
         "t_max": 29,
         "t_min": 12,
         "rh_max": 75,
         "rh_min": 32,
         "wind_speed": 2,
         "wind_direction": 90,
         "cloud_cover": 2
      },
      "2024-11-24": {
         "rainfall": 0,
         "t_max": 28,
         "t_min": 13,
         "rh_max": 68,
         "rh_min": 32,
         "wind_speed": 3,
         "wind_direction": 90,
         "cloud_cover": 1
      }
   },
   "names_of_crops": [
      "rice",
      "green gram",
      "brinjal",
      "common fish"
   ],
   "general_advisory": "Drain out the water from paddy field, 15 days before harvesting of the crop. Harvest the rice crop at physiological maturity (85% grains matured in a panicle) and looks pale yellow in colour. Harvest the crop by leaving one metre from the bund if grain is to be kept for seed purpose. Dry the harvested paddy grains in direct sunlight for 2-3 days to get the moisture content at 14%. For seed purpose, the grain should be dried to below 12% moisture content. All the harvested product must be stored in clean bags and cover with polythene to protect from untimely rain.",
   "crops_data": {
      "rice": {
         "advisory": [
            "If population of Brown Planthopper (BPH) exceeds ETL (5-10 hoppers/hill), it is advised to alter the micro-climate of the rice field by alternate wetting and drying technique (water should not stand in the field for a long time). If the problem still persists, spray Triflumezopyrim 10% SC @ 94 ml/acre or Pymetrozine 50% WG @ 120 g/acre or Dinotefuran 20% SG @ 80 g/acre or Imidacloprid 17.8% SL @ 50 ml/acre or Acephate 75% SP @ 400 g/acre. Use pesticides recommended for BPH at specified dose only. Avoid using nitrogenous fertilizers during infestation of BPH."
         ]
      },
      "green gram": {
         "advisory": [
            "Spodoptera infestation has been noticed in green gram. Spray Emamectin Benzoate 5% SG @ 90 gm per 200 litres of water per acre of land."
         ]
      },
      "brinjal": {
         "advisory": [
            "Bacterial wilt has been noticed in brinjal. Soil drench with Copper oxychloride 50 WP @ 600 gm + plantomycin @ 200 gm in 200 liters of water per acre to control wilting in brinjal."
         ]
      },
      "common fish": {
         "advisory": [
            "During winters, various fungal, bacterial, and parasitic diseases may appear in the fish. Treat the pond with CIF AX @ 400 ml/acre just before the onset of winters. Also treat the pond with potassium permanganate @ 1-2 kg/acre or limestone @ 50-100 kg/acre. Salt application @ 100 kg/acre also helps in protecting fish against disease outbreak during winters."
         ]
      }
   },
   "date": "19-11-2024"
}