{
   "weather_details": {
      "03-07-2024": {
         "rainfall": 10,
         "t_max": 33,
         "t_min": 26,
         "rh_max": 69,
         "rh_min": 54,
         "wind_speed": 19,
         "wind_direction": 248,
         "cloud_cover": 8
      },
      "04-07-2024": {
         "rainfall": 15,
         "t_max": 34,
         "t_min": 26,
         "rh_max": 73,
         "rh_min": 53,
         "wind_speed": 18,
         "wind_direction": 212,
         "cloud_cover": 8
      },
      "05-07-2024": {
         "rainfall": 15,
         "t_max": 34,
         "t_min": 26,
         "rh_max": 75,
         "rh_min": 55,
         "wind_speed": 16,
         "wind_direction": 204,
         "cloud_cover": 8
      },
      "06-07-2024": {
         "rainfall": 20,
         "t_max": 35,
         "t_min": 27,
         "rh_max": 76,
         "rh_min": 52,
         "wind_speed": 17,
         "wind_direction": 202,
         "cloud_cover": 8
      },
      "07-07-2024": {
         "rainfall": 20,
         "t_max": 35,
         "t_min": 27,
         "rh_max": 75,
         "rh_min": 51,
         "wind_speed": 14,
         "wind_direction": 202,
         "cloud_cover": 8
      }
   },
   "names_of_crops": [
      "rice",
      "sugarcane",
      "vegetables",
      "pisciculture",
      "livestock"
   ],
   "general_advisory": "1. As per IMD Forecast, light to moderate rainfall is expected in upcoming days, farmers are advised to take proper care while conducting spraying operations and also start nursery bed preparation for kharif crops & vegetables. 2. For Kharif paddy cultivation, use good quality seeds as mentioned. 3. For Flood affected areas, use specific types of seeds. 4. Regular monitoring of insect pests in vegetable crops is advised due to prevailing weather conditions. 5. Make necessary arrangements for field preparation as monsoon has already entered the state. 6. Provide irrigation to standing crops and vegetables as needed.",
   "crops_data": {
      "rice": {
         "advisory": [
            "Prepare well pulverised nursery bed for Kharif Rice.",
            "Sowing of pre-generated seeds should be done after seed treatment with Carbendazim @ 2 gm along with Plantomycin @ 1 gm per Kg seed.",
            "Instead of manual DSR followed by beushaning, follow mechanized DSR cultivation with appropriate package of practices.",
            "Go for summer ploughing by utilizing the rain received in recent past days. Arrange good quality seeds as green manuring crop."
         ]
      },
      "sugarcane": {
         "advisory": [
            "Wrapping and propping should be done when the crop becomes 4-5 months old in medium and late duration varieties.",
            "To control early shot borer in sugarcane, foliar spray of Fipronil 5SC @400 ml/acre is advised."
         ]
      },
      "vegetables": {
         "advisory": [
            "Regular monitoring of insect pest attack in vegetable crops is advised.",
            "Spraying of Thiamethoxam 0.4 g/l of water is recommended to control mealy bug in okra & brinjal.",
            "Prepare nursery bed and treat the seed with (Carboxin+Thiram)@2g/kg of seed for timely planting of kharif vegetables like Brinjal & Chilli.",
            "To control Fruit and shoot borer, spray recommended pesticides at initial stages."
         ]
      },
      "pisciculture": {
         "advisory": [
            "Stock Carp such as Rohu, Catla and Mrigal in a certain ratio to increase benefits.",
            "Maintain a density of 5,000 fingerlings/ha as a standard stocking.",
            "Provide specific feed to increase pond quality and facilitate growth."
         ]
      },
      "livestock": {
         "advisory": [
            "Ensure animals are vaccinated against common diseases.",
            "Provide mineral mixture regularly and adjust diet during winter season."
         ]
      }
   },
   "date": ""
}