{
   "weather_details": {
      "27-12-2024": {
         "rainfall": 0,
         "t_max": 28,
         "t_min": 16,
         "rh_max": 81,
         "rh_min": 34,
         "wind_speed": 5,
         "wind_direction": 54,
         "cloud_cover": 2
      },
      "28-12-2024": {
         "rainfall": 5,
         "t_max": 27,
         "t_min": 16,
         "rh_max": 76,
         "rh_min": 41,
         "wind_speed": 3,
         "wind_direction": 76,
         "cloud_cover": 6
      },
      "29-12-2024": {
         "rainfall": 2,
         "t_max": 27,
         "t_min": 16,
         "rh_max": 77,
         "rh_min": 46,
         "wind_speed": 4,
         "wind_direction": 9,
         "cloud_cover": 5
      },
      "30-12-2024": {
         "rainfall": 0,
         "t_max": 26,
         "t_min": 16,
         "rh_max": 76,
         "rh_min": 37,
         "wind_speed": 6,
         "wind_direction": 4,
         "cloud_cover": 4
      },
      "31-12-2024": {
         "rainfall": 0,
         "t_max": 26,
         "t_min": 15,
         "rh_max": 67,
         "rh_min": 30,
         "wind_speed": 5,
         "wind_direction": 4,
         "cloud_cover": 2
      }
   },
   "names_of_crops": [
      "kharif rice",
      "summer rice",
      "ground nut",
      "cole crop",
      "livestock",
      "poultry"
   ],
   "general_advisory": "Farmers are advised to conduct harvesting, sowing and spraying operations accordingly. Make provision to take proper care of crops and animals to protect them from cold. Complete the sowing of Rabi crops like Mustard, Til, Chickpea, Groundnut, Green gram/Black Gram etc. and start nursery sowing of Summer Paddy where irrigation facilities are available.",
   "crops_data": {
      "kharif rice": {
         "advisory": [
            "There is some rainfall event expected in the first half of upcoming days so farmers are advised to wait for harvesting operations.",
            "Use 'Super Grain Bag' for safe storage of paddy/rice for longer periods."
         ]
      },
      "summer rice": {
         "advisory": [
            "Farmers should start field preparation for summer season rice cultivation.",
            "Select improved rice varieties like MTU 1010, MTU 1156, MTU 1001, Lalat, Improved Lalat, Chandan, Swarna, etc."
         ]
      },
      "ground nut": {
         "advisory": [
            "Regular monitoring for sucking insect attack in groundnut crop is advised.",
            "If attack observed, use Azadiractin or neem-based insecticide for spraying.",
            "Wait for irrigation and spraying operations due to expected rain."
         ]
      },
      "cole crop": {
         "advisory": [
            "Use straw as mulching material in vegetable crops to maintain soil moisture and temperature during winter season.",
            "Monitor against the attack of Diamond back moth in cauliflower and use pheromone trap if necessary.",
            "Spray neem oil or Emamectin Benzoate after rain if attack is observed."
         ]
      },
      "livestock": {
         "advisory": [
            "Protect animals from cold by using jute bags as cover and provide straw as bedding material.",
            "Ensure clean drinking water for cattle and keep sheds clean to prevent flies.",
            "Vaccination and deworming to control diseases and stomach worms."
         ]
      },
      "poultry": {
         "advisory": [
            "Ensure proper ventilation in poultry houses for fresh air and gas removal.",
            "Provide external heat sources to keep the shed warm and dry.",
            "Maintain drinking water at suitable temperature for water intake."
         ]
      }
   },
   "date": "27-12-2024"
}