{
   "weather_details": {
      "08-02-2025": {
         "rainfall": 0,
         "t_max": 34,
         "t_min": 18,
         "rh_max": 42,
         "rh_min": 14,
         "wind_speed": 5,
         "wind_direction": 356,
         "cloud_cover": 1
      },
      "09-02-2025": {
         "rainfall": 0,
         "t_max": 34,
         "t_min": 17,
         "rh_max": 41,
         "rh_min": 11,
         "wind_speed": 4,
         "wind_direction": 355,
         "cloud_cover": 1
      },
      "10-02-2025": {
         "rainfall": 0,
         "t_max": 34,
         "t_min": 16,
         "rh_max": 40,
         "rh_min": 11,
         "wind_speed": 3,
         "wind_direction": 21,
         "cloud_cover": 2
      },
      "11-02-2025": {
         "rainfall": 0,
         "t_max": 35,
         "t_min": 15,
         "rh_max": 40,
         "rh_min": 11,
         "wind_speed": 1,
         "wind_direction": 146,
         "cloud_cover": 2
      },
      "12-02-2025": {
         "rainfall": 0,
         "t_max": 35,
         "t_min": 15,
         "rh_max": 43,
         "rh_min": 15,
         "wind_speed": 2,
         "wind_direction": 207,
         "cloud_cover": 1
      }
   },
   "names_of_crops": [
      "dry season rice",
      "green gram",
      "black gram",
      "mango",
      "vegetable crops",
      "livestock"
   ],
   "general_advisory": "As per the extended range forecast (date:-06.02.2025) of IMD, MC, Bhubaneswar, dry weather is very likely to prevail over the districts of Odisha during week-1 (7th  to 13 th  February, 2025) and  minimum temperature is very likely to be normal to below normal over the districts of Coastal Odisha and districts adjoining Coastal Odisha and appreciably below normal over the remaining parts of the state during that period. In week-2 (14 th  to 20 th  February, 2025), minimum temperature is very likely to be normal to below normal over the districts of Coastal Odisha and districts adjoining Coastal Odisha, appreciably below normal over some parts of the Interior Odisha and markedly below normal over rest of the parts of Interior Odisha. Dry weather is very likely to prevail over the districts of Odisha during week 2. Considering the prevailing dry weather condition, farmers are advised to provide one live saving irrigation in standing crop and conduct all kind of spraying and intercultural operations during that period at morning or in evening hours.",
   "crops_data": {
      "dry season rice": {
         "advisory": [
            "In transplanted rice, application of 35 kg urea per  acre should be advised as first top dressing at 20-25 days after transplanting or maximum tillering stage.",
            "In just transplanted field use 3 pheromone traps with 5mg lure/acre in the rice field for monitoring of the yellow stem borer and leaf folder. Whenever the number of male moths in trap reaches 4 or 5, spraying of Azadiractin 0.15% neem seed kernel based EC formulation @ 800 ml/acre should be advised. Farmers may also broadcast granular insecticide Chlorantraniliprole 4% GR @ 4 kg/acre or Cartap Hydrochloride 4G @ 10kg/acre mixing with sand at 1: 1 ratio or spray Chlorantraniliprole 18.5% SC @ 60 ml/acre in 200 liters of water to control these insects."
         ]
      },
      "green gram": {
         "advisory": [
            "If sucking insect attack is noticed in Green/Black gram field then farmers should use 8 nos. of yellow sticky trap per acre to  control these insect at vegetative stage. At initial stage of attack, farmers should spray 5 ml neem oil per liter of water to control these insect.",
            "To control yellow mosaic virus attack in field, spraying of imidacloprid 17.8% SL @ 0.3 ml or thiamethoxam 25% WG @ 0.3-0.5m l per liter of water should be advised. If possible, avoid chemical application at flowering stage."
         ]
      },
      "black gram": {
         "advisory": [
            "If sucking insect attack is noticed in Green/Black gram field then farmers should use 8 nos. of yellow sticky trap per acre to  control these insect at vegetative stage. At initial stage of attack, farmers should spray 5 ml neem oil per liter of water to control these insect.",
            "To control yellow mosaic virus attack in field, spraying of imidacloprid 17.8% SL @ 0.3 ml or thiamethoxam 25% WG @ 0.3-0.5m l per liter of water should be advised. If possible, avoid chemical application at flowering stage."
         ]
      },
      "mango": {
         "advisory": [
            "Prevailing increasing temperature condition may accelerate the Mango Hopper attack in orchard so its regular monitoring should be advised.",
            "Avoid irrigation at flowering stage to reduce flower drop in Mango orchard.",
            "Wrap or fix polythene/alkathane sheet tightly on Mango trees to manage mango mealy bug. Training and pruning of diseased and unwanted branches and leaves should be advised.",
            "If powdery mildew infestation or any fungal infection observed in Mango orchard due to prevailing temperature and humidity condition then spraying of wettable sulphur @ 2g per liter of water should be advised."
         ]
      },
      "vegetable crops": {
         "advisory": [
            "To control leaf eating caterpillar and fruit borer/ shoot and fruit borer in Tomato and Brinjal, spraying of Emamectin Benzoate @ 0.4 g per liter of water should be advised.",
            "For Diamond Back Moth attack in Cauliflower, spraying of Spinosad 45 SC @ 0.5 ml or Fipronil 5% SC @ 2ml or Neem oil @ 5 ml per liter of water should be advised.",
            "Regular monitoring against sucking insect attack (aphids, thrips etc.) should be advised. Avoid chemical application at flowering stage.",
            "Current weather condition is favourable for purple blotch disease infestation in onion plant so its regular monitoring is advised."
         ]
      },
      "livestock": {
         "advisory": [
            "Looking to the increase in temperature in upcoming week, farmers are advised to increase the fresh clean drinking water supply to the animals. Avoid grazing of animal at noon hours.",
            "Vaccination against FMF, HS, BQ etc. should be advised. Deworming of animals is advised to control harmful worm."
         ]
      }
   },
   "date": "07-02-2025"
}