{
   "weather_details": {
      "11-01-2025": {
         "rainfall": 0,
         "t_max": 28,
         "t_min": 12,
         "rh_max": 59,
         "rh_min": 23,
         "wind_speed": 2,
         "wind_direction": 346,
         "cloud_cover": 2
      },
      "12-01-2025": {
         "rainfall": 0,
         "t_max": 29,
         "t_min": 13,
         "rh_max": 52,
         "rh_min": 20,
         "wind_speed": 4,
         "wind_direction": 350,
         "cloud_cover": 2
      },
      "13-01-2025": {
         "rainfall": 0,
         "t_max": 29,
         "t_min": 14,
         "rh_max": 58,
         "rh_min": 25,
         "wind_speed": 4,
         "wind_direction": 10,
         "cloud_cover": 3
      },
      "14-01-2025": {
         "rainfall": 0,
         "t_max": 30,
         "t_min": 14,
         "rh_max": 52,
         "rh_min": 20,
         "wind_speed": 4,
         "wind_direction": 350,
         "cloud_cover": 2
      },
      "15-01-2025": {
         "rainfall": 0,
         "t_max": 30,
         "t_min": 14,
         "rh_max": 58,
         "rh_min": 25,
         "wind_speed": 4,
         "wind_direction": 10,
         "cloud_cover": 3
      }
   },
   "names_of_crops": [
      "kharif rice",
      "dry season rice",
      "mustard",
      "fruit and vegetable crops",
      "livestock"
   ],
   "general_advisory": "As per the extended range forecast of IMD, MC, Bhubaneswar, dry weather along with normal to below normal minimum temperature is expected over the districts of Odisha during week-1 (10th to 16th January, 2025) and week-2 (17th to 23rd January, 2025) so farmers are advised to conduct irrigation and any kind of spraying operations during that period and also make provision to protect the crop as well as animals from cold. Vaccination should be avoided in animals during foggy days and cold wave period. Farmers are advised to avoid burning of rice straw or crop residue in the field because it hampers the environment.",
   "crops_data": {
      "kharif rice": {
         "advisory": [
            "After noticing the infestation of the stored grain insect pest, take up fumigation by using Aluminium phosphide (do not use in dwelling houses) tablets @ of 3 tablets/ton grain (total 9g of tablets) in fairly airtight containers or by covering with thick tarpaulin leaving no gaps. The tablets should be wrapped in cotton pouches before placing them in the stacks. All the corners of the plastic cover should be plastered with a 6-inch thick layer of mud/adhesive tapes to prevent leakage of gas. Minimum exposure period is for about 7-10 days."
         ]
      },
      "dry season rice": {
         "advisory": [
            "For dry season transplanted rice cultivation, farmers should prepare the wet nursery seed beds in puddled soil of 120 cm wide, 10 cm height, and convenient length with 30 cm gap in between two beds. About 320 m2 nursery areas are required for transplanting one-acre main field. Seed treatment should be done with Carbendazim 50 WP @ 1.5 g/kg of seed or Trichoderma formulation @ 10 g/kg of seed. During cool winter days to protect the rice nursery from cold injury, apply a thin layer of well decomposed FYM after sowing of seeds in a wet bed to keep the bed relatively warm. Preferably use bore well water for irrigation at an evening and drain out the cold water in the morning to maintain the soil temperature favorable for growth."
         ]
      },
      "mustard": {
         "advisory": [
            "One hoeing and weeding operation should be advised in case of 15 to 20 days old crop. In case of dense planting, one thinning operation is advised to maintain the optimum plant population. Prevailing weather condition is favorable for Aphid attack in the mustard crop so regular monitoring against this insect should be advised."
         ]
      },
      "fruit and vegetable crops": {
         "advisory": [
            "Wrap or fix polythene/alkathane sheet tightly on mango trees to manage mango mealy bug. Training and pruning of diseased and unwanted branches and leaves should be advised. Straw can be used as mulching material to maintain soil moisture as well as temperature in the field during the winter season. Harvesting of matured crops as well as one light irrigation in crops which are in the vegetative growth stage should be advised because dry weather is expected in the upcoming week."
         ]
      },
      "livestock": {
         "advisory": [
            "Cover the animal shelter from all sides during the night to avoid direct exposure of animals to cold winds including dry straw as animal bedding. Weak and sick animals should be covered with sack cloth to protect them from the cold. At the same time, during the night, all the animals should be kept in a covered shelter. Avoid keeping animals in a damp area, as well as protect them from smoke from fires which are lit to provide warmth. The dampness and smoke increase their chances of contracting pneumonia. To maintain the body temperature of animals, they should be fed with a mixture of oil cakes and jiggery including covering of the body during cold hours. Pregnant animals (> 6 months) should be given additional feed."
         ]
      }
   },
   "date": "10-01-2025"
}