{
   "weather_details": {
      "03/04/2024": {
         "rainfall": 0,
         "t_max": 40,
         "t_min": 26,
         "rh_max": 57,
         "rh_min": 13,
         "wind_speed": 12,
         "wind_direction": 205,
         "cloud_cover": 0
      },
      "04/04/2024": {
         "rainfall": 0,
         "t_max": 40,
         "t_min": 26,
         "rh_max": 80,
         "rh_min": 15,
         "wind_speed": 11,
         "wind_direction": 180,
         "cloud_cover": 1
      },
      "05/04/2024": {
         "rainfall": 0,
         "t_max": 41,
         "t_min": 27,
         "rh_max": 70,
         "rh_min": 23,
         "wind_speed": 15,
         "wind_direction": 207,
         "cloud_cover": 1
      },
      "06/04/2024": {
         "rainfall": 0,
         "t_max": 41,
         "t_min": 27,
         "rh_max": 67,
         "rh_min": 15,
         "wind_speed": 13,
         "wind_direction": 210,
         "cloud_cover": 0
      },
      "07/04/2024": {
         "rainfall": 0,
         "t_max": 42,
         "t_min": 27,
         "rh_max": 55,
         "rh_min": 10,
         "wind_speed": 12,
         "wind_direction": 242,
         "cloud_cover": 2
      }
   },
   "names_of_crops": [
      "paddy",
      "sugarcane",
      "maize",
      "tomato",
      "brinjal",
      "coconut",
      "vegetables",
      "fingerlings",
      "black gram",
      "green gram",
      "okra",
      "onion",
      "mango"
   ],
   "general_advisory": "In paddy crop, Panicle initiation, Panicle emergence, flowering and milking stages are the critical stages. Cover the rows with dry leaves in Sugarcane. Apply sprinkler irrigation to bring down the heat effect. Irrigate the maize crop properly. Spread polythene in irrigation channels to save water wastage. Apply Streptocyclin in tomato and brinjal. Mulch coconut leaves around a coconut tree to reduce water loss. Cover newly planted vegetable seedlings. Harvest fingerlings in shallow ponds if water temperature rises. Follow advice for Yellow stem borer management in paddy, Blast Disease Management, Tobacco Caterpillar Management in Black Gram & Green Gram, Early Shoot Borer in Sugarcane, Brinjal shoot and fruit borer, Whitefly Infestation in Okra, and Mango hopper control.",
   "crops_data": {
      "paddy": {
         "advisory": [
            "Panicle initiation, Panicle emergence, flowering and milking stages are the critical stages. Avoid water deficit during these stages."
         ]
      },
      "sugarcane": {
         "advisory": [
            "Cover the rows with dry leaves in Sugarcane.",
            "Top-dress with 4% potassium to protect the crop from water scarcity during summer.",
            "Irrigate the crop frequently during hot months",
            "Timely cutting the attacked shoot at or just below the ground level ensures destruction of most caterpillar."
         ]
      },
      "maize": {
         "advisory": [
            "High temperature increases water requirement of maize crop. Irrigate properly and avoid water stagnation."
         ]
      },
      "tomato": {
         "advisory": [
            "Apply 1g Streptocyclin in 10-liter water in root zone to prevent wilting."
         ]
      },
      "brinjal": {
         "advisory": [
            "Install pheromone traps for Brinjal shoot and fruit borer management.",
            "Spray neem-based pesticide in the primary stage of infestation.",
            "Go for chemical control if necessary."
         ]
      },
      "coconut": {
         "advisory": [
            "Mulch coconut leaves around a coconut tree to reduce water loss."
         ]
      },
      "vegetables": {
         "advisory": [
            "Cover with paper caps on newly planted vegetable seedlings during the day."
         ]
      },
      "fingerlings": {
         "advisory": [
            "Harvest fingerlings in shallow ponds if water temperature rises."
         ]
      },
      "black gram": {
         "advisory": [
            "Check migration of caterpillars by dusting around the field.",
            "For chemical control, spray the recommended insecticides."
         ]
      },
      "green gram": {
         "advisory": [
            "Check migration of caterpillars by dusting around the field.",
            "For chemical control, spray the recommended insecticides."
         ]
      },
      "okra": {
         "advisory": [
            "Treat seeds with Imidacloprid before sowing to prevent whitefly infestation.",
            "Install yellow sticky traps to monitor whitefly infestation."
         ]
      },
      "onion": {
         "advisory": [
            "After harvesting, cut the tops leaving 2.0 -2.5 cm above bulb.",
            "Dry the harvested bulbs in a well-ventilated room."
         ]
      },
      "mango": {
         "advisory": [
            "To control mango hoppers, spray the recommended insecticides.",
            "Application of smoke below plants can also help in reducing the pest population."
         ]
      }
   },
   "date": "02-04-2024"
}