{
   "weather_details": {
      "07.02.2025": {
         "rainfall": 0,
         "t_max": 30,
         "t_min": 16,
         "rh_max": 85,
         "rh_min": 45,
         "wind_speed": 8,
         "wind_direction": 120,
         "cloud_cover": 4
      }
   },
   "names_of_crops": [
      "sugarcane",
      "blackgram",
      "green gram",
      "mustard",
      "tomato",
      "chilli",
      "potato",
      "onion",
      "cabbage",
      "cauliflower",
      "cucurbits",
      "mango",
      "poultry"
   ],
   "general_advisory": "Vaccinate birds against RD, Fowl pox and IB to prevent viral diseases. For preventing CRD (Chronic Respiratory Disease) maintain litter properly, take care of disinfection and avoid ammonia build up in poultry shed.",
   "crops_data": {
      "sugarcane": {
         "advisory": [
            "Carry out planting of Sugarcane crop.",
            "To manage set trot disease after planting, do basal drenching with Carbendazim 12% + Mancozeb 63%",
            "To manage set trot disease after planting, do foliar spray with Metalaxyl 8% + Mancozeb 64% WP"
         ]
      },
      "blackgram": {
         "advisory": [
            "To control Bihar hairy caterpillar in Green gram and Black gram crop, spray Chlorpyriphos 50% + Cypermethrin 5% E.C"
         ]
      },
      "green gram": {
         "advisory": [
            "To control Bihar hairy caterpillar in Green gram and Black gram crop, spray Chlorpyriphos 50% + Cypermethrin 5% E.C"
         ]
      },
      "mustard": {
         "advisory": [
            "To manage Leaf Webber and Mustard sawfly infestation in Mustard crop, spray Ethofenprox 10% EC"
         ]
      },
      "tomato": {
         "advisory": [
            "To manage fruit borer in Tomato, collect and destroy affected fruits and larvae"
         ]
      },
      "chilli": {
         "advisory": [
            "To manage Fruit rot and Die back disease incidence in Chilli crop, spray Propineb 70% WP"
         ]
      },
      "potato": {
         "advisory": [
            "To control Cut worm in Potato crop, spray Chlorpyriphos 50% + Cypermethrin 5% E.C"
         ]
      },
      "onion": {
         "advisory": [
            "To manage Purple blotch and Stemphylium leaf blight disease in Onion, spray Mancozeb 75% WP"
         ]
      },
      "cabbage": {
         "advisory": [
            "To manage Dimond Back Moth and Head Borer in Late sown Cauliflower and Cabbage crops, collect and destroy caterpillars"
         ]
      },
      "cauliflower": {
         "advisory": [
            "To manage Dimond Back Moth and Head Borer in Late sown Cauliflower and Cabbage crops, collect and destroy caterpillars"
         ]
      },
      "cucurbits": {
         "advisory": [
            "To manage infestation of Epilachna beetle in cucurbits, spray Chlorpyriphos 20% EC"
         ]
      },
      "mango": {
         "advisory": [
            "Irrigate at regular intervals after flower appearance",
            "After appearance of flower, always spray the crop in the afternoon and evening hours"
         ]
      },
      "poultry": {
         "advisory": [
            "Vaccinate birds against RD, Fowl pox and IB to prevent viral diseases",
            "For preventing CRD (Chronic Respiratory Disease), maintain litter properly, take care of disinfection and avoid ammonia build up in poultry shed"
         ]
      }
   },
   "date": "07-02-2025"
}