{
   "weather_details": {
      "2024-10-19": {
         "rainfall": 5,
         "t_max": 35,
         "t_min": 25,
         "rh_max": 97,
         "rh_min": 66,
         "wind_speed": 1,
         "wind_direction": 90,
         "cloud_cover": 6
      },
      "2024-10-20": {
         "rainfall": 5,
         "t_max": 35,
         "t_min": 25,
         "rh_max": 97,
         "rh_min": 67,
         "wind_speed": 2,
         "wind_direction": 346,
         "cloud_cover": 8
      },
      "2024-10-21": {
         "rainfall": 2,
         "t_max": 34,
         "t_min": 25,
         "rh_max": 96,
         "rh_min": 65,
         "wind_speed": 2,
         "wind_direction": 9,
         "cloud_cover": 8
      },
      "2024-10-22": {
         "rainfall": 0,
         "t_max": 34,
         "t_min": 24,
         "rh_max": 93,
         "rh_min": 53,
         "wind_speed": 3,
         "wind_direction": 14,
         "cloud_cover": 4
      },
      "2024-10-23": {
         "rainfall": 0,
         "t_max": 33,
         "t_min": 24,
         "rh_max": 84,
         "rh_min": 51,
         "wind_speed": 5,
         "wind_direction": 12,
         "cloud_cover": 6
      }
   },
   "names_of_crops": [
      "rice",
      "cotton",
      "cauliflower",
      "brinjal",
      "french bean",
      "cow"
   ],
   "general_advisory": "The mean maximum daily temperature was 35.7°C and the mean minimum daily temperature was 25.5°C of the Gajapati district during the last week. The district received 14.5 mm of rainfall during the last week. Soil moisture is adequate for sowing of rabi crops such as Groundnut, Horse gram, Green gram, Black gram, Cowpea, Sweet potato and Sesame in upland/medium lands...",
   "crops_data": {
      "rice": {
         "advisory": [
            "The transplanted paddy is at Panicle Initiation to flowering stage in main field. The present high humid weather condition and rainfall followed by clear sky is favourable for Brown Plant Hopper (BPH) and White Backed Plant Hopper (WBPH) infestation in paddy. To manage BPH and WBPH in paddy avoid excess use of nitrogenous fertilizer..."
         ]
      },
      "cotton": {
         "advisory": [
            "The crop is at square formation to boll formation stage. Now temperature and humid conditions are favorable for the infestation of sucking pests in cotton. If there is infestation of Aphids and Jassids in early sown cotton crop, go for spraying of Acetamiprid 20%SP  20gm/acre..."
         ]
      },
      "cauliflower": {
         "advisory": [
            "The cauliflower seedlings in nursery are germination stage. Start nursery preparation for sowing cauliflower and complete sowing seed in nursery. The Varieties suitable for cauliflower are K-1, Pusa early synthetic and Pusa early Kuanri and the seed rate is 200g/acre..."
         ]
      },
      "brinjal": {
         "advisory": [
            "For control of shoot and fruit borer in brinjal, spray Emamectin Benzoate 5% SG @ 80-gram/ acre or Chlorantraniliprole 18.5 % SC @80-ml/acre or Spinetoram 1 1.7 % SC @ 200-ml /acre. Use any of the above insecticides alternately at 15-days interval..."
         ]
      },
      "french bean": {
         "advisory": [
            "To manage Pod borer in beans spray Emamectin Benzoate 5% SG @ 90-gram/ acre or Chlorantraniliprole 18.5 % SC @ 60-ml/acre or Flubendiamide 39.35 SC @ 40-ml/acre..."
         ]
      },
      "cow": {
         "advisory": [
            "If your domestic Animal is becoming off feed, weak, lackluster, diarrhea, Milk production is low, dryness in eyes and appearance of bottleneck condition, there is every possibility of its being suffering from Parasitic infestation. These worms or Parasites reduce the vitality and productivity of the animals..."
         ]
      }
   },
   "date": "18-10-2024"
}