{
   "weather_details": {
      "2024-11-20": {
         "rainfall": 0,
         "t_max": 32,
         "t_min": 17,
         "rh_max": 77,
         "rh_min": 35,
         "wind_speed": 3,
         "wind_direction": 90,
         "cloud_cover": 1
      },
      "2024-11-21": {
         "rainfall": 0,
         "t_max": 32,
         "t_min": 17,
         "rh_max": 77,
         "rh_min": 34,
         "wind_speed": 2,
         "wind_direction": 351,
         "cloud_cover": 0
      },
      "2024-11-22": {
         "rainfall": 0,
         "t_max": 32,
         "t_min": 17,
         "rh_max": 78,
         "rh_min": 35,
         "wind_speed": 2,
         "wind_direction": 90,
         "cloud_cover": 0
      },
      "2024-11-23": {
         "rainfall": 0,
         "t_max": 32,
         "t_min": 17,
         "rh_max": 78,
         "rh_min": 35,
         "wind_speed": 2,
         "wind_direction": 351,
         "cloud_cover": 1
      },
      "2024-11-24": {
         "rainfall": 0,
         "t_max": 31,
         "t_min": 17,
         "rh_max": 78,
         "rh_min": 34,
         "wind_speed": 3,
         "wind_direction": 90,
         "cloud_cover": 2
      }
   },
   "names_of_crops": [
      "rice",
      "cauliflower",
      "marigold",
      "cow",
      "goat",
      "common fish",
      "chicken"
   ],
   "general_advisory": "The mean maximum daily temperature was 33.0°C and the mean minimum daily temperature was 20.3°C of the Gajapati district during the last week. The district received no rainfall during the last week. Based on the five-day weather forecast of IMD, farmers are advised to undertake necessary agricultural activities, including weeding, fertilization, irrigation, harvesting and pesticide application. Undertake sowing of rabi crops like green Gram, Black gram, Toria, Chick pea, Lentil, Sunflower, Groundnut, Cowpea, Field pea etc. in medium or shallow low land to utilize the available soil moisture in the field. Rouging of viral infested crop should be done in chilli, tomato & brinjal. Infected plants should be uprooted and buried in the soil. Pulses like lentil/black gram/green gram can be broadcasted in the standing matured crop (Rice) one week before harvesting to utilize the residual moisture in the soil in suitable areas.",
   "crops_data": {
      "rice": {
         "advisory": [
            "In early maturing varieties, harvest the crop when 80-85% of the grains are matured either manually by sickle or by using combine harvester or reaper. Paddy grains need to be sun-dried to 14% moisture content for consumption purpose and for seed purpose it should be dried to 12% moisture for better self-life. Drain out the water from paddy field, 15 days before harvesting the11/19/24, 3:48 PM District Advisory"
         ]
      },
      "cauliflower": {
         "advisory": [
            "Apply 33-kg of Urea and 23 kg MOP per acre after hoeing and hand weeding at 15-20 DAT and 33 kg of urea and 23-kg of MOP per acre as last top-dressing fertilizer at 30-35 DAT. If Borax was not applied during transplanting of seedlings than spray Borax @ 4 kg/acre or Folibor /Solubor @ 1.5 gram/litre. Spraying of Boron micronutrient should be done after two weeks of transplanting and two weeks before curd formation."
         ]
      },
      "marigold": {
         "advisory": [
            "To manage Red Spider Mites in flower like Marigold and rose spray wettable sulphur 80 % WP (Sulfex/Balwan/Sulfadex) @ 2-gram/litre of water or Propargite 57 % EC (Omite/Mitekill/Super Dynamite) @ 2-ml/litre of water or Fenpyroximate 5 % EC (Seagate/Mitigate/Formite) @ 2-ml/litre of water ."
         ]
      },
      "cow": {
         "advisory": [
            "Deworm the cattle and buffalo in regular interval and vaccinate them also. If the animal is not coming to heat even after 4 years consult with the veterinary doctors and follow the doctor's advice for onset of puberty."
         ]
      },
      "goat": {
         "advisory": [
            "Farmers are advised to repair the goat house before commencement of winter season. Because there is high chance of mortality among kids due to chill weather."
         ]
      },
      "common fish": {
         "advisory": [
            "In winter , fish can be prone to fungal, bacterial, and parasitic infections. To prevent these, apply CIF AX @ 400 ml per acre just before winter starts. Additionally , treat the pond with potassium permanganate @ 1-2 kg per acre or limestone @ 50-100 kg per acre. Applying salt at 100 kg per acre is also effective in protecting fish from disease outbreaks during the winter months."
         ]
      },
      "chicken": {
         "advisory": [
            "Farmers must take care of brooding management of chicks and ducklings during winter season to avoid mortality due to cool weather."
         ]
      }
   },
   "date": "19-11-2024"
}