{
   "weather_details": {
      "2024-09-07": {
         "rainfall": 10,
         "t_max": 35,
         "t_min": 25,
         "rh_max": 93,
         "rh_min": 67,
         "wind_speed": 5,
         "wind_direction": 288,
         "cloud_cover": 7
      },
      "2024-09-08": {
         "rainfall": 15,
         "t_max": 33,
         "t_min": 25,
         "rh_max": 93,
         "rh_min": 68,
         "wind_speed": 6,
         "wind_direction": 288,
         "cloud_cover": 8
      },
      "2024-09-09": {
         "rainfall": 25,
         "t_max": 31,
         "t_min": 24,
         "rh_max": 95,
         "rh_min": 76,
         "wind_speed": 7,
         "wind_direction": 291,
         "cloud_cover": 8
      },
      "2024-09-10": {
         "rainfall": 15,
         "t_max": 33,
         "t_min": 24,
         "rh_max": 93,
         "rh_min": 76,
         "wind_speed": 8,
         "wind_direction": 292,
         "cloud_cover": 8
      },
      "2024-09-11": {
         "rainfall": 10,
         "t_max": 34,
         "t_min": 25,
         "rh_max": 90,
         "rh_min": 69,
         "wind_speed": 10,
         "wind_direction": 291,
         "cloud_cover": 7
      }
   },
   "names_of_crops": [
      "maize",
      "rice",
      "finger millet",
      "cotton",
      "papaya",
      "brinjal",
      "common fish",
      "chicken"
   ],
   "general_advisory": "According to the weather forecast, farmers are advised to withhold application of fertilizers and plant protection chemicals. Apply balanced fertilizers according to crop's growth stage. Avoid excess nitrogen. Use an integrated approach for pest control.",
   "crops_data": {
      "maize": {
         "advisory": [
            "To manage the fall armyworm pest, spray biopesticide Beauveria bassiana.",
            "Use bird perches and dust mixture of sand, soil, and wooden ash."
         ]
      },
      "rice": {
         "advisory": [
            "To manage Blast disease, spray Hexaconazole or Azoxystrobin + Difenoconazole.",
            "To manage Leaf Folder and Case Worm pests, spray Bifenthrin or Lambda Cyhalothrin."
         ]
      },
      "finger millet": {
         "advisory": [
            "To manage Pink stem borer, use Trichogramma chilonis card and spray Bacillus thiringenesis.",
            "Use Handi-khata extract and Nimastra for pest control."
         ]
      },
      "cotton": {
         "advisory": [
            "Regularly monitor for sucking pests like Aphids and Jassids.",
            "Use neem-based pesticide or chemical sprays if infestation is above ETL."
         ]
      },
      "papaya": {
         "advisory": [
            "To manage Mealy bug infestation, spray neem-based pesticide at initial stage.",
            "Use Profenophos or Thiamethoxam for severe infestation."
         ]
      },
      "brinjal": {
         "advisory": [
            "Remove affected terminals and fruits to manage Shoot and fruit borer.",
            "Install pheromone traps and use chemical control alternately."
         ]
      },
      "common fish": {
         "advisory": [
            "Feed groundnut oil cake and rice bran to fish.",
            "Check pH and water temperature regularly after stocking."
         ]
      },
      "chicken": {
         "advisory": [
            "Clean poultry houses daily and change feed and water frequently.",
            "Bury dead poultry birds properly and do not bring birds or eggs from affected areas."
         ]
      }
   },
   "date": "06-09-2024"
}