{
   "weather_details": {
      "11-01-2025": {
         "rainfall": 0,
         "t_max": 26,
         "t_min": 8,
         "rh_max": 88,
         "rh_min": 34,
         "wind_speed": 2,
         "wind_direction": 301,
         "cloud_cover": 3
      },
      "12-01-2025": {
         "rainfall": 0,
         "t_max": 27,
         "t_min": 12,
         "rh_max": 86,
         "rh_min": 34,
         "wind_speed": 3,
         "wind_direction": 326,
         "cloud_cover": 2
      },
      "13-01-2025": {
         "rainfall": 0,
         "t_max": 27,
         "t_min": 9,
         "rh_max": 82,
         "rh_min": 36,
         "wind_speed": 2,
         "wind_direction": 11,
         "cloud_cover": 3
      },
      "14-01-2025": {
         "rainfall": 0,
         "t_max": 28,
         "t_min": 9,
         "rh_max": 86,
         "rh_min": 34,
         "wind_speed": 3,
         "wind_direction": 326,
         "cloud_cover": 3
      },
      "15-01-2025": {
         "rainfall": 0,
         "t_max": 28,
         "t_min": 10,
         "rh_max": 86,
         "rh_min": 34,
         "wind_speed": 3,
         "wind_direction": 326,
         "cloud_cover": 2
      }
   },
   "names_of_crops": [
      "paddy",
      "groundnut",
      "green gram",
      "black gram",
      "onion",
      "cauliflower",
      "cabbage",
      "tomato",
      "chilli",
      "sunflower",
      "cattle",
      "buffalo",
      "goat",
      "sheep",
      "chicken",
      "common fish"
   ],
   "general_advisory": "Keep your crop field free from weed to minimize the incidence of diseases and pests. Apply balanced and appropriate fertilizers according to the crop’s growth stage. Regular monitoring of the crop for incidence of pests and diseases should be done. Follow safety measures during the application of chemical pesticides and apply the recommended doses in the correct method with attention to wind direction.",
   "crops_data": {
      "paddy": {
         "advisory": [
            "Complete sowing of pre-germinated treated seeds in puddled soil by broadcasting or drum seeder and maintain proper water for seedling growth",
            "Apply 44kg of DAP and 22kg of MOP per acre as basal dose at the time of puddling"
         ]
      },
      "groundnut": {
         "advisory": [
            "Prevailing weather conditions favor the development of sucking pests like aphid and jassids",
            "Install yellow sticky traps to monitor pest populations"
         ]
      },
      "green gram": {
         "advisory": [
            "Apply Quizalfop-ethyl 5% EC or Imazethapyr 10 SL for weed management",
            "Use Profenophos 50 EC for controlling leaf-eating caterpillars"
         ]
      },
      "black gram": {
         "advisory": [
            "Apply similar weed and pest management as green gram"
         ]
      },
      "onion": {
         "advisory": [
            "Irrigate the crop at regular intervals",
            "Undertake hoeing, weeding, and top dressing at the appropriate stages"
         ]
      },
      "cauliflower": {
         "advisory": [
            "Continue hoeing, weeding, and apply urea and MOP as needed",
            "Control diamond back moth and other pests as required"
         ]
      },
      "cabbage": {
         "advisory": [
            "Follow similar nutrient management practices as cauliflower"
         ]
      },
      "tomato": {
         "advisory": [
            "Complete hoeing, weeding, and apply urea as needed",
            "Monitor for wilting and fruit & shoot borers"
         ]
      },
      "chilli": {
         "advisory": [
            "Install Blue Sticky Trap for thrips control",
            "Apply neem-based pesticide for pest management"
         ]
      },
      "sunflower": {
         "advisory": [
            "Control sucking pest complex with recommended sprays",
            "Address powdery mildew and other diseases as needed"
         ]
      },
      "cattle": {
         "advisory": [
            "Monitor body condition score during lactation phase",
            "Gradually increase feed amount before calving for better results"
         ]
      },
      "buffalo": {
         "advisory": [
            "Similar care to cattle regarding feed and health management"
         ]
      },
      "goat": {
         "advisory": [
            "Protect goats from chill winds and cold floors",
            "Contact veterinarians for health concerns"
         ]
      },
      "sheep": {
         "advisory": [
            "Similar care to goats for cold weather issues"
         ]
      },
      "chicken": {
         "advisory": [
            "Prevent poultry birds from severe chill wind and cold floor exposure",
            "Cover poultry houses with polythene sheet for protection"
         ]
      },
      "common fish": {
         "advisory": [
            "Apply Cifax as preventive measure against EUS disease",
            "Feed fishes with oil cake bran mixture for proper nutrition"
         ]
      }
   },
   "date": "10-01-2025"
}