{
   "weather_details": {
      "01/02/2025": {
         "rainfall": 0,
         "t_max": 30,
         "t_min": 19,
         "rh_max": 76,
         "rh_min": 29,
         "wind_speed": 7,
         "wind_direction": 11,
         "cloud_cover": 0
      },
      "07/02/2025": {
         "rainfall": 0,
         "t_max": 31,
         "t_min": 19,
         "rh_max": 85,
         "rh_min": 29,
         "wind_speed": 7,
         "wind_direction": 11,
         "cloud_cover": 0
      }
   },
   "names_of_crops": [
      "paddy",
      "groundnut",
      "sugarcane",
      "black gram",
      "chilli",
      "cole crops",
      "onion",
      "mango",
      "rose",
      "animal husbandry",
      "poultry"
   ],
   "general_advisory": "Dry weather with mainly clear sky expected. Farmers advised to monitor pest activity, apply irrigation, and implement disease management practices as needed.",
   "crops_data": {
      "paddy": {
         "advisory": [
            "In transplanted paddy, control grasses, sedges, and broadleaf weeds by spraying recommended pesticides."
         ]
      },
      "groundnut": {
         "advisory": [
            "Manage Bud Necrosis disease by spraying Neem-based pesticide or chemical insecticides."
         ]
      },
      "sugarcane": {
         "advisory": [
            "Manage Sett Rot disease through appropriate drenching or foliar spray with recommended pesticides."
         ]
      },
      "black gram": {
         "advisory": [
            "Control aphids with Neem-based pesticide followed by chemical insecticides."
         ]
      },
      "chilli": {
         "advisory": [
            "Manage Fruit rot and Die back disease through timely fungicide sprays."
         ]
      },
      "cole crops": {
         "advisory": [
            "Control Alternaria Leaf Spot disease using recommended fungicides."
         ]
      },
      "onion": {
         "advisory": [
            "Manage Purple Blotch and Stemphylium leaf blight with appropriate fungicides at regular intervals."
         ]
      },
      "mango": {
         "advisory": [
            "Manage mango hoppers by spraying recommended insecticides at specific stages."
         ]
      },
      "rose": {
         "advisory": [
            "Prevent Powdery mildew infestation by spraying preventive fungicides."
         ]
      },
      "animal husbandry": {
         "advisory": [
            "Ensure Foot and mouth disease vaccination for cattle."
         ]
      },
      "poultry": {
         "advisory": [
            "Vaccinate chicks against Sleeping disease using specific vaccines."
         ]
      }
   },
   "date": "07-02-2025"
}