{
   "weather_details": {
      "20-11-2024": {
         "rainfall": 0,
         "t_max": 30,
         "t_min": 18,
         "rh_max": 75,
         "rh_min": 37,
         "wind_speed": 6,
         "wind_direction": 325,
         "cloud_cover": 1
      },
      "21-11-2024": {
         "rainfall": 0,
         "t_max": 30,
         "t_min": 18,
         "rh_max": 75,
         "rh_min": 36,
         "wind_speed": 6,
         "wind_direction": 320,
         "cloud_cover": 2
      },
      "22-11-2024": {
         "rainfall": 0,
         "t_max": 30,
         "t_min": 18,
         "rh_max": 74,
         "rh_min": 35,
         "wind_speed": 6,
         "wind_direction": 327,
         "cloud_cover": 2
      },
      "23-11-2024": {
         "rainfall": 0,
         "t_max": 30,
         "t_min": 18,
         "rh_max": 74,
         "rh_min": 35,
         "wind_speed": 6,
         "wind_direction": 328,
         "cloud_cover": 0
      },
      "24-11-2024": {
         "rainfall": 0,
         "t_max": 29,
         "t_min": 18,
         "rh_max": 71,
         "rh_min": 32,
         "wind_speed": 6,
         "wind_direction": 335,
         "cloud_cover": 1
      }
   },
   "names_of_crops": [
      "rice",
      "rapeseed and mustard",
      "vegetables",
      "fruit",
      "pisciculture",
      "livestock"
   ],
   "general_advisory": "Monitor the activity of Gundhy bug in rice field and install rotten snail trap for mass trapping and killing of the pest. Visit to field regularly to observe the infestation levels of BPH, WBPH, Leaf folder, Gundhy bug and the incidence of BLB and Neck Blast & sheath rot in rice. Consult to nearest veterinary doctor for vaccination and deworming in animals.",
   "crops_data": {
      "rice": {
         "advisory": [
            "Prevailing microclimate condition may increase the population of Plant Hoppers. Make alleys in field in every 3 m / after 8-10 rows for proper penetration of sunlight and better aeration at plane base. If the population level of Plant Hoppers is around or above ETL (10 Plant Hoppers/Hill), spray Flonicamid 50 WG@60g/acre or (Ethiprole + Pymetrozine)@170g/acre or Triflumezopyrim 10 SC at 92 ml/acre. Spraying of insecticide should be targeted at the plant base.",
            "Farmers are advised to go for harvesting of early matured Paddy crops, which have reached 85% maturity of the panicle and looks pale yellow in color.",
            "Lower the moisture content of harvested paddy by keeping it in sunlight during the daytime.",
            "Make the threshing floor and storage godown clean and disinfectant the same."
         ]
      },
      "rapeseed and mustard": {
         "advisory": [
            "Taking the advantage of residual soil moisture, land preparation and sowing of the crop should be completed soon to get optimum yield.",
            "Suitable varieties: Toria - Anuradha, Parbati, Sushree Indian mustard - NRCHB 101, Mahyco bold, JD 6, sampoorna",
            "Seed rate - 8-10 Kg/ha, Spacing - 30 cm X 10 cm",
            "Fertilizer dose: Toria @60:30:30 N-P2O5-K2O Kg/ha Mustard@80:40:40 N-P2O5-K2O Kg/ha 50%N and all P2O5 and K2O fertilizers should be applied as basal."
         ]
      },
      "vegetables": {
         "advisory": [
            "Select suitable varieties of Cole crops, Chilli and Brinjal and sow the seeds on the well pulverized nursery bed. Add fully decomposed FYM, compost/vermicompost to the nursery bed before sowing.",
            "If the seedlings of early duration varieties of vegetables are ready for transplanting, treat the seedlings with (Metalaxyl + Mancozeb) @ 2g/li of water and Plantomycin @ 1g per liter of water."
         ]
      },
      "fruit": {
         "advisory": [
            "Maximum papaya plants are damaged due to cyclone Dana, so select suitable Open pollinated variety (Coorg honey dew, Ranchi dwarf, surya, Pusa nanha) & hybrid variety (Sampoorna) of papaya seedlings.",
            "Apply 10g Fipronil 0.3 G during planting to minimize the incidence of papaya leaf curl virus."
         ]
      },
      "pisciculture": {
         "advisory": [
            "When there is a lack of oxygen in the pond, the fish will come up to the surface water and start gulping through their mouths. The ideal dissolved oxygen is about 5mg/l. This can be maintained by using aerator. A simple way of aeration is to circulate the pond water. It can be done using a pump which can take water from the lower surface of the pond and splash it into the same pond."
         ]
      },
      "livestock": {
         "advisory": [
            "If the animals have not yet been vaccinated against FMD, Haemorrhagic Septicaemia, Black Quarter, Enterotoxemia etc., these must be done."
         ]
      }
   },
   "date": "19-11-2024"
}