{
   "weather_details": {
      "07-09-2024": {
         "rainfall": 10,
         "t_max": 33,
         "t_min": 25,
         "rh_max": 81,
         "rh_min": 54,
         "wind_speed": 11,
         "wind_direction": 79,
         "cloud_cover": 7
      },
      "08-09-2024": {
         "rainfall": 15,
         "t_max": 31,
         "t_min": 25,
         "rh_max": 89,
         "rh_min": 57,
         "wind_speed": 14,
         "wind_direction": 32,
         "cloud_cover": 8
      },
      "09-09-2024": {
         "rainfall": 25,
         "t_max": 30,
         "t_min": 24,
         "rh_max": 89,
         "rh_min": 65,
         "wind_speed": 12,
         "wind_direction": 64,
         "cloud_cover": 8
      },
      "10-09-2024": {
         "rainfall": 20,
         "t_max": 30,
         "t_min": 24,
         "rh_max": 89,
         "rh_min": 58,
         "wind_speed": 9,
         "wind_direction": 292,
         "cloud_cover": 8
      },
      "11-09-2024": {
         "rainfall": 10,
         "t_max": 31,
         "t_min": 25,
         "rh_max": 88,
         "rh_min": 66,
         "wind_speed": 11,
         "wind_direction": 251,
         "cloud_cover": 7
      }
   },
   "names_of_crops": [
      "rice",
      "jute",
      "sugarcane",
      "vegetables",
      "fruit",
      "livestock"
   ],
   "general_advisory": "As per IMD, district will receive Light to moderate rain with isolated thunderstorm in some places, so farmers are advised to go for needful irrigation of water & drain out excess water from low land. Due to prevailing cloudy weather associated with high humidity, farmers are advised to monitor the incidence of Yellow Stem Borer, Leaf folder & Incidence of BLB & Blast disease in rice crop. Farmers are advised to complete top dressing of urea 35kg/acre as soon as possible. Don’t spray pesticide & herbicide during rainy hours.",
   "crops_data": {
      "rice": {
         "advisory": [
            "Infestation of leaf folder will increase after the rain so apply Cartap hydrochloride @ 400g/acre or Lambada cyhalothrin 4.9 CS @ 300ml/acre or Flubendiamide 20WG 50g/acre in 200 liters of water recommended.",
            "To manage Bacterial Leaf Blight, organically mix 20-kg of fresh cow dung with 200 liters of water. Filter it with fine cloth and spray the solution in one acre. To manage this disease chemically, spray 200-gram Plantomycin along with Copper Oxy Chloride 50% WP @ 600-gram/acre.",
            "As the crop is in tillering stage maintain 2-3 cm of standing water in the field. Apply 35 kg Urea/acre as top dressing after weed management in paddy field."
         ]
      },
      "jute": {
         "advisory": [
            "As the crop is in maturity stage and approaching for harvesting clear the nearby retting area and store the rain water."
         ]
      },
      "sugarcane": {
         "advisory": [
            "To manage Red Rot disease in Sugarcane spray Carbendazim 12%+ Mancozeb 63% WP @ 400-gram/acre or Metalaxyl 8% + Mancozeb 64% @ 400-gram/acre by mixing it in 200-liter of water."
         ]
      },
      "vegetables": {
         "advisory": [
            "Yellow vein mosaic virus in okra transmits through whitefly, thus spray Methyl demeton 25 EC @ 1.6 ml or Thiomethoxam 25 WG @ 2 gm/lt of water to manage it.",
            "To manage Thrips population in chilli, spray Imidachloprid or Dimethoate @ 2ml/lt of water.",
            "To control different viral & phytoplasma diseases in Bitter gourd, Cucumber and Pumpkin apply 120 ml Abamectin or 30 g Fipronil 80 WG per acre.",
            "To control Fruit and shoot borer in Brinjal Spray Neem based pesticide 1500ppm @600ml/acre at initial stages. If the pests continue ETL, go for alternate spray of Spinosad 45% SC @70ml/acre and Emamectin benzoate @ 80 g /acre at 15 days interval."
         ]
      },
      "fruit": {
         "advisory": [
            "Papaya - Install Yellow Sticky trap to trap the vector (Whitefly) of Papaya Leaf Curl Virus.",
            "Alternate spraying of Neem oil formulation 1500ppm @3ml/lit of water and spray flonicamid 50WG @0.3g/lit to control whitefly.",
            "Coconut - Monitor the activity of the Red palm weevil and Rhinoceros beetle by placing pheromone trap. Spray Lambda cyhalothrin @1.2ml/lit of water to the nearby manure pits for killing the developing stages of Rhinoceros beetle.",
            "To prevent Stem bleeding and Gummosis clean the infected areas and apply the paste of Copper Oxy Chloride & Copper hydroxide."
         ]
      },
      "livestock": {
         "advisory": [
            "Provide clean drinking water to poultry and animals. Keep clean and dry the animal shed. No rainwater should enter into the shed."
         ]
      }
   },
   "date": "06-09-2024"
}