{
   "weather_details": {
      "21-12-2024": {
         "rainfall": 7,
         "t_max": 28,
         "t_min": 14,
         "rh_max": 86,
         "rh_min": 56,
         "wind_speed": 9,
         "wind_direction": 45,
         "cloud_cover": 6
      },
      "22-12-2024": {
         "rainfall": 2,
         "t_max": 28,
         "t_min": 14,
         "rh_max": 81,
         "rh_min": 47,
         "wind_speed": 7,
         "wind_direction": 49,
         "cloud_cover": 5
      },
      "23-12-2024": {
         "rainfall": 1,
         "t_max": 28,
         "t_min": 13,
         "rh_max": 70,
         "rh_min": 34,
         "wind_speed": 8,
         "wind_direction": 50,
         "cloud_cover": 5
      },
      "24-12-2024": {
         "rainfall": 0,
         "t_max": 29,
         "t_min": 13,
         "rh_max": 67,
         "rh_min": 33,
         "wind_speed": 8,
         "wind_direction": 56,
         "cloud_cover": 2
      },
      "25-12-2024": {
         "rainfall": 0,
         "t_max": 29,
         "t_min": 13,
         "rh_max": 66,
         "rh_min": 31,
         "wind_speed": 5,
         "wind_direction": 53,
         "cloud_cover": 0
      }
   },
   "names_of_crops": [
      "kharif rice",
      "summer rice",
      "green gram/black gram",
      "ground nut",
      "cole crop",
      "livestock",
      "poultry"
   ],
   "general_advisory": "As per the extended range forecast of IMD, MC, Bhubaneswar, minimum temperature (night temperature) likely to be 18-20°C in some parts of South Odisha, 14-16°C in most parts of Coastal Odisha and some parts of Interior Odisha, and 10-14°C over the remaining parts of Interior Odisha during week-1 (20th to 26th December, 2024). Minimum temperature likely to be normal to above normal over the districts of Odisha. Very light to light rain very likely to occur over Coastal Odisha & adjoining districts of Interior Odisha during that period.",
   "crops_data": {
      "kharif rice": {
         "advisory": [
            "There is some rainfall event expected in the first half of upcoming days so farmers are advised to wait some days for harvesting operations and make provision to keep the harvested paddy crop in safe places to avoid any further damage.",
            "Use 'Super Grain Bag' for safe storage of paddy/rice for a longer period of time or store the harvested paddy in properly bagged and stacked with a suitable cover to avoid damage due to untimely rain."
         ]
      },
      "summer rice": {
         "advisory": [
            "Farmers should start field preparation for summer season rice cultivation. For this purpose farmers may select some improved varieties like MTU 1010, MTU 1156, MTU 1001, Lalat, Improved Lalat, Chandan, Swarna, etc."
         ]
      },
      "green gram/black gram": {
         "advisory": [
            "One week before sowing of green gram/black gram crop, seed should be treated with carbendazim @ 1.5-2.0g and imidacloprid @ 5g per kg seeds.",
            "Varieties: Green Gram: - Kamadeva, Durga, IPM 02-3, IPM 02-14, TARM1. Black Gram: - Prasada, Usala, PU 31, IPU2-43, Mahuri",
            "Avoid irrigation for some days because some amount of rainfall is expected in the upcoming week."
         ]
      },
      "ground nut": {
         "advisory": [
            "Farmers who have not yet sown seeds can use improved Groundnut varieties such as TAG-24, JL-24, Girnar-3, Smruti, TG-3, TG-22, Kadri-5, Kadri-6, Kadri-9, TPG-41, GPBD-4, Devi, CO-7, Dharani and Divya etc."
         ]
      },
      "cole crop": {
         "advisory": [
            "Straw can be used as mulching material in vegetable crops to maintain soil moisture as well as soil temperature in the field during the winter season.",
            "Regular monitoring against the attack of Diamondback moth in cauliflower should be advised and if possible, farmers should use pheromone trap in the field for this purpose.",
            "If the attack observed then spraying of neem oil @ 5 ml or Emamectin Benzoate @ 0.4 g per liter water should be advised after the occurrence of rain."
         ]
      },
      "livestock": {
         "advisory": [
            "Farmers should make provision to protect the animal from cold (if possible use jute bag to cover the animal and straw as bedding material) during the winter season and provide clean drinking water to cattle and keep their sheds clean. Don’t allow the urine or excreta to deposit around the shed which may lead to flies and make provision to restrict the entry of rainwater into the shed.",
            "Vaccination and deworming should be done to control different harmful diseases and stomach worms."
         ]
      },
      "poultry": {
         "advisory": [
            "Proper ventilation is required to provide fresh air and removing gases inside the house.",
            "External heat source is provided to keep the poultry shed warm and dry. Various types and layers of curtains and jute bags are used to insulate the farm.",
            "The drinking water should be maintained at a suitable temperature to promote water intake."
         ]
      }
   },
   "date": "20-12-2024"
}