{
   "weather_details": {
      "28-12-2024": {
         "rainfall": 0,
         "t_max": 29,
         "t_min": 15,
         "rh_max": 77,
         "rh_min": 40,
         "wind_speed": 8,
         "wind_direction": 53,
         "cloud_cover": 1
      },
      "29-12-2024": {
         "rainfall": 5,
         "t_max": 29,
         "t_min": 15,
         "rh_max": 75,
         "rh_min": 45,
         "wind_speed": 6,
         "wind_direction": 58,
         "cloud_cover": 3
      },
      "30-12-2024": {
         "rainfall": 5,
         "t_max": 28,
         "t_min": 15,
         "rh_max": 81,
         "rh_min": 47,
         "wind_speed": 7,
         "wind_direction": 39,
         "cloud_cover": 2
      },
      "31-12-2024": {
         "rainfall": 0,
         "t_max": 29,
         "t_min": 14,
         "rh_max": 78,
         "rh_min": 38,
         "wind_speed": 8,
         "wind_direction": 40,
         "cloud_cover": 1
      },
      "01-01-2025": {
         "rainfall": 0,
         "t_max": 29,
         "t_min": 13,
         "rh_max": 73,
         "rh_min": 34,
         "wind_speed": 8,
         "wind_direction": 37,
         "cloud_cover": 1
      }
   },
   "names_of_crops": [
      "kharif rice",
      "summer rice",
      "ground nut",
      "cole crop",
      "livestock",
      "poultry"
   ],
   "general_advisory": "Farmers are advised to conduct harvesting, sowing, and spraying operations accordingly. They should also make provision to take proper care of crops and animals to protect them from cold. Sowing of Rabi crops like Mustard, Til, Chickpea, Groundnut, Green gram/Black Gram etc. and start nursery sowing of Summer Paddy where irrigation facilities are available.",
   "crops_data": {
      "kharif rice": {
         "advisory": [
            "There is some rainfall event expected in the first half of upcoming days so farmers are advised to wait for harvesting operations and make provisions to keep the harvested paddy crop in safe places to avoid further damage.",
            "Use 'Super Grain Bag' or properly bag and stack the harvested paddy to avoid damage due to untimely rain."
         ]
      },
      "summer rice": {
         "advisory": [
            "Farmers should start field preparation for summer season rice cultivation using improved varieties like MTU 1010, MTU 1156, MTU 1001, Lalat, Improved Lalat, Chandan, Swarna, etc."
         ]
      },
      "ground nut": {
         "advisory": [
            "Regular monitoring against sucking insect attack in groundnut crop is advised, and if observed, spraying of Azadiractin or neem-based insecticide is recommended. Use yellow sticky traps and Trichogramma chilonis cards for biological control."
         ]
      },
      "cole crop": {
         "advisory": [
            "Use straw as mulching material in vegetable crops to maintain soil moisture and temperature during winter season.",
            "Regular monitoring for Diamond back moth in cauliflower should be done, and spraying of neem oil or Emamectin Benzoate is advised after rain."
         ]
      },
      "livestock": {
         "advisory": [
            "Protect animals from cold using jute bags and straw as bedding material. Provide clean drinking water to cattle and maintain clean sheds.",
            "Vaccination and deworming should be done to control diseases and stomach worms."
         ]
      },
      "poultry": {
         "advisory": [
            "Proper ventilation is required in poultry sheds for fresh air. External heat sources should be used to keep sheds warm and dry.",
            "Maintain drinking water at suitable temperature to promote water intake."
         ]
      }
   },
   "date": "27-12-2024"
}