{
   "weather_details": {
      "11-09-2024": {
         "rainfall": 2,
         "t_max": 30,
         "t_min": 24,
         "rh_max": 89,
         "rh_min": 68,
         "wind_speed": 14,
         "wind_direction": 233,
         "cloud_cover": 7
      },
      "12-09-2024": {
         "rainfall": 2,
         "t_max": 31,
         "t_min": 25,
         "rh_max": 89,
         "rh_min": 61,
         "wind_speed": 13,
         "wind_direction": 238,
         "cloud_cover": 6
      },
      "13-09-2024": {
         "rainfall": 5,
         "t_max": 32,
         "t_min": 25,
         "rh_max": 91,
         "rh_min": 61,
         "wind_speed": 13,
         "wind_direction": 243,
         "cloud_cover": 6
      },
      "14-09-2024": {
         "rainfall": 5,
         "t_max": 32,
         "t_min": 25,
         "rh_max": 91,
         "rh_min": 63,
         "wind_speed": 16,
         "wind_direction": 248,
         "cloud_cover": 6
      },
      "15-09-2024": {
         "rainfall": 2,
         "t_max": 33,
         "t_min": 26,
         "rh_max": 86,
         "rh_min": 58,
         "wind_speed": 15,
         "wind_direction": 245,
         "cloud_cover": 7
      }
   },
   "names_of_crops": [
      "direct seeded paddy",
      "transplanted paddy",
      "cotton",
      "arhar",
      "hybrid maize",
      "brinjal",
      "chilli",
      "tomato",
      "cow & buffalo",
      "goat & sheep",
      "poultry"
   ],
   "general_advisory": "In view of five days weather forecast received from IMD, farmers can resume agronomic practices and application of fertilizer. Farmers are advised to apply pesticides with sticker by keeping in view of real-time weather condition. Apply balanced and appropriate fertilizers according to crop’s growth stage. Avoid excess nitrogen as it promotes excessive vegetative growth and increase water demand. Always consider an integrated approach of preventive measures together with biological treatment if available to protect the crop from pests.",
   "crops_data": {
      "direct seeded paddy": {
         "advisory": [
            "Farmers are advised to spray of leaf extracts of Bael (25 g fresh leaves) or Tulsi (25 g fresh leaves) or Neem (200g fresh leaves) per litre of water for reducing the incidence of insects & diseases.",
            "Current weather is favorable for blast infestation. If leaf blast is observed in rice field, spray Tebuconazole 50% + Trifloxystrobin 25% WG (Nativo) @ 80 g/acre or Isoprothiolane 40 EC (Sultan/Fujita/Fujione) @ 300 ml/acre by mixing with 200 liters of water. Repeat the spray at 7-10 days interval.",
            "There is a chance of infestation of sheath rot and sheath blight in paddy in prevailing weather condition. To manage this disease spray Tebuconazole 50% + Trifloxystrobin 25% WG (Nativo) @ 80 gram/acre or Propiconazole 25% EC (Tilt/Zerox/Dhan/Bumper) @ 200ml/acre by mixing with 200 liters of water.",
            "Presently BLB infestation has been observed in few places. Spray Copper oxychloride 50% WP @ 500g/acre + Streptocycline @ 30g/acre by mixing with 200 liters of water to control BLB.",
            "Install Pheromone traps @ 8nos./acre and light trap @1no./acre to monitor and control the population of stem borer & leaf folder and replace the lure after three weeks. If two folded leaves/hill or the number of male moths/traps reaches 4 or 5, is observed, then spray Azadiractin 0.15% EC @ 800 ml/acre or Chlorantraniliprole 18.5% SC @ 60 ml/acre or Flubendiamide 20 WG 50 g/acre by mixing with 200 liters of water or apply Cartap hydrochloride 4G @ 10 kg/acre to control leaf folder as well as stem borer infestation."
         ]
      },
      "transplanted paddy": {
         "advisory": [
            "Install Pheromone traps @ 8nos./acre and light trap @1no./acre to monitor and control the population of stem borer, leaf folder and rice ear eating caterpillar and replace the lure after three weeks.",
            "In stem borer endemic areas, release egg parasitoid Trichogramma japonicum (Tricho card) @ 60000 eggs (3 card)/acre is required.",
            "Infestation of rice case worm has been noticed. Apply Fipronil 5% SC or Phenthoate 50% EC or Profenophos 50% EC @ 2ml/liter of water to control the infestation.",
            "If pest population is above ETL, follow the chemical recommendation for pest management in direct seeded paddy as mentioned above."
         ]
      },
      "cotton": {
         "advisory": [
            "Application of plant hormone Planofix @ 7 ml mixing with 15 liters of water is advisable at 60-65 DAS for improving the seed cotton yield.",
            "Weed Management: As the crop is at 60-70 days stage, apply total killer herbicide glyphosate or Glufosinate Ammonium 13.5% @ 50ml/10 liter water as directed spray using hoods to control all types of weeds.",
            "Nutrient Management: Apply 20 kg urea/acre in hybrids and 15 kg urea/acre in high yielding varieties as second top dressing at 60 DAS.",
            "Spraying may be done with 100 g Magnesium sulphate mixed with 100 g urea in 10 liter of water in waterlogged areas to reduce leaf reddening.",
            "Pest Management: Application of Neem-based pesticide like Neem oil @ 600-800 ml + 200g detergent powder per acre by mixing with 200 liters of water is advisable to control sucking pests complex like Aphid, Jassids, Thrips & Whitefly.",
            "Install yellow sticky trap @ 8nos./acre to control & monitor sucking pests complex like Aphid, Jassids, Thrips & Whitefly.",
            "Drench the soil of early symptomatic and nearby plants affected by wilt and root rot diseases with Carbendazim 50 WP @ 2 g/litre of water to manage any soil-borne disease including root rot and wilt disease."
         ]
      },
      "arhar": {
         "advisory": [
            "To control leaf webber infestation spray Profenophos 50% EC or Chlorpyriphos 50% + Cypermethrin 5% EC @ 2ml/lit @ 2ml/lit of water.",
            "Monitor your field regularly for signs of pest infestation. Sucking pest infestation may be seen in prevailing weather condition. To prevent sucking pests like aphids, jassids and thrips, neem-based pesticide (1500 ppm) may be sprayed @ 3ml/lit of water at the initial stage of infestation.",
            "Wilting may be observed after receding of rain. Apply Metiram 75% WG @ 1.5g/liter at the root zone of the plant as a control measure."
         ]
      },
      "hybrid maize": {
         "advisory": [
            "Nutrient Management: Apply Urea @ 25kg/ac if the crop is at tasseling stage and irrigate if water is not sufficient.",
            "Pest Management: Stem borer, FAW and banded leaf and sheath blight may appear due to present weather condition. Monitor the field regularly and remove infected plant parts.",
            "For effective control of stem borer spray Fipronil 5% SC or Profenophos 50% EC @ 400ml/acre by mixing with 200 liters of water.",
            "Apply Emamectin Benzoate 5% SG @ 80 g/acre by mixing with 200 liters of water to control FAW infestation.",
            "BLSB - Soaked, discolored concentric bands and rings on leaves and sheaths. For control, spray Validamycin 3.0% SL or Hexaconazole 5% EC @ 2ml/lit of water."
         ]
      },
      "brinjal": {
         "advisory": [
            "Install yellow sticky trap @ 8nos./acre to monitor sucking pests.",
            "Wilting: Spray Tebuconazole 25.9% EC @ 200-ml/acre + Streptocycline @ 30g/acre at the root zone by mixing with 200 liters of water."
         ]
      },
      "chilli": {
         "advisory": [
            "Install Blue sticky trap @ 8nos./acre to monitor thrips infestation.",
            "Prevailing weather condition is favorable for thrips attack. Plants are affected by thrips if leaves curl upward. If symptoms are seen spray neem-based pesticide Azadiractin (1500 ppm) @ 3ml/liter of water at the initial stage of infestation."
         ]
      },
      "tomato": {
         "advisory": [
            "Now, it is suitable time for raising tomato seedlings.",
            "Suitable Varieties: Utkal Kumari (BT-10), Utkal Deepti (BT-2), Utkal Raja, Utkal Pragyan, and Swarna Sampad.",
            "Seed rate: 150 to 200 gram/acre"
         ]
      },
      "cow & buffalo": {
         "advisory": [
            "As grasses are high in moisture content during rainy days, the cattle doesn’t get adequate dry matter from those. So, give 1 kg if concentrate for every 2 kg of milk to dairy animals."
         ]
      },
      "goat & sheep": {
         "advisory": [
            "Keep dry fodder and straw ready at home for sheep and goat in the rainy season and ensure the practice of flushing to give balanced concentrate to sheep and goat one month prior to kidding and lambing."
         ]
      },
      "poultry": {
         "advisory": [
            "Bird flu is a viral disease of poultry. It spreads through contaminated feathers, saliva, droppings of birds. Sometimes it can spread from affected birds to human beings.",
            "During this time please clean poultry houses every day and change the feed and water of poultry birds frequently.",
            "Don’t throw the dead poultry birds here and there. Please bury them by wearing gloves and masks and sanitize the place with bleaching powder.",
            "Don’t bring poultry birds or eggs home from the affected area."
         ]
      }
   },
   "date": "10-09-2024"
}