{
   "weather_details": {
      "20-11-2024": {
         "rainfall": 0,
         "t_max": 28,
         "t_min": 12,
         "rh_max": 71,
         "rh_min": 31,
         "wind_speed": 2,
         "wind_direction": 154,
         "cloud_cover": 0
      },
      "21-11-2024": {
         "rainfall": 0,
         "t_max": 28,
         "t_min": 11,
         "rh_max": 71,
         "rh_min": 30,
         "wind_speed": 2,
         "wind_direction": 154,
         "cloud_cover": 0
      },
      "22-11-2024": {
         "rainfall": 0,
         "t_max": 28,
         "t_min": 11,
         "rh_max": 69,
         "rh_min": 30,
         "wind_speed": 2,
         "wind_direction": 154,
         "cloud_cover": 0
      },
      "23-11-2024": {
         "rainfall": 0,
         "t_max": 28,
         "t_min": 11,
         "rh_max": 68,
         "rh_min": 29,
         "wind_speed": 3,
         "wind_direction": 157,
         "cloud_cover": 0
      },
      "24-11-2024": {
         "rainfall": 0,
         "t_max": 27,
         "t_min": 11,
         "rh_max": 66,
         "rh_min": 29,
         "wind_speed": 2,
         "wind_direction": 149,
         "cloud_cover": 1
      }
   },
   "names_of_crops": [
      "paddy",
      "cotton",
      "greengram",
      "blackgram",
      "groundnut",
      "mustard",
      "toria",
      "sunflower",
      "cauliflower",
      "cabbage",
      "broccoli",
      "onion",
      "tomato",
      "rose",
      "marigold",
      "cattle",
      "buffalo",
      "goat",
      "sheep",
      "poultry",
      "duckery"
   ],
   "general_advisory": "Based on the five-day weather forecast of IMD, farmers are advised to continue necessary agricultural activities, including weeding, fertilization, irrigation, harvesting and pesticide application. Undertake sowing of rabi crops like green gram, black gram, toria, chickpea, lentil, sunflower, groundnut, cowpea, field pea etc. in medium or shallow low land to utilize the available soil moisture in the field. Pulses like lentil, black gram, green gram can be broadcasted as paira crop in the standing matured crop (rice) 7-10 days before harvesting to utilize the residual mois...Crop (Stage) Advisory\nField Crops\nPaddy\n(Grain filling to Maturity/125-145 days)\n- In early maturing varieties, harvest the crop when 80-85% of the grains are matured either manually by sickle or by using combine harvester or reaper. Paddy grains need to be sun-dried to 14% moisture content for consumption purpose and for seed purpose it should be dried to 12% moisture for better self-life. Drain out the water from paddy field, 15 days before harvesting the crop. Store the harvested paddy in Super Grain bag for retaining the quality texture, colors, aroma, fragrance, and taste of the commodities for a longer period of time a safer place (properly stacked with a suitable cover) to avoid damage. Pest Management: For further information, contact the IMD, Bhubaneswar, Tel.#0674-2596116\n- Neck blast: Present weather condition i.e., low night temperatures combined with high humidity create favorable conditions for the development of neck blast disease. If infestation of Neck Blast disease is noticed, apply biocontrol agent like Trichoderma viride 1% WP (minimum 106 CFU) @ 2kg/acre mixed with 200 liters of water. To control chemically spray Tebuconazole 50% + Trifloxystrobin 25% WG @ 80-gram/acre or Carbendazim 50% WP @ 400 g/acre mixed with 200 liters of water.\n-",
   "crops_data": {
      "paddy": {
         "advisory": [
            "In early maturing varieties, harvest the crop when 80 -85% of the grains are matured either manually by sickle or by using combine harvester or reaper. Paddy grains need to be sun -dried to 14% moisture content for consumption purpose and for seed purpose it should be dried to 12% moisture for better self - life. Drain out the water from paddy field, 15 days before harvesting the crop. Store the harvested paddy in Super Grain bag for retaining the quality texture, colors, aroma, fragrance and taste of the commodities for a longer period of time a safer place (properly stacked with suitable cover) to avoid damage.",
            "Pest Management: For further information, contact the IMD, Bhubaneswar, Tel.#0674-2596116",
            "Neck blast: Present weather condition i.e., low night temperatures combined with high humidity create favorable conditions for the development of neck blast disease. If infestation of Neck Blast disease is noticed, apply biocontrol agent like Trichoderma viride 1% WP (minimum 106 CFU) @ 2kg/acre mixed with 200 liters of water. To control chemically spray Tebuconazole 50% + Trifloxystrobin 25% WG @ 80 -gram/acre or Carbendazim 50% WP @ 400 g/acre mixed with 200 liters of water."
         ]
      },
      "cotton": {
         "advisory": [
            "Picking should be done when there is complete bursting of bolls.",
            "Dry the seed cotton on a concrete floor or tarpaulin sheets to reduce the moisture to 8-10%. Store the seed cotton obtained from the 1st picking separately for getting a better price.",
            "Foliar spray of liquid fertilizers like NPK-19-19-19 should be done @ 20 g/10 liters of water for better plant growth and boll development",
            "Regular monitoring of the crop to know about the incidence of any new pest and diseases."
         ]
      },
      "greengram": {
         "advisory": [
            "Suitable time for sowing green gram and black gram. Treat the seeds with Thiram 50 WP or Carbendazim 50 WP @ 2g/kg of seeds before sowing.",
            "Seed rate: 8-10 kg/acre",
            "Suitable varieties: Green gram -IPM 2-03, Virat, Sikha, MH 1142, K-851, PDM 11, PDM-14, OUM-115 etc. Black gram -PU-10, PU-11, PU-19, PU-30, PU-31, T9 etc."
         ]
      },
      "blackgram": {
         "advisory": [
            "Suitable time for sowing green gram and black gram. Treat the seeds with Thiram 50 WP or Carbendazim 50 WP @ 2g/kg of seeds before sowing.",
            "Seed rate: 8-10 kg/acre",
            "Suitable varieties: Green gram -IPM 2-03, Virat, Sikha, MH 1142, K-851, PDM 11, PDM-14, OUM-115 etc. Black gram -PU-10, PU-11, PU-19, PU-30, PU-31, T9 etc."
         ]
      },
      "groundnut": {
         "advisory": [
            "Suitable time for sowing rabi groundnut. Treat the seed with Carbendazim 25% + Mancozeb 50% WS @ 3-3.5 g/kg seed before sowing and with Rhizobium culture @ 500g or 250 ml per 25 kg of seed at the time of sowing. Sowing of the seed should be done at afternoon hours.",
            "Suitable varieties: Devi (ICGV-91114), Kadri-6, Kadri-9, TAG-51, TMV-2, Smruti (OG 52-1), CO-7, Dharani etc.",
            "Seed rate: 40-50 kg groundnut seed kernel per acre.",
            "Nutrient Management: Apply 40 kg DAP, 25 kg MOP and 12 kg Sulphur per acre before sowing."
         ]
      },
      "mustard": {
         "advisory": [
            "Weed Management: Apply Oxadiargyl 6% EC as pre-emergence @ 3ml/ltr of water at 1-2 DAS or Quizalofop-ethyl 5% EC as post-emergence @ 2ml/ltr of water at 15-20 DAS."
         ]
      },
      "toria": {
         "advisory": [
            "Weed Management: Apply Oxadiargyl 6% EC as pre-emergence @ 3ml/ltr of water at 1-2 DAS or Quizalofop-ethyl 5% EC as post-emergence @ 2ml/ltr of water at 15-20 DAS."
         ]
      },
      "sunflower": {
         "advisory": [
            "Weed Management: Spray Pendimithalin 30% EC @ 1.25 ltr/acre by mixing with 200 ltrs of water as pre-emergence herbicide. Power weeding at 21-28 DAS before irrigation plays a significant role to manage the weeds."
         ]
      },
      "cauliflower": {
         "advisory": [
            "Transplant the 30-45 days old seedlings in the main field with row to row spacing of 45-60 cm and plant to plant spacing of 30-45 cm.",
            "Before transplanting, apply Carbendazim 12% + Mancozeb 63% WP to seedlings, and transplant during the afternoon.",
            "Nutrient Management: Apply 26 kg DAP, 10 kg MOP, 15 kg Urea and 5kg Borax as basal at the time of transplanting."
         ]
      },
      "cabbage": {
         "advisory": [
            "Transplant the 30-45 days old seedlings in the main field with row to row spacing of 45-60 cm and plant to plant spacing of 30-45 cm."
         ]
      },
      "broccoli": {
         "advisory": [
            "Transplant the 30-45 days old seedlings in the main field with row to row spacing of 45-60 cm and plant to plant spacing of 30-45 cm."
         ]
      },
      "onion": {
         "advisory": [
            "Now is the suitable time for sowing onion.",
            "Suitable variety: Bhima Raj, Bhima dark red, Bhima Sweta, Bhima Subhra, Bhima Safed, Agrifound Dark Red, Bhima Shakti, Bhima Super, Arka Niketan etc. are suitable cultivar for the winter season.",
            "Seed rate: 4 kg/acre"
         ]
      },
      "tomato": {
         "advisory": [
            "Transplant the 30-35 days old seedlings in the main field with row to row spacing of 75-90 cm and plant to plant spacing of 45-60 cm.",
            "Before transplanting, treat the seedlings with a solution of Bavistin @ 1.5 g and Plantomycin @ 1 g mixed with 1 liter of water for 10 to 15 minutes, and transplant during the afternoon.",
            "Nutrient Management: Apply 66 kg DAP, 33 kg MOP and 80 kg Urea per acre. Apply 1/3rd of Urea + Full DAP + 1/2 MOP as basal."
         ]
      },
      "rose": {
         "advisory": [
            "Prevailing weather condition is favorable for infestation of Powdery mildew. To control, spray Carbendazim 50% WP @ 1.5g/lit of water."
         ]
      },
      "marigold": {
         "advisory": [
            "Pinching should be performed at 30-45 DAT or before bud formation to encourage branching as well as to enhance overall yield."
         ]
      },
      "cattle": {
         "advisory": [
            "Deworm the cattle and buffalo at regular intervals and vaccinate them also. If the animal is not coming to heat even after 4 years, consult with the veterinary doctors and follow the doctor's advice for the onset of puberty."
         ]
      },
      "buffalo": {
         "advisory": [
            "Deworm the cattle and buffalo at regular intervals and vaccinate them also. If the animal is not coming to heat even after 4 years, consult with the veterinary doctors and follow the doctor's advice for the onset of puberty."
         ]
      },
      "goat": {
         "advisory": [
            "Farmers are advised to repair the goat house before the commencement of the winter season. Because there is a high chance of mortality among kids due to chill weather."
         ]
      },
      "sheep": {
         "advisory": [
            "Farmers are advised to repair the goat house before the commencement of the winter season. Because there is a high chance of mortality among kids due to chill weather."
         ]
      },
      "poultry": {
         "advisory": [
            "Farmers must take care of brooding management of chicks and ducklings during the winter season to avoid mortality due to cool weather."
         ]
      },
      "duckery": {
         "advisory": [
            "Farmers must take care of brooding management of chicks and ducklings during the winter season to avoid mortality due to cool weather."
         ]
      }
   },
   "date": "19-11-2024"
}