{
   "weather_details": {
      "19-10-2024": {
         "rainfall": 2,
         "t_max": 34,
         "t_min": 23,
         "rh_max": 93,
         "rh_min": 54,
         "wind_speed": 3,
         "wind_direction": 150,
         "cloud_cover": 4
      },
      "20-10-2024": {
         "rainfall": 2,
         "t_max": 34,
         "t_min": 23,
         "rh_max": 93,
         "rh_min": 60,
         "wind_speed": 3,
         "wind_direction": 146,
         "cloud_cover": 6
      },
      "21-10-2024": {
         "rainfall": 2,
         "t_max": 33,
         "t_min": 22,
         "rh_max": 93,
         "rh_min": 58,
         "wind_speed": 1,
         "wind_direction": 0,
         "cloud_cover": 6
      },
      "22-10-2024": {
         "rainfall": 0,
         "t_max": 33,
         "t_min": 22,
         "rh_max": 91,
         "rh_min": 46,
         "wind_speed": 2,
         "wind_direction": 117,
         "cloud_cover": 5
      },
      "23-10-2024": {
         "rainfall": 0,
         "t_max": 33,
         "t_min": 22,
         "rh_max": 82,
         "rh_min": 45,
         "wind_speed": 2,
         "wind_direction": 31,
         "cloud_cover": 5
      }
   },
   "names_of_crops": [
      "paddy",
      "cotton",
      "arhar",
      "hybrid maize",
      "tomato",
      "cole crops",
      "onion",
      "marigold",
      "rose",
      "cattle & buffalo",
      "goat & sheep",
      "poultry"
   ],
   "general_advisory": "Light to moderate rain/thundershower is likely to occur in Odisha in the upcoming week. Maximum temperatures expected to range from 30-34°C in different parts. Farmers advised to continue intercultural operations, harvesting, and pesticide applications as needed.",
   "crops_data": {
      "paddy": {
         "advisory": [
            "Prevailing weather conditions favor diseases like Bacterial Blight, Bacterial Leaf Streak, and Leaf Blast.",
            "Control Gundhi Bug infestation with Malathion or Imidacloprid spray.",
            "For Ear cutting caterpillar control, spray Quinalphos or Chlorpyriphos."
         ]
      },
      "cotton": {
         "advisory": [
            "Apply Emamectin benzoate or Profenophos for American bollworm control.",
            "Use Streptocycline + Copper Oxychloride to control Bacterial leaf blight."
         ]
      },
      "arhar": {
         "advisory": [
            "Control Leaf webber/Leaf folder/Defoliators with Profenophos or Chlorpyriphos spray.",
            "For Pod borer control, use neem-based pesticides like Azadiractin."
         ]
      },
      "hybrid maize": {
         "advisory": [
            "Apply Flubendiamide for American Cob Borer control.",
            "Spray Validamycin or Hexaconazole for BLSB control."
         ]
      },
      "tomato": {
         "advisory": [
            "Seedling wilt prevention measures with well-prepared nursery beds and chlorpyriphos dust application.",
            "Recommended varieties include Utkala Prgayan, Utkala Raja, and others."
         ]
      },
      "cole crops": {
         "advisory": [
            "Prepare nursery beds for Cauliflower, Cabbage, and Broccoli with specific seed requirements.",
            "Recommended varieties listed for Cauliflower and Cabbage."
         ]
      },
      "onion": {
         "advisory": [
            "Nursery bed preparation guidelines and suitable varieties recommendations for Onions."
         ]
      },
      "marigold": {
         "advisory": [
            "Control mealy bug infestation with Profenophos or Buprofezin spray."
         ]
      },
      "rose": {
         "advisory": [
            "Training, pruning, and intercultural operations advice for Rose cultivation.",
            "Control Black spot with Copper Oxychloride spray."
         ]
      },
      "cattle & buffalo": {
         "advisory": [
            "Deworm and vaccinate cattle and buffalo regularly.",
            "Consult with veterinary doctors for specific issues."
         ]
      },
      "goat & sheep": {
         "advisory": [
            "Check animals for dehydration, heat stress, and parasitic infections.",
            "Deworm and vaccinate animals as needed."
         ]
      },
      "poultry": {
         "advisory": [
            "Maintain cleanliness in poultry houses with raised platforms and deep litter systems.",
            "Regularly clean and disinfect to prevent pathogen buildup."
         ]
      }
   },
   "date": "18-10-2024"
}