{
   "weather_details": {
      "31/07/2024": {
         "rainfall": 15,
         "t_max": 29,
         "t_min": 22,
         "rh_max": 80,
         "rh_min": 54,
         "wind_speed": 18,
         "wind_direction": 216,
         "cloud_cover": 8
      },
      "01/08/2024": {
         "rainfall": 25,
         "t_max": 29,
         "t_min": 22,
         "rh_max": 86,
         "rh_min": 60,
         "wind_speed": 18,
         "wind_direction": 249,
         "cloud_cover": 8
      },
      "02/08/2024": {
         "rainfall": 10,
         "t_max": 29,
         "t_min": 23,
         "rh_max": 81,
         "rh_min": 64,
         "wind_speed": 16,
         "wind_direction": 248,
         "cloud_cover": 8
      },
      "03/08/2024": {
         "rainfall": 5,
         "t_max": 31,
         "t_min": 24,
         "rh_max": 81,
         "rh_min": 59,
         "wind_speed": 16,
         "wind_direction": 243,
         "cloud_cover": 7
      },
      "04/08/2024": {
         "rainfall": 5,
         "t_max": 32,
         "t_min": 25,
         "rh_max": 79,
         "rh_min": 63,
         "wind_speed": 9,
         "wind_direction": 216,
         "cloud_cover": 7
      }
   },
   "names_of_crops": [
      "paddy",
      "black gram",
      "cucurbits",
      "banana",
      "fishery"
   ],
   "general_advisory": "In heavy rainfall areas, stop the sowing of seeds and top dressing of fertilisers or herbicides for the time being. Farmers are advised to make a bund for conserving rainwater in the field. Nursery sowing should be completed by the end of the 2nd fortnight of July. For controlling fruit and shoot borer in brinjal and okra, apply Emamectin benzoate @ 60 gm or spinosad @70 ml per acre. Make provisions for drainage where maize or pulses etc. have been sown. Cover the vegetable nursery with polythene to protect it from heavy rain and make drainage arrangements. Prevailing cloudy weather and high relative humidity conditions are favorable for pest attack in standing crops. Regular monitoring and appropriate plant protection measures should be taken.",
   "crops_data": {
      "paddy": {
         "advisory": [
            "Weed management: To control weed infestation in paddy field, use pre-emergence herbicide Pretilachlor 37% EW @ 600ml/acre or Oxadiargyl 80% W.P @ 50g/acre or Pyrazosulfuron Ethyl 10% W.P @ 80g/acre at 1-3 DAT.",
            "Fertilizer management: For high-yielding paddy varieties, apply 35 kg Urea per acre at 3 weeks after transplanting at the active tillering stage. For hybrids, apply 42-kg of Urea per acre at 3 weeks after transplanting at the active tillering stage. Please make sure before applying urea in the field, you should complete weed control operations and drain out excess water from the field."
         ]
      },
      "black gram": {
         "advisory": [
            "Integrated pest management strategies should be followed to prevent both Whitefly infestation and YMV disease incidence starting from sowing of seeds.",
            "Select YMV disease-resistant varieties like PDM 139, PDM 11 etc.",
            "To prevent whitefly infestation, seeds should be treated with Imidacloprid @ 5-gram/kg of seeds before sowing.",
            "Install 10 nos of yellow sticky traps starting from 2-3 leaf stage of the crop till pod maturity. Diseased plants should be rogued out to prevent further spread of the disease."
         ]
      },
      "cucurbits": {
         "advisory": [
            "After heavy rainfall, Semilooper pest incidence is common in cucurbits like Ridge gourd and snake Guard.",
            "Go for spraying of neem-based pesticide (Neem Oil 15000 PPM) Azadirachtin @ 600 ml/acre or Bacillus Thuringiensis @ 400 gm/acre by mixing it in 200-litre of water.",
            "To manage the pest biologically, use Trichogramma chilonis card (50,000 eggs/ha) @ 1/acre at weekly interval for 5 times by splitting each card into 12 pieces at the given perforations.",
            "To manage the pest chemically, spray AlphaCyhalothrin @ 50-ml/acre or Thiachloprid @ 120 ml/acre during afternoon hours by mixing it with 200 litres of water."
         ]
      },
      "banana": {
         "advisory": [
            "Provide staking and make provision for drainage. To manage panama wilt, select disease-free planting material and resistant cultivars like Bantal, Robusta, Champa, Kabuli etc.",
            "Banana suckers should be dipped with a solution of Carbendazim @ 10-gram/10-litre of water before planting followed by bimonthly drenching of soil around the pseudostem starting from 5 months after planting."
         ]
      },
      "fishery": {
         "advisory": [
            "Heavy rainfall may decrease the salinity of water in the pond. Farmers are advised to apply alky-dimethyl-benzyl ammonium chloride (3ppm) as a disinfectant after cessation of rain.",
            "Bamboo or nylon mesh screens should be erected at the inlets and outlets to prevent loss and entry of unwanted fish.",
            "Nylon nets may be erected on bunds to prevent the loss of fish with overflowing water."
         ]
      }
   },
   "date": "30-07-2024"
}