{
   "weather_details": {
      "11-01-2025": {
         "rainfall": 0,
         "t_max": 30,
         "t_min": 12,
         "rh_max": 74,
         "rh_min": 29,
         "wind_speed": 3,
         "wind_direction": 293,
         "cloud_cover": 3
      },
      "12-01-2025": {
         "rainfall": 0,
         "t_max": 31,
         "t_min": 13,
         "rh_max": 77,
         "rh_min": 29,
         "wind_speed": 4,
         "wind_direction": 350,
         "cloud_cover": 3
      },
      "13-01-2025": {
         "rainfall": 0,
         "t_max": 31,
         "t_min": 14,
         "rh_max": 74,
         "rh_min": 28,
         "wind_speed": 4,
         "wind_direction": 5,
         "cloud_cover": 3
      },
      "14-01-2025": {
         "rainfall": 0,
         "t_max": 31,
         "t_min": 14,
         "rh_max": 77,
         "rh_min": 29,
         "wind_speed": 4,
         "wind_direction": 350,
         "cloud_cover": 3
      },
      "15-01-2025": {
         "rainfall": 0,
         "t_max": 31,
         "t_min": 14,
         "rh_max": 74,
         "rh_min": 28,
         "wind_speed": 4,
         "wind_direction": 5,
         "cloud_cover": 3
      }
   },
   "names_of_crops": [
      "paddy",
      "linseed",
      "mustard and toria",
      "chickpea",
      "chilli",
      "cauliflower",
      "tomato",
      "amaranthus",
      "chrysanthemum",
      "marigold"
   ],
   "general_advisory": "Due to very low temperature, plant germination and growth may be delayed/ hampered. Regularly keep a watch on it and if required, re-sowing could be done. Keep the field clean by removing weeds. Irrigate the field as per the requirement. Spray pesticides in morning and evening hours. Harvest the matured vegetables and keep them at safe places.",
   "crops_data": {
      "paddy": {
         "advisory": [
            "Keep the harvested paddy at some height above the ground.",
            "The paddy stacks should be kept at safe places.",
            "Use Fumigant tablets (Aluminium Phosphide) in the storage room and close it from all the directions.",
            "For storing paddy at home, use celphos tablets/ powder packets in the drums."
         ]
      },
      "linseed": {
         "advisory": [
            "Powdery mildew in linseed can be reduced by spraying wettable sulphur @ 3% or Karathane @ 2g/lt.",
            "Rouge out weeds from the field.",
            "Remove/ Uproot the wilted plants from the field."
         ]
      },
      "mustard and toria": {
         "advisory": [
            "Irrigate the field if possible in flowering and fruit formation time.",
            "Spray Imidachloprid 17.8% SL @ 2 ml/lt to reduce the incidence of aphids and mustard sawfly in Mustard and Toria.",
            "Alternaria black leaf spot can be managed by spraying Carbend azim or Mancozeb @ 1 gm/lt.",
            "Regularly check for the powdery mildew disease infestation which may be seen in the field in the next few weeks."
         ]
      },
      "chickpea": {
         "advisory": [
            "Cutworm infestation may be seen in the field. Cutworm in Chickpea can be managed by spraying Methyl Parathion @ 1 ml/lt.",
            "Alternaria leaf blight in chickpea can be reduced by spraying Mancozeb @ 2.5 g/lt.",
            "Powdery mildew in chickpea may be seen in the near future. To manage the same, spray Dithane M -45 @ 2.5 g/lt.",
            "Uproot the plants and destroy it if wilting symptoms due to fusarium wilt are observed in the field."
         ]
      },
      "chilli": {
         "advisory": [
            "Sowing of chilli plants can be taken into consideration if vacant places are available.",
            "Irrigate the crop after sowing.",
            "Little leaf in Chilli can be seen in the field. If that happens spray Dimethoate @ 2 ml/lt.",
            "Aphids and Jassids infestation may be seen in the field. To manage it spray Imidachloprid 17.8% SL @ 1 ml/lt."
         ]
      },
      "cauliflower": {
         "advisory": [
            "Harvest the matured fruits and sell them at the market at affordable prices.",
            "Black rot in Cauliflower can be reduced by spraying copper oxy chloride @ 2 gm/lt.",
            "Cauliflower borer can be managed by manually destroying the borers. In case of heavy infestation of borers spray Cartap hydrochloride @ 6 g/15 lts.",
            "Downy mildew disease in Cauliflower can be reduced by spraying Metalaxyl @ 4g/lt."
         ]
      },
      "tomato": {
         "advisory": [
            "To minimize the infestation of aphids and jassids in the tomato crop, spray dimethoate or Imidachloprid @ 1 ml/lt.",
            "Fruit and shoot borer in tomato plants can be managed by spraying Flubendiamide 20 WG @ 2g/10lt or Emamectin benzoate 4%SG @ 4 g/10lt of water.",
            "Provide irrigation to the crop if plants getting wilted."
         ]
      },
      "amaranthus": {
         "advisory": [
            "Harvest or cut the matured plants for culinary purpose.",
            "Remove any diseased parts from the plants."
         ]
      },
      "chrysanthemum": {
         "advisory": [
            "Provide light irrigation to the flowering plants.",
            "Powdery mildew in Chrysanthemum can be managed by spraying Carbendazim @ 1g/lt.",
            "Wilting symptoms like withered plants or infected parts should be removed and destroyed away from the plants."
         ]
      },
      "marigold": {
         "advisory": [
            "Mealy bug infestation can be seen in the marigold crop field. To reduce the same apply neem oil or insecticidal soap solution or Imidachloprid @ 2 ml/lt."
         ]
      }
   },
   "date": "10-01-2025"
}