{
   "weather_details": {
      "01/02/2025": {
         "rainfall": 0,
         "t_max": 33,
         "t_min": 19,
         "rh_max": 84,
         "rh_min": 32,
         "wind_speed": 4,
         "wind_direction": 90,
         "cloud_cover": 0
      },
      "08/02/2025": {
         "rainfall": 0,
         "t_max": 33,
         "t_min": 16,
         "rh_max": 84,
         "rh_min": 32,
         "wind_speed": 4,
         "wind_direction": 90,
         "cloud_cover": 0
      },
      "09/02/2025": {
         "rainfall": 0,
         "t_max": 33,
         "t_min": 16,
         "rh_max": 81,
         "rh_min": 27,
         "wind_speed": 8,
         "wind_direction": 247,
         "cloud_cover": 0
      }
   },
   "names_of_crops": [
      "paddy",
      "groundnut",
      "sugarcane",
      "black gram",
      "green gram",
      "chilli",
      "cole crops",
      "onion",
      "mango",
      "rose",
      "animal husbandry",
      "poultry"
   ],
   "general_advisory": "Rainfall is expected to be minimal with clear skies. Farmers are advised to monitor pest populations, apply irrigation as needed, and follow specific crop management practices.",
   "crops_data": {
      "paddy": {
         "advisory": [
            "In transplanted paddy to control grasses, sedges and broad leaf weeds farmers are advised to spray Bispyribac Sodium 10% E.C. or Ethoxysulfuron 15% WDG at 3 to 4 leaf stage.",
            "Raising of nursery bed for summer paddy is under progress."
         ]
      },
      "groundnut": {
         "advisory": [
            "To manage the carrier of Bud necrosis disease (Thrips) during primary stage of pest infestation spray Neem-Based Pesticide or chemical sprays like Thiamethoxam 25% W.G or Acetamiprid 20% S.P.",
            "Mustard and Groundnut are in flowering to pod formation stage."
         ]
      },
      "sugarcane": {
         "advisory": [
            "To manage sett rot disease after planting basal drenching with Carbendazim 12% + Mancozeb 63% or foliar spray with Metalaxyl 8% + Mancozeb 64% WP.",
            "Harvesting and planting of sugarcane is under progress."
         ]
      },
      "black gram": {
         "advisory": [
            "To control aphids during the primary stage of pest infestation spray Neem-Based Pesticide or chemical sprays like Thiamethoxam 25% W.G or Acetamiprid 20% S.P."
         ]
      },
      "green gram": {
         "advisory": [
            "To control aphids during the primary stage of pest infestation spray Neem-Based Pesticide or chemical sprays like Thiamethoxam 25% W.G or Acetamiprid 20% S.P."
         ]
      },
      "chilli": {
         "advisory": [
            "To manage Fruit rot and Die back disease in Chilli crop spray Propineb 70 % WP or Difenoconazole 25 % EC or Azoxystrobin 23 % SC.",
            "There are chances of fruit rot and die back disease incidence in Chilli crop."
         ]
      },
      "cole crops": {
         "advisory": [
            "There are chances of Alternaria leaf spot disease incidence in Cole crops due to current weather conditions. To control this disease spray Mancozeb 75 % WP or carbendazim 12 % + Mancozeb 63 % WP."
         ]
      },
      "onion": {
         "advisory": [
            "To manage purple blotch and Stemphylium leaf blight disease in onion spray Mancozeb 75% WP or Difenoconazole 25% E.C or Tebuconazole 25.9% E.C."
         ]
      },
      "mango": {
         "advisory": [
            "To manage mango hoppers multiply rapidly in cloudy and foggy weather spray Imidacloprid 17.8% SL or Thiamethoxam 25% W.G or Acetamiprid 20% S.P.",
            "The mango hoppers multiply rapidly in cloudy and foggy weather."
         ]
      },
      "rose": {
         "advisory": [
            "In prevailing weather conditions infestation of Powdery mildew may be noticed in Rose plant. Spray Carbendazim 50% WP as a preventive measure.",
            "The mango hoppers multiply rapidly in cloudy and foggy weather."
         ]
      },
      "animal husbandry": {
         "advisory": [
            "For countering Foot and mouth diseases of cattle, care should be taken for FMD vaccination once in a year."
         ]
      },
      "poultry": {
         "advisory": [
            "Sleeping disease of poultry has been found. Vaccinate the chicks with LaSota at 7 days and with IBD vaccines within 13-15 days."
         ]
      }
   },
   "date": "07-02-2025"
}