{
   "weather_details": {
      "08-02-2025": {
         "rainfall": 0,
         "t_max": 33,
         "t_min": 17,
         "rh_max": 78,
         "rh_min": 24,
         "wind_speed": 2,
         "wind_direction": 63,
         "cloud_cover": 2
      },
      "09-02-2025": {
         "rainfall": 0,
         "t_max": 33,
         "t_min": 16,
         "rh_max": 83,
         "rh_min": 19,
         "wind_speed": 1,
         "wind_direction": 90,
         "cloud_cover": 1
      },
      "10-02-2025": {
         "rainfall": 0,
         "t_max": 33,
         "t_min": 14,
         "rh_max": 81,
         "rh_min": 16,
         "wind_speed": 1,
         "wind_direction": 162,
         "cloud_cover": 2
      },
      "11-02-2025": {
         "rainfall": 0,
         "t_max": 34,
         "t_min": 14,
         "rh_max": 76,
         "rh_min": 18,
         "wind_speed": 3,
         "wind_direction": 203,
         "cloud_cover": 2
      },
      "12-02-2025": {
         "rainfall": 0,
         "t_max": 34,
         "t_min": 14,
         "rh_max": 58,
         "rh_min": 17,
         "wind_speed": 4,
         "wind_direction": 221,
         "cloud_cover": 1
      }
   },
   "names_of_crops": [
      "tomato",
      "rice",
      "mustard and toria",
      "chilli",
      "potato",
      "okra"
   ],
   "general_advisory": "Farmers are advised to do weeding and hoeing in the standing crops like Maize, Groundnut, Green gram, Chick pea and vegetables to protect them from weeds. Apply balanced and appropriate fertilizers according to crop’s growth stage. Install yellow sticky trap @ 8/acre to monitor sucking pest like White fly, Aphids, Jassids & Thirps in vegetables at vegetative stage. Rouging of viral infested plant should be done in vegetables. Infected plants should be uprooted and buried in the soil. After rouging, if infection is more, then spraying of Imidacloprid @ 1 ml per 3 -4 litres of water is advised to control the vector. Use pheromone trap @ 8/acre for monitoring borer insect in vegetables like brinjal, cauliflower, cabbage, tomato etc.",
   "crops_data": {
      "tomato": {
         "advisory": [
            "To control early and late blight in tomato field spray Azoxystrobin 23% SC @ 1 ml/litre of water or Zineb 75% WP @ 2.5 g/litre of water."
         ]
      },
      "rice": {
         "advisory": [
            "Apply light irrigation to the nursery beds as & when required. The rice seedlings at 4 -5 leaf stage are ready for transplanting.",
            "Spray the nursery area with Tebuconazole 50% + Trifloxystrobin 25% WG @ 0.4 g/litre of water to control blast infestation.",
            "Go for puddling of main field. Apply 8 kg N, 16 kg P2O5 and 16 kg K2O as basal fertilizer at the time of last round of puddling. Plant 2 to 3 seedlings per hill in lines at 15 to 20 cm apart and hill to hill at 10 cm apart.",
            "Apply herbicide Bensulfuron methyl + Pretilachlor @ 4 kg/acre mixed with 12 kg of dry sand at 2 -3 days after transplanting to control weeds at the early stage of crop growth."
         ]
      },
      "mustard and toria": {
         "advisory": [
            "The siliqua is in the development stage which may attract different pests like grasshopper, aphids and larvae. Therefore, regularly, keep a watch in the crop field.",
            "The incidence of aphids along with mustard sawfly larva and adult may be seen in the field. Spray Emamectin benzoate 4% SG @ 5g/10lt of water.",
            "In severe infestation of aphids, spray Imidacloprid or Dimethoate @ 2 ml/lt."
         ]
      },
      "chilli": {
         "advisory": [
            "Little leaf in Chilli can be seen the field. If that happens spray Dimethoate @ 2ml/lt.",
            "Aphids and Jassids infestation may be seen in the field. To manage it spray Imidacloprid 17.8% SL @ 1 ml/lt.",
            "Mite: Stunted growth with downward curling and crinkling of leaves is seen in mite-infested chili plants. Apply Ethion 50% EC or Propargite 57% EC @ 600-ml/acre mixed with 200 liters of water to control mite infestation."
         ]
      },
      "potato": {
         "advisory": [
            "Provide irrigation as per the requirement of the crop.",
            "Earthing up is required in potato to prevent from direct exposure to sun. As this will deteriorate the quality of potato by solanine production.",
            "If wilting is seen in the field, drench Blitox -50 @ 45g + Streptocycline @ 2g in 10liters of water."
         ]
      },
      "okra": {
         "advisory": [
            "To control fruit borer in okra spray neem-based pesticide 300 ppm @ 5ml/l of water. At later stages spray of Spinosad 45% SC @ 0.4ml/l of water."
         ]
      }
   },
   "date": "07-02-2025"
}