{
   "weather_details": {
      "20-07-2024": {
         "rainfall": 40,
         "t_max": 27,
         "t_min": 23,
         "rh_max": 96,
         "rh_min": 80,
         "wind_speed": 9,
         "wind_direction": 248,
         "cloud_cover": 8
      },
      "21-07-2024": {
         "rainfall": 30,
         "t_max": 28,
         "t_min": 23,
         "rh_max": 96,
         "rh_min": 92,
         "wind_speed": 13,
         "wind_direction": 248,
         "cloud_cover": 8
      },
      "22-07-2024": {
         "rainfall": 15,
         "t_max": 30,
         "t_min": 24,
         "rh_max": 97,
         "rh_min": 89,
         "wind_speed": 13,
         "wind_direction": 248,
         "cloud_cover": 7
      },
      "23-07-2024": {
         "rainfall": 5,
         "t_max": 31,
         "t_min": 24,
         "rh_max": 96,
         "rh_min": 90,
         "wind_speed": 12,
         "wind_direction": 246,
         "cloud_cover": 7
      },
      "24-07-2024": {
         "rainfall": 5,
         "t_max": 31,
         "t_min": 25,
         "rh_max": 92,
         "rh_min": 79,
         "wind_speed": 13,
         "wind_direction": 238,
         "cloud_cover": 7
      }
   },
   "names_of_crops": [
      "rice",
      "maize",
      "ragi",
      "tomato"
   ],
   "general_advisory": "Rainfall is expected during the next five days. Farmers are advised to spray only when the sky becomes clear and use a sticker in the spray solution. Proper arrangement for storing rainwater is recommended for irrigation in the crops during dry spells. Due to high humidity, there are possibilities of pest and disease build-up in already sown crops. Take plant protection measures depending on the crop and weather conditions.",
   "crops_data": {
      "rice": {
         "advisory": [
            "Collect hybrid or high yielding varieties of paddy with resistance to diseases and insect pests as per the land situations of the farmers from nearby dealers.",
            "For sowing of dhanicha seeds @ 10 kg/acre prior to the transplanting of paddy, apply phosphatic fertilizer in the dhaincha fields required for paddy cultivation.",
            "Transplant 15-25 days seedlings. Treat the nursery seedlings or root dip uprooted seedlings in the solution of neem oil @ 5ml/litre of water and metalaxyl + mancozeb @ 1.25 g/litre of water."
         ]
      },
      "maize": {
         "advisory": [
            "Complete the sowing of 10 Kg Maize hybrid seed per acre with the spacing of 60 cm row to row and 20-25cm between plants.",
            "Spray Atrazine @1Kg /acre within 2 days of sowing to control the weeds in maize field."
         ]
      },
      "ragi": {
         "advisory": [
            "This is the optimum time for direct sowing ragi. Sow the seeds @ 4 kg/acre in line at 22.5 cm apart. Apply 35 kg DAP and 17 kg MoP per acre at the time of sowing. Before sowing, seeds should be treated with Carboxin 37.5%+Thiram 37.5% DS @ 2 g/kg seed.",
            "Sow 4Kg seeds of Arjun, Kalua, Bharabi, etc. high yielding ragi varieties per acre."
         ]
      },
      "tomato": {
         "advisory": [
            "If bacterial wilting is observed in tomatoes, apply Plantomycin @ 1.0 g and Copper Oxychloride @ 2 g/litre of water."
         ]
      }
   },
   "date": "19-07-2024"
}