{
   "weather_details": {
      "02.09.2024": {
         "rainfall": 4,
         "t_max": 33,
         "t_min": 25,
         "rh_max": 98,
         "rh_min": 77,
         "wind_speed": 0,
         "wind_direction": 0,
         "cloud_cover": 0
      },
      "03.09.2024": {
         "rainfall": 0,
         "t_max": 32,
         "t_min": 26,
         "rh_max": 0,
         "rh_min": 0,
         "wind_speed": 0,
         "wind_direction": 0,
         "cloud_cover": 0
      },
      "04.09.2024": {
         "rainfall": 11,
         "t_max": 31,
         "t_min": 26,
         "rh_max": 0,
         "rh_min": 0,
         "wind_speed": 0,
         "wind_direction": 0,
         "cloud_cover": 0
      },
      "05.09.2024": {
         "rainfall": 18,
         "t_max": 31,
         "t_min": 25,
         "rh_max": 0,
         "rh_min": 0,
         "wind_speed": 0,
         "wind_direction": 0,
         "cloud_cover": 0
      },
      "07-09-2024": {
         "rainfall": 25,
         "t_max": 28,
         "t_min": 24,
         "rh_max": 98,
         "rh_min": 77,
         "wind_speed": 7,
         "wind_direction": 249,
         "cloud_cover": 8
      },
      "08-09-2024": {
         "rainfall": 40,
         "t_max": 28,
         "t_min": 23,
         "rh_max": 97,
         "rh_min": 82,
         "wind_speed": 8,
         "wind_direction": 249,
         "cloud_cover": 8
      },
      "09-09-2024": {
         "rainfall": 45,
         "t_max": 28,
         "t_min": 22,
         "rh_max": 98,
         "rh_min": 94,
         "wind_speed": 8,
         "wind_direction": 246,
         "cloud_cover": 8
      },
      "10-09-2024": {
         "rainfall": 35,
         "t_max": 27,
         "t_min": 22,
         "rh_max": 98,
         "rh_min": 91,
         "wind_speed": 8,
         "wind_direction": 243,
         "cloud_cover": 8
      },
      "11-09-2024": {
         "rainfall": 15,
         "t_max": 29,
         "t_min": 23,
         "rh_max": 97,
         "rh_min": 86,
         "wind_speed": 9,
         "wind_direction": 248,
         "cloud_cover": 8
      }
   },
   "names_of_crops": [
      "rice",
      "maize",
      "kharif groundnut",
      "ragi",
      "brinjal",
      "cucumber",
      "tomato",
      "cattles",
      "goat & sheep",
      "poultry"
   ],
   "general_advisory": "Rainfall is expected during next five days, spray only when sky becomes clear and use sticker to the spray solution. Farmers are advised to do proper arrangement for storing rainwater at one portion in the field. This water can be used for irrigation in the crops during dry spell. Due to high humidity, possibilities of pest and disease build up in already sown crop. Take plant protection measures depending on the crop and weather condition. Make proper drainage system in non-paddy crop field for removing of excess water.",
   "crops_data": {
      "rice": {
         "advisory": [
            "Keep the rice plots weed free.",
            "Apply low quantity of Nitrogen fertilizer to reduce the blast disease.",
            "Spray chlorantraniliprole @ 6 ml /15 liter of water to control the steam borer.",
            "Spray Imidachloprid @ 0.6 ml / liter of water to control the BPH.",
            "Complete the transplanting. Use 4 -5 seedlings / hill in age old seedlings with closed spacing."
         ]
      },
      "maize": {
         "advisory": [
            "Develop better drainage system to avoid water logging condition due to excess rainfall."
         ]
      },
      "kharif groundnut": {
         "advisory": [
            "Prepare the field and raise Kharif groundnut of high yielding varieties. Treat the seeds with Trichoderma viridae (10 gm.), Pseudomonas fluorescence (10 gm.) and Rhizobium culture (20 gm.) per kg of seed before sowing."
         ]
      },
      "ragi": {
         "advisory": [
            "In case of line sown and broadcasted crop apply 13 kg urea/acre at 35 -40 days after sowing. In case of transplanted crop apply 26 kg urea/acre at 20 days after transplanting.",
            "If blast incidence observed in ragi spray Zineb 75% WP @ 2 g/litre of water or Tricyclazole 75% WP @ 1 g/litre of water  when the sky becomes clear."
         ]
      },
      "brinjal": {
         "advisory": [
            "Transplant 25 -35 days old seedlings in the main field.",
            "Make necessary drainage channels to prevent water logging condition.",
            "Identify and fill gaps in the main field to maintain plant population.",
            "Wilting in brinjal can be managed by spraying Tabuconazole @ 1 g/lt."
         ]
      },
      "cucumber": {
         "advisory": [
            "There is a chance of downy mildew attack in cucumber. If observed spray Metalaxyl 8% + Mancozeb 64% @ 2 g/litre of water on sunny days."
         ]
      },
      "tomato": {
         "advisory": [
            "In upland well-drained soil complete the nursery sowing for tomato. Use high yielding varieties @ 150 -200 g seed/acre. Use a low-cost polythene cover above the nursery to avoid the seedlings from excess rainfall."
         ]
      },
      "cattles": {
         "advisory": [
            "Ticks and Flies multiplied rapidly during the rainy season. Ticks suck blood from cattle and induce anaemic and death. Ticks harbor, multiply, and spread of haemoprotozoan diseases. Fly is also induces nuisance, irritation, humpsore and cases reduce production and reproduction performances. Animal farms should be disinfected regularly with the use of a suitable disinfectant."
         ]
      },
      "goat & sheep": {
         "advisory": [
            "Keep dry fodder and straw ready at home for sheep and goat in the rainy season and ensure the practice of flushing to give balanced concentrate to sheep and goat one month prior to kidding and lambing."
         ]
      },
      "poultry": {
         "advisory": [
            "Please ensure filling of holes and crevices of the poultry house in rainy days otherwise that will facilitate the entry of snakes and reptiles, which may kill the birds."
         ]
      }
   },
   "date": "06-09-2024"
}