{
   "weather_details": {
      "23-09-2024": {
         "rainfall": 4,
         "t_max": 34,
         "t_min": 26,
         "rh_max": 0,
         "rh_min": 0,
         "wind_speed": 0,
         "wind_direction": 0,
         "cloud_cover": 0
      },
      "24-09-2024": {
         "rainfall": 25,
         "t_max": 33,
         "t_min": 25,
         "rh_max": 0,
         "rh_min": 0,
         "wind_speed": 0,
         "wind_direction": 0,
         "cloud_cover": 0
      },
      "25-09-2024": {
         "rainfall": 20,
         "t_max": 33,
         "t_min": 25,
         "rh_max": 0,
         "rh_min": 0,
         "wind_speed": 0,
         "wind_direction": 0,
         "cloud_cover": 0
      },
      "26-09-2024": {
         "rainfall": 0,
         "t_max": 32,
         "t_min": 25,
         "rh_max": 0,
         "rh_min": 0,
         "wind_speed": 0,
         "wind_direction": 0,
         "cloud_cover": 0
      },
      "28-09-2024": {
         "rainfall": 5,
         "t_max": 32,
         "t_min": 25,
         "rh_max": 94,
         "rh_min": 73,
         "wind_speed": 6,
         "wind_direction": 193,
         "cloud_cover": 8
      },
      "29-09-2024": {
         "rainfall": 5,
         "t_max": 33,
         "t_min": 25,
         "rh_max": 94,
         "rh_min": 70,
         "wind_speed": 5,
         "wind_direction": 165,
         "cloud_cover": 6
      },
      "30-09-2024": {
         "rainfall": 2,
         "t_max": 33,
         "t_min": 25,
         "rh_max": 96,
         "rh_min": 66,
         "wind_speed": 5,
         "wind_direction": 234,
         "cloud_cover": 4
      },
      "01-10-2024": {
         "rainfall": 2,
         "t_max": 34,
         "t_min": 25,
         "rh_max": 96,
         "rh_min": 69,
         "wind_speed": 5,
         "wind_direction": 234,
         "cloud_cover": 4
      },
      "02-10-2024": {
         "rainfall": 2,
         "t_max": 34,
         "t_min": 26,
         "rh_max": 95,
         "rh_min": 70,
         "wind_speed": 5,
         "wind_direction": 225,
         "cloud_cover": 4
      }
   },
   "names_of_crops": [
      "rice",
      "maize",
      "black gram",
      "sesame",
      "tomato",
      "chilli",
      "brinjal"
   ],
   "general_advisory": "Watch for rain before applying pesticides. If necessary spray only when the sky becomes clear and use a sticker to the spray solution. In fallow uplands, utilizing recent rainfall, farmers should take up short-duration, low-water-requiring crops like black gram, green gram, sesame, fodder crops, etc. Regular surveillance work should be taken up in all crops to know the incidence of various insect pests and initiate control strategies.",
   "crops_data": {
      "rice": {
         "advisory": [
            "Apply 16kg Urea + 10kg MOP per acre in upland conditions and 20kg urea + 13kg MOP per acre in medium and lowland conditions at the panicle initiation stage as the second top dressing.",
            "Install Pheromone traps @ 8nos./acre and light trap @1no./acre to monitor and control the population of stem borer, leaf folder, and rice ear-eating caterpillar and replace the lure after three weeks.",
            "In stem borer endemic areas, release egg parasitoid Trichogramma japonicum (Tricho card) @ 60000 eggs (3 cards) /acre is required.",
            "Current weather may favor blast disease in rice. To control it, spray Tebuconazole 50% + Trifloxystrobin 25% WG @ 0.4 g/liter of water or Tricyclazole 45% + Hexaconazole 10% WG @ 1 g/liter of water."
         ]
      },
      "maize": {
         "advisory": [
            "Develop a better drainage system to avoid waterlogging conditions due to excess rainfall.",
            "Apply Urea @ 25kg/ac if the crop is at the tasseling stage and irrigate if water is not sufficient.",
            "Stem borer, FAW, and banded leaf and sheath blight may appear due to present weather conditions. Monitor the field regularly and remove infected plant parts.",
            "To control Fall armyworm, spray Emamectin benzoate 5% SG @ 0.4 g/liter of water or Chlorantraniliprole 18.5% SC @ 0.4 ml/liter of water."
         ]
      },
      "black gram": {
         "advisory": [
            "This is the time for sowing pre-rabi Black gram (Biri) and Green gram (Mung). Use 10 kg seeds/acre. Before sowing, seeds are to be treated with the Rhizobium culture. Apply 4 kg urea, 35 kg DAP, and 13 kg MOP per acre during final land preparation. Sow the seeds in a line of 30 cm apart with 10 -15 cm plant-to-plant distance."
         ]
      },
      "sesame": {
         "advisory": [
            "This is the optimum time for sowing pre-rabi sesame. Sow the seeds in lines of 30 cm apart and 10 cm between plants using 3 kg seed/acre. Apply 6.5 kg urea, 17 kg DAP, and 13 kg MoP per acre during final land preparation."
         ]
      },
      "tomato": {
         "advisory": [
            "In upland well-drained soil, complete the nursery sowing for tomato. Use high-yielding varieties @ 150 -200 g seed/acre. Use a low-cost polythene cover above the nursery to avoid the seedlings from excess rainfall.",
            "The present climate is suitable for bacterial spot and speck of tomato. To manage at an early stage, go for organic treatment by submerging seeds for one minute in sodium hypochlorite or in hot water (50°C) for 25 minutes can reduce the incidence of both diseases."
         ]
      },
      "chilli": {
         "advisory": [
            "To manage fruit borer, spray Cyntraniliprole 10.26% OD @ 240 ml/acre mixed with 200 liters of water.",
            "If leaf curl and mosaic diseases are observed in the chilli field, to manage this disease, spray dimethoate 30 EC @ 500 ml/ha or imidacloprid 17.8 SL @ 100 ml/ha to control insect vectors and to destroy the infected plants immediately after noticing the initial symptoms. Repeat the spray 15 days later, if necessary."
         ]
      },
      "brinjal": {
         "advisory": [
            "To control wilt, spray Tebuconazole 25.9% EC @ 200 -ml/acre + Streptocycline @ 30g/acre at the root zone mixed with 200 liters of water."
         ]
      }
   },
   "date": "27-09-2024"
}