{
   "weather_details": {
      "2024-09-28": {
         "rainfall": 15,
         "t_max": 29,
         "t_min": 24,
         "rh_max": 93,
         "rh_min": 75,
         "wind_speed": 13,
         "wind_direction": 198,
         "cloud_cover": 8
      },
      "2024-09-29": {
         "rainfall": 10,
         "t_max": 30,
         "t_min": 25,
         "rh_max": 92,
         "rh_min": 66,
         "wind_speed": 9,
         "wind_direction": 212,
         "cloud_cover": 7
      },
      "2024-09-30": {
         "rainfall": 5,
         "t_max": 32,
         "t_min": 25,
         "rh_max": 88,
         "rh_min": 68,
         "wind_speed": 8,
         "wind_direction": 246,
         "cloud_cover": 4
      },
      "2024-10-01": {
         "rainfall": 5,
         "t_max": 32,
         "t_min": 25,
         "rh_max": 89,
         "rh_min": 62,
         "wind_speed": 9,
         "wind_direction": 248,
         "cloud_cover": 4
      },
      "2024-10-02": {
         "rainfall": 5,
         "t_max": 34,
         "t_min": 26,
         "rh_max": 90,
         "rh_min": 68,
         "wind_speed": 9,
         "wind_direction": 207,
         "cloud_cover": 4
      }
   },
   "names_of_crops": [
      "rice",
      "pigeon pea",
      "maize",
      "brinjal",
      "cucumber",
      "papaya",
      "goat",
      "cow",
      "freshwater"
   ],
   "general_advisory": "Drain out excess water from the paddy and non-paddy crops. Harvest the matured vegetables & flowers and keep in safe place. In shallow lowland/ medium land transplanted rice, apply 35 kg urea/acre for HYV  and 42 kg of urea/acre for hybrids at tillering stage. In Zinc deficient soil, if Zinc sulphate (ZnSO4) has not been applied during final land preparation, spray Zn-EDT A @ 0.5 g/litre of water at 30 and 45 days after transplanting of rice or spray 0.5% ZnSO4 solution (2 kg ZnSO4 +10 kg of lime in 400 litres of water per acre) thrice at 15 days’  interval on appearance of deficiency symptom in the field. Maintain 2-3 cm standing water during tillering stage in paddy . if not applied earlier . Regular monitoring of the crop for incidence of pest and diseases should be done. Keep the animal sheds clean and dry . Provide suf ficient foods and water to animals and keep the foods in safer place to protect from rain.",
   "crops_data": {
      "rice": {
         "advisory": [
            "Due to prevailing wet and humid conditions the attack of pests like Yellow stem borer and leaf folder may increase in the crop. The present high humid weather condition and rainfall followed by clear sky is favourable for Brown Plant Hopper (BPH) and White Backed Plant Hopper (WBPH) infestation in paddy . To manage BPH and WBPH in paddy avoid excess use of nitrogenous fertilizer . Do not keeping standing water in the field for longer period. Alter the micro-climate of the rice field by alternate wetting and drying technique. Make alleys at 6 feet spacing for sunlight entry and proper aeration below the crop zone. If infestation of BPH occur (5-10 hoppers/hill), spray Neem Based Pesticide 1500 PPM @ 600-ml/acre at the base of the plant. If problem persists, spray Pymetrozine 50% WG @ 120 g/acre or Dinotefuran 20 % SG @ 80 g/acre or Flonicamid 50 % WG @ 60- gram/acre or Triflumezopyrim 10% SC @ 100 ml / acre at the base of the plant. Use only pesticides recommended for brown plant hopper at recommended dose only . To manage Leaf Folder and Case Worm pests in paddy spray Bifenthrin 10% EC @ 200 ml/acre or Lambda Cyhalothrin 5% EC @ 200-ml/acre or Fipronil 5% SC @ 400- ml/acre or Chlorantraniliprole 18.5% SC @ 60-ml /acre. Yellow stem borer management: To manage stem borer in paddy at early stage of crop, apply Cartap Hydrochloride 4%G @ 18.45-kg/ha or Chlorantraniliprole 0.4 % GR @ 10-kg/ha or Imidacloprid 0.3% G @ 15-kg/ha by mixing it with sand at 1:1 ratio. Leaf folder and case worm management: In paddy fields infested with leaf folder and case worm, apply mixture of 2.5-litre of kerosene and 50-kg of sand per ha and then move a string over the paddy crop by stretching at both the ends of the field. By this method the larva of insects falls to the water and gets killed. To manage Leaf Folder and Case Worm pests in paddy spray Fipronil 5% SC @ 1000-ml/ha or Profenophos 50% EC @ 1000-ml/ha or Chlorantraniliprole 18.5% SC @ 200-ml /ha. Bacterial Leaf Blight: To manage Bacterial Leaf Blight, spray Copper Hydroxide 53.8% DF 3g/ ltr or Copper Oxychloride 50%WP  3.0 g/ ltr . To manage Blast disease, spray Hexaconazole 5 % SC @ 400-ml/acre or Azoxystrobin 18.2% + Difenoconazole 1 1.4 % S.C @ 200-ml/acre or Tebuconazole 50%+ Trifloxystrobin 25 % WG @ 80-gram/acre. To manage sheath blight disease chemically spray Validamycin 3 % L  @ 400-ml/acre or Hexaconazole 5 % SC @ 400-ml/acre or Tebuconazole 50%+ Trifloxystrobin 25 % WG @ 80-gram/acre."
         ]
      },
      "pigeon pea": {
         "advisory": [
            "The crop is at vegetative growth (seven to eight week) stage. Go for hoeing, weeding and earthing up at this stage of crop. Keep drainage arrangement to avoid water stagnation due to rain. There is a chance of infestation of Jassids. To manage Jassids, spray Imidacloprid 17.8% SL  @ 140 ml/ha or Thiamethoxam 25 % WG @ 100 gm/ha or Clothianidin 50 % WDG @ 100gm/ha in 500 litre of water ."
         ]
      },
      "maize": {
         "advisory": [
            "To manage the fall army worm pest spray biopesticide Beauveria bassiana @ 1200-gram/acre by mixing in 200 litre of water . Use 10-12 bird perches per acre and remove them before tasselling stage. Apply Dust mixture of sand, soil, and wooden ash inside the leaf whorl so that the caterpillars cannot feed on the leaves. To manage the pest chemically , spray Emamectin Benzoate 5% S.G @ 80-gram/acre or Spinetoram 1 1.7% S.C @ 100-ml/acre or Chlorantraniliprole 18.5% S.C @ 80-ml/acre by mixing in 200-litre of water ."
         ]
      },
      "brinjal": {
         "advisory": [
            "Brinjal is at flowering to fruiting stage. After receding of rainfall and there is chance of increasing in day & night temperature and morning relative humidity more than 70% favours Shoot and fruit borer in Brinjal. To manage the pest, remove the affected terminal shoot showing bore holes and the affected fruits. To manage this insect, install 8 nos. of pheromone trap having Leucin Lure per acre. Use chemical control if there is 4% withering of terminal shoot or 14% fruits infested with borers. For chemical control spray Emamectin Benzoate 5% SG @ 80-gram/ acre or Chlorantraniliprole 18.5 % SC @80-ml/acre or Spinetoram 1 1.7 % SC @ 200-ml /acre. There should be a gap of 7-10 days between pesticide application and harvest. Use any of the above insecticides alternately at 15-days interval."
         ]
      },
      "cucumber": {
         "advisory": [
            "Rainy and humid weather , high morning RH (>85%) & water saturated soil favours Downy Mildew disease in cucurbit vegetables. To manage Downy Mildew disease in cucurbits spray Metalaxyl @ 2-gram/litre or Azoxystrobin @ 1-gram/litre or Copper oxychloride 50 % WP @ 3-gram/litre twice in 10 days intervals."
         ]
      },
      "papaya": {
         "advisory": [
            "To manage mealy bug at early stage of infestation spray neem-based pesticide (Neem Oil 1500 PPM @30- ml/10-litre of water or insecticidal soap. In case of severe infestation spray Profenphos 50 % EC @ 20-ml/10-litre of water or Thiamethoxam 25 % WG @ 3-gram/10-litre of water ."
         ]
      },
      "goat": {
         "advisory": [
            "By using sand over the floor we can keep the floor dry so that the animals are kept free from different diseases. The specialty of this shed is the floor is made of bricks and cement and sand from the river is spread over it by a thickness of 4-6 inches. The sand soaks the urine so that the animals can sleep over it comfortably . It is also easier to clean the faecal material over the sand floor . To keep the sand dry it is stirred upside down in 15-20 days interval. The floor space requirement for kid is 0.5, for an adult 1.2, for buck and pregnant female 2 square metre floor space is necessary which is suitable for every type of shed."
         ]
      },
      "cow": {
         "advisory": [
            "Monsoon rain might lead to dampness and lack of drainage, use sand and ash to get rid of the excess moisture. Clean the shelter floor twice with phenyl to avoid the flies and diseases associated with them."
         ]
      },
      "freshwater": {
         "advisory": [
            "After stocking of Fingerling, groundnut oil cake and rice bran at 1:1 ratio as feed given @ 5% of their body weight twice a day . Add vitamin and mineral mixture @1% of the total feed given to the fish. Regularly check the pH and water temperature after stocking the fingerling. Add 40 kg of lime per acre to purify the pond water . To increase the amount of plankton in the pond, apply 200 kg of cow dung and 4 kg of superphosphate per acre twice a month."
         ]
      }
   },
   "date": "27-09-2024"
}