{
   "weather_details": {
      "08-02-2025": {
         "rainfall": 0,
         "t_max": 31,
         "t_min": 17,
         "cloud_cover": 2,
         "rh_max": 58,
         "rh_min": 21,
         "wind_speed": 4,
         "wind_direction": 37
      },
      "09-02-2025": {
         "rainfall": 0,
         "t_max": 31,
         "t_min": 16,
         "cloud_cover": 2,
         "rh_max": 51,
         "rh_min": 17,
         "wind_speed": 3,
         "wind_direction": 34
      },
      "10-02-2025": {
         "rainfall": 0,
         "t_max": 31,
         "t_min": 16,
         "cloud_cover": 1,
         "rh_max": 50,
         "rh_min": 12,
         "wind_speed": 3,
         "wind_direction": 196
      },
      "11-02-2025": {
         "rainfall": 0,
         "t_max": 32,
         "t_min": 17,
         "cloud_cover": 1,
         "rh_max": 57,
         "rh_min": 15,
         "wind_speed": 7,
         "wind_direction": 205
      },
      "12-02-2025": {
         "rainfall": 0,
         "t_max": 32,
         "t_min": 18,
         "cloud_cover": 0,
         "rh_max": 55,
         "rh_min": 16,
         "wind_speed": 8,
         "wind_direction": 211
      }
   },
   "names_of_crops": [
      "rice",
      "mustard",
      "toria",
      "chilli",
      "tomato",
      "potato",
      "okra"
   ],
   "general_advisory": "Farmers are advised to do weeding and hoeing in the standing crops like Maize, Groundnut, Green gram, Chickpea, and vegetables to protect them from weeds. Apply balanced and appropriate fertilizers according to the crop’s growth stage. Install yellow sticky traps for monitoring pests. Take necessary actions to control viral infections in vegetables. Specific advisory for various crops mentioned in the document.",
   "crops_data": {
      "rice": {
         "advisory": [
            "Apply light irrigation to the nursery beds as and when required.",
            "Spray the nursery area with Tebuconazole 50% + Trifloxystrobin 25% WG to control blast infestation.",
            "Go for puddling of the main field. Apply basal fertilizers at the time of last round of puddling."
         ]
      },
      "mustard": {
         "advisory": [
            "Regularly keep a watch in the crop field for pests like grasshopper, aphids, and larvae.",
            "Take actions to control aphids, mustard saw fly, and other pests in severe infestations."
         ]
      },
      "toria": {
         "advisory": [
            "Regularly keep a watch in the crop field for pests.",
            "Take actions to control aphids, saw fly, and other pests in severe infestations."
         ]
      },
      "chilli": {
         "advisory": [
            "Manage little leaf in Chilli with appropriate sprays.",
            "Control aphids, jassids, and mites infestation."
         ]
      },
      "tomato": {
         "advisory": [
            "Control early and late blight in tomato field with specific sprays.",
            "Monitor and control white fly infestations in tomato plants."
         ]
      },
      "potato": {
         "advisory": [
            "Provide irrigation as per the crop's requirement.",
            "Earthing up is required in potato to prevent direct sun exposure.",
            "Take actions to control wilting in the field."
         ]
      },
      "okra": {
         "advisory": [
            "To control fruit borer in okra, spray neem-based pesticide.",
            "Use specific sprays for managing diseases and pests in okra plants."
         ]
      }
   },
   "date": "07-02-2025"
}