{
   "weather_details": {
      "29-06-2024": {
         "rainfall": 20,
         "t_max": 29,
         "t_min": 21,
         "cloud_cover": 8,
         "rh_max": 85,
         "rh_min": 62,
         "wind_speed": 19,
         "wind_direction": 248
      },
      "30-06-2024": {
         "rainfall": 12,
         "t_max": 29,
         "t_min": 22,
         "cloud_cover": 8,
         "rh_max": 86,
         "rh_min": 63,
         "wind_speed": 17,
         "wind_direction": 249
      },
      "01-07-2024": {
         "rainfall": 4,
         "t_max": 33,
         "t_min": 23,
         "cloud_cover": 6,
         "rh_max": 85,
         "rh_min": 61,
         "wind_speed": 18,
         "wind_direction": 243
      },
      "02-07-2024": {
         "rainfall": 2,
         "t_max": 33,
         "t_min": 24,
         "cloud_cover": 5,
         "rh_max": 84,
         "rh_min": 56,
         "wind_speed": 17,
         "wind_direction": 248
      },
      "03-07-2024": {
         "rainfall": 2,
         "t_max": 34,
         "t_min": 25,
         "cloud_cover": 4,
         "rh_max": 79,
         "rh_min": 55,
         "wind_speed": 20,
         "wind_direction": 246
      }
   },
   "names_of_crops": [
      "rice",
      "maize",
      "ragi",
      "tomato",
      "brinjal",
      "ginger",
      "turmeric"
   ],
   "general_advisory": "Rainfall is expected during next five days, spray only when sky becomes clear and use sticker to the spray solution. Farmers are advised to do proper arrangement for storing rainwater at one portion in the field. This water can be used for irrigation in the crops during dry spell. Go for field preparation for non-paddy crops like pulse, oilseeds and vegetables in upland condition and take up early sowing/transplanting. Due to high humidity, possibilities of pest and disease build up in already sown crop. Take plant protection measures depending on the crop and weather condition.",
   "crops_data": {
      "rice": {
         "advisory": [
            "Complete the sowing where direct seeding is practiced. Incorporate well decomposed FYM or cow-dung @ 800 kg/acre. Apply 26 kg DAP and 20 kg MoP per acre during last ploughing. Sow the short duration varieties @ 25-30 kg/acre behind the plough with maintaining 15-20 cm row to row distance. Before sowing seed should be treated with Trichoderma viride @ 10 g or Carbendazim 50% WP @ 1.5 g/kg seed.",
            "In direct sown rice field, spray Bispyribac sodium 10% SC @ 15 ml/tanks of 16 litre capacity at 8-10 days after sowing or when the weeds are at 2-3 leaf stage in moist soil as an alternative to manual weeding.",
            "Raise the nursery for transplanted kharif rice. 320 m2 nursery area is required for transplanting of one acre land. Apply 16 baskets of well decomposed FYM, 3.3 kg urea, 2.1 kg DAP and 1.6 kg MoP in 320 m2 nursery area during land preparation."
         ]
      },
      "maize": {
         "advisory": [
            "This is the optimum time for sowing of maize, prepare the land and incorporate FYM @ 2 t/acre at final land preparation and during sowing time apply 35 kg DAP, 4 kg urea and 27 kg MoP per acre. Sow the maize seeds with a spacing of 60 x 20-25 cm using 6 kg seeds/acre."
         ]
      },
      "ragi": {
         "advisory": [
            "This is the optimum time for direct sowing ragi. Sow the seeds @ 4 kg/acre in line at 22.5 cm apart. Apply 35 kg DAP and 17 kg MoP per acre at the time of sowing. Before sowing seeds should be treated with Carboxin 37.5%+Thiram 37.5% DS @ 2 g/kg seed."
         ]
      },
      "tomato": {
         "advisory": [
            "If bacterial wilting observes in tomato, apply Plantomycin @ 1.0 g and Copper Oxychloride @ 2 g/litre of water."
         ]
      },
      "brinjal": {
         "advisory": [
            "To control fruit and shoot borer in brinjal spray neem based pesticide 1500 ppm @ 3 ml/litre of water at initial stages. Later on go for alternate spray of Spinosad 45% SC @ 0.4 ml/litre of water and Thiodicarb 75% WP @ 1.25 g/litre of water at 15 days interval.",
            "Chances of fruit rot infestation in chilli and brinjal, if observe spray Carbendazim 50% WP @ 2 g/litre of water or Copper oxycloride 50% WP @ 3 g/litre of water."
         ]
      },
      "ginger": {
         "advisory": [
            "Grow ginger with seed rate of 6-8 q rhizome/acre with spacing of 30 cm x 25 cm. Farmers are advised to make raised bed with width of 1 m, height of 15 cm and of convenient length and channels of 40 cm for draining excess rainwater. Apply well decomposed FYM @ 8 t/acre and neem cake @ 0.8 t/acre during last ploughing and during sowing time apply phosphorus @ 40 kg/acre and potash @ 20 kg/acre."
         ]
      },
      "turmeric": {
         "advisory": [
            "Grow turmeric with seed rate of 8 q rhizome/acre with spacing of 30 cm x 25 cm. Farmers are advised to make raised bed with width of 1 m, height of 15 cm and of convenient length and channels of 40 cm for draining excess rainwater. Apply well decomposed FYM @ 9 t/acre and neem cake @ 0.8 t/acre during last ploughing and during sowing time apply phosphorus @ 12 kg/acre and potash @ 18 kg/acre."
         ]
      }
   },
   "date": "28-06-2024"
}