{
   "weather_details": {
      "03/04/2024": {
         "rainfall": 0,
         "t_max": 41,
         "t_min": 26,
         "rh_max": 46,
         "rh_min": 11,
         "wind_speed": 8,
         "wind_direction": 288,
         "cloud_cover": 0
      },
      "04/04/2024": {
         "rainfall": 0,
         "t_max": 41,
         "t_min": 26,
         "rh_max": 63,
         "rh_min": 10,
         "wind_speed": 7,
         "wind_direction": 198,
         "cloud_cover": 1
      },
      "05/04/2024": {
         "rainfall": 0,
         "t_max": 42,
         "t_min": 27,
         "rh_max": 53,
         "rh_min": 16,
         "wind_speed": 9,
         "wind_direction": 207,
         "cloud_cover": 1
      },
      "06/04/2024": {
         "rainfall": 0,
         "t_max": 42,
         "t_min": 27,
         "rh_max": 51,
         "rh_min": 12,
         "wind_speed": 9,
         "wind_direction": 165,
         "cloud_cover": 1
      },
      "07/04/2024": {
         "rainfall": 0,
         "t_max": 42,
         "t_min": 27,
         "rh_max": 35,
         "rh_min": 8,
         "wind_speed": 10,
         "wind_direction": 202,
         "cloud_cover": 2
      }
   },
   "names_of_crops": [
      "paddy",
      "sugarcane",
      "maize",
      "tomato",
      "brinjal",
      "coconut",
      "vegetable seedlings",
      "fingerlings",
      "black gram",
      "green gram",
      "okra",
      "onion",
      "mango"
   ],
   "general_advisory": "In paddy crop, Panicle initiation, Panicle emergence, flowering and milking stages are critical stages. Cover the rows with dry leaves in Sugarcane. Apply sprinkler irrigation to bring down the heat effect. High temperature increases the water requirement of maize crop. Spread polythene in irrigation channels to save water wastage. Apply Streptocyclin in tomato and brinjal. Mulch coconut leaves around a coconut tree. Cover newly planted vegetable seedlings with paper caps. Harvest fingerlings in shallow ponds if water temperature rises. Yellow stem borer and blast disease management in paddy. Tobacco caterpillar management in black gram and green gram. Early shoot borer management in sugarcane. Brinjal shoot and fruit borer management. Whitefly infestation prevention in okra. Onion harvesting and storage. Mango hopper control.",
   "crops_data": {
      "paddy": {
         "advisory": [
            "Panicle initiation, Panicle emergence, flowering and milking stages are critical. Avoid water deficit during these stages."
         ]
      },
      "sugarcane": {
         "advisory": [
            "Cover the rows with dry leaves. Top-dress with potassium. Apply sprinkler irrigation. Irrigate frequently during hot months. Timely cutting of attacked shoots."
         ]
      },
      "maize": {
         "advisory": [
            "High temperature increases water requirement. Irrigate the crop. Do not allow water to stagnate."
         ]
      },
      "tomato": {
         "advisory": [
            "Apply Streptocyclin in root zone to prevent wilting."
         ]
      },
      "brinjal": {
         "advisory": [
            "Install pheromone traps. Spray neem-based pesticide in early stages. Chemical control if necessary."
         ]
      },
      "coconut": {
         "advisory": [
            "Mulch coconut leaves to reduce water loss."
         ]
      },
      "vegetable seedlings": {
         "advisory": [
            "Cover newly planted seedlings with paper caps during the day."
         ]
      },
      "fingerlings": {
         "advisory": [
            "Harvest fingerlings in shallow ponds."
         ]
      },
      "black gram": {
         "advisory": [
            "Check caterpillar migration. Dust with Chlorpyriphos. Spray insecticides if necessary."
         ]
      },
      "green gram": {
         "advisory": [
            "Check caterpillar migration. Dust with Chlorpyriphos. Spray insecticides if necessary."
         ]
      },
      "okra": {
         "advisory": [
            "Treat seeds with Imidacloprid. Install yellow sticky traps."
         ]
      },
      "onion": {
         "advisory": [
            "Cut tops after harvesting. Dry bulbs in well-ventilated room for storage."
         ]
      },
      "mango": {
         "advisory": [
            "Control mango hoppers by spraying specified insecticides."
         ]
      }
   },
   "date": "02-04-2024"
}