{
   "weather_details": {
      "03/04/2024": {
         "rainfall": 0,
         "t_max": 41,
         "t_min": 26,
         "rh_max": 46,
         "rh_min": 11,
         "wind_speed": 8,
         "wind_direction": 288,
         "cloud_cover": 0
      },
      "04/04/2024": {
         "rainfall": 0,
         "t_max": 41,
         "t_min": 26,
         "rh_max": 63,
         "rh_min": 10,
         "wind_speed": 7,
         "wind_direction": 198,
         "cloud_cover": 1
      },
      "05/04/2024": {
         "rainfall": 0,
         "t_max": 42,
         "t_min": 27,
         "rh_max": 53,
         "rh_min": 16,
         "wind_speed": 9,
         "wind_direction": 207,
         "cloud_cover": 1
      },
      "06/04/2024": {
         "rainfall": 0,
         "t_max": 42,
         "t_min": 27,
         "rh_max": 51,
         "rh_min": 12,
         "wind_speed": 9,
         "wind_direction": 165,
         "cloud_cover": 1
      },
      "07/04/2024": {
         "rainfall": 0,
         "t_max": 42,
         "t_min": 27,
         "rh_max": 35,
         "rh_min": 8,
         "wind_speed": 10,
         "wind_direction": 202,
         "cloud_cover": 2
      }
   },
   "names_of_crops": [
      "paddy",
      "sugarcane",
      "maize",
      "tomato",
      "brinjal",
      "coconut",
      "vegetable",
      "fingerlings"
   ],
   "general_advisory": "In paddy crop, Panicle initiation, Panicle emergence, flowering and milking stages are the critical stages. In these stages water scarcity or deficit of water causes comparatively greater reduction in yields. Hence, water deficit during these stages should be avoided. Cover the rows with dry leaves in Sugarcane. Top-dress with 4% potassium to protect the crop from water scarcity during summer. Apply sprinkler irrigation to bring down the heat effect. Conserve up to 50% water by irrigating alternate rows. The high temperature increases the water requirement of the maize crop. Irrigate the crop. Never allow water to remain stagnant for more than six hours in the field. Spread polythene in irrigation channels to save water wastage during irrigation in sandy and loamy soil. High temperature in daylight hours may lead to wilting in tomato and brinjal. Apply 1g Streptocyclin in 10 liters of water in the root zone. Mulch coconut leaves 1.8 m around a coconut tree to reduce water loss. Cover with paper caps on the newly planted vegetable seedlings during the daytime. In shallow ponds, harvest fingerlings if water temperature rises to 30°C. Ensure enough water depth before introducing fingerlings into a pond.",
   "crops_data": {
      "paddy": {
         "advisory": [
            "Panicle initiation, Panicle emergence, flowering and milking stages are the critical stages. In these stages water scarcity or deficit of water causes comparatively greater reduction in yields. Hence, water deficit during these stages should be avoided."
         ]
      },
      "sugarcane": {
         "advisory": [
            "Cover the rows with dry leaves in Sugarcane. Top-dress with 4% potassium to protect the crop from water scarcity during summer."
         ]
      },
      "maize": {
         "advisory": [
            "The high temperature increases the water requirement of the maize crop. Irrigate the crop. Never allow water to remain stagnant for more than six hours in the field."
         ]
      },
      "tomato": {
         "advisory": [
            "High temperature in daylight hours may lead to wilting in tomato. Apply 1g Streptocyclin in 10 liters of water in the root zone."
         ]
      },
      "brinjal": {
         "advisory": [
            "High temperature in daylight hours may lead to wilting in brinjal. Apply 1g Streptocyclin in 10 liters of water in the root zone."
         ]
      },
      "coconut": {
         "advisory": [
            "Mulch coconut leaves 1.8 m around a coconut tree to reduce water loss."
         ]
      },
      "vegetable": {
         "advisory": [
            "Cover with paper caps on the newly planted vegetable seedlings during the daytime."
         ]
      },
      "fingerlings": {
         "advisory": [
            "In shallow ponds, harvest fingerlings if water temperature rises to 30°C. Ensure enough water depth before introducing fingerlings into a pond."
         ]
      }
   },
   "date": "02-04-2024"
}