{
   "weather_details": {
      "28-12-2024": {
         "rainfall": 0,
         "t_max": 28,
         "t_min": 14,
         "rh_max": 87,
         "rh_min": 43,
         "wind_speed": 2,
         "wind_direction": 59,
         "cloud_cover": 1
      },
      "29-12-2024": {
         "rainfall": 5,
         "t_max": 27,
         "t_min": 15,
         "rh_max": 87,
         "rh_min": 48,
         "wind_speed": 2,
         "wind_direction": 191,
         "cloud_cover": 6
      },
      "30-12-2024": {
         "rainfall": 2,
         "t_max": 28,
         "t_min": 14,
         "rh_max": 85,
         "rh_min": 54,
         "wind_speed": 2,
         "wind_direction": 351,
         "cloud_cover": 5
      },
      "31-12-2024": {
         "rainfall": 0,
         "t_max": 28,
         "t_min": 14,
         "rh_max": 82,
         "rh_min": 42,
         "wind_speed": 4,
         "wind_direction": 343,
         "cloud_cover": 2
      },
      "01-01-2025": {
         "rainfall": 0,
         "t_max": 29,
         "t_min": 14,
         "rh_max": 70,
         "rh_min": 33,
         "wind_speed": 3,
         "wind_direction": 334,
         "cloud_cover": 1
      }
   },
   "names_of_crops": [
      "transplanted paddy",
      "cotton",
      "arhar",
      "greengram/blackgram",
      "groundnut",
      "sunflower",
      "onion",
      "cauliflower & cabbage",
      "tomato",
      "brinjal",
      "cattle & buffalo",
      "goat",
      "poultry"
   ],
   "general_advisory": "In view of weather forecast during next five days, farmers are advised to withhold harvesting of paddy for another two to three days. Farmers are also advised to postpone spraying of plant protection chemicals and sowing of rabi crops for the time being. Keep your domestic animal indoors. In case of severe cold affected areas use polythene cover during night in paddy nursery.",
   "crops_data": {
      "transplanted paddy": {
         "advisory": [
            "This is the right time for nursery preparation for rabi season. 10 decimal of nursery area is required to cultivate one acre of paddy. Arrange suitable high yielding varieties like MTU 1010, MTU 1001, DRR 44, Sahabhagi Dhan, Lalat, Improved lalat, Mandakini, Bina 11 etc. Treat the seeds with 2g Carbendazim or 3g Carboxin or Thiram per 1kg of seed before sowing in the nursery.",
            "To protect the rice nursery from cold injury, apply a thin layer of well decomposed FYM after sowing of seeds in wet bed to keep the bed relatively warm. Preferably use bore well water for irrigation at evening and drain out the cold water at morning to maintain the soil temperature favourable for growth. In severe cold affected areas use polythene cover at night time.",
            "Apply 13 -15 kg DAP and 10 -12 kg MOP along with 200 kg of FYM and 200 g Zn per 10 decimal as basal dose for healthy production of seedlings."
         ]
      },
      "cotton": {
         "advisory": [
            "Picking should be done when there is complete bursting of bolls.",
            "Dry the seed cotton on concrete floor or tarpaulin sheets to reduce the moisture to 8-10%.",
            "Farmers are advised to sell their seed cotton in the nearby Mandi to get MSP (Rs.7521/qt) for long staple cotton."
         ]
      },
      "arhar": {
         "advisory": [
            "Prevailing weather condition favours the following pest attack. So, recommended control measures should be followed as required.",
            "Pod borer: To control, apply Benfuracarb 40% EC @ 1lit/ac or Deltamethrin 2.8% EC @ 200 ml/ac or Spinosad 45% SC @ 60 ml/ac or Flubendiamide 39.35% SC @ 40ml/ac mixed with 200 liters of water. For further information, contact the IMD, Bhubaneswar, Tel.#0674 -2596116",
            "Pod sucking bug and Aphid: To control, spray Thiamethoxam 25% WG @ 40g/ac or Imidacloprid 17.8% SL @ 60 ml/acre mixed with 200 liters of water."
         ]
      },
      "greengram/blackgram": {
         "advisory": [
            "Weed Management: Apply Pendimithalin 30% EC @ 1.20 liter/acre mixed with 200 liters of water at 1 -2 DAS.",
            "Apply Quizal fop-ethyl 5% EC or Imazethapyr 10 SL @ 300 ml/acre mixed with 200 liters of water at 20 -25 DAS.",
            "Leaf eating caterpillar : The insects usually feed on the tender young leaves. Spray Profenophos 50 EC 400ml per acre mixed with 200 liters of water for its control.",
            "Aphid and Whitefly: Prevailing weather condition is favorable for incidence of sucking pest like aphid and white fly. Install yellow sticky traps @ 8nos/acre at vegetative stage to monitor pest population and apply neem oil-based pesticide Azadiractin 0.03% (300 ppm) @ 5ml/ltr of water at initial stage of infestation."
         ]
      },
      "groundnut": {
         "advisory": [
            "Weed Management: Apply Imazethapyr 10% SL @ 3ml/ltr of water at 15 DAS as early post emergence herbicide or apply Fenoxaprop-P-ethyl 9.3% @ 35 ml/drum (15 -liter capacity) at 15 -20 DAS.",
            "Prevailing weather condition favours the development of sucking pest like aphid, jassids and whitefly. Install yellow sticky trap @ 8nos/acre to monitor the pest population. Apply Neem oil-based pesticide Azadiractin 0.03% (300 ppm) @ 5ml/ltr of water at initial stage of infestation."
         ]
      },
      "sunflower": {
         "advisory": [
            "Sucking pest complex (Aphid, Hopper, Thrips & White fly): Prevailing weather condition favours the development of sucking pests. Need based spray of Acetamiprid 20% SP @ 50g/acre or Imidacloprid 17.8% SL @ 60 ml/acre mixed with 200 ltrs of water is recommended."
         ]
      },
      "onion": {
         "advisory": [
            "Prepare the main field for transplanting onion seedlings at eight-week stage.",
            "Nutrient Management: For one acre area, apply 43kg DAP, 27kg urea, 33kg MOP and 20kg Sulphur prior to the transplanting of onion seedlings in the main field."
         ]
      },
      "cauliflower & cabbage": {
         "advisory": [
            "Nutrient Management: At three-week stage, undertake hoeing, weeding and apply Urea @ 55kg/ac followed by irrigation.",
            "Go for hoeing, weeding and apply 27 kg urea + 25kg MOP at six-to-seven-week stage followed by irrigation.",
            "Pest Management: Dimond back moth: Spray Fipronil 5% SC @ 2ml/ltr or Chlorpyriphos 20% EC @ 4ml/ltr of water as control measure.",
            "Tobacco leaf eating caterpillar: Spray Cyantraniliprole 10.26% OD @ 6ml/5 ltr of water to control pest population.",
            "Cabbage Aphid: Spray Thiamethoxam 25% WG @ 2g/5ltr of water as control measure."
         ]
      },
      "tomato": {
         "advisory": [
            "Pest Management: Wilting: In view of high humid condition wilting may occur at this stage. Spray Mancozeb 75% WP @ 2g/ltr of water if symptom is noticed.",
            "Fruit & Shoot borer: Install pheromone trap @ 8nos/acre to monitor pest population."
         ]
      },
      "brinjal": {
         "advisory": [
            "Pest Management: Fruit and Shoot borer: Install pheromone trap/Wata trap @ 8 nos. per acre area at vegetative stage and replace lure after 3 weeks."
         ]
      },
      "cattle & buffalo": {
         "advisory": [
            "Farmers are requested to vaccinate their cattle & buffalo against FMD through NADCP. Farmers can increase milk production by controlling and preventing Foot and Mouth Disease (FMD).",
            "Calves of 4 - 8 months of age should be vaccinated against Brucellosis."
         ]
      },
      "goat": {
         "advisory": [
            "Protect Goat from chill wind and damp floors."
         ]
      },
      "poultry": {
         "advisory": [
            "Make necessary arrangements to provide heat especially to chicks during night hours to reduce the mortality rate. Make proper brooding arrangement for chicks.",
            "Keep the poultry house clean and clamp free."
         ]
      }
   },
   "date": "27-12-2024"
}