{
   "weather_details": {
      "21-09-2024": {
         "rainfall": 6,
         "t_max": 35,
         "t_min": 24,
         "rh_max": 90,
         "rh_min": 61,
         "wind_speed": 4,
         "wind_direction": 248,
         "cloud_cover": 6
      },
      "22-09-2024": {
         "rainfall": 5,
         "t_max": 35,
         "t_min": 24,
         "rh_max": 88,
         "rh_min": 62,
         "wind_speed": 5,
         "wind_direction": 72,
         "cloud_cover": 6
      },
      "23-09-2024": {
         "rainfall": 6,
         "t_max": 34,
         "t_min": 25,
         "rh_max": 86,
         "rh_min": 58,
         "wind_speed": 5,
         "wind_direction": 198,
         "cloud_cover": 7
      },
      "24-09-2024": {
         "rainfall": 10,
         "t_max": 33,
         "t_min": 25,
         "rh_max": 90,
         "rh_min": 60,
         "wind_speed": 4,
         "wind_direction": 90,
         "cloud_cover": 7
      },
      "25-09-2024": {
         "rainfall": 12,
         "t_max": 33,
         "t_min": 24,
         "rh_max": 93,
         "rh_min": 68,
         "wind_speed": 6,
         "wind_direction": 150,
         "cloud_cover": 8
      }
   },
   "names_of_crops": [
      "direct seeded paddy",
      "transplanted paddy",
      "cotton",
      "arhar",
      "hybrid maize",
      "vegetables"
   ],
   "general_advisory": "Prevailing weather condition is favorable for infestation of sucking pests like aphid, jassids, whitefly, mealy bug and thrips. Apply neem-based pesticide Azadiractin (1500 ppm) @ 3ml/liter of water at initial stage to manage sucking pest infestation. Install yellow sticky trap @ 8nos./acre to monitor sucking pests like aphid, jassids, whitefly, mealy bug and blue sticky traps @ 8nos./acre to monitor thrips. For monitoring of sucking pests, fruit fly and borer insect in vegetables farmers are advised to use pheromone trap @ 8nos. /acre. Keep your crop field free from weed to minimize the incidence of diseases and pests. SMS Advisory Drench the soil at root zone with Carbendazim 50 WP@ 2 g/litre of water to control symptomatic wilt and root rot diseases in cotton.",
   "crops_data": {
      "direct seeded paddy": {
         "advisory": [
            "Pest Management: Blast infestation alert. Spray Tebuconazole 50% + Trifloxystrobin 25% WG (Nativo) @ 80 g/acre or Isoprothiolane 40 EC (Sultan/Fujita/Fujione) @ 300 ml/acre by mixing with 200 liters of litre of water. Repeat the spray at 7 -10 days interval."
         ]
      },
      "transplanted paddy": {
         "advisory": [
            "Nutrient Management: Apply 16kg Urea + 10kg MOP per acre in upland condition and 20 kg urea + 13kg MOP per acre in medium and low land condition at panicle initiation stage as second top dressing.",
            "Pest Management: Install Pheromone traps @ 8nos./acre and light trap @1no./acre to monitor and control the population of stem borer, leaf folder and rice ear eating caterpillar and replace the lure after three weeks."
         ]
      },
      "cotton": {
         "advisory": [
            "Nutrient Management: Spraying with 100 g Magnesium sulphate mixed with 100 g urea in 10 liter of water in waterlogged areas.",
            "Pest Management: Sucking Pests (Aphid, Jassids, Thrips, Whitefly) alert. Application of Neem-based pesticide like Neem oil@ 600 -800 ml + 200 g detergent powder per acre by mixing with 200 liters of water is advisable."
         ]
      },
      "arhar": {
         "advisory": [
            "Pest Management: Leaf webber alert. Spray Profenophos 50% EC or Chlorpyriphos 50 % + Cypermethrin 5 % EC @ 2 ml/lit @ 2ml/lit of water.",
            "Sucking Pests (Aphid, Jassids, Thrips, Whitefly) alert. Neem-based pesticide (1500 ppm) may be sprayed @ 3ml/ lit of water at initial stage of infestation."
         ]
      },
      "hybrid maize": {
         "advisory": [
            "Nutrient Management: Apply Urea @ 25kg/ac if crop is at tasseling stage and irrigate if water is not sufficient.",
            "Pest Management: Stem borer, FAW and banded leaf and sheath blight alert. Monitor the field regularly and remove infected plant parts."
         ]
      },
      "vegetables": {
         "advisory": [
            "Brinjal: To control wilt, spray Tebuconazole 25 .9% EC @ 200 -ml/acre + Streptocycline @ 30g/acre at the root zone mixed with 200 liters of water.",
            "Tomato: Select suitable varieties like Utkal Kumari (BT -10), Utkal Deepti (BT -2), Utkal Raja, Utkal Pragyan and Swarna Sampad for raising in nursery. 150 to 200 gram of seed is required for planting in one acre area."
         ]
      }
   },
   "date": "20-09-2024"
}