{
   "weather_details": {
      "30-10-2024": {
         "rainfall": 7,
         "t_max": 30,
         "t_min": 23,
         "rh_max": 95,
         "rh_min": 62,
         "wind_speed": 0,
         "wind_direction": 0,
         "cloud_cover": 0
      },
      "31-10-2024": {
         "rainfall": 2,
         "t_max": 30,
         "t_min": 22,
         "rh_max": 92,
         "rh_min": 61,
         "wind_speed": 1,
         "wind_direction": 225,
         "cloud_cover": 5
      },
      "01-11-2024": {
         "rainfall": 1,
         "t_max": 30,
         "t_min": 22,
         "rh_max": 91,
         "rh_min": 54,
         "wind_speed": 1,
         "wind_direction": 214,
         "cloud_cover": 5
      },
      "02-11-2024": {
         "rainfall": 0,
         "t_max": 31,
         "t_min": 23,
         "rh_max": 88,
         "rh_min": 44,
         "wind_speed": 2,
         "wind_direction": 284,
         "cloud_cover": 4
      },
      "03-11-2024": {
         "rainfall": 0,
         "t_max": 31,
         "t_min": 23,
         "rh_max": 79,
         "rh_min": 38,
         "wind_speed": 1,
         "wind_direction": 315,
         "cloud_cover": 4
      }
   },
   "names_of_crops": [
      "paddy",
      "mustard",
      "toria",
      "arhar",
      "hybrid maize",
      "brinjal",
      "chilli",
      "cotton"
   ],
   "general_advisory": "Based on the above five days weather forecast received from IMD, farmers are advised to withhold irrigation and spraying of chemicals for the next 2 to 3 days. Protect the vegetable nursery of Chilli, tomato, onion, cole crops and brinjal etc. from rain by covering with plastic or polythene sheet. Harvest the matured vegetables & pulses and store in a safe place. Field preparation should be started for rabi crops. Pulses like lentil/black gram/green gram can be broadcasted in the standing matured crop (Rice) one week before harvesting to utilize the residual moisture in the soil in suitable areas. Farmers are advised to transplant mature seedlings (35 -40 days old) of cauliflower, cabbage, broccoli, tomato etc. in raised bed during clear weather.",
   "crops_data": {
      "paddy": {
         "advisory": [
            "Harvest the crop when 80-85% of the grains are matured either manually or using a combine harvester or reaper. Sun-dry grains to 14% moisture content for consumption and 12% for seed purposes. Provide supplemental irrigation if feasible."
         ]
      },
      "mustard": {
         "advisory": [
            "Treat seed with Thiram or Bavistin before sowing. Use suitable varieties like Pusa bold, Pusa Jaikisan, JD-6."
         ]
      },
      "toria": {
         "advisory": [
            "Sowing time is from Mid-October to Mid-November. Treat seed with Thiram or Bavistin before sowing. Use suitable varieties like M29, Anuradha, Parbati."
         ]
      },
      "arhar": {
         "advisory": [
            "Control leaf webber/leaf folder/defoliators with chemical sprays. Control pod borer with neem-based pesticides."
         ]
      },
      "hybrid maize": {
         "advisory": [
            "Control American Cob Borer by applying Flubendiamide. Monitoring borer insect in Brinjal and control with chemical sprays."
         ]
      },
      "brinjal": {
         "advisory": [
            "Use pheromone trap for monitoring borer insect. Control with chemical sprays like Spinosad, Emamectin benzoate, or Thiodicarb."
         ]
      },
      "chilli": {
         "advisory": [
            "Install Blue sticky traps for managing thrips infestation. Use chemical sprays like Emamectin Benzoate, Fipronil, or Imidacloprid to control thrips."
         ]
      },
      "cotton": {
         "advisory": [
            "Control American bollworm, bacterial leaf blight, and grey mildew with specific chemical sprays."
         ]
      }
   },
   "date": "29-10-2024"
}