{
   "weather_details": {
      "28/09/2024": {
         "rainfall": 5,
         "t_max": 30,
         "t_min": 26,
         "rh_max": 84,
         "rh_min": 76,
         "wind_speed": 25,
         "wind_direction": 202,
         "cloud_cover": 8
      },
      "29/09/2024": {
         "rainfall": 5,
         "t_max": 30,
         "t_min": 26,
         "rh_max": 84,
         "rh_min": 73,
         "wind_speed": 23,
         "wind_direction": 212,
         "cloud_cover": 8
      },
      "30/09/2024": {
         "rainfall": 2,
         "t_max": 32,
         "t_min": 27,
         "rh_max": 85,
         "rh_min": 72,
         "wind_speed": 20,
         "wind_direction": 238,
         "cloud_cover": 4
      },
      "01/10/2024": {
         "rainfall": 2,
         "t_max": 32,
         "t_min": 27,
         "rh_max": 85,
         "rh_min": 71,
         "wind_speed": 17,
         "wind_direction": 243,
         "cloud_cover": 4
      },
      "02/10/2024": {
         "rainfall": 2,
         "t_max": 34,
         "t_min": 28,
         "rh_max": 82,
         "rh_min": 69,
         "wind_speed": 20,
         "wind_direction": 225,
         "cloud_cover": 4
      }
   },
   "names_of_crops": [
      "paddy",
      "maize",
      "pulses",
      "oilseeds",
      "vegetables",
      "sugarcane"
   ],
   "general_advisory": "The district of Puri may likely to receive very light to light rainfall for the next five days. Do proper field surveillance for pests and diseases regularly and take appropriate plant protection measures accordingly. Prevailing weather condition is favorable for infestation of sucking pests like aphid, jassids, whitefly, mealy bug and thrips. Apply neem-based pesticide Azadiractin (1500 ppm) @ 3ml/liter of water at initial stage to manage sucking pest infestation. Keep your crop field free from weed to minimize the incidence of diseases and pests. In uplands prepare seedlings for tomato and early variety cauliflower. For control Epilachna Beetle in cucurbits spray neem-based pesticide (Neem Oil 1500 PPM) @ 3-ml/litre of water at early stage of infestation.",
   "crops_data": {
      "paddy": {
         "advisory": [
            "Rice stem borer: To manage yellow stem borer in paddy spray Fipronil 5% SC @ 400-ml/acre or Flubendiamide 20% SG @ 50-gram/acre or Chlorantraniliprole 18.5% SC @ 60-ml / acre or Chromafenozide 80%WP @ 50-gram /acre.",
            "BPH and WBPH Management: The high humid weather condition is favourable for Brown Plant Hopper (BPH) and White Backed Plant Hopper (WBPH) infestation in paddy. To manage BPH and WBPH in paddy avoid excess use of nitrogenous fertilizer. Do not keep standing water in the field for a longer period. Alter the micro-climate of the rice field by alternate wetting and drying technique. Make alleys at 6 feet spacing for sunlight entry and proper aeration below the crop zone."
         ]
      },
      "maize": {
         "advisory": [
            "Maize crop harvesting is in progress."
         ]
      },
      "pulses": {
         "advisory": [
            "Sowing of non-paddy crops like pulses is under progress."
         ]
      },
      "oilseeds": {
         "advisory": [
            "Sowing of non-paddy crops like oilseeds is under progress."
         ]
      },
      "vegetables": {
         "advisory": [
            "Sowing of non-paddy crops like vegetables is under progress.",
            "For nursery management of cauliflower, cabbage, and broccoli, the seed rate and preparation details."
         ]
      },
      "sugarcane": {
         "advisory": [
            "Sugarcane is at grand growth stage. Overall crop condition is Normal."
         ]
      }
   },
   "date": "27-09-2024"
}