{
   "weather_details": {
      "2024-11-27": {
         "rainfall": 0,
         "t_max": 30,
         "t_min": 14,
         "rh_max": 77,
         "rh_min": 30,
         "wind_speed": 3,
         "wind_direction": 90,
         "cloud_cover": 2
      },
      "2024-11-28": {
         "rainfall": 0.1,
         "t_max": 29,
         "t_min": 15,
         "rh_max": 71,
         "rh_min": 32,
         "wind_speed": 4,
         "wind_direction": 5,
         "cloud_cover": 3
      },
      "2024-11-29": {
         "rainfall": 0.1,
         "t_max": 29,
         "t_min": 15,
         "rh_max": 74,
         "rh_min": 39,
         "wind_speed": 5,
         "wind_direction": 8,
         "cloud_cover": 2
      },
      "2024-11-30": {
         "rainfall": 3,
         "t_max": 29,
         "t_min": 14,
         "rh_max": 82,
         "rh_min": 50,
         "wind_speed": 4,
         "wind_direction": 90,
         "cloud_cover": 6
      },
      "2024-12-01": {
         "rainfall": 1,
         "t_max": 29,
         "t_min": 14,
         "rh_max": 85,
         "rh_min": 50,
         "wind_speed": 5,
         "wind_direction": 90,
         "cloud_cover": 4
      }
   },
   "names_of_crops": [
      "rice",
      "cauliflower",
      "chicken"
   ],
   "general_advisory": "During cool winter days to protect the rice nursery from cold injury, apply a thin layer of well decomposed FYM after sowing of seeds in wet bed to keep the bed relatively warm. Preferably use bore well water for irrigation at evening and drain out the cold water in the morning to maintain the soil temperature favorable for growth. In severe cold affected areas, use polythene cover during the night.",
   "crops_data": {
      "rice": {
         "advisory": [
            "Harvest the matured paddy when more than 80% of grain attained maturity"
         ]
      },
      "cauliflower": {
         "advisory": [
            "Bacterial leaf blight has been noticed in cauliflower. Spray Copper oxychloride 50 WP @ 600 gm + plantomycin @ 200 gm in 200 liters of water per acre of land."
         ]
      },
      "chicken": {
         "advisory": [
            "In winter, the number of feeders should be increased. Feed should be available to the bird whole of the day. During the winter season, birds take less water, so for maintenance of water in the body, it is necessary to give continuous supply of fresh water which can be taken by the bird. For maintaining the heat in the poultry shed, install heaters in the shed. Use 200W bulbs to generate heat in small scale operations. Carry out necessary vaccinations as and when required."
         ]
      }
   },
   "date": "26-11-2024",
   "ERROR": "Not getting consistent data."
}