{
   "weather_details": {
      "05-10-2024": {
         "rainfall": 0,
         "t_max": 36,
         "t_min": 26,
         "rh_max": 44,
         "rh_min": 74,
         "wind_speed": 6,
         "wind_direction": 259,
         "cloud_cover": 2
      },
      "06-10-2024": {
         "rainfall": 0,
         "t_max": 36,
         "t_min": 25,
         "rh_max": 45,
         "rh_min": 79,
         "wind_speed": 5,
         "wind_direction": 270,
         "cloud_cover": 3
      },
      "07-10-2024": {
         "rainfall": 2,
         "t_max": 35,
         "t_min": 25,
         "rh_max": 48,
         "rh_min": 77,
         "wind_speed": 5,
         "wind_direction": 160,
         "cloud_cover": 6
      },
      "08-10-2024": {
         "rainfall": 0,
         "t_max": 35,
         "t_min": 25,
         "rh_max": 51,
         "rh_min": 92,
         "wind_speed": 6,
         "wind_direction": 156,
         "cloud_cover": 4
      },
      "09-10-2024": {
         "rainfall": 0,
         "t_max": 34,
         "t_min": 24,
         "rh_max": 49,
         "rh_min": 96,
         "wind_speed": 7,
         "wind_direction": 155,
         "cloud_cover": 4
      }
   },
   "names_of_crops": [
      "rice",
      "ground nut",
      "okra",
      "mango",
      "cow/buffalo"
   ],
   "general_advisory": "As there are very less chance of occurrence of rainfall is expected in upcoming days, farmers are advised to conduct agricultural operation (irrigation, spraying, intercultural operation etc.) with proper care. Sowing of green fodder should be advised in moist soil to avail proper diet to animals. Regular monitoring against the incidence of some insects i.e. YSB, Leaf folder, Case worm, Gall Midge, Leaf eating caterpillar etc. and diseases like BLB, Blast etc. in Rice crop should be advised. Prevailing weather condition is favourable for various sucking pest (aphids, jassids, mealy bug, thrips etc.) in different crops so its regular monitoring should be advised. Deworming and vaccination against Foot and Mouth Disease and Brucellosis should be advised in animals.",
   "crops_data": {
      "rice": {
         "advisory": [
            "Farmers should maintain 5 cm water level in rice field for proper growth.",
            "In case of appearance of bacterial leaf blight disease, farmers should stop top dressing of nitrogenous fertilizers (Urea/DAP). If there is facility of draining, drain out stagnant water and apply 5 kg potassic fertilizer (MOP) per acre. Apply Streptomycin sulphate (9 %) + Tetracycline hydrochloride (1 %) @ 120 g/acre and Copper oxychloride @ 200 g/acre in 200 litre of water. Spraying should be done in the early morning or afternoon hour under clear weather condition.",
            "To control gall midge attack in rice field (onion leaf or silver shoot like symptoms) farmers should spray Lambda-cyhalothrin 05 % EC @ 100 ml, thiamethoxam 25% WG @ 40g or Fipronil 5% SC @ 400 ml or Gramin Krishi Mausam Sewa India Meteorological Department. To control leaf folder, spraying of Chlorantraniliprole 18.5% SC @ 60 ml or Tetraniliprole 200 SC @ 100 - 120 ml or Flubendiamide 20 WG 50 g in 200 litres of water per acre should be advised under clear weather."
         ]
      },
      "ground nut": {
         "advisory": [
            "To control Tikka disease in Ground nut, spraying of Chlorothalonil @ 400g or Hexaconazole 5 % EC @ 400 ml per 200 liters of water per acre should be advised under clear weather condition."
         ]
      },
      "okra": {
         "advisory": [
            "If yellow vein mosaic symptoms (which is a viral disease and whitefly is the carrier of this disease) are shown in the okra crop, then to control it, first remove the severely affected plants and bury them under the soil at a distance. Use 8 yellow cards per acre to control whiteflies and field should be weed free. For its chemical control, spraying of Difenthiuron 50% WP @ 20 g or Acetamiprid 20% SP @ 2.5 g or Imidacloprid 17.8% SL @ 3 ml per 10 liters of water should be advised in the afternoon and repeat the same after a week of first spray when the weather is dry. To control Fruit and shoot borer in Okra etc. spraying of Neem based pesticide 1500 ppm @600ml per acre should be advised at initial stages. In severe cases, the alternate spray of Spinosad 45% SC @ 70ml and Emamectin benzoate @ 80 g per acre at 15 days interval should be advised. Farmers shouldn’t spray any chemical insecticides at flowering period."
         ]
      },
      "mango": {
         "advisory": [
            "In the old Mango orchard, training, pruning and cleaning of weed, diseased and infected branches and leaves should be advised. If leaf webber infestation occurs, then spraying of quinalfos 20 EC @ 2.5 ml per liter should be advised. In newly planted mango orchard, if leaf cutting weevil attack is observed then farmers should spray Lambda cyhalothrin 5% EC @ 0.5 -1 ml per liter or Chloropyriphos 20 EC @ 2ml per liter or Spinosad 45% SC @ 0.4 ml per liter or quinalfos 20 EC @ 2 ml per liter to control this insect."
         ]
      },
      "cow/buffalo": {
         "advisory": [
            "FMD is a highly contagious viral disease which is characterized by fever and blister-like sores on the tongue and lips, in the mouth, on the teats and between the hooves. The disease is rarely fatal in adult animals, but there is often high mortality in young animals. So there are some preventive and control measures are given below: - The primary vaccination should be given to cattle and buffalo calves when they are 4 – 5 months old and repeat the same in every six months. Deworming should be advised. Mouth and feet of the affected animals should be washed with 1% potassium permanganate (KMnO4) antiseptic mouth wash 3-4 times a day. Glycerin may be applied over the lesions. Isolate the affected animals from healthy animals. Antibiotic treatment and consultation should be made with qualified veterinary Doctor."
         ]
      }
   },
   "date": "04-10-2024"
}