{
   "weather_details": {
      "08-02-2025": {
         "rainfall": 0,
         "t_max": 33,
         "t_min": 15,
         "rh_max": 13,
         "rh_min": 43,
         "wind_speed": 5,
         "wind_direction": 347,
         "cloud_cover": 2
      },
      "09-02-2025": {
         "rainfall": 0,
         "t_max": 33,
         "t_min": 14,
         "rh_max": 11,
         "rh_min": 40,
         "wind_speed": 4,
         "wind_direction": 346,
         "cloud_cover": 2
      },
      "10-02-2025": {
         "rainfall": 0,
         "t_max": 33,
         "t_min": 13,
         "rh_max": 11,
         "rh_min": 44,
         "wind_speed": 4,
         "wind_direction": 0,
         "cloud_cover": 1
      },
      "11-02-2025": {
         "rainfall": 0,
         "t_max": 34,
         "t_min": 13,
         "rh_max": 12,
         "rh_min": 46,
         "wind_speed": 3,
         "wind_direction": 90,
         "cloud_cover": 1
      },
      "12-02-2025": {
         "rainfall": 0,
         "t_max": 35,
         "t_min": 13,
         "rh_max": 15,
         "rh_min": 48,
         "wind_speed": 2,
         "wind_direction": 225,
         "cloud_cover": 3
      }
   },
   "names_of_crops": [
      "dry season rice",
      "green gram",
      "black gram",
      "mango",
      "vegetable crops",
      "livestock"
   ],
   "general_advisory": "As per the extended range forecast, dry weather is very likely to prevail over the districts of Odisha during week 1. Farmers are advised to provide one live-saving irrigation in standing crop and conduct all kinds of spraying and intercultural operations during that period in the morning or in the evening hours.",
   "crops_data": {
      "dry season rice": {
         "advisory": [
            "In transplanted rice, application of 35 kg urea per acre should be advised as the first top dressing at 20-25 days after transplanting or maximum tillering stage.",
            "Insect/Pest management: In just-transplanted field use 3 pheromone traps with 5mg lure/acre in the rice field for monitoring of the yellow stem borer and leaf folder. Farmers may also broadcast granular insecticide or spray insecticides to control these insects."
         ]
      },
      "green gram": {
         "advisory": [
            "If sucking insect attack is noticed in Green/Black gram field, farmers should use yellow sticky traps per acre to control these insects at the vegetative stage. Spraying of neem oil or other insecticides should be advised to control insect attacks.",
            "To control yellow mosaic virus attack in the field, spraying of specific insecticides should be advised. Avoid chemical applications at the flowering stage."
         ]
      },
      "black gram": {
         "advisory": [
            "Similar to green gram advisory"
         ]
      },
      "mango": {
         "advisory": [
            "Regular monitoring of Mango Hopper attack in the orchard should be advised. Avoid irrigation at the flowering stage to reduce flower drop. Manage mango mealy bug by wrapping polythene/alkathane sheet on Mango trees.",
            "To manage fungal infections in Mango orchard, specific fungicides should be advised for spraying."
         ]
      },
      "vegetable crops": {
         "advisory": [
            "Specific insecticides should be sprayed to control leaf eating caterpillar, fruit borer, and other pests in Tomato, Brinjal, and Cauliflower crops. Regular monitoring against sucking insect attacks is advised. Avoid chemical applications at the flowering stage.",
            "Regular monitoring for purple blotch disease infestation in onion plants is advised."
         ]
      },
      "livestock": {
         "advisory": [
            "Increase fresh clean drinking water supply to animals due to the increase in temperature. Avoid grazing at noon hours. Vaccination against specific diseases should be advised. Deworming of animals is advised."
         ]
      }
   },
   "date": "07-02-2025"
}