{
   "weather_details": {
      "05-10-2024": {
         "rainfall": 0,
         "t_max": 35,
         "t_min": 26,
         "rh_max": 45,
         "rh_min": 72,
         "wind_speed": 7,
         "wind_direction": 259,
         "cloud_cover": 3
      },
      "06-10-2024": {
         "rainfall": 0,
         "t_max": 35,
         "t_min": 26,
         "rh_max": 44,
         "rh_min": 69,
         "wind_speed": 6,
         "wind_direction": 270,
         "cloud_cover": 4
      },
      "07-10-2024": {
         "rainfall": 2,
         "t_max": 34,
         "t_min": 25,
         "rh_max": 49,
         "rh_min": 75,
         "wind_speed": 5,
         "wind_direction": 160,
         "cloud_cover": 6
      },
      "08-10-2024": {
         "rainfall": 2,
         "t_max": 34,
         "t_min": 25,
         "rh_max": 45,
         "rh_min": 87,
         "wind_speed": 6,
         "wind_direction": 156,
         "cloud_cover": 6
      },
      "09-10-2024": {
         "rainfall": 0,
         "t_max": 34,
         "t_min": 25,
         "rh_max": 46,
         "rh_min": 91,
         "wind_speed": 6,
         "wind_direction": 155,
         "cloud_cover": 6
      }
   },
   "names_of_crops": [
      "rice",
      "ground nut",
      "okra",
      "mango",
      "cow/buffalo"
   ],
   "general_advisory": "As there are very less chance of occurrence of rainfall is expected in upcoming days, farmers are advised to conduct agricultural operation (irrigation, spraying, intercultural operation etc.) with proper care. Sowing of green fodder should be advised in moist soil to avail proper diet to animals. Regular monitoring against the incidence of some insects i.e. YSB, Leaf folder, Case worm, Gall Midge, Leaf eating caterpillar etc. and diseases like BLB, Blast etc. in Rice crop should be advised.",
   "crops_data": {
      "rice": {
         "advisory": [
            "Farmers should maintain 5 cm water level in rice field for proper growth.",
            "In case of appearance of bacterial leaf blight disease, farmers should stop top dressing of nitrogenous fertilizers (Urea/DAP). If there is facility of draining, drain out stagnant water and apply 5 kg potassic fertilizer (MOP) per acre."
         ]
      },
      "ground nut": {
         "advisory": [
            "To control Tikka disease in Ground nut, spraying of Chlorothalonil @ 400 g or Hexaconazole 5 % EC @ 400 ml per 200 liters of water per acre should be advised under clear weather condition."
         ]
      },
      "okra": {
         "advisory": [
            "If yellow vein mosaic symptoms are shown in the okra crop, then to control it, first remove the severely affected plants and bury them under the soil at a distance.",
            "To control Fruit and shoot borer in Okra, spraying of Neem based pesticide 1500 ppm @600ml per acre should be advised at initial stages."
         ]
      },
      "mango": {
         "advisory": [
            "In the old Mango orchard, training, pruning and cleaning of weed, diseased and infected branches and leaves should be advised."
         ]
      },
      "cow/buffalo": {
         "advisory": [
            "FMD is a highly contagious viral disease in Cow and Buffalo, characterized by fever and blister-like sores. Preventive measures include primary vaccination at 4-5 months old, washing affected areas with potassium permanganate, and isolating affected animals."
         ]
      }
   },
   "date": "04-10-2024"
}