{
   "weather_details": {
      "20-07-2024": {
         "rainfall": 10,
         "t_max": 31,
         "t_min": 24,
         "rh_max": 87,
         "rh_min": 46,
         "wind_speed": 10,
         "wind_direction": 63,
         "cloud_cover": 7
      },
      "21-07-2024": {
         "rainfall": 15,
         "t_max": 31,
         "t_min": 24,
         "rh_max": 83,
         "rh_min": 49,
         "wind_speed": 11,
         "wind_direction": 202,
         "cloud_cover": 7
      },
      "22-07-2024": {
         "rainfall": 10,
         "t_max": 32,
         "t_min": 25,
         "rh_max": 81,
         "rh_min": 57,
         "wind_speed": 17,
         "wind_direction": 238,
         "cloud_cover": 7
      },
      "23-07-2024": {
         "rainfall": 5,
         "t_max": 32,
         "t_min": 25,
         "rh_max": 80,
         "rh_min": 63,
         "wind_speed": 22,
         "wind_direction": 248,
         "cloud_cover": 6
      },
      "24-07-2024": {
         "rainfall": 5,
         "t_max": 33,
         "t_min": 26,
         "rh_max": 78,
         "rh_min": 55,
         "wind_speed": 23,
         "wind_direction": 248,
         "cloud_cover": 6
      }
   },
   "names_of_crops": [
      "rice",
      "maize",
      "vegetable crops",
      "animal husbandry"
   ],
   "general_advisory": "As there is a chance of occurrence of light to moderate rainfall along with heavy rainfall in one or two places in upcoming days so, farmers are advised to avoid irrigation as well as spraying operation during that period and should wait some days for transplanting of rice and planting of fruit and vegetable crops. Looking to the high wind speed condition make provisions to support the crops.",
   "crops_data": {
      "rice": {
         "advisory": [
            "Nursery sowing should be completed by end of 2nd fortnight of July.",
            "Main field land preparation should be done by puddling the field twice at 7-10 days intervals and land leveling for uniform crop stand.",
            "For high yielding varieties apply appropriate basal dose of fertilizers.",
            "Transplanting of seedlings should be done at recommended spacing.",
            "Store rainwater to be utilized during dry spells."
         ]
      },
      "maize": {
         "advisory": [
            "Ideal sowing time for kharif maize is from June 20 to end of July.",
            "Pre-sow seed treatment with fungicides and insecticides is recommended.",
            "Keep a check on weed growth with manual hoeing and herbicide application.",
            "Delay any spraying operations due to upcoming rainfall forecast."
         ]
      },
      "vegetable crops": {
         "advisory": [
            "Start raised bed nursery preparation with proper drainage system for kharif vegetable crops.",
            "Avoid planting and intercultural operations during heavy rainfall periods.",
            "Ensure proper drainage to avoid waterlogging."
         ]
      },
      "animal husbandry": {
         "advisory": [
            "Deworming and vaccination of animals against infectious diseases is crucial during the rainy season.",
            "Provide clean drinking water to animals and avoid exposure to flowing rainwater.",
            "Ensure animals are kept in safe places during adverse weather conditions."
         ]
      }
   },
   "date": "19-07-2024"
}