{
   "weather_details": {
      "20/11/2024": {
         "rainfall": 0,
         "t_max": 30,
         "t_min": 13,
         "rh_max": 72,
         "rh_min": 30,
         "wind_speed": 4,
         "wind_direction": 22,
         "cloud_cover": 1
      },
      "21/11/2024": {
         "rainfall": 0,
         "t_max": 30,
         "t_min": 12,
         "rh_max": 74,
         "rh_min": 31,
         "wind_speed": 4,
         "wind_direction": 29,
         "cloud_cover": 0
      },
      "22/11/2024": {
         "rainfall": 0,
         "t_max": 30,
         "t_min": 12,
         "rh_max": 74,
         "rh_min": 31,
         "wind_speed": 4,
         "wind_direction": 29,
         "cloud_cover": 2
      },
      "23/11/2024": {
         "rainfall": 0,
         "t_max": 30,
         "t_min": 12,
         "rh_max": 71,
         "rh_min": 29,
         "wind_speed": 4,
         "wind_direction": 29,
         "cloud_cover": 0
      },
      "24/11/2024": {
         "rainfall": 0,
         "t_max": 29,
         "t_min": 11,
         "rh_max": 66,
         "rh_min": 27,
         "wind_speed": 4,
         "wind_direction": 31,
         "cloud_cover": 1
      }
   },
   "names_of_crops": [
      "paddy",
      "groundnut",
      "gram",
      "potato",
      "mustard",
      "vegetables",
      "poultry",
      "animal husbandry"
   ],
   "general_advisory": "For rabi crops, farmers can start their field operations in fallow fields in November month. In case of sufficient moisture in field, sow paira crop",
   "crops_data": {
      "paddy": {
         "advisory": [
            "Physiological Maturity stage - False smut endemic area, spray Copper hydroxide 77% @ 2g/ltr or Tebuconazole 25% @ 2g/ltr Repeat the spraying at seven days interval for effective control of false smut."
         ]
      },
      "groundnut": {
         "advisory": [
            "Sowing stage - Due to decreasing temperature, without delay go for sowing of groundnut like Dharani, Kalinga chinabadam, Kadri. Apply 35 kg DAP and 4kg Urea and 26 kg MOP per acre in the furrows before sowing. Keep line to line spacing of 25 cm and plant to plant spacing of 10 cm and put the seed in 3 cm depth."
         ]
      },
      "gram": {
         "advisory": [
            "Sowing stage - Sowing of gram should be done. Before sowing farmers are advised Gramin Krishi Mausam Sewa India Meteorological Department to ensure optimum soil moisture for better seed germination. Seed rate: - 60-80 kilogram for small and medium sized varieties and 80 - 100 kilograms for big sized varieties. R x R spacing to be maintained 30-35 cm. Before sowing, seed should be treated with Rhizobium culture and phosphorus solublesing bacteria."
         ]
      },
      "potato": {
         "advisory": [
            "Sowing stage - Collect seeds like K. Pokhraj, K. Lalima, K. Sinduri, K. Surya @ 608 q/ac. For proper germination keep the seed material inside gunny bag for 5 -7 days. Treat the seeds in 10 liters of water mixed with 20 g Mancozeb, 1 g Streptocyclin and deep the tubers for 30 minutes and after that dry und er shed. Apply 5 t FYM/acre at final land preparation."
         ]
      },
      "mustard": {
         "advisory": [
            "Sowing stage - At 10 days after sowing go for thinning operation and keep healthy plants and maintain proper plant population."
         ]
      },
      "vegetables": {
         "advisory": [
            "Sowing stage - At present farmers may raise the seedlings of winter vegetables like cauliflower, cabbage, chilli, tomato, brinjal etc. Seeds should be treated with fungicide before sowing."
         ]
      },
      "poultry": {
         "advisory": [
            "To keep warm the poultry house keep bulbs to maintain temperature. Cover the house woth gunny bags."
         ]
      },
      "animal husbandry": {
         "advisory": [
            "For protection from cold, the shed house o be kept warm."
         ]
      }
   },
   "date": "19-11-2024"
}