{
   "weather_details": {
      "03-07-2024": {
         "rainfall": 5,
         "t_max": 29,
         "t_min": 24,
         "rh_max": 81,
         "rh_min": 68,
         "wind_speed": 19,
         "wind_direction": 246,
         "cloud_cover": 8
      },
      "04-07-2024": {
         "rainfall": 10,
         "t_max": 30,
         "t_min": 24,
         "rh_max": 82,
         "rh_min": 54,
         "wind_speed": 13,
         "wind_direction": 248,
         "cloud_cover": 8
      },
      "05-07-2024": {
         "rainfall": 10,
         "t_max": 32,
         "t_min": 25,
         "rh_max": 81,
         "rh_min": 54,
         "wind_speed": 12,
         "wind_direction": 243,
         "cloud_cover": 8
      },
      "06-07-2024": {
         "rainfall": 5,
         "t_max": 32,
         "t_min": 25,
         "rh_max": 76,
         "rh_min": 54,
         "wind_speed": 14,
         "wind_direction": 238,
         "cloud_cover": 8
      },
      "07-07-2024": {
         "rainfall": 15,
         "t_max": 31,
         "t_min": 25,
         "rh_max": 78,
         "rh_min": 47,
         "wind_speed": 14,
         "wind_direction": 238,
         "cloud_cover": 8
      }
   },
   "names_of_crops": [
      "kharif rice",
      "cotton",
      "vegetable crops",
      "cow/buffalo",
      "poultry"
   ],
   "general_advisory": "As per Extended Range Forecast of IMD, rainfall is above normal and both maximum and minimum temperature is expected to be normal for Odisha state during 7th to 13th July, 2024 so, farmers are advised to take necessary action towards kharif crop cultivation and avoid irrigation during that period. Farmers should start nursery bed preparation for kharif paddy and vegetable crops and also start planting new fruit crops in orchard by taking the advantage of past rainfall condition. Prevailing weather condition is favorable for mealy bug attack in all type of crops so farmers should spray Thiamethoxam 25% WG @ 0.5-0.6g or Imidacloprid 17.8 % SL @ 0.5ml or Lambda Cyhalothrin 4.9 % CS per liter of water to control this insects under clear weather condition. Cloudy weather along with high relative humidity may favour some disease infestation in standing crop so its regular monitoring should be advised.",
   "crops_data": {
      "kharif rice": {
         "advisory": [
            "By taking the advantage of previous rainfall farmers should start field preparation for nursery sowing of Paddy.",
            "Seed treatment should be done with Carbendazim 50% WP @ 2g/kg of seeds or Trichoderma @ 10 g/kg of seeds.",
            "Soak the seeds in water for 24 hours and then drain out the water and keep the seeds in gunny bag. Once the seeds sprout, use it for sowing."
         ]
      },
      "cotton": {
         "advisory": [
            "Farmers those are not yet started field preparation for cultivation of cotton crop are advised to start the preparation as soon as possible.",
            "Before sowing, seed should be treated with imidachloprid 70 WG @ 7 g/kg of seed for protection against sucking pests.",
            "Spacing should be 90 × 45-60 cm and 90-120 × 90 cm for normal and hybrid variety respectively."
         ]
      },
      "vegetable crops": {
         "advisory": [
            "Past weather (periodically cloudy and sunny) condition is favourable for sucking insect pest attack in vegetable crops so its regular monitoring should be advised.",
            "As there is a chance of occurrence of rainfall expected in upcoming days, farmers are advised to take proper care while conducting spraying operations and also start nursery bed preparation and sowing of kharif vegetable crops with proper protection."
         ]
      },
      "cow/buffalo": {
         "advisory": [
            "Deworming and vaccination of animal against FMD, HS and BQ should be ensured at the beginning of commencement of monsoon (rainy season).",
            "Soft and tender grass is more palatable to cattle, but magnesium deficiency is seen in dairy cows when eating too much litter, so a variety of grasses should be fed instead of just soft grass."
         ]
      },
      "poultry": {
         "advisory": [
            "During rainy season, make provision to ensure proper ventilation by allowing an opening of 1-2 ft at the top of side curtains during the day.",
            "Deworming and vaccination of poultry birds against ranikhet disease must be ensured.",
            "Ensure proper ventilation and cleanliness in the poultry farm to avoid insect pest attack during the rainy season."
         ]
      }
   },
   "date": "02-07-2024"
}