{
   "weather_details": {
      "03/04/2024": {
         "rainfall": 0,
         "t_max": 40,
         "t_min": 26,
         "rh_max": 57,
         "rh_min": 13,
         "wind_speed": 12,
         "wind_direction": 205,
         "cloud_cover": 0
      },
      "04/04/2024": {
         "rainfall": 0,
         "t_max": 40,
         "t_min": 26,
         "rh_max": 80,
         "rh_min": 15,
         "wind_speed": 11,
         "wind_direction": 180,
         "cloud_cover": 1
      },
      "05/04/2024": {
         "rainfall": 0,
         "t_max": 41,
         "t_min": 27,
         "rh_max": 70,
         "rh_min": 23,
         "wind_speed": 15,
         "wind_direction": 207,
         "cloud_cover": 1
      },
      "06/04/2024": {
         "rainfall": 0,
         "t_max": 41,
         "t_min": 27,
         "rh_max": 67,
         "rh_min": 15,
         "wind_speed": 13,
         "wind_direction": 210,
         "cloud_cover": 0
      },
      "07/04/2024": {
         "rainfall": 0,
         "t_max": 42,
         "t_min": 27,
         "rh_max": 55,
         "rh_min": 10,
         "wind_speed": 12,
         "wind_direction": 242,
         "cloud_cover": 2
      }
   },
   "names_of_crops": [
      "paddy",
      "sugarcane",
      "maize",
      "tomato",
      "brinjal",
      "coconut",
      "vegetables",
      "fingerlings"
   ],
   "general_advisory": "In paddy crop, Panicle initiation, Panicle emergence, flowering and milking stages are the critical stages. Cover the rows with dry leaves in Sugarcane. Apply sprinkler irrigation to bring down the heat effect. High temperature increases the water requirement of maize crop. Spread polythene in irrigation channels to save water wastage. High temperature in day hours may lead to wilting in tomato and brinjal. Mulch coconut leaves around a coconut tree to reduce water loss. Cover vegetable seedlings during day time. Harvest fingerlings if water temperature rises to 30°C.",
   "crops_data": {
      "paddy": {
         "advisory": [
            "In paddy crop, Panicle initiation, Panicle emergence, flowering, and milking stages are the critical stages. Water deficit should be avoided during these stages.",
            "Yellow stem borer management - Spray recommended insecticides for effective management."
         ]
      },
      "sugarcane": {
         "advisory": [
            "Cover the rows with dry leaves in Sugarcane.",
            "Top-dress with potassium to protect from water scarcity during summer.",
            "Apply sprinkler irrigation frequently during hot months."
         ]
      },
      "maize": {
         "advisory": [
            "High temperature increases the water requirement of maize crop. Irrigate the crop effectively."
         ]
      },
      "tomato": {
         "advisory": [
            "High temperature may lead to wilting in tomato. Apply Streptocyclin for management."
         ]
      },
      "brinjal": {
         "advisory": [
            "To manage Brinjal shoot and fruit borer, install pheromone traps."
         ]
      },
      "coconut": {
         "advisory": [
            "Mulch coconut leaves around the tree to reduce water loss."
         ]
      },
      "vegetables": {
         "advisory": [
            "Cover newly planted vegetable seedlings with paper caps during the day."
         ]
      },
      "fingerlings": {
         "advisory": [
            "Harvest fingerlings if water temperature rises to 30°C."
         ]
      }
   },
   "date": "02-04-2024"
}