{
   "weather_details": {
      "03/04/2024": {
         "rainfall": 0,
         "t_max": 40,
         "t_min": 26,
         "rh_max": 57,
         "rh_min": 13,
         "wind_speed": 12,
         "wind_direction": 205,
         "cloud_cover": 0
      },
      "04/04/2024": {
         "rainfall": 0,
         "t_max": 40,
         "t_min": 26,
         "rh_max": 80,
         "rh_min": 15,
         "wind_speed": 11,
         "wind_direction": 180,
         "cloud_cover": 1
      },
      "05/04/2024": {
         "rainfall": 0,
         "t_max": 41,
         "t_min": 27,
         "rh_max": 70,
         "rh_min": 23,
         "wind_speed": 15,
         "wind_direction": 207,
         "cloud_cover": 1
      },
      "06/04/2024": {
         "rainfall": 0,
         "t_max": 41,
         "t_min": 27,
         "rh_max": 67,
         "rh_min": 15,
         "wind_speed": 13,
         "wind_direction": 210,
         "cloud_cover": 0
      },
      "07/04/2024": {
         "rainfall": 0,
         "t_max": 42,
         "t_min": 27,
         "rh_max": 55,
         "rh_min": 10,
         "wind_speed": 12,
         "wind_direction": 242,
         "cloud_cover": 2
      }
   },
   "names_of_crops": [
      "paddy",
      "sugarcane",
      "maize",
      "tomato",
      "brinjal",
      "coconut",
      "vegetables",
      "fingerlings",
      "black gram",
      "green gram",
      "onion",
      "mango"
   ],
   "general_advisory": "In paddy crop, Panicle initiation, Panicle emergence, flowering and milking stages are the critical stages...",
   "crops_data": {
      "paddy": {
         "advisory": [
            "In paddy crop, Panicle initiation, Panicle emergence, flowering and milking stages are the critical stages. In these stages water scarcity or deficit of water causes comparatively greater reduction in yields. Hence, water deficit during these stages should be avoided.",
            "General Advisory: Yellow stem borer management - Due to rise in temperature there are chances of increase in stem borer infestation in paddy crop..."
         ]
      },
      "sugarcane": {
         "advisory": [
            "Cover the rows with dry leaves in Sugarcane. Top-dress with 4% potassium to protect crop from water scarcity during summer.",
            "Early Shoot Borer: To manage early shoot borer in Sugarcane, irrigate the crop frequently during hot months. Timely cutting the attacked shoot at or just below the ground level ensures destruction of most of the caterpillar. Collect and destroy the egg masses manually. In furrow, apply Fipronil 0.3% GR @ 10 kg/acre at the time of first earthing up."
         ]
      },
      "maize": {
         "advisory": [
            "The high temperature increases the water requirement of maize crop. Irrigate the crop. Never allow water to remain stagnant for more than six hour in the field."
         ]
      },
      "tomato": {
         "advisory": [
            "High temperature in day hours may lead to wilting in tomato and brinjal. Apply 1g Streptocyclin in 10 liter water in root zone."
         ]
      },
      "brinjal": {
         "advisory": [
            "Brinjal shoot and fruit borer... (Advisory continues)"
         ]
      },
      "coconut": {
         "advisory": [
            "Mulch coconut leaves 1.8 m around a coconut tree to reduce water loss."
         ]
      },
      "vegetables": {
         "advisory": [
            "Cover with paper caps on the newly planted vegetable seedlings during day time."
         ]
      },
      "fingerlings": {
         "advisory": [
            "In shallow ponds, harvest fingerlings, if water temperature rises to 30 0C. Ensure enough water depth before introducing fingerlings in a pond."
         ]
      },
      "black gram": {
         "advisory": [
            "Tobacco Caterpillar Management... (Advisory continues)"
         ]
      },
      "green gram": {
         "advisory": [
            "Tobacco Caterpillar Management... (Advisory continues)"
         ]
      },
      "onion": {
         "advisory": [
            "After harvesting of onion, cut the tops leaving 2.0 -2.5 cm above bulb. The harvested bulb should be dried in well ventilated concrete floored room. Well dried bulbs can be stored for longer period."
         ]
      },
      "mango": {
         "advisory": [
            "Mango hopper - To control mango hoppers spray Imidacloprid 17.8% SL @ 5 ml/15 litre of water or Thiamethoxam 25% W.G @ 3ml/15 litre of water or Acetamiprid 20% S.P. @ 4g/15litre of water. Application of smoke below the plants can also help in reducing the pest population."
         ]
      }
   },
   "date": "02-04-2024"
}