{
   "weather_details": {
      "05-10-2024": {
         "rainfall": 0,
         "t_max": 35,
         "t_min": 26,
         "rh_max": 73,
         "rh_min": 49,
         "wind_speed": 6,
         "wind_direction": 210,
         "cloud_cover": 4
      },
      "06-10-2024": {
         "rainfall": 0,
         "t_max": 35,
         "t_min": 25,
         "rh_max": 72,
         "rh_min": 47,
         "wind_speed": 5,
         "wind_direction": 216,
         "cloud_cover": 4
      },
      "07-10-2024": {
         "rainfall": 0,
         "t_max": 34,
         "t_min": 25,
         "rh_max": 82,
         "rh_min": 51,
         "wind_speed": 5,
         "wind_direction": 180,
         "cloud_cover": 4
      },
      "08-10-2024": {
         "rainfall": 5,
         "t_max": 34,
         "t_min": 24,
         "rh_max": 92,
         "rh_min": 54,
         "wind_speed": 6,
         "wind_direction": 153,
         "cloud_cover": 6
      },
      "09-10-2024": {
         "rainfall": 5,
         "t_max": 34,
         "t_min": 24,
         "rh_max": 93,
         "rh_min": 56,
         "wind_speed": 6,
         "wind_direction": 156,
         "cloud_cover": 6
      }
   },
   "names_of_crops": [
      "direct seeded paddy",
      "cotton",
      "arhar",
      "hybrid maize",
      "brinjal",
      "tomato",
      "cole crops",
      "banana",
      "papaya",
      "cattle",
      "goat & sheep",
      "poultry"
   ],
   "general_advisory": "Based on five days weather forecast received from IMD, farmers can continue agronomic practices, irrigation, application of pesticides and fertilizers during next four days as needed. Keep fields weed-free and plug the holes in the bunds to arrest the seepage loss. Regular monitoring of crops for incidence of pests and diseases should be done.",
   "crops_data": {
      "direct seeded paddy": {
         "advisory": [
            "Gundhi bug infestation commonly observed during milking stage of rice.",
            "If population of Brown Planthopper exceeds ETL, undertake alternate wetting and drying technique.",
            "Avoid using nitrogenous fertilizers during infestation of BPH."
         ]
      },
      "cotton": {
         "advisory": [
            "Topping should be done at 90 DAS or when the crop attains 100 cm height.",
            "Install pheromone traps for monitoring pink bollworm and American bollworm."
         ]
      },
      "arhar": {
         "advisory": [
            "Spray Profenophos or Chlorpyriphos to control pests.",
            "Apply Metiram 75% WG at root zone to control wilt."
         ]
      },
      "hybrid maize": {
         "advisory": [
            "Monitor field regularly for stem borer, FAW, and banded leaf and sheath blight.",
            "For effective control of stem borer, spray Fipronil 5% SC or Profenophos 50% EC."
         ]
      },
      "brinjal": {
         "advisory": [
            "Spray Copper Oxychloride 50% WP to manage bacterial wilt."
         ]
      },
      "tomato": {
         "advisory": [
            "Treat nursery bed with Trichoderma viride 1.5% WP as a precautionary measure before sowing."
         ]
      },
      "cole crops": {
         "advisory": [
            "Prepare nursery beds with well-decomposed FYM and chlorpyriphos dust before sowing."
         ]
      },
      "banana": {
         "advisory": [
            "Spray Mancozeb 75% WP to manage Sigatoka leaf spot and Cigar end rot."
         ]
      },
      "papaya": {
         "advisory": [
            "Install yellow sticky traps to monitor and control YVM.",
            "Spray neem oil and Difenthiuron 50% WP for chemical control."
         ]
      },
      "cattle": {
         "advisory": [
            "Ensure proper ventilation in animal sheds.",
            "Cultivate drought-resistant fodder varieties like Hybrid Napier grass."
         ]
      },
      "goat & sheep": {
         "advisory": [
            "Regularly check animals for signs of dehydration, heat stress, and parasitic infections.",
            "Deworm animals as needed and vaccinate them against common diseases."
         ]
      },
      "poultry": {
         "advisory": [
            "Raised platforms and deep litter systems help in maintaining cleanliness and temperature control.",
            "Regularly clean and disinfect the house to prevent the buildup of pathogens."
         ]
      }
   },
   "date": "04-10-2024"
}