{
   "weather_details": {
      "2024-11-06": {
         "rainfall": 0,
         "t_max": 32,
         "t_min": 22,
         "rh_max": 84,
         "rh_min": 51,
         "wind_speed": 3,
         "wind_direction": 344,
         "cloud_cover": 4
      },
      "2024-11-07": {
         "rainfall": 2,
         "t_max": 32,
         "t_min": 22,
         "rh_max": 85,
         "rh_min": 54,
         "wind_speed": 4,
         "wind_direction": 354,
         "cloud_cover": 5
      },
      "2024-11-08": {
         "rainfall": 0,
         "t_max": 32,
         "t_min": 22,
         "rh_max": 87,
         "rh_min": 55,
         "wind_speed": 4,
         "wind_direction": 355,
         "cloud_cover": 3
      },
      "2024-11-09": {
         "rainfall": 0,
         "t_max": 31,
         "t_min": 22,
         "rh_max": 87,
         "rh_min": 54,
         "wind_speed": 4,
         "wind_direction": 349,
         "cloud_cover": 3
      },
      "2024-11-10": {
         "rainfall": 0,
         "t_max": 31,
         "t_min": 21,
         "rh_max": 84,
         "rh_min": 49,
         "wind_speed": 4,
         "wind_direction": 349,
         "cloud_cover": 4
      }
   },
   "names_of_crops": [
      "rice",
      "pigeon pea",
      "tomato",
      "okra",
      "cauliflower",
      "cabbage",
      "onion",
      "brinjal",
      "banana",
      "papaya",
      "cucumber",
      "cow",
      "fresh water"
   ],
   "general_advisory": "Go for the sowing of pre-rabi crops like blackgram, greengram, horsegram, sesame, sunflower and cucurbits in up-medium land. Go for sowing of vegetable crops like Pea, carrot, radish etc. Harvest the crop when 80-85% of the grains are matured either manually by sickle or by using combine harvester or reaper. Paddy grains need to be sun-dried to 14% moisture content for consumption purpose and for seed purpose it should be dried to 12% moisture for better self-life. Harvest the matured maize and vegetables and keep it in a safe place.",
   "crops_data": {
      "rice": {
         "advisory": [
            "If population of Brown Plant Hopper (BPH) exceeds economic threshold level (ETL) (i.e., 5-10 hoppers/hill), it is advised to alter the micro-climate of the rice field by alternate wetting and drying technique (water should not stand in the field for a long time). If the problem still persists, spray Pymetrozine 50% WG @ 120 g/acre or Dinotefuran 20 % SG @ 80 g/acre or Flonicamid 50 % WG @ 60- gram/acre or Triflumezopyrim 10% SC @ 100 ml / acre at the base of the plant for control of above pests. Avoid using nitrogenous fertilizers during infestation of BPH. To control Neck Blast diseases first drain out excess water from the paddy field. Spray Hexaconazole @ 400-Crop (Stage) Crop Specific Advisory ml/acre or Azoxystrobin+ Difenoconazole @ 200-ml/acre or Tebuconazole + Trifloxystrobin @ 80-gram/acre."
         ]
      },
      "pigeon pea": {
         "advisory": [
            "The crop is at grand vegetative growth to flower initiation (fifteen to sixteen-week) stage. Leaf webber infestation may occur during this stage. To control leaf webber in Arhar spray 400 ml Chloropyriphos 50% + Cypermethrin 5% EC or 400ml profenophos 50% EC mixing with 200 lit of water per acre crop area."
         ]
      },
      "tomato": {
         "advisory": [
            "The tomato seedlings in the nursery are one to three-week stage. Drench the seed bed with streptocycline 0.1g with carbendazim 1g mixing in one liter water to protect seedlings from damping off. Prepare the main field for transplanting tomato seedlings when they become 3-4 week old in the nursery. After final land preparation of the main field, rings or mounds should be prepared at a spacing of 60cm from row to row and 45cm from plant to plant within the row for tomato. Basal dose of 52kg DAP, 7kg Urea, and 66kg MOP should be applied per acre crop area before transplanting seedlings to mounds."
         ]
      },
      "okra": {
         "advisory": [
            "To manage sucking pests like aphids, Jassids, thrips, and whiteflies in Okra spray neem-based pesticide (Neem Oil 1500 PPM Azadiractin @600-ml/acre by mixing it in 200-litre of water or install 8-10 Nos of Yellow sticky traps per acre to control the pest. Spray Thiamethoxam 25 % WG @ 40-gram/acre or Acetamiprid 20 % SP @ 50-gram/acre or Fenobucarb @ 400-ml/acre or Tolfenpyrad 15 % EC @ 400-ml/acre by mixing it in 200-litre of water when infestation is severe."
         ]
      },
      "cauliflower": {
         "advisory": [
            "Apply 33-kg of Urea and 23 kg MOP per acre after hoeing and hand weeding at 15-20 DAT and 33 kg of urea and 23-kg of MOP per acre as last top-dressing fertilizer at 30-35 DAT. If Borax was not applied during transplanting of seedlings than spray Borax @ 4 kg/acre or Folibor /Solubor @ 1.5 gram/litre. Spraying of Boron micronutrient should be done after two weeks of transplanting and two weeks before curd formation."
         ]
      },
      "cabbage": {
         "advisory": [
            "The cabbage seedlings in the nursery are germination stage. Start nursery preparation and sowing cabbage seeds. The Varieties suitable for cabbage are Golden acre, Pride of India, etc and the seed rate is 200g/acre. For 1 acre crop the nursery area should be of 50 sq.m (of dimension 3m X1m X 0.15 m). Seed treatment with Bavistin 1g + Thriam 2 g per kg seed should be done before sowing in the nursery. Drench the seed bed with streptocycline 0.1g with carbendazim 1g mixing in one liter water to protect seedlings from damping off."
         ]
      },
      "onion": {
         "advisory": [
            "The onion seedlings in the nursery are germination to one-week stage. Complete nursery preparation for sowing onion and sowing seeds in the nursery. For onion use varieties like Agrifound light Red, Bhima Super, Bhima Red, Bhima Shakti and seed rate is 4-5 kg/ac. Cover the nursery to protect from sunrays and rain. For 1 acre crop the nursery area should be of 50 sq.m (of dimension 3m X1m X 0.15 m). Seed treatment with Bavistin 1g + Thriam 2 g per kg seed should be done before sowing in the nursery. Drench the seed bed with streptocycline 0.1g with carbendazim 1g mixing in one liter water to protect seedlings from damping off."
         ]
      },
      "brinjal": {
         "advisory": [
            "After rainfall there are chances of wilt disease in brinjal and chili crop. To manage wilt disease in brinjal and chili first uproot affected plants and destroy it away from the field. Don't apply excess nitrogenous fertilizer. Drench the root zone of the plant with 200-ml of Tebuconazole mixed with 20-gram of Streptocycline per acre. Use 200-litre of water per acre for spraying."
         ]
      },
      "banana": {
         "advisory": [
            "To manage stem weevil, install Cosmolure pheromone traps @ 10/acre in banana garden. Dip the banana stem in warm water for 30 minutes before planting. Fill the pit with 25 g neem pedia or 25-50 g any granular insecticide before planting. Cut the affected plant into pieces and dry under the sun. Keep the banana garden neat and clean."
         ]
      },
      "papaya": {
         "advisory": [
            "To manage mealy bug at the early stage of infestation spray neem-based pesticide (Neem Oil 1500 PPM @30- ml/10-litre of water or insecticidal soap. In case of severe infestation spray Profenphos 50 % EC @ 20-ml/10-litre of water or Thiamethoxam 25 % WG @ 3-gram/10-litre of water."
         ]
      },
      "cucumber": {
         "advisory": [
            "To manage fruit fly in cucurbits, prepare a poison bait by mixing 400- gram Jaggery and 8-ml Malathion or DDVP in 4-litre of water. Keep this mixture in Plastic cups or clay pots @80-nos/acre. The fruit flies will be attracted to this and eventually get killed by falling into the poison baits."
         ]
      },
      "cow": {
         "advisory": [
            "If your domestic Animal is becoming off feed, weak, lackluster, diarrhea, Milk production is low, dryness in eyes and appearance of bottleneck condition, there is every possibility of it being suffering from Parasitic infestation. These worms or Parasites reduce the vitality and productivity of the animals. Hence, the farmers are advised to make fecal sample examination of their animals at regular intervals at the nearest LAC, Veterinary Dispensary."
         ]
      },
      "fresh water": {
         "advisory": [
            "When there is a lack of oxygen in the pond, the fish will come up to the surface water and start gulping through their mouths. The ideal dissolved oxygen is about 5mg/l. This can be maintained by using an aerator. A simple way of aeration is to circulate the pond water. It can be done using a pump which can take water from the lower surface of the pond and splash it into the same pond."
         ]
      }
   },
   "date": "05-11-2024"
}