{
   "weather_details": {
      "06-11-2024": {
         "rainfall": 0,
         "t_max": 30,
         "t_min": 19,
         "rh_max": 86,
         "rh_min": 48,
         "wind_speed": 3,
         "wind_direction": 346,
         "cloud_cover": 5
      },
      "07-11-2024": {
         "rainfall": 3,
         "t_max": 31,
         "t_min": 19,
         "rh_max": 87,
         "rh_min": 52,
         "wind_speed": 5,
         "wind_direction": 356,
         "cloud_cover": 6
      },
      "08-11-2024": {
         "rainfall": 0,
         "t_max": 31,
         "t_min": 19,
         "rh_max": 89,
         "rh_min": 54,
         "wind_speed": 5,
         "wind_direction": 4,
         "cloud_cover": 3
      },
      "09-11-2024": {
         "rainfall": 0,
         "t_max": 31,
         "t_min": 19,
         "rh_max": 89,
         "rh_min": 52,
         "wind_speed": 5,
         "wind_direction": 90,
         "cloud_cover": 3
      },
      "10-11-2024": {
         "rainfall": 0,
         "t_max": 30,
         "t_min": 18,
         "rh_max": 86,
         "rh_min": 47,
         "wind_speed": 5,
         "wind_direction": 90,
         "cloud_cover": 4
      }
   },
   "names_of_crops": [
      "paddy",
      "linseed",
      "chickpea",
      "mustard and toria",
      "cauliflower",
      "brinjal",
      "pumpkin",
      "banana",
      "papaya",
      "marigold"
   ],
   "general_advisory": "Prepare the land for sowing of Rabi crops. Select the healthy and disease-free seeds. Treat the seeds with fungicides before sowing in the field. Spraying of pesticides and application of fertilisers can be resumed in early morning hours.",
   "crops_data": {
      "paddy": {
         "advisory": [
            "Restrict the irrigation 10-15 days prior to harvesting of early paddy crops.",
            "Matured paddy crops can be harvested (early varieties) and sun dry it for 1-2 days.",
            "Some of the late maturing varieties are in grain filling stage. Irrigate the crop and maintain a water level of 5 cm in the field.",
            "Gundhi bug infestation can be seen in the field. To minimize the Gundhi bug damage, spray Imidachloprid 17.8% SL @ 1 ml/lt.",
            "Clean up the threshing floor to be used in the next few days."
         ]
      },
      "linseed": {
         "advisory": [
            "Farmers interested in sowing linseed can broadcast the seeds in standing matured paddy crops.",
            "Broadcast can be done 10-15 days prior to harvesting of paddy crops.",
            "Do not broadcast the seeds in waterlogged conditions."
         ]
      },
      "chickpea": {
         "advisory": [
            "Prepare the land for sowing.",
            "The sowing activity can be resumed after proper land ploughing.",
            "Do not sow seeds in waterlogged condition.",
            "Make sure to sow seeds at an optimum depth of 3-5 cm.",
            "Irrigation should be provided after sowing."
         ]
      },
      "mustard and toria": {
         "advisory": [
            "Prepare the field for sowing of mustard and toria in the upcoming week.",
            "Select disease and insect-free seeds for sowing.",
            "Since the Mustard and Toria seeds are smaller in size, mix the seeds with sand to sow uniformly."
         ]
      },
      "cauliflower": {
         "advisory": [
            "Transplanting of Cauliflower can be done in the field.",
            "Remove excess water from the field.",
            "Keep the field weed-free."
         ]
      },
      "brinjal": {
         "advisory": [
            "Regularly monitor the field for insects and pests.",
            "Remove excess water from the root zone.",
            "Fruit and shoot borer infestation can be reduced by spraying Emamectin benzoate 5% SG @ 4g/10 lt."
         ]
      },
      "pumpkin": {
         "advisory": [
            "Spraying of Insecticides and pesticides can be done in the early morning or evening hours.",
            "Leaf blight disease in pumpkin can be corrected by spraying Mancozeb or Captan @ 2g/lt of water."
         ]
      },
      "banana": {
         "advisory": [
            "Provide irrigation to the banana crop in ring basin method.",
            "Staking should be done to the emerging bunch of banana plants.",
            "Harvested bunch should be kept at safe places away from the soil and water.",
            "Spraying of Imidachloprid @ 1ml/lt can be used to reduce the whitefly and thrips infestation."
         ]
      },
      "papaya": {
         "advisory": [
            "Remove weeds from the root zone of the plant.",
            "Papaya ring spot virus can be managed by spraying Malathion or Imidachloprid @ 1ml/lt.",
            "Irrigate the plant but be careful not to over-irrigate it."
         ]
      },
      "marigold": {
         "advisory": [
            "Provide controlled irrigation to the crop.",
            "Transplant and maintain distance from plant to plant and row to row."
         ]
      }
   },
   "date": "05-11-2024"
}