{
   "weather_details": {
      "06-11-2024": {
         "rainfall": 3,
         "t_max": 31,
         "t_min": 23,
         "rh_max": 79,
         "rh_min": 52,
         "wind_speed": 7,
         "wind_direction": 90,
         "cloud_cover": 6
      },
      "07-11-2024": {
         "rainfall": 0,
         "t_max": 32,
         "t_min": 22,
         "rh_max": 82,
         "rh_min": 55,
         "wind_speed": 8,
         "wind_direction": 8,
         "cloud_cover": 5
      },
      "08-11-2024": {
         "rainfall": 0,
         "t_max": 32,
         "t_min": 22,
         "rh_max": 83,
         "rh_min": 55,
         "wind_speed": 8,
         "wind_direction": 3,
         "cloud_cover": 4
      },
      "09-11-2024": {
         "rainfall": 0,
         "t_max": 32,
         "t_min": 22,
         "rh_max": 83,
         "rh_min": 54,
         "wind_speed": 7,
         "wind_direction": 357,
         "cloud_cover": 4
      },
      "10-11-2024": {
         "rainfall": 0,
         "t_max": 31,
         "t_min": 22,
         "rh_max": 82,
         "rh_min": 49,
         "wind_speed": 7,
         "wind_direction": 3,
         "cloud_cover": 4
      }
   },
   "names_of_crops": [
      "rice",
      "rapeseed and mustard",
      "vegetables",
      "fruit",
      "pisciculture",
      "livestock"
   ],
   "general_advisory": "Taking the advantage of store soil moisture, farmer should start land preparation for rabi crops like mustard, toria, sunflower and sowing should be completed soon to get optimum yield. Visit to field regularly to observe the infestation levels of BPH, WBPH, Leaf folder, Gundhy bug and & the incidence of BLB and Blast in rice. Consult to nearest veterinary doctor for vaccination and deworming in animals.",
   "crops_data": {
      "rice": {
         "advisory": [
            "Prevailing warm and humid weather may increases the incidence of BLB and neck Blast disease in rice so apply (Tebuconazole 50%+ Trifloxystrobin 25% WG)@0.4 g/litre of water.",
            "Prevailing microclimate condition after the cyclonic events may increase the population of Plant Hoppers. Make alleys in field in every 3 m/after 8 -10 rows for proper penetration of sunlight and better aeration at plane base. At early stage of infestation, to protect the crop apply Dinotefuran @ 80g/acre WG along with Neem Oil Formulation @ 600 ml/acre targeting to the plant base. Spraying of insecticide should be targeted at the plant base.",
            "If late transplanted rice is in PI/early flowering stage application of additional dose of MOP 12 Kg/acre recommended or foliar spray of MOP (0:0:50)@8-10g/litre of water along with 20% boron @1.5g/litre of water recommended."
         ]
      },
      "rapeseed and mustard": {
         "advisory": [
            "Taking the advantage of store soil moisture, land preparation and sowing of the crop should be completed soon to get optimum yield.",
            "Suitable varieties: Toria - Anuradha, Parbati, Sushree Indian mustard - NRCHB 101, Mahyco bold, JD 6 Seed rate - 8-10 Kg/ha, Spacing - 30 cm X 10 cm Fertilizer dose: Toria @60:30:30 N -P2O5 -K2O Kg/ha Mustard@80:40:40 N -P2O5 -K2O Kg/ha 50%N and all P2O5 and K2O fertilizers should be applied as basal."
         ]
      },
      "vegetables": {
         "advisory": [
            "To prevent wilting or partial wilting in brinjal drain the excess water from the field. Apply Neem or Karanja cake @ 1g/acre, Drenching of Tebuconazole @ 1ml/liter can be recommended.",
            "If the seedlings of early duration varieties of vegetables are damaged, treat the seedlings with (Metalaxyl + Mancozeb) @ 2g/li of water and Plantomycin @ 1g per liter of water."
         ]
      },
      "fruit": {
         "advisory": [
            "Coconut - To reduce the incidence of Leaf blight in newly planted coconut saplings spraying of (Metalaxyl+ Mancozeb)@2 g/litre of water is advised.",
            "Papaya - Install Yellow Sticky trap to trap the vector (Whitefly) of Papaya Leaf Curl Virus. Alternate spraying of Neem oil formulation 1500ppm @3ml/lit of water and spray flonicamid 50WG @0.3g/lit to control whitefly."
         ]
      },
      "pisciculture": {
         "advisory": [
            "Water quality of fish ponds may be altered so testing of water PH & need based Application of @100kg lime/acre in 3 splits (40:40:20) at 2 days interval recommended."
         ]
      },
      "livestock": {
         "advisory": [
            "Animals should be given mineral mixture along with salt regularly and wheat grains, jaggery etc. may be provided @ 10% -20% in the daily ration to meet the energy requirement of the animals.",
            "If the animals have not yet been vaccinated against FMD, Haemorrhagic Septicaemia, Black Quarter, Enterotoxemia etc., these must be done."
         ]
      }
   },
   "date": "05-11-2024"
}