{
   "weather_details": {
      "2024-09-07": {
         "rainfall": 10,
         "t_max": 35,
         "t_min": 25,
         "rh_max": 93,
         "rh_min": 67,
         "wind_speed": 5,
         "wind_direction": 288,
         "cloud_cover": 7
      },
      "2024-09-08": {
         "rainfall": 15,
         "t_max": 33,
         "t_min": 25,
         "rh_max": 93,
         "rh_min": 68,
         "wind_speed": 6,
         "wind_direction": 288,
         "cloud_cover": 8
      },
      "2024-09-09": {
         "rainfall": 25,
         "t_max": 31,
         "t_min": 24,
         "rh_max": 95,
         "rh_min": 76,
         "wind_speed": 7,
         "wind_direction": 291,
         "cloud_cover": 8
      },
      "2024-09-10": {
         "rainfall": 15,
         "t_max": 33,
         "t_min": 24,
         "rh_max": 93,
         "rh_min": 76,
         "wind_speed": 8,
         "wind_direction": 292,
         "cloud_cover": 8
      },
      "2024-09-11": {
         "rainfall": 10,
         "t_max": 34,
         "t_min": 25,
         "rh_max": 90,
         "rh_min": 69,
         "wind_speed": 10,
         "wind_direction": 291,
         "cloud_cover": 7
      }
   },
   "names_of_crops": [
      "maize",
      "rice",
      "finger millet",
      "cotton",
      "papaya",
      "brinjal",
      "cow",
      "common fish",
      "chicken"
   ],
   "general_advisory": "As per extended range of forecast received from IMD, fairly widespread rain/thundershower is very likely over districts of Odisha during the week-1 (6th - 12th September , 2024) with isolated heavy rainfall very likely in the districts of South Odisha on 6th Sept; isolated heavy to very heavy rainfall very likely in the districts of South Odisha on 7th Sept; isolated heavy to very heavy rainfall very likely in the districts of Central Odisha on 8th Sept, heavy rainfall very likely over the districts of north Odisha on 9th and 10th Sept. Scattered to fairly widespread rain/thundershower very likely in the district of Odisha state during week 2 (13th - 19th September , 2024). In view of five days weather forecast received from IMD, farmers are advised to withhold application of fertilizers and plant protection chemicals for the time being. Apply balanced and appropriate fertilizers according to crop’s growth stage. Avoid excess nitrogen as it promotes excessive vegetative growth and increase water demand. Always consider an integrated approach of preventive measures together with biological treatment if available to protect the crop from pests. Extensive insecticide use can lead to resistance in the pest. To prevent this, ensure proper rotation between insecticides and use mixtures.",
   "date": "06-09-2024",
   "crops_data": {
      "maize": {
         "advisory": [
            "To manage the fall army worm pest spray biopesticide Beauveria bassiana @ 1200-gram/acre by mixing in 200- litre of water. Use 10-12 bird perches per acre and remove them before tasselling stage. Dust mixture of sand, soil, and wooden ash inside the leaf whorl so that the caterpillars cannot feed on the leaves. To manage the pest chemically, spray Emamectin Benzoate 5 % S.G @ 80-gram/acre or Spinetoram 11.7% S.C @ 100-ml/acre or Chlorantraniliprole 18.5% S.C @ 80-ml/acre by mixing in 200-litre of water."
         ]
      },
      "rice": {
         "advisory": [
            "To manage Blast disease, spray Hexaconazole 5 % SC @ 400-ml/acre or Azoxystrobin 18.2% + Difenoconazole 11.4 % S.C @ 200-ml/acre or Tebuconazole 50%+ Trifloxystrobin 25 % WG @ 80-gram/acre. To manage Leaf Folder and Case Worm pests in paddy spray Bifenthrin 10% EC @ 200 ml/acre or Lambda Cyhalothrin 5% EC @ 200-ml/acre or Fipronil 5% SC @ 400-ml/acre or Chlorantraniliprole 18.5% SC @ 60-ml /acre."
         ]
      },
      "finger millet": {
         "advisory": [
            "Pink stem borer management in finger millet crop: Early transplant the seedlings. Remove and destroy affected bushes. Place 10 light traps and 6 pheromone traps per acre. Plant 8 to 10 'T' shaped sticks per acre so that the birds can sit on them and eat the twigs climbing up the tree. 30 to 40 days after planting, use Trichogramma chilonis card @ 1-2/acre (10000 eggs/ha) at weekly interval for 6 times by splitting each card into 12 pieces at the given perforations. Along with this spray Bacillus thiringenesis @ 400 g/acre or Metarhizium anisopilae @ 500 g/acre. Mix 1 liter of Handi-khata extract in 20 liters of water and spray it once a week. Mix 1 liter of Nimastra with 15 liters of Brahmastra extract in 20 liters of water and spray 30 days after planting, set fire to the bunds. Crush & mix Calotropis leaves (1 kg), neem leaves (1 kg), basang leaves (1 kg), begunia leaves (1 kg) well in 15 liters of water. Then mix 1 liter of cow urine and 50 grams of hing then stir well and cover the drum in such a way that no air can enter the drum. Stir the mixture with a stick every morning and evening. After 7 days sprinkle it on leaves."
         ]
      },
      "cotton": {
         "advisory": [
            "Due to high temperature and humidity, there are reports of incidence of sucking pest like Aphids and Jassids in Cotton crop. Go for regular monitoring of the crop for incidence of pest and diseases. If there is infestation of sucking pest like Aphids and Jassids cotton crop go for spraying of neem-based pesticide (Neem Oil 1500 PPM) @600-ml/acre by mixing it in 200-litre of water. Use yellow sticky trap @ 8/acre. If the sucking pest population found to be above ETL, spray Flonicamid 50% WG @ 60-gram/acre or Thiamethoxam 25% WG @ 40-gram /acre or Dinotefuran 20 % SG @ 80-gram/ acre."
         ]
      },
      "papaya": {
         "advisory": [
            "In prevailing weather condition infestation of Mealy bug may be observed. If symptoms are seen spray neem bases pesticide Azadiractin (1500 ppm) @ 3ml/liter of water at initial stage of infestation. In case of severe infestation spray Profenophos 50% EC @ 20 ml or Thiamethoxam 25 WG @ 2 g or Imidacloprid 17.8% SL @ 3 ml by mixing with 10 liters of water."
         ]
      },
      "brinjal": {
         "advisory": [
            "Brinjal is at flowering to fruiting stage. After receding of rainfall and there is chance of increasing in day & night temperature and morning relative humidity more than 70% favors Shoot and fruit borer in Brinjal. To manage the pest, remove the affected terminal shoot showing bore holes and the affected fruits. To manage this insect, install 8 nos. of pheromone trap having Leucin Lure per acre. Use chemical control if there is 4% withering of terminal shoot or 14% fruits infested with borers. For chemical control spray Emamectin Benzoate 5% SG @ 80-gram/ acre or Chlorantraniliprole 18.5 % SC @80-ml/acre or Spinetoram 11.7 % SC @ 200-ml /acre. There should be a gap of 7-10 days between pesticide application and harvest. Use any of the above insecticides alternately at 15-days interval."
         ]
      },
      "cow": {
         "advisory": [
            "As grasses are high in moisture content during rainy days, the cattle don’t get adequate dry matter from those. So, give 1 kg if concentrate for every 2 kg of milk to dairy animals."
         ]
      },
      "common fish": {
         "advisory": [
            "After stocking of Fingerling, groundnut oil cake and rice bran at 1:1 ratio as feed given @ 5% of their body weight twice a day. Add vitamin and mineral mixture @1% of the total feed given to the fish. Regularly check the pH and water temperature after stocking the fingerling. Add 40 kg of lime per acre to purify the pond water. To increase the amount of plankton in the pond, apply 200 kg of cow dung and 4 kg of superphosphate per acre twice a month."
         ]
      },
      "chicken": {
         "advisory": [
            "Bird flu is a viral disease of poultry. It spreads through contaminated feathers, saliva, droppings of birds. Sometimes it can spread from affected birds to human beings. During this time please clean poultry houses every day and change the feed and water of poultry birds frequently. Don’t throw the dead poultry birds here and there. Please bury them by wearing gloves and masks and sanitize the place with bleaching powder. Don’t bring poultry birds or eggs to home from the affected area."
         ]
      }
   }
}