{
   "weather_details": {
      "2025-02-08": {
         "rainfall": 0.0,
         "t_max": 32,
         "t_min": 16,
         "rh_max": 48,
         "rh_min": 14,
         "wind_speed": 4,
         "wind_direction": 351,
         "cloud_cover": 2
      },
      "2025-02-09": {
         "rainfall": 0.0,
         "t_max": 32,
         "t_min": 15,
         "rh_max": 46,
         "rh_min": 13,
         "wind_speed": 3,
         "wind_direction": 348,
         "cloud_cover": 2
      },
      "2025-02-10": {
         "rainfall": 0.0,
         "t_max": 32,
         "t_min": 14,
         "rh_max": 57,
         "rh_min": 13,
         "wind_speed": 2,
         "wind_direction": 334,
         "cloud_cover": 1
      },
      "2025-02-11": {
         "rainfall": 0.0,
         "t_max": 32,
         "t_min": 14,
         "rh_max": 71,
         "rh_min": 16,
         "wind_speed": 3,
         "wind_direction": 262,
         "cloud_cover": 1
      },
      "2025-02-12": {
         "rainfall": 0.0,
         "t_max": 33,
         "t_min": 14,
         "rh_max": 64,
         "rh_min": 17,
         "wind_speed": 3,
         "wind_direction": 243,
         "cloud_cover": 0
      }
   },
   "names_of_crops": [
      "rice",
      "groundnut",
      "green gram",
      "sunflower",
      "mustard",
      "menacinakahi",
      "chilli",
      "cauliflower",
      "cabbage",
      "brinjal",
      "tomato",
      "marigold",
      "pumpkin",
      "cow",
      "goat",
      "freshwater"
   ],
   "general_advisory": "Provide light irrigation to standing vegetables and crops during morning hours to prevent damage from fog and moisture stress. Due to fog condition, there will be chance of infestation of sucking pests, leaf blight, powdery mildew in the Rabi crops and vegetable. Monitor the crops and vegetables, if symptoms are noticed, undertake appropriate plant protection measures. Carry out weeding, hoeing and other intercultural operations in Rabi vegetables. In Cole crops irrigation should be done at 7-8 Days interval depending upon soil moisture and weather condition.",
   "crops_data": {
      "rice": {
         "advisory": [
            "Farmers those who are going for transplanting should apply 35- kg DAP , 30-kg MOP and 8-kg Urea per acre during last puddling. For sandy soil apply 35 kg DAP , 15 kg MOP  and 8 kg Urea per acre during last puddling. In Zinc deficient soil apply Zinc Sulphate (21%) @ 10 kg/acre at every three years. Transplanting of 25-30 days old seedlings should be done at a spacing of 20 x15 cm, plant 2-3 seedlings per hill for high yielding varieties."
         ]
      },
      "groundnut": {
         "advisory": [
            "To control stem rot in groundnut drench soil with Validamycin 3% L  @ 400-ml/acre or Captan 70 % + Hexaconazole 5 % WP@ 300-gram/acre."
         ]
      },
      "green gram": {
         "advisory": [
            "Apply Quizalfop-ethyl 5% EC or Imazethapyr 10 SL  @ 300 ml/acre mixed with 200 liters of water at 20-25 DAS. Leaf eating caterpillar: The insects usally feed on the tender young leaves. Spray Profenophos 50 EC 400ml per acre mixed with 200 liters of water for its control. Aphid and Whitefly: Prevailing weather condition is favorable for incidence of sucking pest like aphid and white fly . Install yellow sticky traps @ 8nos/acre at vegetative stage to monitor pest population and apply neem oil-based pesticide Azadiractin 0.03% (300 ppm) @ 5ml/ltr of water at initial stage of infestation."
         ]
      },
      "sunflower": {
         "advisory": [
            "Apply half dose of Urea (Inbred-6kg/ac, Hybrid-12kg/ac) + half dose of MOP  (Inbred-10 kg/ac, Hybrid-20 kg/ac) as 2nd top dressing at second irrigation. Sucking pest complex (Aphid, Hopper , Thrips & White fly): Prevailing weather condition favours the development of sucking pests. Need based spray of Acetamiprid 20% SP  @ 50g/acre or Imidacloprid 17.8% SL  @ 60 ml/acre mixed with 200 ltrs of water is recommended. Powdery mildew: Spray 0.2% wettable sulphur @ 2g /ltr of water ."
         ]
      },
      "mustard": {
         "advisory": [
            "There are chances of Aphid infestation in early sown mustard crop. To manage aphids at early stage, put 8 number of yellow sticky traps per acre. Spray Neem based pesticide 1500 PPM @ 600-ml/acre by mixing in 200-litre of water . If the infestation is severe than spray chemical pesticide Thiamethoxam 25 % WG @ 40-gram/acre or Acetamiprid 20 % SP  @ 50-gram/acre in 200-liter of water ."
         ]
      },
      "menacinakahi": {
         "advisory": [
            "To control aphids and thrips in chilli during primary stage of pest infestation spray neem-based pesticide 1500 PPM @ 600-ml/acre by mixing in 200-litre of water . Spray Thiamethoxam 25 % WG @ 40 g/acre or Acetamiprid 20% S.P . @ 50 g /acre or Profenophos 40 % + Fenpyroximate 2.5 % EC @ 400-ml/acre."
         ]
      },
      "chilli": {
         "advisory": [
            "To control aphids and thrips in chilli during primary stage of pest infestation spray neem-based pesticide 1500 PPM @ 600-ml/acre by mixing in 200-litre of water . Spray Thiamethoxam 25 % WG @ 40 g/acre or Acetamiprid 20% S.P . @ 50 g /acre or Profenophos 40 % + Fenpyroximate 2.5 % EC @ 400-ml/acre."
         ]
      },
      "cauliflower": {
         "advisory": [
            "Apply borax @ 4-kg/ acre as soil application during transplanting in Cole crops to prevent Brown rot. If Borax was not applied during transplanting of seedlings than spray Borax @ 2.5-gram/litre or Folibor /Solubor @ 1.5 gram/litre. Spraying of Boron micronutrient should be done after two weeks of transplanting and two weeks before curd formation."
         ]
      },
      "cabbage": {
         "advisory": [
            "There are chances of infestation of Dimond Back Moth in early planted Cole crops. The damage is caused by the larvae that dig tunnels in the leaf tissues or scrap the epidermal leaf tissues of the lower surface of the leaf blade producing typical whitish patches on leaves. To manage this pest, install 6-8 nos of light traps per acre. During primary stage of pest infestation spray neem-based pesticide @ 1-litre/acre by mixing in 200-litre of water . To manage this pest chemically spray Tolfenpyrad 15 % EC @ 400-ml/acre or Flubendiamide 20 % WG @ 20-gram/acre or Emamectin Benzoate 5 % SG @ 80-gram/acre by mixing in 200-litre of water ."
         ]
      },
      "brinjal": {
         "advisory": [
            "To manage whitefly in Brinjal and Tomato crop, use yellow sticky traps @ 8-10/acre to attract and kill the insects. During primary stage of pest infestation spray neem based pesticide 1500 PPM @ 600-ml/acre by mixing in 200-litre of water . To manage this pest chemically spray Thiamethoxam 25 % WG @ 40-gram/acre or Pyriproxifen 10% EC @ 200-ml/acre or Spiromesifen 22.9% SC @ 250-ml/acre by mixing in 200-litre of water ."
         ]
      },
      "tomato": {
         "advisory": [
            "To control fruit borer in Tomato, first collect and destroy the affected fruits and grown up larvae. Set up 20 nos. of pheromone trap having Helilure per acre. Go for spraying of insecticide if there are 10% fruits infested with borer . Spray Chlorantraniliprole 18.5% S.C @ 80 ml/acre or Flubendiamide 39.5 % M/M S.C @ 40 ml/acre or Indoxacarb 14.5% S.C. @ 200 ml/acre. Use any of the above insecticides alternately at 15 days interval."
         ]
      },
      "marigold": {
         "advisory": [
            "To manage Red Spider Mites in flower like Marigold and rose spray wettable sulphur 80 % WP @ 2-gram/litre of water or Propargite 57 % EC @ 2-ml/litre of water or Fenpyroximate 5 % EC @ 2-ml/litre of water ."
         ]
      },
      "pumpkin": {
         "advisory": [
            "To manage fruit fly in cucurbits, prepare a poison bait by mixing 400- gram Jaggery and 8-ml Malathion or DDVP  in 4-litre of water . Keep this mixture in Plastic cups or clay pots @80-nos/acre. The fruit flies will be attracted to this and eventually get killed by falling into the poison baits."
         ]
      },
      "cow": {
         "advisory": [
            "If the animals have not yet been vaccinated against FMD, Haemorrhagic Septicaemia, Black Quarter , Enterotoxemia etc., these must be done. Due care should be taken to store/procure fodder for periods of shortage that may occur during the winter months in certain areas. Perennial grasses must be cut at this time."
         ]
      },
      "goat": {
         "advisory": [
            "TPPR disease also known as ‘Goat Plague’  is common during winter . This viral disease that affects goats and sheep which causes sudden fever , pneumonia and coughing. Affected animals appear restless, have a dull coat, dry muzzle and depressed appetite. Pregnant animals may abort. Vaccinate the animals."
         ]
      },
      "freshwater": {
         "advisory": [
            "During winters, there is a possibility of “EUS” disease in fish. Farmers are advised to apply Cifax @ 400 ml mixed with 40 litre of water in one acre pond area as a preventive measure. The fishes should be fed daily with oil cake bran mixture at the rate of 2-3 % of their total biomass."
         ]
      }
   },
   "date": "07-02-2025"
}