{
   "weather_details": {
      "11-01-2025": {
         "rainfall": 0,
         "t_max": 25,
         "t_min": 12,
         "rh_max": 60,
         "rh_min": 26,
         "wind_speed": 3,
         "wind_direction": 264,
         "cloud_cover": 2
      },
      "12-01-2025": {
         "rainfall": 0,
         "t_max": 26,
         "t_min": 14,
         "rh_max": 53,
         "rh_min": 25,
         "wind_speed": 3,
         "wind_direction": 304,
         "cloud_cover": 3
      },
      "13-01-2025": {
         "rainfall": 0,
         "t_max": 27,
         "t_min": 14,
         "rh_max": 57,
         "rh_min": 28,
         "wind_speed": 2,
         "wind_direction": 321,
         "cloud_cover": 3
      },
      "14-01-2025": {
         "rainfall": 0,
         "t_max": 28,
         "t_min": 14,
         "rh_max": 54,
         "rh_min": 28,
         "wind_speed": 2,
         "wind_direction": 353,
         "cloud_cover": 2
      },
      "15-01-2025": {
         "rainfall": 0,
         "t_max": 28,
         "t_min": 14,
         "rh_max": 52,
         "rh_min": 29,
         "wind_speed": 1,
         "wind_direction": 382,
         "cloud_cover": 3
      }
   },
   "names_of_crops": [
      "paddy",
      "arhar",
      "greengram/blackgram",
      "groundnut",
      "sunflower",
      "onion",
      "cauliflower & cabbage",
      "tomato",
      "chilli",
      "cattle & buffalo",
      "goat & sheep",
      "poultry"
   ],
   "general_advisory": "Keep your crop field free from weed to minimize the incidence of diseases and pests. Apply balanced and appropriate fertilizers according to crop’s growth stage. Regular monitoring of the crop for incidence of pest and diseases should be done and use light trap to monitor insect population so that timely control measure can be taken. Follow the safety measures during application of chemical pesticides and keep leftover pesticides in a safe place out of reach of small children and domestic animals. Always apply the recommended dose of pesticide in the correct method during morning or afternoon hours and pay attention to the wind direction during application.",
   "crops_data": {
      "paddy": {
         "advisory": [
            "Complete the sowing of pre-germinated treated seeds in puddled soil by broadcasting or drum seeder and maintain a thin film of water for proper establishment and early growth of seedlings.",
            "Apply 44 kg of DAP and 22 kg of MOP per acre as basal dose at the time of puddling.",
            "Spray Pyrazosulfuron-ethyl 10%WP (Sathi) @ 80g/acre at 3-5 days after sowing (DAS) in 130 litres of water when there is a thin film of soil moisture or broadcast ready mix Bensulfuron methyl + Pretilachlor granular herbicide mixed with 4 kg of sand."
         ]
      },
      "arhar": {
         "advisory": [
            "Suitable time for harvesting when 2/3rd to 3/4th of the pods have changed to brown colour.",
            "Harvested plant should be left in the field for sun drying for 3-5 days. Threshing may be done either by beating the pods with a stick or by using a Pullman thresher.",
            "The clean seed should be sun-dried for 3-4 days to bring the moisture content at 9-10% for safe and longer storage."
         ]
      },
      "greengram/blackgram": {
         "advisory": [
            "Weed Management: Apply Quizalfop-ethyl 5% EC or Imazethapyr 10 SL @ 300 ml/acre mixed with 200 litres of water at 20-25 DAS.",
            "Pest Management: Leaf eating caterpillar: The insects usually feed on the tender young leaves. Spray Profenophos 50 EC 400ml per acre mixed with 200 litres of water for its control.",
            "Aphid and Whitefly: Prevailing weather condition is favorable for the incidence of sucking pest like aphid and whitefly. Install yellow sticky traps @ 8nos/acre at vegetative stage to monitor pest population and apply neem oil-based pesticide Azadiractin 0.03% (300 ppm) @ 5ml/ltr of water at the initial stage of infestation."
         ]
      },
      "groundnut": {
         "advisory": [
            "Pest Management: Prevailing weather condition favours the development of sucking pest like aphid, jassids, and whitefly. Install yellow sticky trap @ 8nos/acre to monitor the pest population. Apply Neem oil-based pesticide Azadiractin 0.03% (300 ppm) @ 5ml/ltr of water at the initial stage of infestation."
         ]
      },
      "sunflower": {
         "advisory": [
            "Sucking pest complex (Aphid, Hopper, Thrips & White fly): Prevailing weather condition favours the development of sucking pests. Need-based spray of Acetamiprid 20% SP @ 50g/acre or Imidacloprid 17.8% SL @ 60 ml/acre mixed with 200 ltrs of water is recommended.",
            "Powdery mildew: Spray 0.2% wettable sulphur @ 2g/ltr of water.",
            "Capitulum Borer: Spray Bacillus thuringiensis var kurstaki 5% WP @ 1.5 g/ltr of water.",
            "Head Rot: Spray 0.4% Copper oxychloride 50% WP @ 3g/ltr of water."
         ]
      },
      "onion": {
         "advisory": [
            "Irrigate the crop at a regular interval.",
            "Undertake hoeing, weeding and 1st top dressing @ 45 kg urea/acre at 4-week stage of the crop followed by irrigation."
         ]
      },
      "cauliflower & cabbage": {
         "advisory": [
            "Nutrient Management: Go for hoeing, weeding and apply 27 kg urea + 25kg MOP at six-to-seven-week stage followed by irrigation.",
            "Pest Management: Dimond back moth: Spray Fipronil 5% SC @ 2ml/ltr or Chlorpyriphos 20% EC @ 4ml/ltr of water as a control measure.",
            "Tobacco leaf eating caterpillar: Spray Cyantraniliprole 10.26% OD @ 6ml/5 ltr of water to control the pest population.",
            "Cabbage Aphid: Spray Thiamethoxam 25% WG @ 2g/5ltr of water as a control measure."
         ]
      },
      "tomato": {
         "advisory": [
            "Nutrient Management: Complete hoeing, weeding and apply 27 kg urea at six-week stage followed by irrigation",
            "Pest Management: Wilting: In view of high humid condition wilting may occur at this stage. Spray Mancozeb 75% WP @ 2g/ltr of water if symptoms are noticed.",
            "Fruit & Shoot borer: Install pheromone trap @ 8nos/acre to monitor pest population."
         ]
      },
      "chilli": {
         "advisory": [
            "Pest Management: Thrips: Prevailing weather condition is favorable for thrips attack. Install Blue Sticky Trap @ 8nos/acre to control and monitor pest population. Apply neem-based pesticide Azadiractin 1500 ppm @ 3ml/liter of water at the initial stage of infestation. To control chemically apply 3 g Acetamiprid 15% SP or 4 ml Imidacloprid 17.8% SL mixed with 15 liters of water."
         ]
      },
      "cattle & buffalo": {
         "advisory": [
            "As there is lesser heat and humidity in the air, there is a lesser chance of cattle and buffalo falling sick. Farmers must take care to make up for the loss in the body condition score during the lactation phase. It is advised to increase the amount of concentrate in the feed gradually before two months prior to calving. It also helps to increase milk production in the coming lactation."
         ]
      },
      "goat & sheep": {
         "advisory": [
            "As goats are more affected by cold, so goat farmers are advised to prevent their animals from chill wind and floor. If they identify their goats having a running nose and persistent cough, veterinarians must be contacted quickly."
         ]
      },
      "poultry": {
         "advisory": [
            "It is advisable to prevent the poultry birds from severe chill wind and cold floor to check their mortality. Farmers must cover the poultry house with a thick polythene sheet to protect their birds from cold wind and remove them after 9 a.m in the morning to allow sunlight in the shed. Farmers must also be careful regarding litter material on the floor as this helps keep the birds warm and also aids in nutrient recycling."
         ]
      }
   },
   "date": "10-01-2025"
}