{
   "weather_details": {
      "14/08/2024": {
         "rainfall": 5,
         "t_max": 34,
         "t_min": 29,
         "rh_max": 82,
         "rh_min": 63,
         "wind_speed": 23,
         "wind_direction": 202,
         "cloud_cover": 6
      },
      "15/08/2024": {
         "rainfall": 6,
         "t_max": 35,
         "t_min": 29,
         "rh_max": 85,
         "rh_min": 76,
         "wind_speed": 21,
         "wind_direction": 207,
         "cloud_cover": 6
      },
      "16/08/2024": {
         "rainfall": 6,
         "t_max": 34,
         "t_min": 29,
         "rh_max": 85,
         "rh_min": 74,
         "wind_speed": 16,
         "wind_direction": 238,
         "cloud_cover": 7
      },
      "17/08/2024": {
         "rainfall": 7,
         "t_max": 34,
         "t_min": 28,
         "rh_max": 83,
         "rh_min": 59,
         "wind_speed": 20,
         "wind_direction": 225,
         "cloud_cover": 7
      },
      "18/08/2024": {
         "rainfall": 10,
         "t_max": 33,
         "t_min": 27,
         "rh_max": 81,
         "rh_min": 58,
         "wind_speed": 20,
         "wind_direction": 207,
         "cloud_cover": 7
      }
   },
   "names_of_crops": [
      "pulses",
      "maize",
      "vegetables",
      "paddy",
      "arhar",
      "groundnut",
      "chilli",
      "cucurbits",
      "tomato"
   ],
   "general_advisory": "Complete transplanting of rice by first fortnight of August. Regular monitoring of the crop for incidence of pest and diseases should be done and appropriate plant protection measure should be taken. Make arrangements for draining out excess water from the field of Pulses, Maize, Groundnut and vegetables. Farmers are advised to make bund for conserving rainwater in the field. Install yellow sticky trap @ 8 nos./acre to control & monitor sucking pests complex like Aphid, Jassids, Thrips & Whitefly in standing crops like maize, groundnut, and pulses.",
   "crops_data": {
      "pulses": {
         "advisory": [
            "Make arrangements for draining out excess water from the field."
         ]
      },
      "maize": {
         "advisory": [
            "Install yellow sticky trap @ 8 nos./acre to control & monitor sucking pests complex like Aphid, Jassids, Thrips & Whitefly."
         ]
      },
      "vegetables": {
         "advisory": [
            "Make arrangements for draining out excess water from the field."
         ]
      },
      "paddy": {
         "advisory": [
            "If leaf blast is observed in rice field, spray Tebuconazole 50% + Trifloxystrobin 25% WG (Nativo) @ 80 g/acre or Isoprothiolane 40 EC (Sultan/Fujita/Fujione) @ 300 ml/acre by mixing with 200 liters of water. Repeat the spray at 7-10 days interval. There is a chance of infestation of sheath rot and sheath blight in paddy. To manage this disease spray Tebuconazole 50% + Trifloxystrobin 25 % WG (Nativo) @ 80 gram/acre or Propiconazole 25% EC (Tilt/Zerox/Dhan/Bumper) @ 200ml/acre by mixing with 200 liters of water. If BLB is observed, spray Copper oxychloride 50% WP @ 600g/acre by mixing with 200 liters of water."
         ]
      },
      "arhar": {
         "advisory": [
            "Hoeing, weeding followed by earthing up should be completed by the end of this week. Monitor your field regularly for signs of pest infestation. To prevent sucking pests like aphids and thrips, neem-based pesticide (1500 ppm) may be sprayed @ 3ml/ lit of water."
         ]
      },
      "groundnut": {
         "advisory": [
            "Hoeing should be done at 20-25 DAS in groundnut crop. To manage Tikka disease, spray Chlorothalonil 75% WP @ 400g/acre or Mancozeb 75% WP @ 600g/acre or Hexaconazole 5% E.C @ 300ml/acre."
         ]
      },
      "chilli": {
         "advisory": [
            "Keep the field clean. Monitor the crops for any disease and pests. To control Chilli thrips, spray Malathion or Imidacloprid 17.8 SL @ 2 ml/lt. Leaf blight in Chilli can be controlled by spraying carbendazim or Mancozeb fungicides @ 2-3 g/lt."
         ]
      },
      "cucurbits": {
         "advisory": [
            "To manage Fruit fly in cucurbits, prepare a poison bait by mixing 200-gram Jaggery, 4 ripen banana and 2ml Imidacloprid in 4-litre of water. Keep this mixture in Plastic cups or clay pots @ 8-nos/acre. The fruit flies will be attracted to this and eventually get killed by falling into the poison baits. In extreme cases, for chemical control spray Spinosad @ 2.5ml/10 lit."
         ]
      },
      "tomato": {
         "advisory": [
            "August and September are the optimum time for Tomato planting. Grow Tomato verities like Utkal Kumari (BT-10), Utkal Deepti (BT-2), Utkal Raja, Utkal Pragyan, and Swarna Sampad. For one-acre planting 150 to 200 grams of seeds are required."
         ]
      }
   },
   "date": "13-08-2024"
}