{
   "weather_details": {
      "2024-08-14": {
         "rainfall": 5.0,
         "t_max": 36,
         "t_min": 27,
         "rh_max": 89,
         "rh_min": 56,
         "wind_speed": 6,
         "wind_direction": 212,
         "cloud_cover": 6
      },
      "2024-08-15": {
         "rainfall": 4.0,
         "t_max": 36,
         "t_min": 27,
         "rh_max": 87,
         "rh_min": 62,
         "wind_speed": 5,
         "wind_direction": 212,
         "cloud_cover": 7
      },
      "2024-08-16": {
         "rainfall": 5.0,
         "t_max": 37,
         "t_min": 28,
         "rh_max": 90,
         "rh_min": 62,
         "wind_speed": 4,
         "wind_direction": 225,
         "cloud_cover": 7
      },
      "2024-08-17": {
         "rainfall": 6.0,
         "t_max": 37,
         "t_min": 28,
         "rh_max": 92,
         "rh_min": 61,
         "wind_speed": 5,
         "wind_direction": 207,
         "cloud_cover": 7
      },
      "2024-08-18": {
         "rainfall": 10.0,
         "t_max": 36,
         "t_min": 27,
         "rh_max": 88,
         "rh_min": 57,
         "wind_speed": 6,
         "wind_direction": 225,
         "cloud_cover": 6
      }
   },
   "names_of_crops": [
      "rice",
      "maize",
      "cotton",
      "chilli",
      "brinjal",
      "goat",
      "common fish"
   ],
   "general_advisory": "The mean maximum daily temperature was 34.6°C and the mean minimum daily temperature was 25.7°C of the Gajapati district during the last week. The district received 52.3 mm of rainfall during the last week. Based on the forecast received from the IMD, farmers can now resume intercultural operations, fertilization and spraying of plant protection chemical with sticker as required. Considering the realized and anticipated rainfall, farmers are advised to complete the transplanting of paddy by 15th of August. Farmers are advised not to apply fertilizer and herbicides in rice field when there is no sufficient soil moisture. Make arrangements for draining out excess water from the field of Pulses, Maize, Groundnut and vegetables. Due to the prevailing cloudy weather associated with high humidity, regular monitoring for occurrence of insects and diseases in crops is highly recommended. Install light trap in crop fields to monitor insect population so that timely control measure can be taken.",
   "crops_data": {
      "rice": {
         "advisory": [
            "The crop is at active tillering stage. After receding of rain water, the low temperature below 280C and relative humidity more than 70% favours infestation of Swarming caterpillar and Yellow stem borer in rice.",
            "To manage Swarming caterpillar, first removes the weeds from the field and bunds. If crop is in Beushaning stage then complete Beushaning immediately. When the ETL reaches ‚1‛ damaged tiller/hill or ‚2‛ larvae/ M2, spray Chlorpyriphos 50 % + Cypermethrin 5 % E.C @ 400-ml/acre or Quinalphos 20% E.C. + Cypermethrin 3% E.C. @ 400-ml/acre or Lambda Cyhalothrin 5% EC @ 300 ml/acre during afternoon hours.",
            "To manage stem borer in paddy at early stage of crop, apply Cartap Hydrochloride 4 % G @ 8-kg/acre or Chlorantraniliprole 0.4 % GR @ 4-kg/acre or Imidacloprid 0.3% GR @ 6-kg/acre by mixing it with sand at 1:1 ratio."
         ]
      },
      "maize": {
         "advisory": [
            "To manage the fall army worm pest spray biopesticide Beauveria bassiana @ 1200-gram/acre by mixing in 200- litre of water. Use 10-12 bird perches per acre and remove them before tasselling stage. Dust mixture of sand, soil, and wooden ash inside the leaf whorl so that the caterpillars cannot feed on the leaves.",
            "To manage the pest chemically, spray Emamectin Benzoate 5 % S.G @ 80-gram/acre or Spinetoram 11.7% S.C @ 100-ml/acre or Chlorantraniliprole 18.5% S.C @ 80-ml/acre by mixing in 200-litre of water."
         ]
      },
      "cotton": {
         "advisory": [
            "To manage stem weevil in cotton, apply Cartap Hydrochloride 4G @ 8-kg/acre or Chlorantraniliprole 0.4 %G @ 4-kg/acre along with recommended fertilizer during earthing up.",
            "If there is infestation of Aphids and Jassids in early sown cotton crop, go for spraying of neem-based pesticide (Neem Oil 1500 PPM @600-ml/acre by mixing it in 200-litre of water).",
            "Provide adequate drainage channels to avoid water logging in the cotton fields."
         ]
      },
      "chilli": {
         "advisory": [
            "Chilli crop is at seedling stage. High soil moisture & moderate soil temperature (<28°C), high RH, high rainfall and poor drainage during this rainy season may cause damping of f disease.",
            "Drench the soil with Mancozeb @ 3g/ltr or foliar spray with Metalaxyl @ 2g/ltr or Metalaxyl+Mancozeb @ 3g/ltr."
         ]
      },
      "brinjal": {
         "advisory": [
            "Brinjal is at flowering to fruiting stage. After receding of rainfall and there is chance of increasing in day & night temperature and morning relative humidity more than 70% favours Shoot and fruit borer in Brinjal.",
            "To manage the pest, remove the affected terminal shoot showing bore holes and the affected fruits.",
            "To manage this insect, install 8 nos. of pheromone trap having Leucin Lure per acre. Use chemical control if there is 4% withering of terminal shoot or 14% fruits infested with borers.",
            "For chemical control spray Emamectin Benzoate 5% SG @ 80-gram/acre or Chlorantraniliprole 18.5 % SC @80-ml/acre or Spinetoram 11.7 % SC @ 200-ml /acre.",
            "There should be a gap of 7-10 days between pesticide application and harvest. Use any of the above insecticides alternately at 15-days interval."
         ]
      },
      "goat": {
         "advisory": [
            "By using sand over the floor we can keep the floor dry so that the animals are kept free from different diseases.",
            "The specialty of this shed is the floor is made of bricks and cement and sand from river is spread over it by a thickness of 4-6 inches.",
            "The sand soaks the urine so that the animals can sleep over it comfortably.",
            "It is also easier to clean the fecal material over the sand floor.",
            "To keep the sand dry it is stirred upside down in 15-20 days interval.",
            "The floor space requirement for kid is 0.5, for adult 1.2, for buck and pregnant female 2 square meter floor space is necessary which is suitable for every type of shed."
         ]
      },
      "common fish": {
         "advisory": [
            "Carp such as Rohu, Catla and Mrigal, which grow rapidly, should be stocked in a certain ratio of 4:3:3 to increase the benefits.",
            "Generally, a density of 5,000 fingerlings/ha is kept as a standard stocking.",
            "Groundnut oil cake and rice bran is given in the same ratio @ 5% of the total biomass of stocking material.",
            "Cow dung, urea and super phosphate should be applied to increase pond quality.",
            "In 8-10 months, fishes attain their marketable size."
         ]
      }
   },
   "date": "13-08-2024"
}