{
   "weather_details": {
      "18-01-2025": {
         "rainfall": 0,
         "t_max": 28,
         "t_min": 12,
         "rh_max": 64,
         "rh_min": 23,
         "wind_speed": 0,
         "wind_direction": 90,
         "cloud_cover": 3
      },
      "19-01-2025": {
         "rainfall": 0,
         "t_max": 28,
         "t_min": 12,
         "rh_max": 54,
         "rh_min": 20,
         "wind_speed": 2,
         "wind_direction": 323,
         "cloud_cover": 3
      },
      "20-01-2025": {
         "rainfall": 0,
         "t_max": 28,
         "t_min": 12,
         "rh_max": 57,
         "rh_min": 24,
         "wind_speed": 2,
         "wind_direction": 53,
         "cloud_cover": 2
      },
      "21-01-2025": {
         "rainfall": 0,
         "t_max": 28,
         "t_min": 12,
         "rh_max": 51,
         "rh_min": 23,
         "wind_speed": 3,
         "wind_direction": 118,
         "cloud_cover": 3
      },
      "22-01-2025": {
         "rainfall": 0,
         "t_max": 29,
         "t_min": 13,
         "rh_max": 48,
         "rh_min": 24,
         "wind_speed": 3,
         "wind_direction": 100,
         "cloud_cover": 3
      }
   },
   "names_of_crops": [
      "dry season rice",
      "mustard",
      "fruit and vegetable crops",
      "livestock"
   ],
   "general_advisory": "As per the extended range forecast...feed.",
   "crops_data": {
      "dry season rice": {
         "advisory": [
            "To control weeds in nursery, farmers should spray Pyrazosulfuron-ethyl 10% WP @ 80 g/acre at 3-5 days after sowing (DAS) or Bispyribac sodium @ 120 ml/acre at 10-12 DAS (or at 2-3 leaf stage of weeds) in 140 litres of water.",
            "If infestation of seedling blight is noticed, spray Carbendazim @ 400 g/acre or Propiconazole @ 200 g/acre in 200 litres of water.",
            "Transplanting of 3-5 week old seedlings should be advised in well-puddled soil at a spacing of 15 cm × 15 cm with 3-4 seedlings per hill at shallow depth. Apply (DAP 44 kg + MOP 22 kg) or (Urea 22 kg + SSP 125 kg + MOP 22 kg) as basal dose during final puddling."
         ]
      },
      "mustard": {
         "advisory": [
            "Prevailing weather conditions favor Aphid attack in mustard crop so regular monitoring against this insect should be advised.",
            "At present, the attack of this insect is noticed in some farmers' fields so spraying of Acetamiprid @ 125g per 500 liters of water per hectare or Imidacloprid @ 0.5 ml per liter of water should be advised under dry weather conditions.",
            "Insecticide application should be avoided at the initial flowering stage."
         ]
      },
      "fruit and vegetable crops": {
         "advisory": [
            "Wrap or fix polythene/alkathane sheet tightly on mango trees to manage mango mealy bug. Training and pruning of diseased and unwanted branches and leaves should be advised.",
            "Straw can be used as mulching material to maintain soil moisture as well as temperature in the field during the winter season.",
            "Harvesting of matured crops as well as one light irrigation in crops which are in the vegetative growth stage should be advised because dry weather is expected in the upcoming week."
         ]
      },
      "livestock": {
         "advisory": [
            "Cover the animal shelter from all sides during the night in order to avoid direct exposure of animals to cold winds, including dry straw as animal bedding.",
            "Weak and sick animals should be covered with sack cloth to protect them from the cold. At the same time, during the night, all the animals should be kept in a covered shelter.",
            "Avoid keeping animals in a damp area, as well as protect them from smoke from fires which are lit to provide warmth. The dampness and smoke increase their chances of contracting pneumonia.",
            "To maintain the body temperature of animals, they should be fed with a mixture of oil cakes and jaggery, including covering of the body during cold hours. Pregnant animals (>6 months) should be given additional feed."
         ]
      }
   },
   "date": "17-01-2025"
}