{
   "weather_details": {
      "13.01.2025": {
         "rainfall": 0,
         "t_max": 30,
         "t_min": 17,
         "rh_max": 0,
         "rh_min": 0,
         "wind_speed": 0,
         "wind_direction": 0,
         "cloud_cover": 0
      },
      "14.01.2025": {
         "rainfall": 0,
         "t_max": 30,
         "t_min": 17,
         "rh_max": 0,
         "rh_min": 0,
         "wind_speed": 0,
         "wind_direction": 0,
         "cloud_cover": 0
      },
      "15.01.2025": {
         "rainfall": 0,
         "t_max": 31,
         "t_min": 16,
         "rh_max": 0,
         "rh_min": 0,
         "wind_speed": 0,
         "wind_direction": 0,
         "cloud_cover": 0
      },
      "16.01.2025": {
         "rainfall": 0,
         "t_max": 30,
         "t_min": 15,
         "rh_max": 0,
         "rh_min": 0,
         "wind_speed": 0,
         "wind_direction": 0,
         "cloud_cover": 0
      },
      "18.01.2025": {
         "rainfall": 0,
         "t_max": 28,
         "t_min": 14,
         "rh_max": 77,
         "rh_min": 32,
         "wind_speed": 3,
         "wind_direction": 98,
         "cloud_cover": 2
      },
      "19.01.2025": {
         "rainfall": 0,
         "t_max": 28,
         "t_min": 14,
         "rh_max": 74,
         "rh_min": 28,
         "wind_speed": 3,
         "wind_direction": 84,
         "cloud_cover": 3
      },
      "20.01.2025": {
         "rainfall": 0,
         "t_max": 28,
         "t_min": 14,
         "rh_max": 74,
         "rh_min": 29,
         "wind_speed": 3,
         "wind_direction": 78,
         "cloud_cover": 3
      },
      "21.01.2025": {
         "rainfall": 0,
         "t_max": 29,
         "t_min": 13,
         "rh_max": 72,
         "rh_min": 27,
         "wind_speed": 4,
         "wind_direction": 67,
         "cloud_cover": 2
      },
      "22.01.2025": {
         "rainfall": 0,
         "t_max": 29,
         "t_min": 13,
         "rh_max": 71,
         "rh_min": 25,
         "wind_speed": 4,
         "wind_direction": 57,
         "cloud_cover": 2
      }
   },
   "names_of_crops": [
      "rice",
      "groundnut",
      "arhar",
      "greengram/blackgram",
      "green pea",
      "cauliflower/cabbage/broccoli",
      "chilli",
      "tomato"
   ],
   "general_advisory": "No rainfall and dry weather expected during next five days. So, go for irrigation in crop field as per requirement. Before raising any crop go for collection of soil sample and test it in nearby soil testing laboratory. Apply balanced fertilizers in all the crops as per soil test based recommendations mentioned in the soil health card.",
   "crops_data": {
      "rice": {
         "advisory": [
            "Complete the sowing of pre-germinated treated seeds in puddled soil by broadcasting or drum seeder and maintain a thin film of water for proper establishment and early growth of seedlings.",
            "Nutrient Management: Apply 44 kg of DAP and 33 kg of MOP per acre as basal dose at the time of puddling.",
            "Weed Management: Spray Pyrazosulfuron-ethyl 10%WP (Sathi) @ 80g/acre at 3-5 days after sowing (DAS) in 130 litres of water when there is thin film of soil moisture or broadcast ready mix Bensulfuron methyl + Pretilachlor granular herbicide mixed with 4kg of sand."
         ]
      },
      "groundnut": {
         "advisory": [
            "Pest Management: Prevailing weather condition favours the development of sucking pest like aphid, jassids and whitefly. Install yellow sticky trap @ 8nos/acre to monitor the pest population. Apply Neem oil-based pesticide Azadiractin 0.03% (300 ppm) @ 5ml/ltr of water at initial stage of infestation."
         ]
      },
      "arhar": {
         "advisory": [
            "Arhar is at pod filling stage and chances of pod borer infestation in field, to control it spray Chlorpyriphos 20 % EC @ 2 ml/litre of water or Profenophos 50 % EC @ 2 ml/litre of water."
         ]
      },
      "greengram/blackgram": {
         "advisory": [
            "Weed Management: Apply Quizalfop-ethyl 5% EC or Imazethapyr 10 SL @ 300 ml/acre mixed with 200 liters of water at 20-25 DAS.",
            "Pest Management: Leaf eating caterpillar: The insects usually feed on the tender young leaves. Spray Profenophos 50 EC 400ml per acre mixed with 200 liters of water for its control.",
            "Aphid and Whitefly: Prevailing weather condition is favorable for incidence of sucking pest like aphid and white fly. Install yellow sticky traps @ 8nos/acre at vegetative stage to monitor pest population and apply neem oil-based pesticide Azadiractin 0.03% (300 ppm) @ 5ml/ltr of water at initial stage of infestation."
         ]
      },
      "green pea": {
         "advisory": [
            "Complete the sowing of Green pea in the fallow lands. High yielding varieties suitable for Odisha such as Pravat, Uttara and T-163. Use 30 kg seeds/acre with a spacing of 30 x 10 cm.",
            "Before sowing seeds are to be treated with Vitavax Power @ 2.5 g/kg seeds. Apply 30:50:50 kg N-P2O5-K2O per hectare during final land preparation."
         ]
      },
      "cauliflower/cabbage/broccoli": {
         "advisory": [
            "Nutrient Management: At three-week stage, undertake hoeing, weeding and apply Urea @ 55kg/ac followed by irrigation.",
            "Go for hoeing, weeding and apply 27 kg urea + 25kg MOP at six-to-seven-week stage followed by irrigation.",
            "Pest Management: Dimond back moth: Spray Fipronil 5% SC @ 2ml/ltr or Chlorpyriphos 20% EC @ 4ml/ltr of water as control measure.",
            "Tobacco leaf eating caterpillar: Spray Cyantraniliprole 10.26% OD @ 6ml/5 ltr of water to control pest population.",
            "Cabbage Aphid: Spray Thiamethoxam 25% WG @ 2g/5ltr of water as control measure."
         ]
      },
      "chilli": {
         "advisory": [
            "Pest Management: Thrips: Prevailing weather condition is favorable for thrips attack. Install Blue Sticky Trap @ 8nos/acre to control and monitor pest population. Apply neem-based pesticide Azadiractin 1500 ppm @ 3ml/liter of water at initial stage of infestation. To control chemically apply 3 g Acetamiprid 15% SP or 4 ml Imidacloprid 17.8% SL mixed with 15 liters of water."
         ]
      },
      "tomato": {
         "advisory": [
            "Pest Management: Wilting: In view of high humid condition wilting may occur at this stage. Spray Mancozeb 75% WP @ 2g/ltr of water if symptom is noticed.",
            "Fruit & Shoot borer: Install pheromone trap @ 8nos/acre to monitor pest population."
         ]
      }
   },
   "date": "17-01-2025"
}