{
   "weather_details": {
      "2024-12-18": {
         "rainfall": 0,
         "t_max": 30,
         "t_min": 15,
         "rh_max": 78,
         "rh_min": 42,
         "wind_speed": 4,
         "wind_direction": 17,
         "cloud_cover": 7
      },
      "2024-12-19": {
         "rainfall": 6,
         "t_max": 29,
         "t_min": 16,
         "rh_max": 92,
         "rh_min": 58,
         "wind_speed": 5,
         "wind_direction": 45,
         "cloud_cover": 8
      },
      "2024-12-20": {
         "rainfall": 8,
         "t_max": 30,
         "t_min": 17,
         "rh_max": 90,
         "rh_min": 67,
         "wind_speed": 5,
         "wind_direction": 51,
         "cloud_cover": 8
      },
      "2024-12-21": {
         "rainfall": 11,
         "t_max": 29,
         "t_min": 17,
         "rh_max": 96,
         "rh_min": 67,
         "wind_speed": 3,
         "wind_direction": 27,
         "cloud_cover": 7
      },
      "2024-12-22": {
         "rainfall": 5,
         "t_max": 29,
         "t_min": 17,
         "rh_max": 92,
         "rh_min": 52,
         "wind_speed": 4,
         "wind_direction": 20,
         "cloud_cover": 5
      }
   },
   "names_of_crops": [
      "rice",
      "cotton",
      "mustard",
      "menacinakahi",
      "chilli",
      "tomato",
      "onion",
      "cow",
      "goat",
      "common fish"
   ],
   "general_advisory": "The mean maximum daily temperature was 30.7°C and the mean minimum daily temperature was 16.3°C of the Gajapati district during the last week. The district received 0.0 mm of rainfall during the last week. Due to low night temperature and fog condition, there will be chance of infestation of sucking pests, leaf blight, powdery mildew in the Rabi crops and vegetables. Monitor the crops and vegetables, if symptoms are noticed, undertake appropriate plant protection measures. Carry out weeding, hoeing and other intercultural operations in Rabi vegetables...",
   "crops_data": {
      "rice": {
         "advisory": [
            "Soon after noticing the infestation of the stored grain insect pest, take up fumigation by using Aluminium phosphide (do not use in dwelling houses) tablets @ of 3 tablets/ ton grain (total 9 g of tablets) in fairly air tight containers or by covering with thick tarpaulin leaving no gaps..."
         ]
      },
      "cotton": {
         "advisory": [
            "Farmers are advised to go for picking cotton on sunny days after 9 AM or when dew dries up from the crop surface. Pick the seed cotton in cloth bag or plastic basket. Remove the dry leaves and other plant part from the seed cotton. First picking, second picking and third picking seed cotton separately..."
         ]
      },
      "mustard": {
         "advisory": [
            "There are chances of Aphid infestation in early sown mustard crop. To manage aphids at early stage, put 8 number of yellow sticky traps per acre. Spray Neem based pesticide 1500 PPM @ 600-ml/acre by mixing in 200-litre of water..."
         ]
      },
      "menacinakahi": {
         "advisory": [
            "To control aphids and thrips in chilli during primary stage of pest infestation spray neem-based pesticide 1500 PPM @ 600-ml/acre by mixing in 200-litre of water..."
         ]
      },
      "chilli": {
         "advisory": [
            "To control aphids and thrips in chilli during primary stage of pest infestation spray neem-based pesticide 1500 PPM @ 600-ml/acre by mixing in 200-litre of water..."
         ]
      },
      "tomato": {
         "advisory": [
            "To control fruit borer in Tomato, first collect and destroy the affected fruits and grown up larvae. Set up 20 nos. of pheromone trap having Helilure per acre. Go for spraying of insecticide if there are 10% fruits infested with borer..."
         ]
      },
      "onion": {
         "advisory": [
            "To prevent Damping of f disease in nursery, drench the nursery bed with Carbendazim @ 2 g/litre of water at 15 days interval. Seedlings of 8-weeks old are planted in the main field..."
         ]
      },
      "cow": {
         "advisory": [
            "Provide proper shelter to the animals with proper ventilation facilities. Floor should be clean, dry and bedding with straw which act as insulation and prevention of heat loss. In winter season animal required high amount of food as temperature drops. Roughage should be given high amount to maintain the milk production. Maize, wheat and concentrate oil cakes @ 3 kg to the large animals such as Buffalo and cattle feedling helps in maintaining the body heat of the animals..."
         ]
      },
      "goat": {
         "advisory": [
            "PPR disease also known as ‘Goat Plague’ is common during winter. This viral disease that affects goats and sheep which causes sudden fever, pneumonia and coughing. Affected animals appear restless, have a dull coat, dry muzzle and depressed appetite. Pregnant animals may abort. Vaccinate the animals..."
         ]
      },
      "common fish": {
         "advisory": [
            "During winters, there is a possibility of “EUS” disease in fish. Farmers are advised to apply Cifax @ 400 ml mixed with 40 litre of water in one acre pond area as a preventive measure. The fishes should be fed daily with oil cake bran mixture at the rate of 2-3 % of their total biomass..."
         ]
      }
   },
   "date": "17-12-2024"
}