{
   "weather_details": {
      "18-10-2024": {
         "rainfall": 0,
         "t_max": 35,
         "t_min": 23,
         "rh_max": 91,
         "rh_min": 53,
         "wind_speed": 4,
         "wind_direction": 84,
         "cloud_cover": 4
      },
      "19-10-2024": {
         "rainfall": 2,
         "t_max": 35,
         "t_min": 24,
         "rh_max": 55,
         "rh_min": 55,
         "wind_speed": 4,
         "wind_direction": 68,
         "cloud_cover": 6
      },
      "20-10-2024": {
         "rainfall": 2,
         "t_max": 35,
         "t_min": 24,
         "rh_max": 55,
         "rh_min": 55,
         "wind_speed": 4,
         "wind_direction": 70,
         "cloud_cover": 6
      },
      "21-10-2024": {
         "rainfall": 2,
         "t_max": 34,
         "t_min": 23,
         "rh_max": 52,
         "rh_min": 52,
         "wind_speed": 4,
         "wind_direction": 36,
         "cloud_cover": 6
      },
      "22-10-2024": {
         "rainfall": 0,
         "t_max": 34,
         "t_min": 23,
         "rh_max": 40,
         "rh_min": 40,
         "wind_speed": 3,
         "wind_direction": 17,
         "cloud_cover": 5
      }
   },
   "names_of_crops": [
      "rice",
      "cotton",
      "okra",
      "cole crop",
      "mango",
      "cow/buffalo"
   ],
   "general_advisory": "Dry weather condition is expected in upcoming days, so farmers are advised to conduct agricultural operation (irrigation, spraying, intercultural operation etc.) during that period. Sowing of green fodder should be advised to avail proper diet to animals. Farmers should start nursery sowing and planting of Cole crops and other winter season vegetable. Deworming and vaccination against Foot and Mouth Disease and Brucellosis should be advised in animals.",
   "crops_data": {
      "rice": {
         "advisory": [
            "Farmers should maintain adequate moisture in rice field by applying irrigation because there is very less chance of rainfall in upcoming days.",
            "To control gall midge attack in rice field, farmers should spray recommended insecticides."
         ]
      },
      "cotton": {
         "advisory": [
            "To control bollworm complex in cotton crop, farmers are advised to spray recommended insecticides."
         ]
      },
      "okra": {
         "advisory": [
            "To control Fruit and shoot borer in Okra, spraying of Neem based pesticides should be advised."
         ]
      },
      "cole crop": {
         "advisory": [
            "Nursery bed preparation and seed sowing/planting details should be followed as advised."
         ]
      },
      "mango": {
         "advisory": [
            "Pruning and cleaning of Mango orchard should be advised.",
            "In case of insect attack in Mango orchard, spraying of recommended insecticides should be advised."
         ]
      },
      "cow/buffalo": {
         "advisory": [
            "Preventive measures for Foot and Mouth Disease in Cow and Buffalo should be followed as advised."
         ]
      }
   },
   "date": "18-10-2024"
}