{
   "weather_details": {
      "2024-07-20": {
         "rainfall": 20,
         "t_max": 31,
         "t_min": 25,
         "rh_max": 90,
         "rh_min": 65,
         "wind_speed": 15,
         "wind_direction": 72,
         "cloud_cover": 8
      },
      "2024-07-21": {
         "rainfall": 15,
         "t_max": 32,
         "t_min": 25,
         "rh_max": 91,
         "rh_min": 62,
         "wind_speed": 12,
         "wind_direction": 112,
         "cloud_cover": 8
      },
      "2024-07-22": {
         "rainfall": 10,
         "t_max": 33,
         "t_min": 25,
         "rh_max": 86,
         "rh_min": 58,
         "wind_speed": 10,
         "wind_direction": 158,
         "cloud_cover": 7
      },
      "2024-07-23": {
         "rainfall": 15,
         "t_max": 33,
         "t_min": 26,
         "rh_max": 82,
         "rh_min": 60,
         "wind_speed": 14,
         "wind_direction": 238,
         "cloud_cover": 7
      },
      "2024-07-24": {
         "rainfall": 10,
         "t_max": 32,
         "t_min": 26,
         "rh_max": 83,
         "rh_min": 61,
         "wind_speed": 20,
         "wind_direction": 248,
         "cloud_cover": 8
      }
   },
   "names_of_crops": [
      "rice",
      "groundnut",
      "maize",
      "pigeon pea",
      "okra",
      "brinjal",
      "goat",
      "fresh water carp"
   ],
   "general_advisory": "For one-acre area of paddy transplanting 400 m2 (10 Decimal) size of land is required for nursery raising. Before sowing, paddy seeds should be treated with Trichoderma powder formulation@10g/kg of seeds or any other seed treating chemicals like Thiram 75% @ 3 gm or Captan 50% @ 3 gm per kg of seeds procured from the Government approved agencies. Go for non-paddy crops in the upland to avoid terminal drought. Intercropping of cereals+pulses/oilseeds is recommended. Go for early sowing/transplanting as for as possible to complete these by mid-August. Go for medium duration rice varieties in medium land. Go for line sowing of rice followed by early beaushaning and weeding. This will avoid the rainfall required for transplanting, and over -aged seedlings if transplanted late. Drain out excess moisture from the non-paddy crops, make proper drainage channel and keep the channel open.",
   "crops_data": {
      "rice": {
         "advisory": [
            "In assured irrigated areas select the land for wet bed nursery close to source of irrigation water with good drainage facilities. It is advisable to follow community nursery approach at village level. Divide nursery area into smaller plots of 1.5-metre-long, 10 cm height and convenient length. Irrigation channels of size 30 cm in width should be made along the beds for irrigation/drainage. Sprouted Seeds should be sown @ 40-50 g/ m2 area of seed bed by line sowing with 5 cm gap between each line or direct broadcasting and put dried compost over seeds.",
            "Upland rice varieties (Matures in 100-120 days) like Khandagiri, Sahabhagi Dhan, DRR-42, DRR-44, DRR-46, Mandakini, Naveen, GB-1, Bina-1 1, MTU-1010, Satyabhama etc. can be cultivated. Medium land rice varieties (Matures in 120-140 days) like MTU 1 156, MTU 1 153, CR Dhan 310, RGL 2538, Lalat, Improved Lalat, Manaswini, MTU-1001, Sampada, Gitanjali, Nua acharmati etc can be cultivated.Low land rice varieties (Matures >140 days) like Pratikshya, Swarna, Swarna Sub-1, RGL-2537, MTU-1075, Mrinalini, Hashanta, Rani Dhan, CR 1009, CR 1009 Sub-1, DRR 50, Pooja, MTU-1064, CR-1018, Sarala, Dur ga, Pradhan Dhan, Nua Kalajeera, Nua chinikamini, CR Sungadhi Dhan-907 etc can be cultivated. Before sowing, seed treatment can be done with Carbendazim 50 % WP @ 2- gram/ kg of seeds or Carboxin 37.5 % + Thiram 37.5% D.S WP or thiram 75 % WS @ 3 gm/kg of seeds. In broadcasted paddy cultivation, spray post-emer gence herbicide like Bispyribac Sodium @ 80- ml/ acre or tank mix of Fenoxaprop- p-ethyl 9.3 % W/W  EC+ Ethoxysulfuron 15 % WDG @ 250 ml + 50-g /acre at 15-20 DAS in moist soil (When the weeds are at 3-4 leaf stage) by mixing in 200 litres of water . In case of transplanted rice, complete the transplanting of rice as soon as possible. 21 days old seedlings are ideal for transplanting. For control of weed in paddy use pre-emer gence herbicide Pretilachlor 37 % EW @ 600-ml/acre or Oxadiar gyl 80%W . P @ 50-gm/acre or Pyrazosulfuron Ethyl 10% W.P @ 80-gm/acre at 1-3 (Days After Transplanting) DA T."
         ]
      },
      "groundnut": {
         "advisory": [
            "In groundnut, apply well powdered Gypsum @ 100 kg/acre and incorporate into the soil along with the basal fertilizers, this will improve number of pods and pod filling. If pre-emer gence herbicide is not applied during sowing than to manage weeds in Groundnut crop post emer gence application of herbicide like Imazethapyr 10 % SL  @ 300-ml/acre or Quizalofop-Ethyl 5 % EC @ 400-ml/acre should be applied at 15-DAS by mixing it in 200 litre of water . For better peg formation in groundnut crop hoeing and earthing up should be done at 20-25 DAS."
         ]
      },
      "maize": {
         "advisory": [
            "Seed rate for maize is 6-7kg/acre.T o avoid the infestation of Fall Army Worm, treat 1-kg seeds with 4-ml Cyantraniliprole19.8%+ Thiamethoxam 19.8% FS. Keep row to row spacing at 60 cm and plant to plant at 20 cm. To maintain optimum plant population, use seed drill for sowing or sow the seeds behind the plough. Apply 55 kg of DAP  and 22-kg of potash as basal fertilizer . For chemical control of weeds in Maize, spray Atrazine 50 % W.P herbicide @ 800 g /acre by mixing it in 200 litres of water within 1-2 DAS."
         ]
      },
      "pigeon pea": {
         "advisory": [
            "Some improved varieties of Arhar are PRG-235, PRG 176, VL ARHAR-1, T- Arhar etc. For line sowing the recommended seed rate for early maturing varieties is 8 kg whereas for late maturing varieties it is 6 kg. Land should be ploughed 3-4 times by cultivator to get fine tilth followed by land levelling. Apply 2 tonne of well decomposed FYM during final land preparation. Seed treatment can be done with Carbendazim 50 % WP @ 2- gram/ kg of seeds or Carboxin 37.5 % + Thiram 37.5% D.S WP. Treat the seeds with recommended species of Rhizobium bacterial culture @ 20 gram/kg of seeds before 1 hour of sowing. The gap between chemical seed treatment and Rhizobium treatment should be at least 7 days."
         ]
      },
      "okra": {
         "advisory": [
            "The seed rate for HYV  okra is 4 -kg/acre whereas for hybrid the seed rate is 1.5 kg/acre. For providing resistance against infestation of sucking pests at early stage of crop, treat the seed with imidacloprid."
         ]
      },
      "brinjal": {
         "advisory": [
            "For cultivation of an acre of brinjal crop 200g of improved variety and 80g of hybrid seed is required.Some important varieties of Brinjal are Utkal tarini, Utkal Madhuri, Safed moti, VNR Long Purple, Akshita, VNR B5, Vairabi, Borigumma round etc. Ten days before sowing in the nursery bed 20kg of completely decomposed FYM should be well mixed with the soil. Seed treatment can be done with Carbendazim 50 % WP @ 2g/ kg of seeds or Carboxin 37.5 % + Thiram 37.5% D.S WP @ 3-gm/kg of seeds. After about 6 hours of seed treatment sow the seeds at 2.5 x 5cm at a depth of .1cm. After sowing, drench the soil with a mixture of 2-g Carbendazim. Cover the nursery bed with paddy straw or dried leaves for better germination. Dust Chlorpyriphos powder around the nursery bed to avoid the ants. 4 weeks old seedlings should be transplanted in the main field."
         ]
      },
      "goat": {
         "advisory": [
            "By using sand over the floor we can keep the floor dry so that the animals are kept free from dif ferent diseases. The speciality of this shed is the floor is made of bricks and cement and sand from river is spread over it by a thickness of 4-6 inches. The sand soaks the urine so that the animals can sleep over it comfortably . It is also easier to clean the faecal material over the sand floor . To keep the sand dry it is stirred upside down in 15-20 days interval. The floor space requirement for kid is 0.5, for adult 1.2, for buck and pregnant female 2 square metre floor space is necessary which is suitable for every type of shed."
         ]
      },
      "fresh water carp": {
         "advisory": [
            "Carp such as Rohu, Catla and Mrigal, which grow rapidly , should be stocked in a certain ratio of 4:3:3 to increase the benefits. Generally , a density of 5,000 fingerlings/ha is kept as a standard stocking. Groundnut oil cake and rice bran is given in same ratio @ 5% of the total biomass of stocking material. Cow dung, urea and super phosphate should be applied to increase pond quality . In 8-10 months, fishes attain their marketable size."
         ]
      }
   },
   "date": "19-07-2024"
}