{
   "weather_details": {
      "20-07-2024": {
         "rainfall": 10,
         "t_max": 31,
         "t_min": 24,
         "rh_max": 87,
         "rh_min": 46,
         "wind_speed": 10,
         "wind_direction": 63,
         "cloud_cover": 7
      },
      "21-07-2024": {
         "rainfall": 15,
         "t_max": 31,
         "t_min": 24,
         "rh_max": 83,
         "rh_min": 49,
         "wind_speed": 11,
         "wind_direction": 202,
         "cloud_cover": 7
      },
      "22-07-2024": {
         "rainfall": 10,
         "t_max": 32,
         "t_min": 25,
         "rh_max": 81,
         "rh_min": 57,
         "wind_speed": 17,
         "wind_direction": 238,
         "cloud_cover": 7
      },
      "23-07-2024": {
         "rainfall": 5,
         "t_max": 32,
         "t_min": 25,
         "rh_max": 80,
         "rh_min": 63,
         "wind_speed": 22,
         "wind_direction": 248,
         "cloud_cover": 6
      },
      "24-07-2024": {
         "rainfall": 5,
         "t_max": 33,
         "t_min": 26,
         "rh_max": 78,
         "rh_min": 55,
         "wind_speed": 23,
         "wind_direction": 248,
         "cloud_cover": 6
      }
   },
   "names_of_crops": [
      "rice",
      "maize",
      "vegetable crops",
      "animal husbandry"
   ],
   "general_advisory": "As there is a chance of occurrence of light to moderate rainfall along with heavy rainfall in one or two places in upcoming days, farmers are advised to avoid irrigation as well as spraying operation during that period and should wait some days for transplanting of rice and planting of fruit and vegetable crops. Looking to the high wind speed condition make provision to support the crops.",
   "crops_data": {
      "rice": {
         "advisory": [
            "Nursery sowing should be completed by end of 2nd fortnight of July.",
            "Main field land preparation should be done by puddling the field twice at 7-10 days intervals and land leveling for uniform crop stand."
         ]
      },
      "maize": {
         "advisory": [
            "The ideal sowing time is June 20 to end of July for kharif maize.",
            "About 8 kg of seed per acre should be used. Before sowing seeds should be treated with fungicides and insecticides before sowing to protect it from seed and soil borne diseases and some insect-pests."
         ]
      },
      "vegetable crops": {
         "advisory": [
            "Farmers should start raised bed nursery preparation for kharif vegetable crops with proper drainage system to avoid water logging."
         ]
      },
      "animal husbandry": {
         "advisory": [
            "Deworming and vaccination of animals against some infectious diseases should be ensured because with decrease in temperature and increase in humidity during the rainy season, there is an increase in the number of mosquitoes, flies, and various microorganisms."
         ]
      }
   },
   "date": "19-07-2024"
}