{
   "weather_details": {
      "2024-11-20": {
         "rainfall": 0,
         "t_max": 27,
         "t_min": 15,
         "rh_max": 75,
         "rh_min": 42,
         "wind_speed": 4,
         "wind_direction": 326,
         "cloud_cover": 0
      },
      "2024-11-21": {
         "rainfall": 0,
         "t_max": 27,
         "t_min": 15,
         "rh_max": 74,
         "rh_min": 41,
         "wind_speed": 4,
         "wind_direction": 319,
         "cloud_cover": 1
      },
      "2024-11-22": {
         "rainfall": 0,
         "t_max": 27,
         "t_min": 15,
         "rh_max": 73,
         "rh_min": 39,
         "wind_speed": 3,
         "wind_direction": 328,
         "cloud_cover": 0
      },
      "2024-11-23": {
         "rainfall": 0,
         "t_max": 27,
         "t_min": 15,
         "rh_max": 73,
         "rh_min": 38,
         "wind_speed": 3,
         "wind_direction": 320,
         "cloud_cover": 1
      },
      "2024-11-24": {
         "rainfall": 0,
         "t_max": 26,
         "t_min": 14,
         "rh_max": 66,
         "rh_min": 35,
         "wind_speed": 3,
         "wind_direction": 328,
         "cloud_cover": 0
      }
   },
   "names_of_crops": [
      "rice",
      "amaranth",
      "tomato",
      "cabbage",
      "cauliflower",
      "brinjal",
      "okra/ladyfinger",
      "onion",
      "cow",
      "fresh water"
   ],
   "general_advisory": "Drain out the water from paddy field, 15 days before harvesting of the crop. Harvest the rice crop at physiological maturity (85% grains matured in a panicle) and looks pale yellow in colour. Harvest the crop by leaving one metre from the bund if grain is to be kept for seed purpose. Dry the harvested paddy grains in direct sunlight for 2-3 days to get the moisture content at 14%. For seed purpose the grain should be dried to below 12% moisture content.",
   "crops_data": {
      "rice": {
         "advisory": [
            "The transplanted paddy is at hard dough to harvesting (thirteen to seventeen week) stage. The direct seeded rice crop is at harvesting stage. Drain out water from the crop field at maturity stage. Keep the harvested paddy by covering or carry to covered threshing floor. Cut Worm: Spray Chloropyriphos 50% + Cypermethrin 5% E.C. @ 400 ml or Profenophos 50% E.C. @ 400 ml per acre per 200 ltr of water in afternoon hour. Brown Plant Hopper: BPH may be seen in the prevailing weather conditions. To Manage BPH in rice fields make alley paths after every 8-10 rows, spraying of Buprofezin+Acephate @ 30 gram or Dinotefuran @ 5 gram per 15 litres of water can be beneficial."
         ]
      },
      "amaranth": {
         "advisory": [
            "October to March is suitable for greens amaranth. Amaranth are of two types- White or Red. Use 3 kg seeds/acre. Layout 5 ft long beds of 4 ft wide with bunds. Pulverise the beds, remove the weeds and apply 1 to 2 baskets of FYM/ bed. Because of small size seeds, mix some coarse sands with the seeds for easy and uniform sowing. After sowing cover the seeds with thin layer of soil and cover it with straw followed by light irrigation. Remove the straw after emergence."
         ]
      },
      "tomato": {
         "advisory": [
            "The tomato seedlings in nursery are one to three week stage. Drench the seed bed with streptocycline 0.1g with carbendazim 1g mixing in one litre water to protect seedlings from damping off. Prepare main field for transplanting tomato seedlings when they become 3-4 week old in nursery. After final land preparation of the main field, rings or mounds should be prepared at spacing of 60cm from row to row and 45cm from plant to plant within the row for tomato. Basal dose of 52kg DAP, 7kg Urea and 66kg MOP should be applied per acre crop area before transplanting seedlings to mounds."
         ]
      },
      "cabbage": {
         "advisory": [
            "The cabbage seedlings in nursery are germination to two week stage. Drench the seed bed with streptocycline 0.1g with carbendazim 1g mixing in one litre water to protect seedlings from damping off. Go for preparing main field for transplanting cabbage at 3-4 week stage of seedling."
         ]
      },
      "cauliflower": {
         "advisory": [
            "The cauliflower seedlings in nursery are germination to two week stage. Drench the seed bed with streptocycline 0.1g with carbendazim 1g mixing in one litre water to protect seedlings from damping off. Go for preparing main field for transplanting cabbage at 3-4 week stage of seedling."
         ]
      },
      "brinjal": {
         "advisory": [
            "To control Phomopsis Blight disease in Brinjal spray Metalaxyl 8%+ Mancozeb 64 % WP @ 400 gram/acre or Propineb 70 % WP @ 400-gram/acre."
         ]
      },
      "okra/ladyfinger": {
         "advisory": [
            "To manage sucking pest like aphids, Jassids, thrips and whiteflies in Okra spray neem-based pesticide (Neem Oil 1500 PPM Azadiractin @600-ml/acre by mixing it in 200-liter of water or install 8-10 Nos of Yellow sticky traps per acre to control the pest. Spray Thiamethoxam 25 % WG @ 40-gram/acre or Acetamiprid 20 % SP @ 50-gram/acre or Fenobucarb @ 400-ml/acre or Tolfenpyrad 15 % EC @ 400-ml/acre by mixing it in 200-liter of water when infestation is severe."
         ]
      },
      "onion": {
         "advisory": [
            "Before sowing, seed treatment should be done with Carbendazim 50% WP @ 2g/ per kg of seeds or Carboxin 37.5 % + Thiram 37.5% D.S @ 3g/ kg of seeds. To prevent Damping off disease in nursery, drench the nursery bed with Carbendazim @ 2-gram/liter of water at 15 days interval. Seedlings of 8 weeks old are planted in the main field."
         ]
      },
      "cow": {
         "advisory": [
            "Animals should be given mineral mixture along with salt regularly and wheat grains, jaggery etc. may be provided @ 10%-20% in the daily ration during winter season to meet the energy requirement of the animals."
         ]
      },
      "fresh water": {
         "advisory": [
            "During winters, various fungal, bacterial and parasitic diseases may appear in the fish. Treat the pond with CIFAX @ 400 ml/acre just before the onset of winters. Also treat the pond with potassium permanganate @ 1-2 kg/acre or limestone @ 50-100 kg/acre. Salt application @ 100 kg/acre also helps in protecting fish against disease outbreak during winters."
         ]
      }
   },
   "date": "19-11-2024"
}