{
   "weather_details": {
      "21-09-2024": {
         "rainfall": 2,
         "t_max": 34,
         "t_min": 26,
         "rh_max": 55,
         "rh_min": 84,
         "wind_speed": 4,
         "wind_direction": 165,
         "cloud_cover": 5
      },
      "22-09-2024": {
         "rainfall": 2,
         "t_max": 35,
         "t_min": 26,
         "rh_max": 52,
         "rh_min": 83,
         "wind_speed": 5,
         "wind_direction": 150,
         "cloud_cover": 5
      },
      "23-09-2024": {
         "rainfall": 5,
         "t_max": 35,
         "t_min": 26,
         "rh_max": 55,
         "rh_min": 83,
         "wind_speed": 5,
         "wind_direction": 150,
         "cloud_cover": 7
      },
      "24-09-2024": {
         "rainfall": 7,
         "t_max": 34,
         "t_min": 25,
         "rh_max": 56,
         "rh_min": 84,
         "wind_speed": 6,
         "wind_direction": 108,
         "cloud_cover": 7
      },
      "25-09-2024": {
         "rainfall": 10,
         "t_max": 32,
         "t_min": 24,
         "rh_max": 52,
         "rh_min": 90,
         "wind_speed": 8,
         "wind_direction": 103,
         "cloud_cover": 7
      }
   },
   "names_of_crops": [
      "rice",
      "cotton",
      "vegetable crops",
      "cow/buffalo"
   ],
   "general_advisory": "Need based irrigation is applied in field in case of no rainfall condition. Make provision for good drainage system in fruit orchard and vegetable field. Prevailing weather condition is favorable for mealy bug attack in all types of crops so its regular monitoring should be advised. Farmers should avoid excess use of nitrogenous fertilizer at crop because it may extend the vegetative growth period and also attract various insect pests.",
   "crops_data": {
      "rice": {
         "advisory": [
            "Farmers should maintain 5 cm water level in rice field for proper growth.",
            "Disease Management: Bacterial leaf blight attack is also observed, so spraying of Copper Oxychloride and Streptocycline is advised under clear and calm weather.",
            "Pest Management: Case worm attack is observed, farmers are advised to spray Fipronil or Profenofos under clear weather. Previous weather condition was favorable for gall midge attack in rice field for which control measures are advised."
         ]
      },
      "cotton": {
         "advisory": [
            "To control flower drop in cotton crop, application of Planofix is advised after a certain period after sowing.",
            "To control sucking insect pest attack, Neem based pesticide application is advised at a specific crop stage.",
            "At the initial stage of flowering, avoid any chemical application in cotton crop."
         ]
      },
      "vegetable crops": {
         "advisory": [
            "To control Fruit and shoot borer in Brinjal, Tomato, Okra etc., spraying of Neem based pesticide is advised at initial stages.",
            "If sucking insect pest attack is noticed, then spraying of specific pesticides is advised.",
            "For controlling diseases like wilt, root rot, etc., specific fungicides should be used."
         ]
      },
      "cow/buffalo": {
         "advisory": [
            "Mastitis disease prevention and control measures are advised including sanitation, preventing wet floor surface, and ensuring fresh water availability.",
            "Consult the doctor from a nearby animal health center in severe cases."
         ]
      }
   },
   "date": "20-09-2024"
}