{
   "weather_details": {
      "21-09-2024": {
         "rainfall": 2,
         "t_max": 37,
         "t_min": 26,
         "rh_max": 56,
         "rh_min": 87,
         "wind_speed": 3,
         "wind_direction": 165,
         "cloud_cover": 5
      },
      "22-09-2024": {
         "rainfall": 4,
         "t_max": 36,
         "t_min": 26,
         "rh_max": 55,
         "rh_min": 84,
         "wind_speed": 4,
         "wind_direction": 150,
         "cloud_cover": 5
      },
      "23-09-2024": {
         "rainfall": 5,
         "t_max": 36,
         "t_min": 26,
         "rh_max": 58,
         "rh_min": 88,
         "wind_speed": 5,
         "wind_direction": 150,
         "cloud_cover": 7
      },
      "24-09-2024": {
         "rainfall": 10,
         "t_max": 35,
         "t_min": 27,
         "rh_max": 59,
         "rh_min": 91,
         "wind_speed": 6,
         "wind_direction": 108,
         "cloud_cover": 7
      },
      "25-09-2024": {
         "rainfall": 10,
         "t_max": 35,
         "t_min": 27,
         "rh_max": 57,
         "rh_min": 95,
         "wind_speed": 8,
         "wind_direction": 103,
         "cloud_cover": 7
      }
   },
   "names_of_crops": [
      "rice",
      "cotton",
      "vegetable crops",
      "cow/buffalo"
   ],
   "general_advisory": "According to medium range weather forecast of IMD, MC, Bhubaneswar, there is a chance of occurrence of very light to light rainfall in upcoming week and partly to generally cloudy sky is expected during that period. The maximum and minimum temperature is likely to range between 35-37°C and 26-27°C respectively during this week. The maximum and minimum relative humidity may vary between 84-95% and 55-59% respectively. The South Easterly wind with a speed of 3-8 km/hr is predicted during the upcoming days. Need based irrigation is applied in the field in case of no rainfall condition. Make provision for good drainage system in fruit orchard and vegetable field. Prevailing weather conditions are favorable for mealy bug attack in all types of crops so its regular monitoring should be advised. Farmers should avoid excess use of nitrogenous fertilizer at crops because it may extend the vegetative growth period and also attract various insect pests.",
   "crops_data": {
      "rice": {
         "advisory": [
            "Farmers should maintain 5 cm water level in rice field for proper growth.",
            "Disease Management: Bacterial leaf blight attack is also observed in some field, so spraying of Copper Oxychloride 50% WP @ 600g and Streptocycline @ 30g in 200 liter of water per acre should be advised under clear and calm weather.",
            "Pest Management: Case worm attack is observed in some farmer’s field and in severe cases farmers are advised to spray Fipronil 5% SC @ 400ml or Profenofos 50% EC @ 400ml per 200 liters of water per acre under clear weather. Previous weather conditions were favorable for gall midge attack in rice field due to which an onion leaf or silver shoot-like structure are formed so for its control farmers should spray thiamethoxam 25% WG @ 40g or Fipronil 5% SC @ 400 ml or Chloropyriphos 20 EC @ 500 ml in 200 liter water per acre in clear and calm weather conditions."
         ]
      },
      "cotton": {
         "advisory": [
            "To control the flower drop in the cotton crop, application of Planofix @ 90 ml in 200 liters of water per acre after 60-65 days after sowing of seed.",
            "To control sucking insect pest (Aphid, Thrips etc.) attack in cotton crop, application of Neem based pesticide like Neem oil @ 600-800 ml + 200g detergent powder per acre by mixing with 200 liters of water should be advised at 30-45 days crop stage under clear weather.",
            "At the initial stage of flowering, farmers should avoid any chemical application in cotton crop."
         ]
      },
      "vegetable crops": {
         "advisory": [
            "To control Fruit and shoot borer in Brinjal, Tomato, Okra etc. spraying of Neem based pesticide 1500 ppm @600ml per acre should be advised at initial stages. In severe cases, the alternate spray of Spinosad 45% SC @ 70ml and Emamectin benzoate @ 80 g per acre at 15 days interval should be advised.",
            "If sucking insect pest attack noticed, then spraying of thiamethoxam @ 0.2 g or imidacloprid @ 0.33 ml per liter of water should be advised.",
            "For controlling some diseases like wilt, root rot etc. farmers should use Carbendazim @ 2g or copper oxicloride @ 3ml per liter water under no rainfall condition."
         ]
      },
      "cow/buffalo": {
         "advisory": [
            "Mastitis disease is also observed in some animals at present condition due to which milk production and quality may hamper, so some preventive as well as control measures like pre and post dipping with antiseptic liquids, proper sanitation, preventing wet floor surface, feeding should be adjusted to avoid sitting of animals before closure of teat sphincters after milking, lime application on the resting floor etc. should be taken to control this disease. Freshwater availability should be ensured on the farm. In severe cases, consult the doctor from a nearby animal health center."
         ]
      }
   },
   "date": "20-09-2024"
}