{
   "weather_details": {
      "21-12-2024": {
         "rainfall": 7,
         "t_max": 27,
         "t_min": 19,
         "rh_max": 56,
         "rh_min": 89,
         "wind_speed": 5,
         "wind_direction": 54,
         "cloud_cover": 5
      },
      "22-12-2024": {
         "rainfall": 3,
         "t_max": 27,
         "t_min": 19,
         "rh_max": 43,
         "rh_min": 84,
         "wind_speed": 5,
         "wind_direction": 52,
         "cloud_cover": 5
      },
      "23-12-2024": {
         "rainfall": 1,
         "t_max": 28,
         "t_min": 18,
         "rh_max": 31,
         "rh_min": 78,
         "wind_speed": 5,
         "wind_direction": 50,
         "cloud_cover": 3
      },
      "24-12-2024": {
         "rainfall": 0,
         "t_max": 28,
         "t_min": 19,
         "rh_max": 29,
         "rh_min": 71,
         "wind_speed": 5,
         "wind_direction": 70,
         "cloud_cover": 1
      },
      "25-12-2024": {
         "rainfall": 1,
         "t_max": 28,
         "t_min": 19,
         "rh_max": 28,
         "rh_min": 68,
         "wind_speed": 4,
         "wind_direction": 67,
         "cloud_cover": 1
      }
   },
   "names_of_crops": [
      "kharif rice",
      "summer rice",
      "green gram/black gram",
      "ground nut",
      "cole crop",
      "livestock",
      "poultry"
   ],
   "general_advisory": "Farmers are advised to conduct harvesting, sowing, and spraying operations accordingly. They should make provision to take care of crops and animals to protect them from the cold. Sowing of Rabi crops like Mustard, Til, Chickpea, Groundnut, Green gram/Black Gram etc. and start nursery sowing of Summer Paddy where irrigation facilities are available.",
   "crops_data": {
      "kharif rice": {
         "advisory": [
            "There is some rainfall event is expected in the first half of upcoming days so farmers are advised to wait for harvesting operations and make provision to keep the harvested paddy crop in safe places to avoid any further damage.",
            "Use 'Super Grain Bag' for safe storage of paddy/rice for a longer period of time or store the harvested paddy in properly bagged and stacked with a suitable cover to avoid damage due to untimely rain."
         ]
      },
      "summer rice": {
         "advisory": [
            "Farmers should start field preparation for summer season rice cultivation. For this purpose, farmers may select some improved varieties like MTU 1010, MTU 1156, MTU 1001, Lalat, Improved Lalat, Chandan, Swarna, etc."
         ]
      },
      "green gram/black gram": {
         "advisory": [
            "One week before sowing of green gram/black gram crop, seed should be treated with carbendazim @ 1.5-2.0g and imidacloprid @ 5g per kg seeds.",
            "Seed should be sown with a seed rate of 8-10 kg/ac with a spacing of 30cm×10cm.",
            "Avoid irrigation for some days because some amount of rainfall is expected in the upcoming week."
         ]
      },
      "ground nut": {
         "advisory": [
            "Farmers who have not yet sown seeds can use improved Groundnut varieties such as TAG-24, JL-24, Girnar-3, Smruti, TG-3, TG-22, Kadri-5, Kadri-6, Kadri-9, TPG-41, GPBD-4, Devi, CO-7, Dharani, and Divya etc."
         ]
      },
      "cole crop": {
         "advisory": [
            "Straw can be used as mulching material in vegetable crops to maintain soil moisture and soil temperature in the field during the winter season.",
            "Regular monitoring against the attack of Diamondback moth in cauliflower should be advised and if possible, farmers should use pheromone trap in the field for this purpose."
         ]
      },
      "livestock": {
         "advisory": [
            "Farmers should make provision to protect the animal from cold during winter season and provide clean drinking water to cattle and keep their sheds clean.",
            "Vaccination and deworming should be done to control different harmful diseases and stomach worms."
         ]
      },
      "poultry": {
         "advisory": [
            "Proper ventilation is required to provide fresh air and remove gases inside the house.",
            "The drinking water should be maintained at a suitable temperature to promote water intake."
         ]
      }
   },
   "date": "20-12-2024"
}