{
   "weather_details": {
      "21-12-2024": {
         "rainfall": 5,
         "t_max": 29,
         "t_min": 15,
         "rh_max": 93,
         "rh_min": 53,
         "wind_speed": 4,
         "wind_direction": 49,
         "cloud_cover": 5
      },
      "22-12-2024": {
         "rainfall": 2,
         "t_max": 29,
         "t_min": 15,
         "rh_max": 87,
         "rh_min": 42,
         "wind_speed": 4,
         "wind_direction": 34,
         "cloud_cover": 5
      },
      "23-12-2024": {
         "rainfall": 1,
         "t_max": 29,
         "t_min": 14,
         "rh_max": 78,
         "rh_min": 34,
         "wind_speed": 3,
         "wind_direction": 36,
         "cloud_cover": 4
      },
      "24-12-2024": {
         "rainfall": 0,
         "t_max": 30,
         "t_min": 14,
         "rh_max": 71,
         "rh_min": 33,
         "wind_speed": 2,
         "wind_direction": 79,
         "cloud_cover": 4
      },
      "25-12-2024": {
         "rainfall": 0,
         "t_max": 30,
         "t_min": 14,
         "rh_max": 65,
         "rh_min": 31,
         "wind_speed": 2,
         "wind_direction": 37,
         "cloud_cover": 2
      }
   },
   "names_of_crops": [
      "transplanted paddy",
      "cotton",
      "greengram/blackgram",
      "groundnut",
      "mustard & toria",
      "sunflower",
      "onion",
      "cauliflower & cabbage",
      "tomato",
      "cattle & buffalo",
      "goat",
      "poultry"
   ],
   "general_advisory": "As per extended range forecast received from IMD, very light to light rain very likely to occur over Coastal Odisha & adjoining districts of Interior Odisha during week -1 (20th to 26th December, 2024). Minimum temperature (night temperature) very likely to be 18-20°C in some parts of South Odisha, 14-16°C in most parts of Coastal Odisha and some parts of Interior Odisha and 10-14°C over the remaining parts of Interior Odisha during week -1. Dry weather likely to prevail over Odisha during week -2 (27th December, 2024 to 02nd January, 2025). Minimum temperature (night temperature) very likely to be 16-18°C in some parts of South Odisha, 14-16°C in most parts of Coastal Odisha and some parts of Interior Odisha, and 10-14°C over the remaining parts of Interior Odisha during week -2. In light of anticipated rain during next three days of the week, farmers are advised to store their harvested produce safely by covering with polythene. Due to expected light rainfall, cotton farmers should harvest fully opened bolls and store them safely to preserve quality. Hold off on spraying of pesticides for the time being. Complete the sowing of rabi crops to utilize anticipated rainfall. Confine domestic animals indoors till rain recedes.",
   "crops_data": {
      "transplanted paddy": {
         "advisory": [
            "This is the right time for nursery preparation for rabi season. 10 decimal of nursery area is required to cultivate one acre of paddy. Arrange suitable high yielding varieties like MTU 1010, MTU 1001, DRR 44, Sahabhagi Dhan, Lalat, Improved Lalat, Mandakini, Bina 11 etc. Treat the seeds with 2g Carbendazim or 3g Carboxin or Thiram per 1kg of seed before sowing in the nursery.",
            "To protect the rice nursery from cold injury, apply a thin layer of well decomposed FYM after sowing of seeds in wet bed to keep the bed relatively warm. Preferably use bore well water for irrigation at evening and drain out the cold water in the morning to maintain the soil temperature favorable for growth. In severe cold affected areas use polythene cover at night time.",
            "Apply 13-15 kg DAP and 10-12 kg MOP along with 200 kg of FYM and 200 g Zn per 10 decimal as the basal dose for healthy production of seedlings."
         ]
      },
      "cotton": {
         "advisory": [
            "Picking should be done when there is complete bursting of bolls.",
            "Dry the seed cotton on the concrete floor or tarpaulin sheets to reduce the moisture to 8-10%.",
            "Farmers are advised to sell their seed cotton in the nearby 'Mandi' to get MSP (Rs.7521/qt) for long staple cotton."
         ]
      },
      "greengram/blackgram": {
         "advisory": [
            "Weed Management: Apply Pendimithalin 30% EC @ 1.20 liter/acre mixed with 200 liters of water at 1-2 DAS."
         ]
      },
      "groundnut": {
         "advisory": [
            "Weed Management: Apply Imazethapyr 10% SL @ 3ml/ltr of water at 15 DAS as early post-emergence herbicide or apply Fenoxaprop-P-Ethyl 9.3% @ 35 ml/drum (15-liter capacity) at 15-20 DAS."
         ]
      },
      "mustard & toria": {
         "advisory": [
            "Weed Management: Apply Quizalofop-ethyl 5% EC as post-emergence @ 2ml/liter of water at 15-20 DAS.",
            "Undertake intercultural operation like weeding and earthing up followed by fertilizer application (Urea @ 35-40kg/ac + MOP @ 10kg/ac) and irrigation at the 3-week stage."
         ]
      },
      "sunflower": {
         "advisory": [
            "Undertake intercultural operation like weeding and earthing up followed by 1st top dressing (Urea @ 6-10 kg/ac) and irrigation at the 3-week stage.",
            "Sucking pest complex (Aphid, Hopper, Thrips & White fly): Prevailing weather condition favors the development of sucking pests. Need-based spray of Acetamiprid 20% SP @ 50g/acre or Imidacloprid 17.8% SL @ 60 ml/acre mixed with 200 ltrs of water is recommended."
         ]
      },
      "onion": {
         "advisory": [
            "Prepare the main field for transplanting onion seedlings at the eight-week stage.",
            "Nutrient Management: For one-acre area, apply 43kg DAP, 27kg urea, 33kg MOP, and 20kg Sulphur prior to the transplanting of onion seedlings in the main field."
         ]
      },
      "cauliflower & cabbage": {
         "advisory": [
            "Nutrient Management: At the three-week stage, undertake hoeing, weeding and apply Urea @ 55kg/ac followed by irrigation.",
            "Go for hoeing, weeding and apply 27 kg urea + 25kg MOP at six-to-seven-week stage followed by irrigation."
         ]
      },
      "tomato": {
         "advisory": [
            "In view of high humid condition wilting may occur at this stage. Spray Mancozeb 75% WP @ 2g/ltr of water if the symptom is noticed."
         ]
      },
      "cattle & buffalo": {
         "advisory": [
            "Farmers are requested to vaccinate their cattle & buffalo against FMD through NADCP.",
            "Farmers can increase milk production by controlling and preventing Foot and Mouth Disease (FMD)",
            "Calves of 4-8 months of age should be vaccinated against Brucellosis."
         ]
      },
      "goat": {
         "advisory": [
            "Protect Goat from chill wind and damp floors."
         ]
      },
      "poultry": {
         "advisory": [
            "Make necessary arrangements to provide heat especially to chicks during night hours to reduce the mortality rate. Make proper brooding arrangement for chicks. Keep the poultry house clean and clamp free."
         ]
      }
   },
   "date": "20-12-2024"
}