{
   "weather_details": {
      "20.12.2024": {
         "rainfall": 0,
         "t_max": 28,
         "t_min": 16,
         "rh_max": 79,
         "rh_min": 34,
         "wind_speed": 10,
         "wind_direction": 120,
         "cloud_cover": 4
      }
   },
   "names_of_crops": [
      "mustard",
      "cucurbits",
      "indian bean",
      "spinach",
      "garlic",
      "potato",
      "cauliflower"
   ],
   "general_advisory": "Ensure proper irrigation practices for mustard crop to manage Sawfly infestation. Control downy mildew in cucurbits due to low temperature. Protect Indian bean from aphids. Follow proper sowing practices for spinach and garlic. Prevent early leaf blight in potato and Alternaria leaf spot in cauliflower. Ensure good ventilation in animal husbandry to prevent diseases.",
   "crops_data": {
      "mustard": {
         "advisory": [
            "There will be chances of Sawfly infestation in Mustard crop.",
            "To manage this pest, irrigation should be done in seedling stage.",
            "Manually collect and destroy grubs of Sawfly.",
            "Spray Ethofenprox 10 % EC or Chlorpyriphos 50% + Cypermethrin 5 % E.C."
         ]
      },
      "cucurbits": {
         "advisory": [
            "There will be an increase in infestation of downy mildew due to low temperature.",
            "Spray Metalaxyl 8% + Mancozeb 64% W.P or Fosetyl -AL 80 % WP."
         ]
      },
      "indian bean": {
         "advisory": [
            "To manage aphids, put yellow sticky traps per acre.",
            "Spray Neem based pesticide or chemical pesticide if severe infestation."
         ]
      },
      "spinach": {
         "advisory": [
            "Varieties of Palak include Pusa Palak, All Green, Pusa Jyoti, Pusa Harit, Komal, Punjab Green.",
            "Soak seeds in water before sowing."
         ]
      },
      "garlic": {
         "advisory": [
            "Plant varieties like Agrifound white, Jamuna Safed, G-282, Agrifound Parvati.",
            "Treat garlic cloves with Carbendazim.",
            "Maintain optimal spacing for Garlic."
         ]
      },
      "potato": {
         "advisory": [
            "Chances of Early leaf Blight disease in potato.",
            "Spray Mancozeb 75% WP or Carbendazim 12% + Mancozeb 63% WP."
         ]
      },
      "cauliflower": {
         "advisory": [
            "To manage Alternaria leaf spot disease, spray Mancozeb 75 % WP or Carbendazim 12 % + Mancozeb 63 % WP."
         ]
      }
   },
   "date": "20-12-2024"
}