{
   "weather_details": {
      "2024-09-28": {
         "rainfall": 5,
         "t_max": 33,
         "t_min": 24,
         "rh_max": 98,
         "rh_min": 79,
         "wind_speed": 7,
         "wind_direction": 193,
         "cloud_cover": 8
      },
      "2024-09-29": {
         "rainfall": 10,
         "t_max": 34,
         "t_min": 24,
         "rh_max": 98,
         "rh_min": 69,
         "wind_speed": 6,
         "wind_direction": 212,
         "cloud_cover": 6
      },
      "2024-09-30": {
         "rainfall": 5,
         "t_max": 34,
         "t_min": 24,
         "rh_max": 96,
         "rh_min": 69,
         "wind_speed": 5,
         "wind_direction": 248,
         "cloud_cover": 8
      },
      "2024-10-01": {
         "rainfall": 5,
         "t_max": 35,
         "t_min": 25,
         "rh_max": 94,
         "rh_min": 72,
         "wind_speed": 5,
         "wind_direction": 214,
         "cloud_cover": 5
      },
      "2024-10-02": {
         "rainfall": 5,
         "t_max": 36,
         "t_min": 25,
         "rh_max": 92,
         "rh_min": 72,
         "wind_speed": 6,
         "wind_direction": 244,
         "cloud_cover": 5
      }
   },
   "names_of_crops": [
      "rice",
      "groundnut",
      "pigeon pea",
      "pumpkin",
      "papaya",
      "cauliflower",
      "french bean",
      "cow",
      "common fish"
   ],
   "general_advisory": "The mean maximum daily temperature was 34.6°C and the mean minimum daily temperature was 24.5°C of the Gajapati district during the last week. The district received 43.6 mm of rainfall during the last week. For HYVs of rice apply 17 kg of Urea per acre at PI stage. In case of Light sandy soil, apply 17 kg Urea and 15 Kg of MOP per acre. For Hybrids apply 20 kg of Urea along with 20-kg of MOP at PI stage. To manage fungal and bacterial diseases (leaf blight, wilt, and rot) in different standing crops, spray (Metalaxyl+ Mancozeb) @ 2-gram/litre of water or (Carbendazim+ Mancozeb) @ 2-gram/litre of water along with Plantomycin @ 1-gram/ litre of water. Keep the poultry farm neat & clean, select disease-free chicks for farming & Provide adequate poultry feed & clean water to avoid Poultry bird diseases. Regular monitoring of the crop for incidence of pests and diseases should be done.",
   "crops_data": {
      "rice": {
         "advisory": [
            "Due to prevailing wet and humid conditions the attack of pests like Yellow stem borer and leaf folder may increase in the crop. To manage Leaf Folder and Case Worm pests in paddy spray Bifenthrin 10% EC @ 200 ml/acre or Lambda Cyhalothrin 5% EC @ 200-ml/acre or Fipronil 5% SC @ 400-ml/acre or Chlorantraniliprole 18.5% SC @ 60-ml /acre. Yellow stem borer management: To manage stem borer in paddy at the early stage of the crop, apply Cartap Hydrochloride 4%G @ 18.45-kg/ha or Chlorantraniliprole 0.4 % GR @ 10-kg/ha or Imidacloprid 0.3% G @ 15-kg/ha by mixing it with sand at 1:1 ratio. Leaf folder and case worm management: In paddy fields infested with leaf folder and case worm, apply a mixture of 2.5-litre of kerosene and 50-kg of sand per ha and then move a string over the paddy crop by stretching at both ends of the field. By this method, the larva of insects falls into the water and gets killed. To manage Leaf Folder and Case Worm pests in paddy spray Fipronil 5% SC @ 1000-ml/ha or Profenophos 50% EC @ 1000-ml/ha or Chlorantraniliprole 18.5% SC @ 200-ml /ha. Bacterial Leaf Blight: To manage Bacterial Leaf Blight, spray Copper Hydroxide 53.8% DF 3g/ ltr or Copper Oxychloride 50%WP 3.0 g/ ltr. To manage Blast disease, spray Hexaconazole 5 % SC @ 400-ml/acre or Azoxystrobin 18.2% + Difenoconazole 11.4 % S.C @ 200-ml/acre or Tebuconazole 50%+ Trifloxystrobin 25 % WG @ 80-gram/acre. To manage sheath blight disease chemically spray Validamycin 3 % L @ 400-ml/acre or Hexaconazole 5 % SC @ 400-ml/acre or Tebuconazole 50%+ Trifloxystrobin 25 % WG @ 80-gram/acre."
         ]
      },
      "groundnut": {
         "advisory": [
            "The disease incidence is maximum after rainfall. To prevent the disease Seed treatment should be done with Carbendazim 50 % WP @ 2-gm/ kg of seeds or Carboxin 37.5 % + Thiram 37.5% D.S WP @ 3-gm/kg of seeds. To manage Stem Rot disease in groundnut spray Validamycin 3 % L @ 400-ml/acre or Captan 70 %+ Hexaconazole 5 % @ 300- gram/acre. To spray the fungicide 200-litre of water per acre is required."
         ]
      },
      "pigeon pea": {
         "advisory": [
            "Sucking Pests (Aphid, Jassids, Thrips, Whitefly): Sucking pests are generally more active in prevailing weather conditions. Neem-based pesticide (1500 ppm) may be sprayed @ 3ml/ lit of water at the initial stage of infestation. Wilt: Wilting may be observed after receding of rain. Apply Metiram 75% WG @ 1.5g/liter at the root zone of the plant as a control measure."
         ]
      },
      "pumpkin": {
         "advisory": [
            "To manage Epilachna Beetle in cucurbits spray neem-based pesticide (Neem Oil 1500 PPM) @ 3-ml/litre of water at the early stage of infestation. To manage Epilachna Beetle chemically spray Chlorpyriphos 20 % EC @ 2-ml/litre of water or Profenophos 50 % EC @ 2- ml/litre of water."
         ]
      },
      "papaya": {
         "advisory": [
            "To manage mealy bug at the early stage of infestation spray neem-based pesticide (Neem Oil 1500 PPM @30- ml/10-litre of water or insecticidal soap. In case of severe infestation spray Profenphos 50 % EC @ 20-ml/10-litre of water or Thiamethoxam 25 % WG @ 3-gram/10-litre of water."
         ]
      },
      "cauliflower": {
         "advisory": [
            "The seed rate for Cauliflower, cabbage and Broccoli is 200g for improved varieties and 50g for hybrid seeds. For one-acre cultivation, prepare 10-12 nursery beds of 3m length, 1m breadth, and 10-15 cm height. Apply 20 kg of completely decomposed FYM to each nursery bed ten days before sowing."
         ]
      },
      "french bean": {
         "advisory": [
            "To manage Pod borer in beans spray Emamectin Benzoate 5% SG @ 90-gram/ acre or Chlorantraniliprole 18.5 % SC @ 60-ml/acre or Flubendiamide 39.35 SC @ 40-ml/acre."
         ]
      },
      "cow": {
         "advisory": [
            "The common symptoms of this disease are high fever, anorexia, salivation from the mouth and nostril, inflammation of neck and respiratory tract. The affected animal feels pain for respiration and creates a grunting sound. As it is highly contagious and affects the respiratory tract, the mortality rate is very high in untreated animals and animals succumb to death within 3 to 4 days. The disease is more fatal in Buffaloes. But the diseased animal can be recovered if treated at an early stage. Farmers are advised to vaccinate their animals yearly twice to keep safe their animals."
         ]
      },
      "common fish": {
         "advisory": [
            "When there is a lack of oxygen in the pond, the fish will come up to the surface water and start gulping through their mouths. The ideal dissolved oxygen is about 5mg/l. This can be maintained by using an aerator. A simple way of aeration is to circulate the pond water. It can be done using a pump that can take water from the lower surface of the pond and splash it into the same pond."
         ]
      }
   },
   "date": "27-09-2024"
}