{
   "weather_details": {
      "2024-12-28": {
         "rainfall": 0,
         "t_max": 24,
         "t_min": 17,
         "rh_max": 88,
         "rh_min": 45,
         "wind_speed": 3,
         "wind_direction": 36,
         "cloud_cover": 1
      },
      "2024-12-29": {
         "rainfall": 0,
         "t_max": 24,
         "t_min": 17,
         "rh_max": 85,
         "rh_min": 49,
         "wind_speed": 2,
         "wind_direction": 14,
         "cloud_cover": 2
      },
      "2024-12-30": {
         "rainfall": 0,
         "t_max": 25,
         "t_min": 16,
         "rh_max": 86,
         "rh_min": 53,
         "wind_speed": 2,
         "wind_direction": 22,
         "cloud_cover": 2
      },
      "2024-12-31": {
         "rainfall": 0,
         "t_max": 26,
         "t_min": 16,
         "rh_max": 88,
         "rh_min": 50,
         "wind_speed": 2,
         "wind_direction": 11,
         "cloud_cover": 3
      },
      "2025-01-01": {
         "rainfall": 0,
         "t_max": 27,
         "t_min": 16,
         "rh_max": 90,
         "rh_min": 45,
         "wind_speed": 2,
         "wind_direction": 11,
         "cloud_cover": 1
      }
   },
   "names_of_crops": [
      "rice",
      "sunflower",
      "mustard",
      "cotton",
      "chilli",
      "tomato",
      "potato",
      "menacinakahi",
      "common fish",
      "chick"
   ],
   "general_advisory": "The mean maximum daily temperature was 24.0°C and the mean minimum daily temperature was 17.3°C of the Gajapati district during the last week. The district received 65.1 mm of rainfall during the last week. Due to low night temperature and fog condition, there will be a chance of infestation of sucking pests, leaf blight, powdery mildew in the Rabi crops and vegetables. Monitor the crops and vegetables, if symptoms are noticed, undertake appropriate plant protection measures. Carry out weeding, hoeing and other intercultural operations in Rabi vegetables. In Cole crops, irrigation should be done at 7-8 Days interval depending upon soil moisture and weather condition. In winter during cold hours farmers should keep doors, windows and open spaces in cow sheds covered with polythene or gunny bag curtains to prevent direct contact with cold air. For maintaining the heat in the poultry shed during winter season, install heaters in the shed.",
   "crops_data": {
      "rice": {
         "advisory": [
            "Soon after noticing the infestation of the stored grain insect pest, take up fumigation by using Aluminium phosphide (do not use in dwelling houses) tablets @ of 3 tablets/ ton grain (total 9 g of tablets) in fairly airtight containers or by covering with thick tarpaulin leaving no gaps. The tablets should be wrapped in cotton pouches before placing them in the stacks. All the corners of plastic cover should be plastered with 6- inch thick layer of mud/ adhesive tapes to prevent leakage of gas. Minimum exposure period is for about 7-10 days. Arrange good quality paddy seed varieties like Satyabhama, Sahabhagi Dhan, Mandakini, Manaswini, DRR 42, DRR-43, DRR-44, Bina 1 1, GB-1, Improved Lalat, MTU 1010, MTU 1001, Naveen, Swarna Shreya which can be grown during the dry season. Seed rate for an acre of land is 20 kg for these varieties. Treat the seeds with Carbendazim 50% W.P @ 2-gram/1-kg of seeds or Carboxin 37.5% + Thiram 37.5 % @ 3- gram /1 kg of seeds before sowing in the nursery."
         ]
      },
      "sunflower": {
         "advisory": [
            "Sunflower crop is at 25-30 days stage. Go for hoeing and weeding and thinning and apply N -fertilizer."
         ]
      },
      "mustard": {
         "advisory": [
            "There are chances of Aphid infestation in early sown mustard crop. To manage aphids at an early stage, put 8 number of yellow sticky traps per acre. Spray Neem-based pesticide 1500 PPM @ 600-ml/acre by mixing in 200-litre of water. If the infestation is severe then spray chemical pesticide Thiamethoxam 25 % WG @ 40-gram/acre or Acetamiprid 20 % SP  @ 50-gram/acre in 200-liter of water."
         ]
      },
      "cotton": {
         "advisory": [
            "Farmers are advised to go for picking cotton on sunny days after 9 AM or when dew dries up from the crop surface. Pick the seed cotton in cloth bag or plastic basket. Remove the dry leaves and other plant parts from the seed cotton. First picking, second picking and third picking seed cotton separately. If more than one variety or hybrid of cotton is grown than keep them separately. Dry the seed Cotton on a concrete floor or tarpaulin for 2-3 hours in direct sunlight and keep it in clean cloth bags."
         ]
      },
      "chilli": {
         "advisory": [
            "To control aphids and thrips in chili during the primary stage of pest infestation spray neem-based pesticide 1500 PPM @ 600-ml/acre by mixing in 200-liter of water. Spray Thiamethoxam 25 % WG @ 40 g/acre or Acetamiprid 20% S.P. @ 50 g/acre or Profenophos 40 % + Fenpyroximate 2.5 % EC @ 400-ml/acre."
         ]
      },
      "tomato": {
         "advisory": [
            "To control fruit borer in Tomato, first collect and destroy the affected fruits and grown-up larvae. Set up 20 nos. of pheromone traps having Helilure per acre. Go for spraying of insecticide if there are 10% fruits infested with borer. Spray Chlorantraniliprole 18.5% S.C @ 80 ml/acre or Flubendiamide 39.5 % M/M S.C @ 40 ml/acre or Indoxacarb 14.5% S.C. @ 200 ml/acre. Use any of the above insecticides alternately at 15 days interval."
         ]
      },
      "potato": {
         "advisory": [
            "Early planted potato crop is at a 3-week stage. Go for hoeing and weeding and apply the rest 30-45 Kg N/acre. For better tuber growth in potato, soil temperature below 30°C should be maintained. Therefore farmers are advised to irrigate the field. There are chances of Leaf Blight disease incidence in the potato crop. To manage early leaf blight in the potato, spray Mancozeb 75% WP @ 600 gram/acre or Carbendazim 12% + Mancozeb 63% W.P @ 400-gram/acre. To manage late blight in the potato spray Metalaxyl 8% + Mancozeb 64% W.P @ 400-gram/acre at 10 days interval."
         ]
      },
      "menacinakahi": {
         "advisory": [
            "To control aphids and thrips in chilli during the primary stage of pest infestation spray neem-based pesticide 1500 PPM @ 600-ml/acre by mixing in 200-liter of water. Spray Thiamethoxam 25 % WG @ 40 g/acre or Acetamiprid 20% S.P. @ 50 g /acre or Profenophos 40 % + Fenpyroximate 2.5 % EC @ 400-ml/acre."
         ]
      },
      "common fish": {
         "advisory": [
            "During winters, there is a possibility of “EUS” disease in fish. Farmers are advised to apply Cifax @ 400 ml mixed with 40 liters of water in one acre pond area as a preventive measure. The fishes should be fed daily with oil cake bran mixture at the rate of 2-3 % of their total biomass."
         ]
      },
      "chick": {
         "advisory": [
            "In winter, the number of feeders should be increased. Feed should be available to the bird the whole day. During the winter season birds take less water so far maintenance of water in the body, it is necessary to give a continuous supply of fresh water which can be taken by the bird. For maintaining the heat in the poultry shed, install heaters in the shed. Use 200W bulbs to generate heat in small scale operations. Carry out necessary vaccinations as and when required."
         ]
      }
   },
   "date": "27-12-2024"
}