{
   "weather_details": {
      "28-12-2024": {
         "rainfall": 0,
         "t_max": 29,
         "t_min": 18,
         "rh_max": 36,
         "rh_min": 79,
         "wind_speed": 5,
         "wind_direction": 69,
         "cloud_cover": 1
      },
      "29-12-2024": {
         "rainfall": 5,
         "t_max": 28,
         "t_min": 17,
         "rh_max": 39,
         "rh_min": 77,
         "wind_speed": 4,
         "wind_direction": 0,
         "cloud_cover": 6
      },
      "30-12-2024": {
         "rainfall": 5,
         "t_max": 28,
         "t_min": 16,
         "rh_max": 45,
         "rh_min": 82,
         "wind_speed": 4,
         "wind_direction": 18,
         "cloud_cover": 5
      },
      "31-12-2024": {
         "rainfall": 0,
         "t_max": 28,
         "t_min": 15,
         "rh_max": 37,
         "rh_min": 80,
         "wind_speed": 6,
         "wind_direction": 5,
         "cloud_cover": 2
      },
      "01-01-2025": {
         "rainfall": 0,
         "t_max": 29,
         "t_min": 14,
         "rh_max": 31,
         "rh_min": 77,
         "wind_speed": 5,
         "wind_direction": 355,
         "cloud_cover": 1
      }
   },
   "names_of_crops": [
      "kharif rice",
      "ground nut",
      "cole crop"
   ],
   "general_advisory": "Farmers are advised to conduct harvesting, sowing, and spraying operations accordingly. Make provision to take proper care of crops and animals to protect them from cold. Sowing of Rabi crops like Mustard, Til, Chickpea, Groundnut, Green gram/Black Gram, and nursery sowing of Summer Paddy are recommended where irrigation facilities are available.",
   "crops_data": {
      "kharif rice": {
         "advisory": [
            "There is some rainfall event expected in the first half of upcoming days so farmers are advised to wait for harvesting operations and make provision to keep the harvested paddy crop in safe places to avoid further damage."
         ]
      },
      "ground nut": {
         "advisory": [
            "Past weather conditions (cloudy and foggy) are favorable for sucking insect attack in groundnut crop so regular monitoring is advised.",
            "If insect attack is observed, spraying of Azadiractin or neem-based insecticide is recommended.",
            "As some amount of rain is expected in the upcoming days, farmers should wait for irrigation and spraying operations."
         ]
      },
      "cole crop": {
         "advisory": [
            "Straw can be used as mulching material in vegetable crops to maintain soil moisture and temperature during winter season.",
            "Regular monitoring against the attack of Diamond back moth in cauliflower is advised.",
            "If attack is observed, spraying of neem oil or Emamectin Benzoate after rain occurrence is recommended."
         ]
      }
   },
   "date": "27-12-2024"
}