{
   "weather_details": {
      "28-12-2024": {
         "rainfall": 0,
         "t_max": 25,
         "t_min": 15,
         "rh_max": 77,
         "rh_min": 40,
         "wind_speed": 3,
         "wind_direction": 344,
         "cloud_cover": 1
      },
      "29-12-2024": {
         "rainfall": 0,
         "t_max": 26,
         "t_min": 15,
         "rh_max": 79,
         "rh_min": 42,
         "wind_speed": 2,
         "wind_direction": 90,
         "cloud_cover": 2
      },
      "30-12-2024": {
         "rainfall": 0,
         "t_max": 27,
         "t_min": 15,
         "rh_max": 78,
         "rh_min": 48,
         "wind_speed": 2,
         "wind_direction": 51,
         "cloud_cover": 1
      },
      "31-12-2024": {
         "rainfall": 0,
         "t_max": 28,
         "t_min": 14,
         "rh_max": 81,
         "rh_min": 45,
         "wind_speed": 2,
         "wind_direction": 27,
         "cloud_cover": 2
      },
      "01-01-2025": {
         "rainfall": 0,
         "t_max": 28,
         "t_min": 13,
         "rh_max": 81,
         "rh_min": 41,
         "wind_speed": 3,
         "wind_direction": 6,
         "cloud_cover": 1
      }
   },
   "names_of_crops": [
      "paddy",
      "blackgram",
      "groundnut",
      "cabbage",
      "coriander",
      "mango"
   ],
   "general_advisory": "By utilizing the soil moisture from past rainfall, continue sowing operation of summer paddy. Polythene to cover the paddy nursery at night-time. Protect the paddy nursery, apply a thin layer of well decomposed FYM in bed to keep the bed relatively warm. Cover the recently planted cole crops with paper pockets during night time to avoid low temperature. Due to low night temperature and fog condition, there will be chance of infestation of sucking pests, leaf blight, powdery mildew in the Rabi crops and vegetables. Monitor the crops and vegetables, if symptoms are noticed, undertake appropriate plant protection measures.",
   "crops_data": {
      "paddy": {
         "advisory": [
            "By utilizing the soil moisture from past rainfall, continue sowing operation of summer paddy. Polythene to cover the paddy nursery at night-time.",
            "Protect the paddy nursery, apply a thin layer of well decomposed FYM in bed to keep the bed relatively warm."
         ]
      },
      "blackgram": {
         "advisory": [
            "Agromet Advisory: Farmers those are going for Wet direct sown rice cultivation should apply 35 kg DAP, 27 kg Potash and 8 kg Urea per acre during last puddling. In Zinc deficient soil apply Zinc Sulphate (21%) @ 10 kg/acre at every three years.",
            "Sowing of pre-germinated seeds should be done in puddled soil by direct broadcasting or by using drum seeder. Maintain only a thin film of water for proper establishment and early growth of seedlings."
         ]
      },
      "groundnut": {
         "advisory": [
            "To control stem rot in groundnut go for seed treatment with tricoderma viride @4g per kg of seed. Drench the root zone with Validamycin @ 400 ml or Captan and Hexaconazole @ 300 g/acremixing it in 200 litre of water."
         ]
      },
      "cabbage": {
         "advisory": [
            "Current weather is favourable for attack of Cabbage webber and tobacco caterpillar in Cabbage. To control these insects, go for alternate spray of Neem based formulation 1500ppm@600ml/acre and Emamectin benzoate@70g/acre in 200 lit water."
         ]
      },
      "coriander": {
         "advisory": [
            "Now the weather is favourable for Coriander sowing. Grow high yielding varieties like CO-1, CO-2, CO-3, Swati, Sadhana, Ram Selection and Udi. Use 6 kg seeds/acre. Treat the seeds with 1.5 g Carbendazim or 3 g Thiram/kg of seeds. Soak the seeds overnight for 10 to 12 hours for better germination. Apply 1 ton FYM along with 4:16 kg NP per acre as basal during final land preparation. Sow the seeds in lines with 30 X 8 cm."
         ]
      },
      "mango": {
         "advisory": [
            "New Plantation- Mulching around the basin either with grass or polythene (100 μ). Spray chloropyriphos 20EC @ 2.5ml/ltr on trunk and collar region to manage termite.",
            "Growing Plant- Mulching around the basin either with grass or polythene (100 μ). Irrigation may be given through ring or drip method at 15 days interval."
         ]
      }
   },
   "date": "27-12-2024"
}