{
   "weather_details": {
      "29-01-2025": {
         "rainfall": 0,
         "t_max": 32,
         "t_min": 9,
         "rh_max": 56,
         "rh_min": 31,
         "wind_speed": 6,
         "wind_direction": 63,
         "cloud_cover": 1
      },
      "30-01-2025": {
         "rainfall": 0,
         "t_max": 31,
         "t_min": 10,
         "rh_max": 63,
         "rh_min": 30,
         "wind_speed": 5,
         "wind_direction": 63,
         "cloud_cover": 2
      },
      "31-01-2025": {
         "rainfall": 0,
         "t_max": 31,
         "t_min": 10,
         "rh_max": 72,
         "rh_min": 28,
         "wind_speed": 2,
         "wind_direction": 117,
         "cloud_cover": 2
      },
      "01-02-2025": {
         "rainfall": 0,
         "t_max": 32,
         "t_min": 11,
         "rh_max": 63,
         "rh_min": 29,
         "wind_speed": 4,
         "wind_direction": 73,
         "cloud_cover": 2
      },
      "02-02-2025": {
         "rainfall": 0,
         "t_max": 32,
         "t_min": 11,
         "rh_max": 59,
         "rh_min": 31,
         "wind_speed": 5,
         "wind_direction": 0,
         "cloud_cover": 2
      }
   },
   "names_of_crops": [
      "dry season rice",
      "green gram",
      "black gram",
      "mango",
      "vegetable crops"
   ],
   "general_advisory": "According to the daily forecast of IMD, MC, Bhubaneswar, there is no large change in minimum temperature expected during next two days and thereafter rise by 2-4 deg. cen. in subsequence three days over the district of Odisha. Looking to the dry weather condition in upcoming days farmers are advised to provide one irrigation in crop field and conduct all kind of spraying and intercultural operations in standing crops. Farmers should keep their fields weed-free for proper crop growth. Prevailing temperature condition (high gap in day and night temperature) may affect various types of crops (favor different kind of insect attack) as well as animals.",
   "crops_data": {
      "dry season rice": {
         "advisory": [
            "Transplanting of 3-5 week old seedlings should be advised in well-puddled soil at a spacing of 15cm x 15cm with 3-4 seedlings per hill at shallow depth. Apply (DAP 44kg + MOP 22kg) or (Urea 22kg + SSP 125kg + MOP 22kg) as basal dose during final puddling.",
            "Weed Management: Farmers those have already completed transplanting, apply granular herbicide Bensulfuron-methyl + Pretilachlor @ 4kg/acre at 5-8 DAT. Mix the granular herbicide with 4kg of sand/acre and broadcast it uniformly in the field or spray Pyrazosulfuron-ethyl 10WP @ 80g/acre in 140 litres of water at 3-5 DAT or spray Bispyribac sodium @ 120ml/acre at 10-15 DAT or 2-3 leaf stage of weeds in 140 litres of water.",
            "Insect/ Pest management: In just transplanted field use 3 pheromone traps with 5mg lure/acre in the rice field for monitoring of the yellow stem borer and leaf folder. Whenever the number of male moths in the trap reaches 4 or 5, spraying of Azadiractin 0.15% neem seed kernel based EC formulation @ 800ml/acre should be advised."
         ]
      },
      "green gram": {
         "advisory": [
            "If sucking insect attack is noticed in Green/Black gram field then farmers should use 8 nos. of yellow sticky trap per acre to control these insects at the vegetative stage.",
            "At the initial stage of attack, farmers should spray 5ml neem oil per liter of water to control these insects.",
            "Insecticide application should be avoided at flowering stage."
         ]
      },
      "black gram": {
         "advisory": [
            "If sucking insect attack is noticed in Green/Black gram field then farmers should use 8 nos. of yellow sticky trap per acre to control these insects at the vegetative stage.",
            "At the initial stage of attack, farmers should spray 5ml neem oil per liter of water to control these insects.",
            "Insecticide application should be avoided at flowering stage."
         ]
      },
      "mango": {
         "advisory": [
            "Wrap or fix polythene/alkathane sheet tightly on Mango trees to manage mango mealy bug.",
            "Training and pruning of diseased and unwanted branches and leaves should be advised.",
            "If powdery mildew infestation or any fungal infection observed in Mango orchard then spraying of wettable sulphur @ 2g per liter of water should be advised."
         ]
      },
      "vegetable crops": {
         "advisory": [
            "To control leaf-eating caterpillar and fruit borer/shoot and fruit borer in Tomato and Brinjal, spraying of Emamectin Benzoate @ 0.4 g per liter of water should be advised.",
            "For Diamond Back Moth attack in Cauliflower, spraying of Spinosad 45 SC @ 0.5 ml or Fipronil 5% SC @ 2ml or Neem oil @ 5ml per liter of water should be advised.",
            "Regular monitoring against sucking insect attack should be advised.",
            "Avoid chemical application at the flowering stage."
         ]
      }
   },
   "date": "28-01-2025"
}