{
   "weather_details": {
      "29.11.2024": {
         "rainfall": 0,
         "t_max": 26,
         "t_min": 16,
         "rh_max": 92,
         "rh_min": 65,
         "wind_speed": 10,
         "wind_direction": 180,
         "cloud_cover": 5
      }
   },
   "names_of_crops": [
      "mustard",
      "pointed gourd",
      "chilli",
      "cabbage & cauliflower",
      "livestock",
      "fishery",
      "poultry"
   ],
   "general_advisory": "Farmers are advised to take necessary precautions for the mentioned crops during the current weather conditions. Livestock, fishery, and poultry advice are also provided for the winter season.",
   "crops_data": {
      "mustard": {
         "advisory": [
            "In low temperature conditions, monitor for Aphid infestation and take appropriate measures."
         ]
      },
      "pointed gourd": {
         "advisory": [
            "To control downy mildew, spray recommended fungicides at the mentioned concentrations."
         ]
      },
      "chilli": {
         "advisory": [
            "Monitor for Aphids and Thrips infestation, and use neem-based pesticide for control.",
            "Chemical sprays like Thiamethoxam or Acetamiprid can be used for management."
         ]
      },
      "cabbage & cauliflower": {
         "advisory": [
            "Install light traps and use neem-based pesticide for Diamond Back Moth pests.",
            "Recommended chemical sprays can also be used for pest management."
         ]
      },
      "livestock": {
         "advisory": [
            "During cold hours, take measures to ensure livestock comfort and health."
         ]
      },
      "fishery": {
         "advisory": [
            "Maintain water depth and adjust feeding rates according to temperature changes.",
            "Avoid adding organic manures in the pond during winter."
         ]
      },
      "poultry": {
         "advisory": [
            "Install heaters and use bulbs for heat maintenance in poultry sheds during winter.",
            "Ensure necessary vaccinations are carried out timely."
         ]
      }
   },
   "date": "29-11-2024"
}