{
   "weather_details": {
      "30-11-2024": {
         "rainfall": 1,
         "t_max": 27,
         "t_min": 16,
         "rh_max": 90,
         "rh_min": 48,
         "wind_speed": 4,
         "wind_direction": 53,
         "cloud_cover": 4
      },
      "01-12-2024": {
         "rainfall": 0,
         "t_max": 26,
         "t_min": 17,
         "rh_max": 92,
         "rh_min": 66,
         "wind_speed": 4,
         "wind_direction": 75,
         "cloud_cover": 5
      },
      "02-12-2024": {
         "rainfall": 0,
         "t_max": 26,
         "t_min": 17,
         "rh_max": 93,
         "rh_min": 61,
         "wind_speed": 4,
         "wind_direction": 81,
         "cloud_cover": 5
      },
      "03-12-2024": {
         "rainfall": 1,
         "t_max": 26,
         "t_min": 16,
         "rh_max": 91,
         "rh_min": 64,
         "wind_speed": 4,
         "wind_direction": 84,
         "cloud_cover": 4
      },
      "04-12-2024": {
         "rainfall": 0,
         "t_max": 27,
         "t_min": 14,
         "rh_max": 87,
         "rh_min": 54,
         "wind_speed": 3,
         "wind_direction": 104,
         "cloud_cover": 4
      }
   },
   "names_of_crops": [
      "rice",
      "green gram",
      "black gram",
      "mustard",
      "ground nut",
      "cole crop"
   ],
   "general_advisory": "Cloudy weather is expected in upcoming days so farmers are advised to take precautionary measures to keep the harvested produce in safe place. There is a chance of increase in various disease infestation in both field as well as vegetable crops due to prevailing weather condition so regular monitoring against these diseases should be advised. Farmers are advised to complete the sowing of Rabi crops like Mustard, Chickpea, Groundnut, Green gram/Black Gram etc. and start land preparation for nursery sowing of Rabi Paddy where irrigation facilities are available. Deworming and vaccination should be advised in animals to boost immunity and protect them from any harmful diseases.",
   "crops_data": {
      "rice": {
         "advisory": [
            "If rice is at maturity stage, stop irrigation in the field before harvesting. Harvest the plants when 80-85% of the grains have matured and the plant looks pale yellow in color.",
            "After harvesting rice should be dried in the field for 2-3 days and thereafter threshing should be done. Rice should be stored at a moisture level of 12% in safe places."
         ]
      },
      "green gram": {
         "advisory": [
            "One week before sowing, seed should be treated with carbendazim @ 1.5-2.0g and imidacloprid @ 5g per kg seeds. Seven days after this treatment, 200g Rizobium culture and 3-4g sodium molybdate should be mixed in 10kg seeds in 400ml of water and mixed it thoroughly and dry it in shade for half an hour then go for sowing in field. Seed should be sown with a seed rate of 8-10 kg/ac with a spacing of 30cm×10cm.",
            "Varieties: Green Gram: - Kamadeva, Durga, IPM 02-3, IPM 02-14, TARM1."
         ]
      },
      "black gram": {
         "advisory": [
            "One thinning operation should be advised to maintain optimum plant population in mustard in case of dense planting. Hoeing and weeding operation is advised in case of crop 15 to 20 day’s old crop."
         ]
      },
      "mustard": {
         "advisory": [
            "Farmers who have not yet sown seeds can use improved Groundnut varieties such as TAG-24, JL-24, Girnar-3, Smruti, TG-3, TG-22, Kadri-5, Kadri-6, Kadri-9, TPG-41, GPBD-4, Devi, CO-7, Dharani and Divya etc. All these varieties are harvested within 100 to 130 days.",
            "Ensure seed treatment before sowing of seed and if possible, treat with bacteria or phospho culture 7 days after treatment. For 10 kg of seed, farmer can use 200 grams of rhizobium culture and 200 grams of phospho culture within 3 hours of sowing. 40 to 50 kg of seed or 60 to 70 kg of pod is required per acre. Seeds should be sown within 2 to 3 days of husking at a depth of 5 cm."
         ]
      },
      "ground nut": {
         "advisory": [
            "If the seedlings are of 10 days old, it is recommended to conduct gap filling where the seedlings have not emerged."
         ]
      },
      "cole crop": {
         "advisory": [
            "During planting, polythene can be used as mulching material or if planting already done straw can be used for same purpose to maintain moisture as well as soil temperature vegetable crops.",
            "Regular monitoring against the attack of Diamond back moth in cauliflower should be advised and if possible, farmers should use pheromone trap in field for this purpose."
         ]
      }
   },
   "date": "29-11-2024"
}