{
   "weather_details": {
      "02-11-2024": {
         "rainfall": 0.4,
         "t_max": 32,
         "t_min": 24,
         "rh_max": 85.3,
         "rh_min": 39.9,
         "wind_speed": 2,
         "wind_direction": 297,
         "cloud_cover": 4
      },
      "03-11-2024": {
         "rainfall": 0.1,
         "t_max": 32,
         "t_min": 23,
         "rh_max": 73.6,
         "rh_min": 36.3,
         "wind_speed": 1,
         "wind_direction": 0,
         "cloud_cover": 4
      },
      "04-11-2024": {
         "rainfall": 0.1,
         "t_max": 32,
         "t_min": 23,
         "rh_max": 73.8,
         "rh_min": 35.3,
         "wind_speed": 2,
         "wind_direction": 259,
         "cloud_cover": 3
      },
      "05-11-2024": {
         "rainfall": 0.2,
         "t_max": 31,
         "t_min": 23,
         "rh_max": 73.9,
         "rh_min": 36.5,
         "wind_speed": 2,
         "wind_direction": 225,
         "cloud_cover": 3
      },
      "06-11-2024": {
         "rainfall": 0.2,
         "t_max": 31,
         "t_min": 22,
         "rh_max": 79.8,
         "rh_min": 41.4,
         "wind_speed": 1,
         "wind_direction": 236,
         "cloud_cover": 2
      }
   },
   "names_of_crops": [
      "ଧାନ।",
      "କପା",
      "ସୋରିଷ ଏବଂ ତୋରିଆ",
      "ଅରହର",
      "ବାଇଗଣ",
      "ଲଙ୍କା",
      "ଗୋରୁ ଏବଂ ମଇଁଷି",
      "ଛେଳି ଏବଂ ମେଣ୍ଢା",
      "କୁକୁଡ଼ା ମାଂସ"
   ],
   "general_advisory": "ପରିପକ୍ୱ ହୋଇଥିବା ପନିପରିବା ଏବଂ ଡାଲି ଅମଳ କରନ୍ତୁ ଏବଂ ଏକ ସୁରକ୍ଷିତ ସ୍ଥାନରେ ଷ୍ଟୋର୍ କରନ୍ତୁ | ପ୍ଲାଷ୍ଟିକ୍ କିମ୍ବା ପଲିଥିନ୍ ଶୀଟ୍ ଦ୍ୱାରା ଆଚ୍ଛାଦନ କରି ଥଣ୍ଡା, ଟମାଟୋ, ପିଆଜ୍, କୋଲ୍ ଫସଲ ଏବଂ ବାଇଗଣ ଇତ୍ଯ଼ାଦି ପନିପରିବା ନର୍ସରୀକୁ ବର୍ଷାରୁ ରକ୍ଷା କରନ୍ତୁ |",
   "crops_data": {
      "paddy": {
         "advisory": [
            "ଶୀଘ୍ର ପରିପକ୍ୱ ହେଉଥିବା କିସମଗୁଡ଼ିକରେ, ଫସଲ ଅମଳ କରନ୍ତୁ ଯେତେବେଳେ 80-85% ଶସ୍ଯ଼ ହାତ ଦ୍ୱାରା ହାତୁଡ଼ି ଦ୍ୱାରା କିମ୍ବା କମ୍ବାଇନ୍ ହାରଭେଷ୍ଟର କିମ୍ବା ରିପ୍ପର୍ ବ୍ଯ଼ବହାର କରି ପରିପକ୍ୱ ହୁଏ | ଧାନ ଶସ୍ଯ଼କୁ 14 ପ୍ରତିଶତ ଆର୍ଦ୍ରତା ପର୍ଯ୍ଯ଼ନ୍ତ ସୂର୍ଯ୍ଯ଼ାଲୋକରେ ଶୁଖାଇବା ଆବଶ୍ଯ଼କ।",
            "କୀଟ ପରିଚାଳନାଃ ବି. ପି. ଏଚ୍.: ଧାନର ଏହି ପର୍ଯ୍ଯ଼ାଯ଼ରେ ବି. ପି. ଏଚ୍. ସଂକ୍ରମଣ ପରିଲକ୍ଷିତ ହୋଇପାରେ। ଯଦି ବ୍ରାଉନ୍ ପ୍ଲାଣ୍ଟପର୍ (ବିପିଏଚ) ର ଜନସଂଖ୍ଯ଼ା ଇଟିଏଲ (5-10 ହପର୍ସ୍/ହିଲ୍) ରୁ ଅଧିକ ହୁଏ, ତେବେ କୃଷକମାନଙ୍କୁ ବିକଳ୍ପ ଭିଜା ଏବଂ ଶୁଖାଇବା କୌଶଳ ଗ୍ରହଣ କରିବାକୁ ପରାମର୍ଶ ଦିଆଯାଇଛି।",
            "ବିପିଏଚ ସଂକ୍ରମଣ ସମଯ଼ରେ ନାଇଟ୍ରୋଜେନ ସାର ବ୍ଯ଼ବହାରରୁ ଦୂରେଇ ରୁହନ୍ତୁ।"
         ]
      },
      "cotton": {
         "advisory": [
            "ଆମେରିକୀଯ଼ ବୋଲୱର୍ମଃ ରାସାଯ଼ନିକ ନିଯ଼ନ୍ତ୍ରଣ ପାଇଁ, ଅଣ-ବି. ଟି. କପା ଅଞ୍ଚଳରେ ଆମେରିକୀଯ଼ ବୋଲୱର୍ମକୁ ନିଯ଼ନ୍ତ୍ରଣ କରିବା ପାଇଁ 10 ଲିଟର ପାଣି ସହିତ ଏମାମେକ୍ଟିନ୍ ବେନ୍ଜୋଏଟ୍ 5 ପ୍ରତିଶତ ଏସ୍. ଜି. @4ଜି କିମ୍ବା ପ୍ରୋଫେନୋଫସ୍ 50 ପ୍ରତିଶତ ଇ. ସି. @30 ମିଲି. ମିଶ୍ରଣ କରନ୍ତୁ।",
            "ବ୍ୟାକ୍ଟେରିଆଲ୍ ଲିଫ୍ ବ୍ଲାଇଟ୍ଃ ଷ୍ଟ୍ରିପ୍ଟୋସାଇକ୍ଲିନ୍ 1.5 ଗ୍ରାମ୍ + କପର ଅକ୍ସିକ୍ଲୋରାଇଡ୍ 50 ପ୍ରତିଶତ ଡବ୍ଲ୍ୟୁ. ପି. ଲଗାନ୍ତୁ।"
         ]
      },
      "mustard & toria": {
         "advisory": [
            "ଅକ୍ଟୋବର ମଧ୍ଯ଼ଭାଗରୁ ନଭେମ୍ବର ମଧ୍ଯ଼ଭାଗ ପର୍ଯ୍ଯ଼ନ୍ତ ବୁଣିବା ପାଇଁ ଉପଯୁକ୍ତ ସମଯ଼। ବୀଜ ବୁଣିବା ପୂର୍ବରୁ ଥିରମ୍ @2.5g/kg କିମ୍ବା ବାଭିଷ୍ଟିନ୍ @2 ଗ୍ରାମ୍/କେଜି ମଞ୍ଜି ବ୍ଯ଼ବହାର କରନ୍ତୁ।",
            "ସୋରିଷ <ଆଇ. ଡି. 2> କି. ଗ୍ରା./ଏକର ଏବଂ <ଆଇ. ଡି. 1> କି. ଗ୍ରା./ଏକର ପାଇଁ ବିହନ ଦର ତୋରିଆ ପାଇଁ ଉଦ୍ଦିଷ୍ଟ।",
            "ଉପଯୁକ୍ତ କିସମଃ ସୋରିଷ-ପୁସା ବୋଲ୍ଡ, ପୁସା ଜଯ଼କିସାନ, ଜେଡି-6। ତୋରିଆ-ଏମ୍ 29, ଅନୁରାଧା, ପାର୍ବତୀ।"
         ]
      },
      "arhar": {
         "advisory": [
            "ଲିଫ୍ ୱେବର୍/ଲିଫ୍ ଫୋଲ୍ଡର୍/ଡିଫୋଲିଏଟର୍ଃ ଏହି ପର୍ଯ୍ଯ଼ାଯ଼ରେ ଏହି କୀଟପତଙ୍ଗ ଦେଖିବାକୁ ମିଳିପାରେ। ନିଯ଼ନ୍ତ୍ରଣ ପାଇଁ ପ୍ରୋଫେନୋଫସ୍ 50 ପ୍ରତିଶତ ଇସି କିମ୍ବା କ୍ଲୋରପାଇରିଫସ୍ 50 ପ୍ରତିଶତ + ସାଇପର୍ମେଥ୍ରିନ୍ 5 ପ୍ରତିଶତ ଇସି @2 ମିଲି/ଲିଟର @2 ମିଲି/ଲିଟର ପାଣି ସ୍ପ୍ରେ କରନ୍ତୁ।",
            "ପୋଡ୍ ବୋରର୍ଃ ନିଯ଼ନ୍ତ୍ରଣ କରିବା ପାଇଁ, ନିମ୍ବ-ଆଧାରିତ କୀଟନାଶକ ଆଜାଦିରାକ୍ଟିନ୍ 0.03% (300 ପିପିଏମ୍) @5 ମିଲି/ଲିଟର ଜଳ ପ୍ରଯ଼ୋଗ କରନ୍ତୁ।"
         ]
      },
      "brinjal": {
         "advisory": [
            "ଛେଦକ କୀଟ ଉପରେ ନଜର ରଖିବା ପାଇଁ, କୃଷକମାନଙ୍କୁ ଏକର ପିଛା 8 ହାରରେ ଫେରୋମୋନ୍ ଫାନ୍ଦ ବ୍ୟବହାର କରିବାକୁ ପରାମର୍ଶ ଦିଆଯାଇଛି। ରାସାୟନିକ ନିୟନ୍ତ୍ରଣ ପାଇଁ, ସ୍ପିନୋସାଦ୍ 45 ପ୍ରତିଶତ ଏସ୍. ସି. @1.5 ମିଲି/4 ଲିଟର ପାଣି କିମ୍ବା ଏମାମେକ୍ଟିନ୍ ବେନ୍ଜୋଏଟ୍ 5 ପ୍ରତିଶତ ଏସ୍. ଜି. @4 ଗ୍ରାମ୍/10 ଲିଟର ପାଣି କିମ୍ବା ଥିଓଡିକାର୍ବ 75 ପ୍ରତିଶତ ଡବ୍ଲ୍ୟୁ. ପି. @2 ମିଲି/ଲିଟର ପାଣି ସିଞ୍ଚନ କରନ୍ତୁ।"
         ]
      },
      "chilli": {
         "advisory": [
            "ଥ୍ରୀପ୍ସର ସଂକ୍ରମଣ ପରିଲକ୍ଷିତ ହୋଇଛି। ଯଦି ପତ୍ରଗୁଡ଼ିକ ଉପରକୁ ଘୁଞ୍ଚିଯାଏ ତେବେ ଗଛଗୁଡ଼ିକ ଥ୍ରୀପ୍ ଦ୍ୱାରା ପ୍ରଭାବିତ ହୁଅନ୍ତି |",
            "ଥ୍ରିପ୍ସ ସଂକ୍ରମଣର ପରିଚାଳନା ପାଇଁ ବ୍ଲୁ ଷ୍ଟିକି ଟ୍ରାପ୍ @8 nos./acre.For ରାସାଯ଼ନିକ ନିଯ଼ନ୍ତ୍ରଣ ସ୍ପ୍ରେ ଏମାମେକ୍ଟିନ୍ ବେନ୍ଜୋଏଟ୍ 5 ପ୍ରତିଶତ ଏସଜି @0.4 ଗ୍ରାମ/ଲିଟର କିମ୍ବା ଫିପ୍ରୋନିଲ୍ 5 ପ୍ରତିଶତ ଏସସି @2 ମିଲି/ଲିଟର କିମ୍ବା ଇମିଡାକ୍ଲୋପ୍ରିଡ୍ 17.8% ଏସଏଲ 0.35 ମିଲି/ଲିଟର ପାଣି ଲଗାନ୍ତୁ।"
         ]
      },
      "cattle & buffalo": {
         "advisory": [
            "ନିଯ଼ମିତ ବ୍ଯ଼ବଧାନରେ ଗୋରୁ ଏବଂ ମଇଁଷିକୁ କୃମି ମୁକ୍ତ କରନ୍ତୁ ଏବଂ ସେମାନଙ୍କୁ ଟୀକାକରଣ ମଧ୍ଯ଼ କରନ୍ତୁ। 4 ବର୍ଷ ପରେ ମଧ୍ଯ଼ ଯଦି ପଶୁଟି ଗରମ ହେଉନାହିଁ, ତେବେ ପଶୁ ଚିକିତ୍ସକଙ୍କ ସହ ପରାମର୍ଶ କରନ୍ତୁ ଏବଂ ଯୌବନ ଆରମ୍ଭ କରିବା ପାଇଁ ଡାକ୍ତରଙ୍କ ପରାମର୍ଶ ଅନୁସରଣ କରନ୍ତୁ।"
         ]
      },
      "goat & sheep": {
         "advisory": [
            "ନିର୍ଜଲୀକରଣ, ଉତ୍ତାପ ଚାପ ଏବଂ ପରଜୀବୀ ସଂକ୍ରମଣର ଲକ୍ଷଣ ପାଇଁ ନିଯ଼ମିତ ଭାବରେ ପଶୁମାନଙ୍କୁ ଯାଞ୍ଚ କରନ୍ତୁ | ଆବଶ୍ଯ଼କ ଅନୁଯାଯ଼ୀ କୃମି ପଶୁମାନଙ୍କୁ ଛାଡ଼ନ୍ତୁ ଏବଂ ସେମାନଙ୍କୁ ପାଦ ଏବଂ ପାଟି ରୋଗ, ପିପିଆର ପରି ସାଧାରଣ ରୋଗ ବିରୁଦ୍ଧରେ ଟୀକାକରଣ କରନ୍ତୁ |"
         ]
      },
      "poultry": {
         "advisory": [
            "କୁକୁଡ଼ା ଘରେ ଉଠାଯାଇଥିବା ପ୍ଲାଟଫର୍ମ ଏବଂ ଗଭୀର ଆବର୍ଜନା ବ୍ୟବସ୍ଥା ସ୍ୱଚ୍ଛତା ଏବଂ ତାପମାତ୍ରା ନିୟନ୍ତ୍ରଣ ବଜାୟ ରଖିବାରେ ସାହାଯ୍ୟ କରେ | ବର୍ଷା ପରେ ଅତ୍ୟଧିକ ଆର୍ଦ୍ରତା ପରିସ୍ଥିତିରେ ଜୀବାଣୁ ସୃଷ୍ଟି ନହେବା ପାଇଁ ନିୟମିତ ଭାବରେ ଘରକୁ ସଫା ଏବଂ ଜୀବାଣୁମୁକ୍ତ କରନ୍ତୁ | ଚାପ ହ୍ରାସ କରିବା ଏବଂ ଅତ୍ୟଧିକ ଉତ୍ତାପକୁ ରୋକିବା ପାଇଁ ଉପଯୁକ୍ତ ଷ୍ଟକିଂ ଘନତ୍ୱ ବଜାୟ ରଖନ୍ତୁ |"
         ]
      }
   },
   "date": "01-11-2024",
   "ERROR": "ନିୟମିତ ତଥ୍ୟ ମିଳୁନାହିଁ।"
}