{
   "weather_details": {
      "06-12-2024": {
         "rainfall": 2,
         "t_max": 28,
         "t_min": 16,
         "rh_max": 86,
         "rh_min": 0,
         "wind_speed": 3,
         "wind_direction": 27,
         "cloud_cover": 4
      },
      "07-12-2024": {
         "rainfall": 0,
         "t_max": 29,
         "t_min": 15,
         "rh_max": 81,
         "rh_min": 0,
         "wind_speed": 3,
         "wind_direction": 63,
         "cloud_cover": 1
      },
      "08-12-2024": {
         "rainfall": 2,
         "t_max": 30,
         "t_min": 13,
         "rh_max": 0,
         "rh_min": 82,
         "wind_speed": 3,
         "wind_direction": 63,
         "cloud_cover": 0
      },
      "09-12-2024": {
         "rainfall": 0,
         "t_max": 27,
         "t_min": 15,
         "rh_max": 0,
         "rh_min": 70,
         "wind_speed": 2,
         "wind_direction": 51,
         "cloud_cover": 0
      },
      "11-12-2024": {
         "rainfall": 0,
         "t_max": 27,
         "t_min": 13,
         "rh_max": 86,
         "rh_min": 43,
         "wind_speed": 3,
         "wind_direction": 27,
         "cloud_cover": 4
      },
      "12-12-2024": {
         "rainfall": 0,
         "t_max": 27,
         "t_min": 12,
         "rh_max": 81,
         "rh_min": 37,
         "wind_speed": 3,
         "wind_direction": 63,
         "cloud_cover": 1
      },
      "13-12-2024": {
         "rainfall": 0,
         "t_max": 26,
         "t_min": 12,
         "rh_max": 82,
         "rh_min": 32,
         "wind_speed": 2,
         "wind_direction": 63,
         "cloud_cover": 0
      },
      "14-12-2024": {
         "rainfall": 0,
         "t_max": 26,
         "t_min": 12,
         "rh_max": 70,
         "rh_min": 29,
         "wind_speed": 2,
         "wind_direction": 51,
         "cloud_cover": 0
      },
      "15-12-2024": {
         "rainfall": 0,
         "t_max": 26,
         "t_min": 12,
         "rh_max": 66,
         "rh_min": 22,
         "wind_speed": 3,
         "wind_direction": 40,
         "cloud_cover": 0
      }
   },
   "names_of_crops": [
      "ଚାଉଳ",
      "ଅରହର",
      "ଚିନାବାଦାମ",
      "ସୋରିଷ",
      "ଫୁଲକୋବି",
      "କଦଳୀ",
      "ବ୍ରୋକୋଲି",
      "ଓକ୍ରା",
      "ଗାଈ।",
      "ଛେଳି।",
      "କୁକୁଡ଼ା ମାଂସ"
   ],
   "general_advisory": "କ୍ଷେତରେ ଶେଷ ହଳ କରିବା ସମୟରେ ଭଲ ଭାବେ ସଙ୍କୁଚିତ ଫାର୍ମ ୟାର୍ଡ ସାର/ଭର୍ମିକମ୍ପୋଷ୍ଟ ଲଗାନ୍ତୁ। କୌଣସି ଫସଲ ଉଠାଇବା ପୂର୍ବରୁ, ମୃତ୍ତିକାର ନମୁନା ସଂଗ୍ରହ କରନ୍ତୁ ଏବଂ ନିକଟସ୍ଥ ମୃତ୍ତିକା ପରୀକ୍ଷଣ ପରୀକ୍ଷାଗାରରେ ଏହାର ପରୀକ୍ଷା କରନ୍ତୁ। ମୃତ୍ତିକା ସ୍ୱାସ୍ଥ୍ୟ କାର୍ଡରେ ଉଲ୍ଲିଖିତ ମୃତ୍ତିକା ପରୀକ୍ଷା ଆଧାରିତ ସୁପାରିଶ ଅନୁଯାୟୀ ସମସ୍ତ ଫସଲରେ ସନ୍ତୁଳିତ ସାର ପ୍ରୟୋଗ କରନ୍ତୁ। ଶୀତ ଋତୁ ଆରମ୍ଭ ହେବା ପୂର୍ବରୁ ଛେଳି ଘର ମରାମତି କରିବାକୁ କୃଷକମାନଙ୍କୁ ପରାମର୍ଶ ଦିଆଯାଇଛି କାରଣ ଥଣ୍ଡା ପାଗ ହେତୁ ପିଲାମାନଙ୍କ ମଧ୍ୟରେ ମୃତ୍ୟୁ ହେବାର ଅଧିକ ସମ୍ଭାବନା ରହିଛି।",
   "crops_data": {
      "rice": {
         "advisory": [
            "ଖରିଫ ଧାନ ଅମଳ ଜାରି ରହିଛି। କୃଷକମାନଙ୍କୁ ଭଲ ମୂଲ୍ୟ ପାଇଁ ମିଶ୍ରଣ ନକରି ଅଲଗା ଅଲଗା କିସମର ଅମଳ ଏବଂ ପ୍ରକ୍ରିୟାକରଣ କରିବାକୁ ପରାମର୍ଶ ଦିଆଯାଇଛି। ଧାନ ସଂରକ୍ଷଣ କରିବା ପୂର୍ବରୁ ଏହାକୁ ଭଲ ଭାବେ ଶୁଖାଇବା ଉଚିତ।",
            "ଖରିଫ ଧାନର ଅବଶିଷ୍ଟାଂଶ କ୍ଷେତରେ ନ ଜଳାଇବାକୁ କୃଷକମାନଙ୍କୁ ପରାମର୍ଶ ଦିଆଯାଇଛି କାରଣ ଏହା କେବଳ ପରିବେଶକୁ ପ୍ରଦୂଷିତ କରେ ନାହିଁ ବରଂ ଗୁରୁତର ସ୍ୱାସ୍ଥ୍ୟ (ଶ୍ୱାସକ୍ରିୟା) ସମସ୍ୟା ମଧ୍ୟ ସୃଷ୍ଟି କରେ। ଧାନ ଫସଲର ଅବଶିଷ୍ଟାଂଶକୁ ମାଟିରେ ମିଶାଇବାକୁ କୃଷକମାନଙ୍କୁ ପରାମର୍ଶ ଦିଆଯାଇଛି। ଏହା ମୃତ୍ତିକାର ଉର୍ବରତା ବୃଦ୍ଧି କରିଥାଏ ଏବଂ ମୃତ୍ତିକାର ବାଷ୍ପୀକରଣ ହ୍ରାସ କରିବା ଏବଂ ମୃତ୍ତିକାର ଆର୍ଦ୍ରତା ସଂରକ୍ଷଣ କରିବା ପାଇଁ ମଲ୍ଚିଙ୍ଗ ଭାବେ ବ୍ୟବହାର କରାଯାଇପାରିବ।",
            "ଯଦି 'ମୂଷା/ମୂଷା' ସମସ୍ୟା ଦେଖାଯାଏ, ତେବେ ଫସଲ କ୍ଷେତ ଏବଂ ଆଖପାଖ ଅଞ୍ଚଳରେ ମୂଷା ଗର୍ତ୍ତକୁ ଚିହ୍ନଟ କରନ୍ତୁ | ଆଲୁମିନିୟମ୍ ଫସଫାଇଡ୍ 6 ପ୍ରତିଶତ ଟାବଲେଟ୍ ପ୍ରତି ଗର୍ତ୍ତରେ ଗୋଟିଏ ଟାବଲେଟ୍ (12 ଗ୍ରାମ୍) ରଖି ଗର୍ତ୍ତକୁ କାଦୁଅରେ ବନ୍ଦ କରିଦିଅନ୍ତୁ।"
         ]
      },
      "arhar": {
         "advisory": [
            "ପ୍ରଚଳିତ ପାଣିପାଗ ସ୍ଥିତି ପରବର୍ତ୍ତୀ କୀଟ ଆକ୍ରମଣକୁ ସମର୍ଥନ କରେ | ଆବଶ୍ୟକତା ଅନୁଯାୟୀ ସୁପାରିସ କରାଯାଇଥିବା ନିୟନ୍ତ୍ରଣ ପଦକ୍ଷେପଗୁଡ଼ିକୁ ଅନୁସରଣ କରନ୍ତୁ।",
            "ଶୁଣ୍ଢ ଛେଦକକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ, ବେନଫୁରାକାର୍ବ 40 ପ୍ରତିଶତ ଇସି @1ଲିଟ୍/ଏସି କିମ୍ବା ଡେଲ୍ଟାମେଥ୍ରିନ୍ 2.8 ପ୍ରତିଶତ ଇସି @200 ମିଲି/ଏସି କିମ୍ବା ସ୍ପିନୋସାଡ୍ 45 ପ୍ରତିଶତ ଏସସି @60 ମିଲି/ଏସି କିମ୍ବା ଫ୍ଲୁବେଣ୍ଡିଆମାଇଡ୍ 39.35% ଏସସି @40 ମିଲି/ଏସି ସହିତ 200 ଲିଟର ପାଣି ମିଶାଇ ଲଗାନ୍ତୁ।",
            "ପୋଡ୍ ଶୋଷକ ବଗ୍ ଏବଂ ଏଫିଡ୍ କୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ, ଥିୟାମେଥୋକ୍ସାମ୍ 25 ପ୍ରତିଶତ ଡବ୍ଲୁଜି @40 ଗ୍ରାମ୍/ଏସି କିମ୍ବା ଇମିଡାକ୍ଲୋପ୍ରିଡ୍ 17.8% ଏସ୍ଏଲ୍ @60 ମିଲି/ଏକର ସହିତ 200 ଲିଟର ପାଣି ମିଶାଇ ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "groundnut": {
         "advisory": [
            "2 ରୁ 3 ଡିଏଏସରେ 200 ଲିଟର ପାଣି ସହିତ 80 ମିଲି/ଏକରରେ ଅକ୍ସିଫ୍ଲୋରଫେନ୍ ଇ. ସି. ଲଗାନ୍ତୁ।",
            "ଇମାଜେଥାପାଇର୍ 10 ପ୍ରତିଶତ ଏସ୍. ଏଲ୍. @3 ମିଲି/ଲିଟର ପାଣି 15 ଡିଏଏସ୍ ମଧ୍ୟରେ ଏକ ପ୍ରାରମ୍ଭିକ ପୋଷ୍ଟ-ଇମର୍ଜେନ୍ସ୍ ହର୍ବିସାଇଡ୍ ଭାବରେ ପ୍ରୟୋଗ କରନ୍ତୁ |"
         ]
      },
      "mustard": {
         "advisory": [
            "1-2 ଡିଏଏସରେ 3 ମିଲି/ଲିଟର ଜଳ କିମ୍ବା 15-20 ଡିଏଏସରେ 2 ମିଲି/ଲିଟର ଜଳ ଉତ୍ତୋଳନ ପରେ କୁଇଜାଲୋଫପ-ଇଥାଇଲ 5 ପ୍ରତିଶତ ଇସିରେ ଅକ୍ସାଡିଆର୍ଜିଲ 6 ପ୍ରତିଶତ ଇସି ପ୍ରୟୋଗ କରନ୍ତୁ।"
         ]
      },
      "cauliflower": {
         "advisory": [
            "ଡିମଣ୍ଡ ବ୍ୟାକ୍ ମଥ୍କୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ ଜୈବ କୀଟନାଶକ ଆଜାଦିରାକ୍ଟିନ 0.03% (300 ପିପିଏମ) ଲିଟର ପିଛା 5 ମିଲି ପାଣି କିମ୍ବା ବିଉଭେରିଆ ବାସିଆନା 5 ପ୍ରତିଶତ ଡବ୍ଲ୍ୟୁ. ପି. ଲିଟର ପିଛା 800 ଗ୍ରାମ ପାଣି ସହିତ 200 ଲିଟର ପାଣି ମିଶାଇ ସ୍ପ୍ରେ କରନ୍ତୁ। ରାସାୟନିକ ନିୟନ୍ତ୍ରଣ ପାଇଁ, ଫାଇପ୍ରୋନିଲ୍ 5 ପ୍ରତିଶତ ଏସ୍. ସି. @2 ମିଲି/ଲିଟର କିମ୍ବା କ୍ଲୋରପାଇରିଫସ୍ 20 ପ୍ରତିଶତ ଇ. ସି. @4 ମିଲି/ଲିଟର ପାଣି ସିଞ୍ଚନ କରନ୍ତୁ।",
            "ତମାଖୁ ପତ୍ର ଖାଉଥିବା କ୍ୟାଟର୍ପିଲରକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ, ସାଇଣ୍ଟ୍ରାନିଲିପ୍ରୋଲ 10.26% ଓଡି @6 ମିଲି/5 ଲିଟର ପାଣି ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "okra": {
         "advisory": [
            "ଓକ୍ରାରେ ଏଫିଡ୍ ସଂକ୍ରମଣ ହେତୁ ୱାଇ. ଏମ୍. ଭି. ର ଭେକ୍ଟର ଏବଂ ପତ୍ର କୁଣ୍ଡାଇକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ, ବୁପ୍ରୋଫେଜିନ୍ 15 ପ୍ରତିଶତ + ଆସେଫେଟ୍ 35 ପ୍ରତିଶତ ଡବ୍ଲ୍ୟୁ. ପି. ଲିଟର ପିଛା 1.5 ଗ୍ରାମ୍ କିମ୍ବା 15 ଲିଟର ପାଣିରେ ଥିୟାମେଥୋକ୍ସାମ୍ 25 ପ୍ରତିଶତ ଡବ୍ଲ୍ୟୁ. ଜି. 3 ଗ୍ରାମ୍ ସ୍ପ୍ରେ କରନ୍ତୁ।",
            "ଓକ୍ରାରେ ଫଳ ଛେଦକକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ, ନିମ୍ବ-ଆଧାରିତ କୀଟନାଶକକୁ ଏକର ପିଛା 600 ମିଲିଲିଟରରେ 1500 ପିପିଏମ ସ୍ପ୍ରେ କରନ୍ତୁ। ପରବର୍ତ୍ତୀ ପର୍ଯ୍ୟାୟରେ ସ୍ପିନୋସାଡ୍ 45 ପ୍ରତିଶତ ଏସ୍. ସି. @70 ମିଲି/ଏକରରେ ସିଞ୍ଚନ କରନ୍ତୁ।"
         ]
      },
      "cow": {
         "advisory": [
            "ପର୍ଯ୍ୟାପ୍ତ ପରିମାଣର ସବୁଜ ଘାସ ଯୋଗାଇ ଦିଅନ୍ତୁ। ଉତ୍ତମ ଉତ୍ପାଦନ ପାଇଁ ସ୍ତନ୍ୟପାନ କରାଉଥିବା ପଶୁମାନଙ୍କୁ ଘନୀଭୂତ ମିଶ୍ରଣ ପ୍ରଦାନ କରାଯିବା ଉଚିତ।"
         ]
      },
      "goat": {
         "advisory": [
            "ଶୀତ ଋତୁ ଆରମ୍ଭ ହେବା ପୂର୍ବରୁ ଛେଳି ଘର ମରାମତି କରିବାକୁ କୃଷକମାନଙ୍କୁ ପରାମର୍ଶ ଦିଆଯାଇଛି କାରଣ ଥଣ୍ଡା ପାଗ ହେତୁ ପିଲାମାନଙ୍କ ମଧ୍ୟରେ ମୃତ୍ୟୁ ହେବାର ଅଧିକ ସମ୍ଭାବନା ରହିଛି।"
         ]
      },
      "poultry": {
         "advisory": [
            "ମୃତ୍ୟୁ ହାର ହ୍ରାସ କରିବା ପାଇଁ ବିଶେଷ କରି ରାତିରେ ଛୁଆମାନଙ୍କୁ ଉତ୍ତାପ ପ୍ରଦାନ କରିବା ପାଇଁ ଆବଶ୍ୟକ ବ୍ୟବସ୍ଥା କରନ୍ତୁ। ଛୁଆମାନଙ୍କ ପାଇଁ ଉପଯୁକ୍ତ ପ୍ରଜନନ ବ୍ୟବସ୍ଥା କରନ୍ତୁ। କୁକୁଡ଼ା ଘରକୁ ସଫା ରଖନ୍ତୁ ଏବଂ କ୍ଲାମ୍ପ ମୁକ୍ତ ରଖନ୍ତୁ |"
         ]
      }
   },
   "date": "10-12-2024",
   "ERROR": "ନିୟମିତ ତଥ୍ୟ ମିଳୁନାହିଁ।"
}