{
   "weather_details": {
      "2024-11-27": {
         "rainfall": 0.1,
         "t_max": 27,
         "t_min": 15,
         "rh_max": 73,
         "rh_min": 38,
         "wind_speed": 4,
         "wind_direction": 345,
         "cloud_cover": 2
      },
      "2024-11-28": {
         "rainfall": 0.1,
         "t_max": 27,
         "t_min": 16,
         "rh_max": 73,
         "rh_min": 42,
         "wind_speed": 5,
         "wind_direction": 356,
         "cloud_cover": 3
      },
      "2024-11-29": {
         "rainfall": 0.2,
         "t_max": 27,
         "t_min": 16,
         "rh_max": 80,
         "rh_min": 46,
         "wind_speed": 7,
         "wind_direction": 6,
         "cloud_cover": 2
      },
      "2024-11-30": {
         "rainfall": 2.0,
         "t_max": 26,
         "t_min": 15,
         "rh_max": 85,
         "rh_min": 52,
         "wind_speed": 7,
         "wind_direction": 9,
         "cloud_cover": 6
      },
      "2024-12-01": {
         "rainfall": 1.0,
         "t_max": 26,
         "t_min": 15,
         "rh_max": 90,
         "rh_min": 59,
         "wind_speed": 8,
         "wind_direction": 8,
         "cloud_cover": 4
      }
   },
   "names_of_crops": [
      "ଚାଉଳ",
      "ଅମରନ୍ଥ",
      "ସୂର୍ଯ୍ୟମୁଖୀ",
      "ବାଇଗଣ",
      "ଫୁଲକୋବି",
      "ରସୁଣ",
      "ଟମାଟୋ",
      "କଦଳୀ",
      "ପେଁପେ",
      "କାକୁଡ଼ି"
   ],
   "general_advisory": "କ୍ଷେତରେ ରହିବା ଏବଂ ଅଙ୍କୁରୋଦଗମକୁ ଏଡ଼ାଇବା ପାଇଁ ଶାରୀରିକ ପରିପକ୍ୱତା ପର୍ଯ୍ୟାୟରେ ଧାନ ଅମଳ କରନ୍ତୁ। ଛିଡ଼ା ହୋଇଥିବା ଧାନ ଫସଲରୁ ବର୍ଷାଜଳ ବାହାର କରିବା ପାଇଁ ଗଲି (ପାହି) ତିଆରି କରି ବ୍ୟବସ୍ଥା କରନ୍ତୁ ଏବଂ ନର୍ଦ୍ଦମାର ଶେଷ ଭାଗକୁ ଖୋଲା ରଖନ୍ତୁ। ଅମଳ ହୋଇଥିବା ଧାନକୁ ଅମଳ କରିବା ପାଇଁ ଯାଆନ୍ତୁ। ଅମଳ ପରେ, ଧାନ ଶସ୍ୟକୁ ଉପଭୋଗ ଉଦ୍ଦେଶ୍ୟରେ 14 ପ୍ରତିଶତ ଆର୍ଦ୍ରତା ପର୍ଯ୍ୟନ୍ତ ସୂର୍ଯ୍ୟାଲୋକରେ ଶୁଖାଇବା ଆବଶ୍ୟକ ଏବଂ ଉନ୍ନତ ଆତ୍ମ-ଜୀବନ ପାଇଁ ବୀଜ ଉଦ୍ଦେଶ୍ୟରେ ଏହାକୁ 12 ପ୍ରତିଶତ ଆର୍ଦ୍ରତା ପର୍ଯ୍ୟନ୍ତ ଶୁଖାଇବା ଆବଶ୍ୟକ | ଧାନ କ୍ଷେତ ଏବଂ କ୍ଷେତରେ ମୂଷାଙ୍କ ସଂକ୍ରମଣ ଦେଖିବାକୁ ମିଳିଛି। ବିଷାକ୍ତ ଚାରା ବ୍ୟବହାର କରନ୍ତୁ। 100 ଗ୍ରାମ୍ ବିଷ ଚାରା ପ୍ରସ୍ତୁତ କରିବା ପାଇଁ 96 ଗ୍ରାମ୍ ଅଟା, 2 ଗ୍ରାମ୍ ଖାଇବା ତେଲ ଏବଂ 2 ଗ୍ରାମ୍ ଜିଙ୍କ୍ ଫସଫାଇଡ୍ ମିଶାନ୍ତୁ। ମାଟି ପାତ୍ରରେ ପାଣି ବିଷାକ୍ତ ଚାରା ପାଖରେ ରଖନ୍ତୁ। ପ୍ରତ୍ୟେକ ମୂଷା ଛିଦ୍ରର ପାଟିରେ ଗୋଟିଏ ସେଲ୍ଫୋସ୍ ଟାବଲେଟ୍ ରଖନ୍ତୁ | ଅଧିକ ସମୟ ଧରି ଧାନ/ଚାଉଳର ସୁରକ୍ଷିତ ସଂରକ୍ଷଣ ପାଇଁ 'ସୁପର ଗ୍ରେନ୍ ବ୍ୟାଗ୍' ବ୍ୟବହାର କରନ୍ତୁ କିମ୍ବା ଅସମୟ ବର୍ଷା କାରଣରୁ କ୍ଷୟକ୍ଷତି ଏଡ଼ାଇବା ପାଇଁ ଅମଳ ହୋଇଥିବା ଧାନକୁ ସଠିକ୍ ବ୍ୟାଗରେ ଏବଂ ଉପଯୁକ୍ତ କଭର ସହିତ ଷ୍ଟ୍ୟାକ୍ କରି ରଖନ୍ତୁ | ଜଳସେଚନ ସୁବିଧା ଉପଲବ୍ଧ ଥିବା ସବୁଜ ଚଣା ଏବଂ କଳା ଚଣା ପାଇଁ କ୍ଷେତ ପ୍ରସ୍ତୁତି ଆରମ୍ଭ କରନ୍ତୁ, କ୍ଷେତରେ ଉପଲବ୍ଧ ମୃତ୍ତିକା ଆର୍ଦ୍ରତାକୁ ବ୍ୟବହାର କରି ମଧ୍ୟମ/ଅଗଭୀର ତଳିଆ ଅଞ୍ଚଳରେ ଚିନାବାଦାମ, କାଉପି ଭଳି ରବି ଫସଲ ଚାଷ କରନ୍ତୁ।",
   "crops_data": {
      "rice": {
         "advisory": [
            "ରୋପଣ କରାଯାଇଥିବା ଧାନ କଠିନ ମଇଦାରେ ଅମଳ (ତେରରୁ ସତୁରି ସପ୍ତାହ) ପର୍ଯ୍ୟାୟରେ ଅଛି | ସିଧାସଳଖ ବିହନ ବୁଣାଯାଇଥିବା ଧାନ ଫସଲ ଅମଳ ପର୍ଯ୍ୟାୟରେ ରହିଛି। ପରିପକ୍ୱତା ପର୍ଯ୍ୟାୟରେ ଫସଲ କ୍ଷେତରୁ ପାଣି ବାହାର କରନ୍ତୁ। ଅମଳ ହୋଇଥିବା ଧାନକୁ ଢାଙ୍କି ରଖନ୍ତୁ କିମ୍ବା ଆଚ୍ଛାଦିତ ଅମଳ ଚଟାଣକୁ ନେଇ ଯାଆନ୍ତୁ। ପୋକ କାଟିବାଃ ଅପରାହ୍ନ ସମୟରେ କ୍ଲୋରୋପାଇରିଫସ୍ 50 ପ୍ରତିଶତ + ସାଇପର୍ମେଥ୍ରିନ୍ 5 ପ୍ରତିଶତ ଇ. ସି. @400 ମିଲି କିମ୍ବା ପ୍ରୋଫେନୋଫସ୍ 50 ପ୍ରତିଶତ ଇ. ସି. ପ୍ରତି ଏକର 400 ମିଲି. ପ୍ରତି 200 ଲିଟର ପାଣିରେ ସ୍ପ୍ରେ କରନ୍ତୁ। ବ୍ରାଉନ୍ ପ୍ଲାଣ୍ଟ ହପର୍ଃ ବର୍ତ୍ତମାନର ପାଣିପାଗ ସ୍ଥିତିରେ ବିପିଏଚ ଦେଖିବାକୁ ମିଳିପାରେ। ଧାନ କ୍ଷେତରେ ବିପିଏଚ ପରିଚାଳନା କରିବା ପାଇଁ ପ୍ରତ୍ୟେକ 8-10 ଧାଡ଼ି ପରେ ଗଳି ପଥ ତିଆରି କରନ୍ତୁ, ବୁପ୍ରୋଫେଜିନ୍ + ଆସେଫେଟ୍ @30 ଗ୍ରାମ୍ କିମ୍ବା ଡାଇନୋଟେଫୁରାନ୍ @5 ଗ୍ରାମ୍ ପ୍ରତି 15 ଲିଟର ପାଣି ସିଞ୍ଚନ ଲାଭଦାୟକ ହୋଇପାରେ |",
            "ଯଦି ବ୍ରାଉନ୍ ପ୍ଲାଣ୍ଟ ହପର (ବିପିଏଚ) ର ଜନସଂଖ୍ୟା ଆର୍ଥିକ ସୀମା ସ୍ତର (ଇଟିଏଲ) (ଅର୍ଥାତ୍, 5-10 ହପର/ପାହାଡ) ଅତିକ୍ରମ କରେ, ତେବେ ବିକଳ୍ପ ଆର୍ଦ୍ରତା ଏବଂ ଶୁଖାଇବା କୌଶଳ ଦ୍ୱାରା ଧାନ କ୍ଷେତର ମାଇକ୍ରୋ-ଜଳବାୟୁ ପରିବର୍ତ୍ତନ କରିବାକୁ ପରାମର୍ଶ ଦିଆଯାଇଛି (ପାଣି ଦୀର୍ଘ ସମୟ ଧରି କ୍ଷେତରେ ଠିଆ ହେବା ଉଚିତ ନୁହେଁ)। ଯଦି ସମସ୍ୟା ଜାରି ରହେ, ତେବେ ଉପରୋକ୍ତ କୀଟପତଙ୍ଗ ନିୟନ୍ତ୍ରଣ ପାଇଁ ଗଛର ପାଦଦେଶରେ ଏକର ପିଛା 120 ଗ୍ରାମ୍ ପାଇମେଟ୍ରୋଜିନ୍ 50 ପ୍ରତିଶତ ଡବ୍ଲୁ. ଜି. କିମ୍ବା ଏକର ପିଛା 80 ଗ୍ରାମ୍ ଡାଇନୋଟେଫୁରାନ୍ 20 ପ୍ରତିଶତ ଏସ୍. ଜି. କିମ୍ବା ଏକର ପିଛା 60 ଗ୍ରାମ୍ ଫ୍ଲୋନିକାମିଡ୍ 50 ପ୍ରତିଶତ ଡବ୍ଲୁ. ଜି. କିମ୍ବା ଏକର ପିଛା 100 ମିଲି. ଟ୍ରାଇଫ୍ଲୁମେଜୋପାଇରିମ୍ 10 ପ୍ରତିଶତ ଏସ୍. ସି. ସ୍ପ୍ରେ କରନ୍ତୁ। ବିପିଏଚ ସଂକ୍ରମଣ ସମୟରେ ନାଇଟ୍ରୋଜେନ ସାର ବ୍ୟବହାରରୁ ଦୂରେଇ ରୁହନ୍ତୁ। ନେକ୍ ବ୍ଲାଷ୍ଟ ରୋଗକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ ପ୍ରଥମେ ଧାନ କ୍ଷେତରୁ ଅତିରିକ୍ତ ପାଣି ବାହାର କରନ୍ତୁ। ହେକ୍ଟର ପିଛା 400-ମିଲି ହେକ୍ସାକୋନାଜୋଲ କିମ୍ବା ଏକର ପିଛା 200-ମିଲି ଆଜୋକ୍ସିସ୍ଟ୍ରୋବିନ + ଡିଫେନୋକାନାଜୋଲ କିମ୍ବା ଏକର ପିଛା 80-ଗ୍ରାମ ଟେବୁକୋନାଜୋଲ + ଟ୍ରାଇଫ୍ଲୋକ୍ସିସ୍ଟ୍ରୋବିନ ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "amaranth": {
         "advisory": [
            "ଅକ୍ଟୋବରରୁ ମାର୍ଚ୍ଚ ମାସ ସବୁଜିମା ଅମାରାନ୍ଥ ପାଇଁ ଉପଯୁକ୍ତ। ଅମରନ୍ଥ ଦୁଇ ପ୍ରକାରର ହୋଇଥାଏ-ଧଳା କିମ୍ବା ଏକର ପିଛା 3 କି. ଗ୍ରା. ମଞ୍ଜି। 4 ଫୁଟ ଚଉଡ଼ା ବିଶିଷ୍ଟ 5 ଫୁଟ ଲମ୍ବ ଶଯ୍ୟା ସହିତ ଶଯ୍ୟା ଗୁଡ଼ିକୁ ବିଛାନ୍ତୁ, ଆଗାଛା ଗୁଡ଼ିକୁ ବାହାର କରନ୍ତୁ ଏବଂ 1ରୁ 2 ଝୁଡ଼ି ଏଫ୍. ଆଇ. ଏମ୍./ଶଯ୍ୟା ଲଗାନ୍ତୁ। ଛୋଟ ଆକାରର ମଞ୍ଜି ହେତୁ, ମଞ୍ଜି ସହିତ କିଛି ମୋଟା ବାଲି ମିଶାନ୍ତୁ, ସହଜ ଏବଂ ସମାନ sowing.After ବୁଣିବା ପାଇଁ ମଞ୍ଜି ଗୁଡ଼ିକୁ ମାଟିର ପତଳା ସ୍ତର ସହିତ ଢାଙ୍କି ଦିଅନ୍ତୁ ଏବଂ ଏହାକୁ ନଡ଼ିଆରେ ଢାଙ୍କି ହାଲୁକା ଜଳସେଚନ କରନ୍ତୁ। ନଡ଼ିଆ ବାହାରିବା ପରେ ତାକୁ ବାହାର କରିଦିଅନ୍ତୁ।"
         ]
      },
      "sunflower": {
         "advisory": [
            "ସୂର୍ଯ୍ୟମୁଖୀ ଏକ ଲାଭଜନକ ରବି ତୈଳବୀଜ ଫସଲ। ଏବେ ସୂର୍ଯ୍ୟମୁଖୀ ବୁଣିବା ପାଇଁ ସର୍ବୋତ୍ତମ ସମୟ। ମର୍ଡେନ୍, ସନ୍ରାଇଜ୍, ସୂର୍ଯ୍ୟ ଭଳି ଅଧିକ ଉତ୍ପାଦନକ୍ଷମ କିସମ ଏବଂ କେ. ବି. ଏସ୍. ଏଚ୍.-1, କେ. ବି. ଏସ୍. ଏଚ୍.-3 ଏବଂ ଏମ୍. ଏସ୍. ଏଫ୍. ଏଚ୍. ଭଳି ହାଇବ୍ରିଡ୍ କିସମ ଚାଷ କରନ୍ତୁ। ଅଧିକ ଉତ୍ପାଦନକ୍ଷମ କିସମ ପାଇଁ ଏକର ପିଛା 4 କି. ଗ୍ରା. ମଞ୍ଜି, ଜଳସେଚିତ ଅବସ୍ଥା ପାଇଁ 3 କି. ଗ୍ରା., ଜଳସେଚିତ ଅବସ୍ଥା ପାଇଁ ଏକର ପିଛା 2 କି. ଗ୍ରା. ମଞ୍ଜି, ଏବଂ ଜଳସେଚିତ ଅବସ୍ଥା ପାଇଁ ଏକର ପିଛା 1 କି. ଗ୍ରା. ମଞ୍ଜି ବ୍ୟବହାର କରନ୍ତୁ। ବୁଣିବା ପୂର୍ବରୁ ମଞ୍ଜିଗୁଡ଼ିକୁ 2 ଗ୍ରାମ୍ କାର୍ବେନଡାଜିମ୍/କି. ଗ୍ରା. ମଞ୍ଜି ସହିତ ଉପଚାର କରନ୍ତୁ। ଫସଲକୁ ଫଙ୍ଗାଲ୍ ୱିଲ୍ଟରୁ ରକ୍ଷା କରିବା ପାଇଁ, 4 ଗ୍ରାମ୍ ଟ୍ରାଇକୋଡର୍ମା/କେଜି ସହିତ ମଞ୍ଜି ଉପଚାର କରନ୍ତୁ | ବ୍ୟାଟର ଅଙ୍କୁରୋଦଗମ ପାଇଁ ମଞ୍ଜିଗୁଡ଼ିକୁ 10-12 ଘଣ୍ଟା ପର୍ଯ୍ୟନ୍ତ ଭିଜାଇ ରଖନ୍ତୁ। ପାଣି ବାହାର କରିବା ପରେ ଏକର ପିଛା 600 ଗ୍ରାମ୍ ପି. ଏସ୍. ବି. ଚାଷ ବ୍ୟବହାର କରନ୍ତୁ। ଅଧିକ ଉତ୍ପାଦନକାରୀ କିସମ ପାଇଁ ଏକର ପିଛା 8:16:12 କେଜି NPK ସହିତ 2 ଟନ୍ FYM ପ୍ରୟୋଗ କରନ୍ତୁ ଏବଂ ବୁଣିବା ପୂର୍ବରୁ ହାଇବ୍ରିଡ୍ ଭାରିଆଣ୍ଟି ପାଇଁ ଏହାର ଦ୍ୱିଗୁଣିତ କରନ୍ତୁ। ଦୋଆଁଶ ମାଟି ପାଇଁ 45 ସେ. ମି. ଏବଂ ଦୋଆଁଶ ମାଟି ପାଇଁ 60 ସେ. ମି. ବ୍ୟବଧାନ ରଖି 30 ସେ. ମି. ବ୍ୟବଧାନରେ ମଞ୍ଜି ବୁଣନ୍ତୁ।"
         ]
      },
      "brinjal": {
         "advisory": [
            "ବାଇଗଣରେ ଫୋମୋପ୍ସିସ୍ ବ୍ଲାଇଟ୍ ରୋଗକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ ମେଟାଲାକ୍ସିଲ୍ 8 ପ୍ରତିଶତ + ମାନକୋଜେବ୍ 64 ପ୍ରତିଶତ ଡବ୍ଲ୍ୟୁ. ପି. @400 ଗ୍ରାମ/ଏକର କିମ୍ବା ପ୍ରୋପିନେବ୍ 70 ପ୍ରତିଶତ ଡବ୍ଲ୍ୟୁ. ପି. @400 ଗ୍ରାମ/ଏକର ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "cauliflower": {
         "advisory": [
            "ଏକର ପିଛା 33 କି. ଗ୍ରା. ୟୁରିଆ ଏବଂ 23 କି. ଗ୍ରା. ଏମ୍. ଓ. ପି. ପ୍ରୟୋଗ କରନ୍ତୁ ଏବଂ 15-20 ଡି. ଏ. ଟି. ରେ ହାତ କାଟିବା ଏବଂ ଏକର ପିଛା 33 କି. ଗ୍ରା. ୟୁରିଆ ଏବଂ 23 କି. ଗ୍ରା. ଏମ୍. ଓ. ପି. କୁ 30-35 ଡି. ଏ. ଟି. ରେ ଶେଷ ଟପ୍ ଡ୍ରେସିଙ୍ଗ୍ ସାର ଭାବରେ ପ୍ରୟୋଗ କରନ୍ତୁ। ଯଦି ଚାରା ରୋପଣ ସମୟରେ ବୋରାକ୍ସ ପ୍ରୟୋଗ କରାଯାଇନଥାଏ, ତେବେ ବୋରାକ୍ସ ସ୍ପ୍ରେ @4 କେଜି/ଏକର କିମ୍ବା ଫୋଲିବୋର/ସଲ୍ୟୁବର ସ୍ପ୍ରେ @1.5 ଗ୍ରାମ/ଲିଟର। ପ୍ରତିରୋପଣର ଦୁଇ ସପ୍ତାହ ପରେ ଏବଂ ଦହି ତିଆରି ହେବାର ଦୁଇ ସପ୍ତାହ ପୂର୍ବରୁ ବୋରନ ମାଇକ୍ରୋ ନ୍ୟୁଟ୍ରିଏଣ୍ଟ ସିଞ୍ଚନ କରାଯିବା ଉଚିତ।"
         ]
      },
      "onion": {
         "advisory": [
            "ନର୍ସରୀରେ ଥିବା ପିଆଜର ଚାରା ଏକ ସପ୍ତାହ ପର୍ଯ୍ୟାୟ ପର୍ଯ୍ୟନ୍ତ ଅଙ୍କୁରିତ ହୋଇଥାଏ। ନର୍ସରୀରେ ଆଳୁ ବୁଣିବା ଏବଂ ମଞ୍ଜି ବୁଣିବା ପାଇଁ ସମ୍ପୂର୍ଣ୍ଣ ନର୍ସରୀ ପ୍ରସ୍ତୁତି। ଅଗ୍ରିଫାଉଣ୍ଡ୍ ଲାଇଟ୍ ରେଡ୍, ଭୀମ ସୁପର୍, ଭୀମ ରେଡ୍, ଭୀମ ଶକ୍ତି ପରି କିସମ ଏବଂ ମଞ୍ଜି ଦର ଏସି ପିଛା 4 ରୁ 5 କିଲୋଗ୍ରାମ। ସୂର୍ଯ୍ୟକିରଣ ଏବଂ ବର୍ଷାରୁ ରକ୍ଷା ପାଇବା ପାଇଁ ନର୍ସରୀକୁ ଢାଙ୍କି ଦିଅନ୍ତୁ। 1 ଏକର ଫସଲ ପାଇଁ ନର୍ସରୀ କ୍ଷେତ୍ର 50 ବର୍ଗ ମିଟର (ଆକାର 3 ମି. x1 ମି. x 0.15 ମି.) ହେବା ଉଚିତ। ନର୍ସରୀରେ ବୁଣିବା ପୂର୍ବରୁ ପ୍ରତି କିଲୋଗ୍ରାମ ମଞ୍ଜି ପିଛା ବାଭିଷ୍ଟିନ୍ 1 ଗ୍ରାମ୍ + ଥ୍ରିୟମ୍ 2 ଗ୍ରାମ୍ ସହିତ ମଞ୍ଜି ଚିକିତ୍ସା କରାଯିବା ଉଚିତ। ଚାରା ଗୁଡ଼ିକୁ ଭିଜି ଯିବାରୁ ରକ୍ଷା କରିବା ପାଇଁ ଗୋଟିଏ ଲିଟର ପାଣିରେ କାର୍ବେନଡାଜିମ୍ 1 ଗ୍ରାମ୍ ମିଶାଇ ଷ୍ଟ୍ରେପ୍ଟୋସାଇକ୍ଲିନ୍ 0.1 ଗ୍ରାମ୍ ସହିତ ବୀଜ ଶଯ୍ୟାକୁ ଭିଜାଇ ଦିଅନ୍ତୁ |"
         ]
      },
      "tomato": {
         "advisory": [
            "ନର୍ସରୀରେ ଟମାଟୋ ଚାରା ଏକରୁ ତିନି ସପ୍ତାହ ପର୍ଯ୍ୟାୟ ଅଟେ | ଚାରା ଗୁଡ଼ିକୁ ଭିଜି ଯିବାରୁ ରକ୍ଷା କରିବା ପାଇଁ ଗୋଟିଏ ଲିଟର ପାଣିରେ କାର୍ବେନଡାଜିମ୍ 1 ଗ୍ରାମ୍ ମିଶାଇ ଷ୍ଟ୍ରେପ୍ଟୋସାଇକ୍ଲିନ୍ 0.1 ଗ୍ରାମ୍ ସହିତ ବୀଜ ଶଯ୍ୟାକୁ ଭିଜାଇ ଦିଅନ୍ତୁ | ନର୍ସରୀରେ 3ରୁ 4 ସପ୍ତାହ ବୟସ ହେବା ପରେ ଟମାଟୋ ଚାରା ରୋପଣ ପାଇଁ ମୁଖ୍ୟ କ୍ଷେତ୍ର ପ୍ରସ୍ତୁତ କରନ୍ତୁ। ମୁଖ୍ୟ କ୍ଷେତର ଚୂଡ଼ାନ୍ତ ଜମି ପ୍ରସ୍ତୁତି ପରେ, ଟମାଟୋ ପାଇଁ ଧାଡ଼ି ମଧ୍ୟରେ ଧାଡ଼ି ଠାରୁ ଧାଡ଼ି ମଧ୍ୟରେ 60 ସେ. ମି. ଏବଂ ଗଛରୁ ଗଛ ମଧ୍ୟରେ 45 ସେ. ମି. ବ୍ୟବଧାନରେ ରିଙ୍ଗ କିମ୍ବା ଢିପ ପ୍ରସ୍ତୁତ କରାଯିବା ଉଚିତ। ଢିପରେ ଚାରା ରୋପଣ କରିବା ପୂର୍ବରୁ ଏକର ପିଛା 52 କିଲୋଗ୍ରାମ ଡିଏପି, 7 କିଲୋଗ୍ରାମ ୟୁରିଆ ଏବଂ 66 କିଲୋଗ୍ରାମ ଏମଓପିର ମୂଳ ମାତ୍ରା ପ୍ରୟୋଗ କରାଯିବା ଉଚିତ।"
         ]
      },
      "banana": {
         "advisory": [
            "ବର୍ଷା ପରେ ବାଇଗଣ ଏବଂ ଲଙ୍କା ଫସଲରେ ୱିଲ୍ଟ ରୋଗ ହେବାର ସମ୍ଭାବନା ରହିଛି। ବାଇଗଣ ଏବଂ ଲଙ୍କାରେ ୱିଲ୍ଟ ରୋଗକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ ପ୍ରଥମେ ପ୍ରଭାବିତ ଗଛଗୁଡ଼ିକୁ ଉପୁଡ଼ି ପକାଇ କ୍ଷେତରୁ ଦୂରକୁ ନଷ୍ଟ କରିଦିଅନ୍ତୁ। ଅତ୍ୟଧିକ ନାଇଟ୍ରୋଜେନ ସାର ପ୍ରୟୋଗ କରନ୍ତୁ ନାହିଁ। ଏକର ପିଛା 20 ଗ୍ରାମ ଷ୍ଟ୍ରେପ୍ଟୋସାଇକ୍ଲିନ ସହିତ 200-ମିଲି ଟିବୁକୋନାଜୋଲ ମିଶାଇ ଗଛର ମୂଳ ଅଞ୍ଚଳକୁ ଭିଜାଇ ଦିଅନ୍ତୁ। ସ୍ପ୍ରେ କରିବା ପାଇଁ ଏକର ପିଛା 200 ଲିଟର ପାଣି ବ୍ୟବହାର କରନ୍ତୁ।"
         ]
      },
      "papaya": {
         "advisory": [
            "ଷ୍ଟେମ ୱିଭିଲକୁ ପରିଚାଳନା କରିବା ପାଇଁ, କଦଳୀ ବଗିଚାରେ ଏକର ପିଛା 10ରେ କସମୋଲୁର ଫେରୋମୋନ୍ ଟ୍ରାପ୍ ଲଗାନ୍ତୁ। ରୋପଣ ପୂର୍ବରୁ କଦଳୀ କାଣ୍ଡକୁ 30 ମିନିଟ୍ ପାଇଁ ଉଷୁମ ପାଣିରେ ବୁଡ଼ାଇ ଦିଅନ୍ତୁ। ଚାରା ଲଗାଇବା ପୂର୍ବରୁ ଗର୍ତ୍ତରେ 25 ଗ୍ରାମ୍ ନିମ୍ବ ପେଡିଆ କିମ୍ବା 25-50 ଗ୍ରାମ୍ ଯେକୌଣସି ଦାଣାଦାର କୀଟନାଶକ ଭର୍ତ୍ତି କରନ୍ତୁ। ପ୍ରଭାବିତ ଗଛକୁ ଖଣ୍ଡ ଖଣ୍ଡ କରି କାଟି ସୂର୍ଯ୍ୟକିରଣ ତଳେ ଶୁଖାଇ ଦିଅନ୍ତୁ। କଦଳୀ ବଗିଚାକୁ ପରିଷ୍କାର ପରିଚ୍ଛନ୍ନ ରଖନ୍ତୁ।"
         ]
      },
      "cucumber": {
         "advisory": [
            "କାକୁଡ଼ିରେ ଫଳ ମାଛି ପରିଚାଳନା କରିବା ପାଇଁ, 4 ଲିଟର ପାଣିରେ 400 ଗ୍ରାମ୍ ଗୁଡ଼ ଏବଂ 8 ମିଲି ମାଲାଥିଅନ୍ କିମ୍ବା ଡି. ଡି. ଭି. ପି. ମିଶାଇ ଏକ ବିଷାକ୍ତ ଚାରା ପ୍ରସ୍ତୁତ କରନ୍ତୁ। ଏହି ମିଶ୍ରଣକୁ ପ୍ଲାଷ୍ଟିକ୍ କପ୍ କିମ୍ବା ମାଟି ପାତ୍ରରେ ରଖନ୍ତୁ @80-ସଂଖ୍ୟା/ଏକର। ଫଳ ମାଛିମାନେ ଏହା ପ୍ରତି ଆକର୍ଷିତ ହେବେ ଏବଂ ଶେଷରେ ବିଷ ଜାଲରେ ପଡ଼ି ମୃତ୍ୟୁବରଣ କରିବେ।"
         ]
      }
   },
   "date": "26-11-2024",
   "ERROR": "ନିୟମିତ ତଥ୍ୟ ମିଳୁନାହିଁ।"
}