{
   "weather_details": {
      "30/10/2024": {
         "rainfall": 4,
         "t_max": 32,
         "t_min": 25,
         "rh_max": 94.3,
         "rh_min": 66,
         "wind_speed": 3,
         "wind_direction": 15.9,
         "cloud_cover": 8
      },
      "31/10/2024": {
         "rainfall": 0,
         "t_max": 33,
         "t_min": 24,
         "rh_max": 93.4,
         "rh_min": 65,
         "wind_speed": 2,
         "wind_direction": 239,
         "cloud_cover": 0
      },
      "01/11/2024": {
         "rainfall": 0,
         "t_max": 33,
         "t_min": 24,
         "rh_max": 92.1,
         "rh_min": 59,
         "wind_speed": 3,
         "wind_direction": 238,
         "cloud_cover": 0
      },
      "02/11/2024": {
         "rainfall": 0,
         "t_max": 33,
         "t_min": 24,
         "rh_max": 92.7,
         "rh_min": 55,
         "wind_speed": 4,
         "wind_direction": 0,
         "cloud_cover": 0
      }
   },
   "names_of_crops": [
      "ସବୁଜ ଚଣା",
      "କଳା ଚଣା",
      "କଦଳୀ",
      "କ୍ଷେତ ମଟର",
      "ମସୁର ଡାଲି",
      "ଚିନାବାଦାମ",
      "ତୋରିଆ",
      "ସୂର୍ଯ୍ୟମୁଖୀ",
      "କାକୁଡ଼ି",
      "କଦଳୀ",
      "ମାରିଗୋଲ୍ଡ",
      "ଗୋଲାପ।"
   ],
   "general_advisory": "କ୍ଷେତରେ ଉପଲବ୍ଧ ମୃତ୍ତିକା ଆର୍ଦ୍ରତାର ଉପଯୋଗ କରି ମଧ୍ୟମ/ଅଗଭୀର ତଳିଆ ଅଞ୍ଚଳରେ ସବୁଜ ଗହମ, କଳା ଗହମ, ମଟର, ମଟର, ଚିନାବାଦାମ, ତୋରିଆ ଏବଂ ସୂର୍ଯ୍ୟମୁଖୀ ଭଳି ସ୍ୱଳ୍ପକାଳୀନ ରବି ଫସଲ ଚାଷ କରିବାକୁ କୃଷକମାନଙ୍କୁ ପରାମର୍ଶ ଦିଆଯାଇଛି। କୀଟ ସଂକ୍ରମଣ ରୋକିବା ପାଇଁ କୃଷକମାନଙ୍କୁ ନିୟମିତ ଭାବେ ନିଜ ଫସଲ କ୍ଷେତ ପରିଦର୍ଶନ କରିବାକୁ ପରାମର୍ଶ ଦିଆଯାଇଛି। ଦେବୀ (ଆଇ. ସି. ଜି. ଭି.-91114), କାଦ୍ରି-6, କାଦ୍ରି-9, ଟି. ଜି.-50 ଭଳି ଓଡ଼ିଶାର ପରିସ୍ଥିତି ଅନୁକୂଳ ଚିନାବାଦାମ କିସମ ବ୍ୟବହାର କରନ୍ତୁ। ବାଇଗଣ ଏବଂ ଟମାଟୋରେ ୱିଲ୍ଟ ଏବଂ ରଟ୍ ରୋଗକୁ ପରିଚାଳନା କରିବା ପାଇଁ, 10 ଲିଟର ପାଣିରେ ମିଶ୍ରିତ 10 ଗ୍ରାମ୍ ପ୍ଲାଣ୍ଟୋମାଇସିନ୍ ଦ୍ରବଣ ସହିତ ମୂଳ ଅଞ୍ଚଳକୁ ଭିଜାଇ ଦିଅନ୍ତୁ |",
   "crops_data": {
      "paddy": {
         "advisory": [
            "ଫସଲ ପର୍ଯ୍ଯ଼ାଯ଼-ପି. ଏ. ଡି. ଡି. ୱାଇ.: ଫୁଲ ଫୁଲିଯିବା ପରେ ଶାରୀରିକ ପରିପକ୍ୱତା ପର୍ଯ୍ଯ଼ାଯ଼-କାନ ମୁଣ୍ଡ କ୍ଯ଼ାଟରପିଲର-କାନ ମୁଣ୍ଡ କ୍ଯ଼ାଟର୍ପିଲରକୁ ନିଯ଼ନ୍ତ୍ରଣ କରିବା ପାଇଁ କ୍ଲୋରପିରିଫସ୍ 50 ପ୍ରତିଶତ + ସାଇପର୍ମେଥ୍ରିନ 5 ପ୍ରତିଶତ ଇ. ସି. ଏକର ପିଛା 400 ମିଲି କିମ୍ବା ପ୍ରୋଫେନୋଫସ୍ 50 ପ୍ରତିଶତ ଇ. ସି. ଏକର ପିଛା 400 ମିଲି. ସ୍ପ୍ରେ କରନ୍ତୁ। ଯେହେତୁ କୀଟ ଆଚରଣରେ ନିଶାଚର, ଉତ୍ତମ ଫଳାଫଳ ପାଇଁ ସନ୍ଧ୍ଯ଼ାରେ କୀଟନାଶକ ସିଞ୍ଚନ କରାଯିବା ଉଚିତ୍ |",
            "ଗୁଣ୍ଡି ବଗ ମ୍ୟାନେଜମେଣ୍ଟ-ଗୁଣ୍ଡି ବଗକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ, 200 ଲିଟର ପାଣିରେ ମିଶାଇ ଏକର ପିଛା 400 ମିଲିଲିଟରରେ କ୍ଲୋରପିରିଫସ୍ 20 ପ୍ରତିଶତ ଇସି ସ୍ପ୍ରେ କରନ୍ତୁ। କ୍ଲୋରପିରିଫସ୍ 1.5% ଡି @ଏକର ପିଛା 10 କି. ଗ୍ରା. କିମ୍ବା ମାଲାଥିଅନ୍ 5% ଡି. ପି. @ଏକର ପିଛା 10 କି. ଗ୍ରା. ସକାଳ ସମୟରେ ସମାନ ଭାବରେ କରାଯିବା ଉଚିତ ଯେତେବେଳେ କୌଣସି କିମ୍ବା ସର୍ବନିମ୍ନ ପବନ ନଥାଏ |"
         ]
      },
      "groundnut": {
         "advisory": [
            "ଷ୍ଟୋରେଜ୍-ଚିନାବାଦାମକୁ ପଲିଥିନ୍ ଲାଇନ୍ ହୋଇଥିବା ଗନ୍ନୀ ବ୍ଯ଼ାଗରେ ଫିଉଜଡ୍ କ୍ଯ଼ାଲସିଯ଼ମ୍ କ୍ଲୋରାଇଡ୍ ପରି ଡେସିକାଣ୍ଟ ସହିତ 250 ଗ୍ରାମ/30 ବକ୍ସରେ ସଂରକ୍ଷଣ କରାଯିବା ଉଚିତ୍ | ସିଲ୍ ହୋଇଥିବା ବ୍ଯ଼ାଗଗୁଡିକ କୋଠରୀର ତାପମାତ୍ରାରେ ଏକ ଭଲ ବାଯ଼ୁଚାଳିତ କୋଠରୀ ଭିତରେ ଉଲ୍ଲମ୍ବ ଭାବରେ ରଖିବା ଉଚିତ୍ | 8-10 ସଂରକ୍ଷଣର ମାସ ପରେ ମଧ୍ଯ଼ ଉଚ୍ଚ ଅଙ୍କୁରୋଦଗମ ହାର ବଜାଯ଼ ରଖିବାରେ ଏହି କୌଶଳ ଅତ୍ଯ଼ନ୍ତ ପ୍ରଭାବଶାଳୀ |"
         ]
      },
      "sugarcane": {
         "advisory": [
            "ପରିପକ୍ୱତା ପର୍ଯ୍ୟାୟ-ଇଣ୍ଟର୍ନୋଡ୍ ବୋରର୍ ମ୍ୟାନେଜମେଣ୍ଟ-କୀଟ ଜୈବିକ ବ୍ୟବହାରକୁ ପରିଚାଳନା କରିବା ପାଇଁ, ପ୍ରତ୍ୟେକ କାର୍ଡକୁ ପ୍ରଦତ୍ତ ଛିଦ୍ରରେ 12 ଖଣ୍ଡରେ ବିଭକ୍ତ କରି ସାପ୍ତାହିକ ବ୍ୟବଧାନରେ 6 ଥର ପାଇଁ ଟ୍ରାଇକୋଗ୍ରାମ ଚିଲିନିସ୍ କାର୍ଡ @1/ଏକର ବ୍ୟବହାର କରନ୍ତୁ। ରାସାୟନିକ ଭାବରେ କୀଟକୁ ପରିଚାଳନା କରିବା ପାଇଁ, 200 ଲିଟର ପାଣିରେ ମିଶାଇ ଏକର ପିଛା 600 ମିଲି କିମ୍ବା କ୍ଲୋରାଣ୍ଟ୍ରାନିଲିପ୍ରୋଲ 0.4 ଜିଆର @4 କେଜି ସ୍ପ୍ରେ କରନ୍ତୁ। ଆହୁରି ମଧ୍ୟ, 8 କିଲୋଗ୍ରାମ ବାଲି ସହିତ ମିଶ୍ରଣ କରି କ୍ଲୋରାଣ୍ଟ୍ରାନିଲିପ୍ରୋଲ 0.4 ଜିଆର @4 କିଲୋଗ୍ରାମ/ଏକର ଲଗାନ୍ତୁ।"
         ]
      },
      "cucurbits": {
         "advisory": [
            "ଫଳ ଦେବା ପାଇଁ ଉଦ୍ଭିଦ-ଫଳ ମାଛି-କାକୁଡ଼ିରେ ଫଳ ମାଛି ନିଯ଼ନ୍ତ୍ରଣ କରିବା ପାଇଁ, 4 ଲିଟର ପାଣିରେ 400 ଗ୍ରାମ ଗୁଡ଼ ଏବଂ 8 ମିଲି ଡିଡିଭିପି ମିଶାଇ ଏକ ବିଷାକ୍ତ ଚାରା ପ୍ରସ୍ତୁତ କରନ୍ତୁ। ଏହି ମିଶ୍ରଣକୁ ପ୍ଲାଷ୍ଟିକ୍ କପ୍ କିମ୍ବା ମାଟି ପାତ୍ର @80 ନମ୍ବର/ଏକରରେ ରଖନ୍ତୁ। ଫଳ ମାଛିମାନେ ଏହା ପ୍ରତି ଆକର୍ଷିତ ହେବେ ଏବଂ ଶେଷରେ ବିଷ ଜାଲରେ ପଡ଼ି ମୃତ୍ଯ଼ୁବରଣ କରିବେ।"
         ]
      },
      "cole crop": {
         "advisory": [
            "ଫୁଲକୋବି ଏବଂ ବନ୍ଧାକୋବି-ପନିପରିବା ପର୍ଯ୍ଯ଼ାଯ଼-ସାର ପରିଚାଳନା-ଜମି ଛାଣିବା ପରେ ଏକର ପିଛା 33 କିଲୋଗ୍ରାମ ଯ଼ୁରିଆ ଏବଂ 23 କିଲୋଗ୍ରାମ ଏମଓପି ପ୍ରଯ଼ୋଗ କରନ୍ତୁ ଏବଂ ହାତ ଛାଣିବା ପରେ 15-20 ଡିଏଟି ଏବଂ 33 କିଲୋଗ୍ରାମ ଯ଼ୁରିଆ ଏବଂ ଏକର ପିଛା 23 କିଲୋଗ୍ରାମ ଏମଓପି ପ୍ରଯ଼ୋଗ କରନ୍ତୁ। ଯଦି ଚାରା ରୋପଣ ସମଯ଼ରେ ବୋରାକ୍ସ ପ୍ରଯ଼ୋଗ କରାଯାଇନଥାଏ, ତେବେ ବୋରାକ୍ସ @4 କେଜି/ଏକର କିମ୍ବା ଫୋଲିବୋର/ସଲ୍ଯ଼ୁବର @1.5 ଗ୍ରାମ/ଲିଟର ସ୍ପ୍ରେ କରନ୍ତୁ। ପ୍ରତିରୋପଣର ଦୁଇ ସପ୍ତାହ ପରେ ଏବଂ ଦହି ତିଆରି ହେବାର ଦୁଇ ସପ୍ତାହ ପୂର୍ବରୁ ବୋରନ ମାଇକ୍ରୋ ନ୍ଯ଼ୁଟ୍ରିଏଣ୍ଟ ସିଞ୍ଚନ କରାଯିବା ଉଚିତ।"
         ]
      },
      "marigold & rose": {
         "advisory": [
            "ମାରିଗୋଲ୍ଡ ଏବଂ ଗୋଲାପ ପରି ଫୁଲରେ ରେଡ୍ ସ୍ପାଇଡର ମାଇଟ୍କୁ ପରିଚାଳନା କରିବା ପାଇଁ ଓଦା ସଲଫର୍ 80 ପ୍ରତିଶତ ଡବ୍ଲ୍ଯ଼ୁ. ପି. @2 ଗ୍ରାମ/ଲିଟର ପାଣି କିମ୍ବା ପ୍ରୋପାର୍ଜାଇଟ୍ 57 ପ୍ରତିଶତ ଇ. ସି. @2 ମିଲି/ଲିଟର ପାଣି କିମ୍ବା ଫେନପାଇରୋକ୍ସିମେଟ୍ 5 ପ୍ରତିଶତ ଇ. ସି. @2 ମିଲି/ଲିଟର ପାଣି ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      }
   },
   "date": "29-10-2024",
   "ERROR": "ନିଯ଼ମିତ ତଥ୍ଯ଼ ମିଳୁନାହିଁ।"
}