{
   "weather_details": {
      "30-10-2024": {
         "rainfall": 7,
         "t_max": 32,
         "t_min": 26,
         "rh_max": 94.5,
         "rh_min": 67.8,
         "wind_speed": 3,
         "wind_direction": 344,
         "cloud_cover": 7
      },
      "31-10-2024": {
         "rainfall": 1,
         "t_max": 33,
         "t_min": 25,
         "rh_max": 93.4,
         "rh_min": 66.6,
         "wind_speed": 4,
         "wind_direction": 243,
         "cloud_cover": 6
      },
      "01-11-2024": {
         "rainfall": 1,
         "t_max": 33,
         "t_min": 25,
         "rh_max": 91.8,
         "rh_min": 57,
         "wind_speed": 5,
         "wind_direction": 241,
         "cloud_cover": 5
      },
      "02-11-2024": {
         "rainfall": 0,
         "t_max": 33,
         "t_min": 25,
         "rh_max": 92.8,
         "rh_min": 55,
         "wind_speed": 6,
         "wind_direction": 266,
         "cloud_cover": 4
      },
      "03-11-2024": {
         "rainfall": 0,
         "t_max": 33,
         "t_min": 24,
         "rh_max": 89.7,
         "rh_min": 49,
         "wind_speed": 5,
         "wind_direction": 294,
         "cloud_cover": 4
      }
   },
   "names_of_crops": [
      "ଚାଉଳ",
      "ଆଖୁ",
      "ପନିପରିବା",
      "ଫଳ",
      "ପଶୁପାଳନ",
      "ମତ୍ସ୍ଯ଼ଚାଷ"
   ],
   "general_advisory": "ବିପିଏଚ, ଡବ୍ଲ୍ଯ଼ୁ. ବି. ପି. ଏଚ., ଲିଫ ଫୋଲଡର, ଗୁଣ୍ଡି ବଗ ଏବଂ ବି. ଏଲ. ବି. ଏବଂ ବିସ୍ଫୋରଣ ଘଟଣା ଉପରେ ନଜର ରଖିବା ପାଇଁ ନିଯ଼ମିତ ଭାବେ ପଡ଼ିଆକୁ ଯାଆନ୍ତୁ। ଧାନ କ୍ଷେତରେ ଗୁଣ୍ଡି ବଗ୍ର କାର୍ଯ୍ଯ଼କଳାପ ଉପରେ ନଜର ରଖନ୍ତୁ ଏବଂ କୀଟପତଙ୍ଗକୁ ବ୍ଯ଼ାପକ ଭାବେ ଫସାଇବା ଏବଂ ମାରିବା ପାଇଁ ସଡି ଯାଇଥିବା ଶାମୁକା ଫାନ୍ଦ ଲଗାନ୍ତୁ। ଦ୍ରାକ୍ଷାଲତା ପନିପରିବା ଏବଂ କାକୁଡ଼ିରେ ଟ୍ରେଲିସ୍ ମରାମତି ଏବଂ ମଜବୁତ କରନ୍ତୁ | କୀଟାଣୁନାଶକ/ବ୍ଲିଚିଂ ପାଉଡର/ଫିନାଇଲ ସିଞ୍ଚନ କରି ପଶୁଶାଳାକୁ ସଫା କରନ୍ତୁ।",
   "crops_data": {
      "rice": {
         "advisory": [
            "ଯଦି ବିଳମ୍ବରେ ପ୍ରତିରୋପଣ କରାଯାଇଥିବା ଚାଉଳ ପି. ଆଇ./ଫୁଲର ପ୍ରାରମ୍ଭିକ ପର୍ଯ୍ଯ଼ାଯ଼ରେ ଥାଏ, ତେବେ ଏକର ପିଛା ଏମ୍. ଓ. ପି. 12 କି. ଜି. ର ଅତିରିକ୍ତ ମାତ୍ରା ପ୍ରଯ଼ୋଗ କିମ୍ବା ଏମ୍. ଓ. ପି. (<ଆଇ. ଡି. 3>) @<ଆଇ. ଡି. 2> ଗ୍ରାମ୍/ଲିଟର ପାଣିର ପତ୍ର ସ୍ପ୍ରେ ସହିତ 20 ପ୍ରତିଶତ ବୋରନ୍ @<ଆଇ. ଡି. 1> ପାଣିର ସୁପାରିଶ କରାଯାଇଥାଏ।",
            "ଘୂର୍ଣ୍ଣିବଳଯ଼ ଘଟଣା ପରେ ପ୍ରଚଳିତ ମାଇକ୍ରୋକ୍ଲାଇମେଟ୍ ଅବସ୍ଥା ସୂର୍ଯ୍ଯ଼କିରଣର ଉପଯୁକ୍ତ ଅନୁପ୍ରବେଶ ଏବଂ ସମତଲ ତଳେ ଉନ୍ନତ ବାଯ଼ୁ ସଞ୍ଚାଳନ ପାଇଁ ପ୍ରତି 3 ମିଟର/ପରେ 8-10 ଧାଡ଼ି କ୍ଷେତ୍ରରେ ଉଦ୍ଭିଦ Hoppers.Make ଗଳିଗୁଡ଼ିକର ଜନସଂଖ୍ଯ଼ା ବୃଦ୍ଧି କରିପାରେ। ସଂକ୍ରମଣର ପ୍ରାରମ୍ଭିକ ପର୍ଯ୍ଯ଼ାଯ଼ରେ, ଫସଲର ସୁରକ୍ଷା ପାଇଁ ଡିନୋଟେଫୁରାନ୍ କିମ୍ବା କ୍ଲୋଥିଆନିଡିନ୍ 50 @80 ଗ୍ରାମ୍/ଏକର ଡବ୍ଲୁ. ଜି. ସହିତ ନିମ୍ବ ତେଲ ଫର୍ମ୍ଯ଼ୁଲେସନ୍ @600 ମିଲି/ଏକର ସହିତ ଗଛର ମୂଳକୁ ଲକ୍ଷ୍ଯ଼ କରନ୍ତୁ | ଉଦ୍ଭିଦର ମୂଳ ଅଂଶକୁ ଲକ୍ଷ୍ଯ଼ କରି କୀଟନାଶକ ସିଞ୍ଚନ କରାଯିବା ଉଚିତ।",
            "ଧାନ କ୍ଷେତରେ ଗୁଣ୍ଡି ବଗ୍ର କାର୍ଯ୍ଯ଼କଳାପ ଉପରେ ନଜର ରଖନ୍ତୁ ଏବଂ କୀଟପତଙ୍ଗକୁ ବ୍ଯ଼ାପକ ଭାବେ ଫସାଇବା ଏବଂ ମାରିବା ପାଇଁ ସଡି ଯାଇଥିବା ଶାମୁକା ଫାନ୍ଦ ଲଗାନ୍ତୁ।",
            "ବାତ୍ଯ଼ା ପରେ ପ୍ରଚଳିତ ଉଷ୍ମ ଏବଂ ଆର୍ଦ୍ର ପାଗ ଧାନରେ ବିଏଲବି ଏବଂ ନେକ ବ୍ଲାଷ୍ଟ ରୋଗର ଘଟଣା ବୃଦ୍ଧି କରିପାରେ ତେଣୁ ପ୍ରଯ଼ୋଗ କରନ୍ତୁ (ଟେବୁକୋନାଜୋଲ 50 ପ୍ରତିଶତ + ଟ୍ରାଇଫ୍ଲୋକ୍ସିସ୍ଟ୍ରୋବିନ୍ 25 ପ୍ରତିଶତ ଡବ୍ଲୁଜି) @0.4 ଗ୍ରାମ/ଲିଟର ପାଣି।"
         ]
      },
      "sugarcane": {
         "advisory": [
            "ଅତିରିକ୍ତ ପାଣି ବାହାର କରନ୍ତୁ।",
            "ରହଣି ଏଡ଼ାଇବା ପାଇଁ ଆଖୁ ରାପିଙ୍ଗ୍ ଏବଂ ପ୍ରୋପିଙ୍ଗ୍ କରାଯିବା ଉଚିତ୍ |"
         ]
      },
      "vegetables": {
         "advisory": [
            "ଅଧିକ ଆର୍ଦ୍ରତା ଏବଂ ତା 'ପରେ ବାତ୍ୟା କାରଣରୁ ପ୍ରବଳ ବର୍ଷା ହେବା ଦ୍ୱାରା ବାଇଗଣ ଶୁଖିଯିବା କିମ୍ବା ଆଂଶିକ ଶୁଖିଯିବା ବୃଦ୍ଧି ପାଇଥାଏ, ଯାହାଦ୍ୱାରା କ୍ଷେତରୁ ଅତିରିକ୍ତ ଜଳ ନିଷ୍କାସନ ହୋଇପାରିବ ନାହିଁ। ନିମ୍ କିମ୍ବା କରଞ୍ଜା କେକ୍ 1 ଗ୍ରାମ୍/ଏକରରେ ଲଗାନ୍ତୁ, ଟେବୁକୋନାଜୋଲ୍ 1 ମିଲି/ଲିଟରରେ ଭିଜାଇବାକୁ ପରାମର୍ଶ ଦିଆଯାଇପାରେ |",
            "ଦ୍ରାକ୍ଷାଲତା ଏବଂ ଷ୍ଟାଣ୍ଡିଂ କୁକୁର୍ବିଟ୍ ପନିପରିବାରେ ଟ୍ରେଲିର ମରାମତି ଏବଂ ମଜବୁତ କରିବା।",
            "ଯଦି ପ୍ରାରମ୍ଭିକ ଅବଧି କିସମ ପନିପରିବାର ଚାରା ନଷ୍ଟ ହୋଇଯାଏ, ତେବେ ଚାରା ଗୁଡ଼ିକୁ (ମେଟାଲାକ୍ସିଲ + ମାନକୋଜେବ) 2 ଗ୍ରାମ/ଲି ପାଣିରେ ଏବଂ ପ୍ଲାଣ୍ଟୋମାଇସିନ ଲିଟର ପିଛା 1 ଗ୍ରାମ ପାଣିରେ ଚିକିତ୍ସା କରନ୍ତୁ।"
         ]
      },
      "fruit": {
         "advisory": [
            "ପେପା-ପେପା ଲିଫ୍ କର୍ଲ ଭାଇରସର ଭେକ୍ଟର (ହ୍ୱାଇଟ୍ଫ୍ଲାଇ) କୁ ଧରିବା ପାଇଁ ହଳଦିଆ ଷ୍ଟିକି ଫାନ୍ଦ ଲଗାନ୍ତୁ। ଶ୍ୱେତ ମାଛି ନିଯ଼ନ୍ତ୍ରଣ ପାଇଁ ନିମ୍ବ ତେଲ ଗଠନ 1500 ପିପିଏମ @3ml ଲିଟର ପାଣି ଏବଂ ଫ୍ଲୋନିକାମିଡ 50 ଡବ୍ଲୁଜି @0.3g/lit ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "livestock": {
         "advisory": [
            "ଯଦି ପଶୁମାନଙ୍କୁ ଏପର୍ଯ୍ଯ଼ନ୍ତ ଏଫ୍. ଏମ୍. ଡି., ରକ୍ତସ୍ରାବଜନିତ ସେପ୍ଟିସେମିଆ, ବ୍ଲାକ୍ କ୍ୱାର୍ଟର୍, ଏଣ୍ଟେରୋଟକ୍ସିମିଆ ଇତ୍ଯ଼ାଦି ବିରୁଦ୍ଧରେ ଟୀକାକରଣ କରାଯାଇ ନାହିଁ, ତେବେ ଏଗୁଡ଼ିକ କରିବା ଆବଶ୍ଯ଼କ |",
            "ପଶୁମାନଙ୍କୁ ରୋଗ ଏବଂ କୀଟପତଙ୍ଗରୁ ରକ୍ଷା କରିବା ପାଇଁ ମଳମୂତ୍ର ବାହାର କରି ସଫା ରଖନ୍ତୁ ଏବଂ ଶୁଖାନ୍ତୁ |"
         ]
      },
      "pisciculture": {
         "advisory": [
            "ପ୍ରବଳ ବର୍ଷା ପରେ ମାଛ ପୋଖରୀଗୁଡ଼ିକର ଜଳର ଗୁଣବତ୍ତାରେ ପରିବର୍ତ୍ତନ କରାଯାଇପାରେ, ତେଣୁ ପାଣିର ପି. ଏଚ୍. ଏବଂ ଆବଶ୍ୟକତା ଆଧାରିତ ପରୀକ୍ଷଣ ପାଇଁ 2 ଦିନ ବ୍ୟବଧାନରେ 3 ଭାଗ (<ଆଇ. ଡି. 1>) ରେ ଏକର ପିଛା <ଆଇ. ଡି. 2> ଚୁନାର ପ୍ରୟୋଗ କରିବା ପାଇଁ ପରାମର୍ଶ ଦିଆଯାଇଛି।"
         ]
      }
   },
   "date": "29-10-2024",
   "ERROR": "ନିୟମିତ ତଥ୍ୟ ମିଳୁନାହିଁ।"
}