{
   "weather_details": {
      "25-10-2024": {
         "rainfall": 0,
         "t_max": 31,
         "t_min": 20,
         "rh_max": 0,
         "rh_min": 0,
         "wind_speed": 0,
         "wind_direction": 0,
         "cloud_cover": 0
      },
      "26-10-2024": {
         "rainfall": 0.5,
         "t_max": 31,
         "t_min": 20,
         "rh_max": 0,
         "rh_min": 0,
         "wind_speed": 0,
         "wind_direction": 0,
         "cloud_cover": 0
      },
      "27-10-2024": {
         "rainfall": 0,
         "t_max": 32,
         "t_min": 20,
         "rh_max": 0,
         "rh_min": 0,
         "wind_speed": 0,
         "wind_direction": 0,
         "cloud_cover": 0
      },
      "28-10-2024": {
         "rainfall": 5,
         "t_max": 31,
         "t_min": 19,
         "rh_max": 0,
         "rh_min": 0,
         "wind_speed": 0,
         "wind_direction": 0,
         "cloud_cover": 0
      },
      "29-10-2024": {
         "rainfall": 0,
         "t_max": 0,
         "t_min": 0,
         "rh_max": 0,
         "rh_min": 0,
         "wind_speed": 0,
         "wind_direction": 0,
         "cloud_cover": 0
      },
      "30-10-2024": {
         "rainfall": 7,
         "t_max": 31,
         "t_min": 20,
         "rh_max": 96,
         "rh_min": 63,
         "wind_speed": 2,
         "wind_direction": 225,
         "cloud_cover": 7
      },
      "31-10-2024": {
         "rainfall": 2,
         "t_max": 32,
         "t_min": 20,
         "rh_max": 96,
         "rh_min": 61,
         "wind_speed": 1,
         "wind_direction": 90,
         "cloud_cover": 6
      },
      "01-11-2024": {
         "rainfall": 1,
         "t_max": 32,
         "t_min": 19,
         "rh_max": 97,
         "rh_min": 58,
         "wind_speed": 1,
         "wind_direction": 243,
         "cloud_cover": 6
      },
      "02-11-2024": {
         "rainfall": 2,
         "t_max": 32,
         "t_min": 19,
         "rh_max": 95,
         "rh_min": 52,
         "wind_speed": 0,
         "wind_direction": 90,
         "cloud_cover": 5
      },
      "03-11-2024": {
         "rainfall": 1,
         "t_max": 31,
         "t_min": 19,
         "rh_max": 93,
         "rh_min": 49,
         "wind_speed": 2,
         "wind_direction": 0,
         "cloud_cover": 5
      }
   },
   "names_of_crops": [
      "ଚାଉଳ",
      "ମକା",
      "ଡାଲିଗୁଡ଼ିକ",
      "ସୋରିଷ",
      "ହଳଦୀ",
      "ଫୁଲକୋବି",
      "କଦଳୀ",
      "ଅଦା।",
      "ଗାଈ ଏବଂ ମଇଁଷି"
   ],
   "general_advisory": "ଆଇଏମଡିରୁ ମିଳିଥିବା ପାଞ୍ଚ ଦିନର ପାଣିପାଗ ପୂର୍ବାନୁମାନ ଆଧାରରେ, କୃଷକମାନେ ଆନ୍ତଃସାଂସ୍କୃତିକ କାର୍ଯ୍ଯ଼କଳାପ, ପରିପକ୍ୱ ଉତ୍ପାଦ ଅମଳ ଏବଂ ଆବଶ୍ଯ଼କ ଅନୁଯାଯ଼ୀ ପରବର୍ତ୍ତୀ ପାଞ୍ଚ ଦିନ ମଧ୍ଯ଼ରେ ଷ୍ଟିକର ସହିତ ମିଶ୍ରିତ କୀଟନାଶକ ପ୍ରଯ଼ୋଗ ଜାରି ରଖିପାରିବେ। ରବି ଫସଲ ପାଇଁ କ୍ଷେତ ପ୍ରସ୍ତୁତି ଆରମ୍ଭ କରାଯିବା ଉଚିତ। ବନ୍ଧ, କେନାଲ, ଚାଷ ନହୋଇଥିବା କ୍ଷେତ ଏବଂ ପଡ଼ିଆ ରାସ୍ତାଗୁଡ଼ିକୁ ଆଗାଛା ବାହାର କରି ସଫା କରାଯିବା ଉଚିତ। ସ୍ୱଚ୍ଛ ପାଗ ସମଯ଼ରେ ଫୁଲକୋବି, ବନ୍ଧାକୋବି, ବ୍ରୋକୋଲି, ଟମାଟୋ ଇତ୍ଯ଼ାଦି ପରିପକ୍ୱ ଚାରା (35-40 ଦିନ ପୁରୁଣା) ଉଠାଯାଇଥିବା ଶଯ୍ଯ଼ାରେ ରୋପଣ କରିବାକୁ କୃଷକମାନଙ୍କୁ ପରାମର୍ଶ ଦିଆଯାଇଛି। ବିଭିନ୍ନ କୀଟପତଙ୍ଗର ପ୍ରକୋପ ଜାଣିବା ଏବଂ ନିଯ଼ନ୍ତ୍ରଣ ରଣନୀତି ଆରମ୍ଭ କରିବା ପାଇଁ ସମସ୍ତ ଫସଲ ଉପରେ ନିଯ଼ମିତ ନଜର ରଖିବା ଉଚିତ।",
   "crops_data": {
      "rice": {
         "advisory": [
            "ନେକ୍ ବ୍ଲାସ୍ଟ୍ ରୋଗ ପରିଚାଳନା ପାଇଁ ଟ୍ରାଇସାଇକ୍ଲାଜୋଲ୍ (ବିମ୍) @0.6 ଗ୍ରାମ୍/ଲିଟର ପାଣି (120 ଗ୍ରାମ୍/ଏସି) ଲଗାନ୍ତୁ।",
            "ବାଷ୍ପ ଛେଦକ ଏବଂ ପତ୍ର ଫୋଲଡରକୁ ନିଯ଼ନ୍ତ୍ରଣ କରିବା ପାଇଁ କ୍ଲୋରପିରିଓଫସ୍/ପ୍ରୋଫେନୋଫସ୍ @2 ମିଲି/ଲିଟର ପାଣି ସ୍ପ୍ରେ କରନ୍ତୁ।",
            "ବି. ପି. ଏଚ୍. କୁ ନିଯ଼ନ୍ତ୍ରଣ କରିବା ପାଇଁ ଇମିଡାକ୍ଲୋପ୍ରିଡ୍ @0.6 ମିଲି/ଲିଟର ପାଣି ସ୍ପ୍ରେ କରନ୍ତୁ।",
            "କାନ କାଟିବା କ୍ୟାଟର୍ପିଲର୍ଃ ଏହାକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ ସକାଳେ ରୁଟ ଜୋନ୍ରେ 400 ମିଲି/ଏକର ପିଛା କ୍ୱିନାଲଫସ୍ 25 ଇସି କିମ୍ବା 500 ମିଲି/ଏକର ପିଛା କ୍ଲୋରପିରିଫସ୍ 20 ଇସି ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "maize": {
         "advisory": [
            "ଆମେରିକୀଯ଼ କୋବ୍ ବୋରର୍ଃ ଆମେରିକୀଯ଼ କୋବ୍ ବୋରର୍ ସଂକ୍ରମଣକୁ ନିଯ଼ନ୍ତ୍ରଣ କରିବା ପାଇଁ 10 ଲିଟର ପାଣି ସହିତ ଫ୍ଲୁବେଣ୍ଡିଆମାଇଡ୍ 39.35% SC @4 ମିଲି ମିଶାନ୍ତୁ।"
         ]
      },
      "pulses": {
         "advisory": [
            "ବର୍ତ୍ତମାନର ପାଣିପାଗ ହର୍ସ ଗ୍ରାମ୍ ଏବଂ ବେଙ୍ଗଲ ଗ୍ରାମ୍ ବୁଣିବା ପାଇଁ ଅନୁକୂଳ ଅଟେ। ତେଣୁ, କୃଷକମାନଙ୍କୁ ମାଟିର ଆର୍ଦ୍ରତା ସ୍ଥିତି ଉପରେ ନିର୍ଭର କରି ମଞ୍ଜି ବୁଣିବା ପାଇଁ ପରାମର୍ଶ ଦିଆଯାଇଛି। ବୁଣିବା ପୂର୍ବରୁ, ମଞ୍ଜି ଗୁଡ଼ିକୁ ଫଙ୍ଗିସାଇଡ୍ ଦ୍ୱାରା ଚିକିତ୍ସା କରାଯିବା ଉଚିତ ଏବଂ ତା 'ପରେ ଗଣ୍ଠିକୁ ବଢ଼ାଇବା ପାଇଁ 20 ଗ୍ରାମ୍/କେଜି ମଞ୍ଜି ସହିତ ରାଇଜୋବିଯ଼ମ୍ ସଂସ୍କୃତି କରାଯିବା ଉଚିତ।"
         ]
      },
      "mustard": {
         "advisory": [
            "ଉପଲବ୍ଧ ମୃତ୍ତିକା ଆର୍ଦ୍ରତାର ଲାଭ ଉଠାଇ, ସର୍ବାଧିକ ଉତ୍ପାଦନ ପାଇବା ପାଇଁ ଜମି ପ୍ରସ୍ତୁତି ଏବଂ ଫସଲ ବୁଣିବା ଆରମ୍ଭ କରାଯିବା ଉଚିତ।",
            "ଉପଯୁକ୍ତ କିସମଃ ତୋରିଆ-ଅନୁରାଧା, ପାର୍ବତୀ, ସୁଶ୍ରୀ, ଭାରତୀୟ ସୋରିଷ-ପୁସା ବୋଲ୍ଡ, ପୁସା ଜୟ କିଷାନ। ବୀଜ ହାର-8-10 କିଲୋଗ୍ରାମ/ହେକ୍ଟର, ବ୍ୟବଧାନ-30 ସେ. ମି. x 10 ସେ. ମି.।",
            "ଚାରା ରୋପଣ ପର୍ଯ୍ୟାୟରେ ସୋରିଷ ଏବଂ ତୋରିଆରେ କୀଟପତଙ୍ଗକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ ନିମ୍ବ ତେଲ 5 ମିଲି/ଲିଟର ପାଣି ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "turmeric": {
         "advisory": [
            "ଘାସ କାଟିବା ପାଇଁ ଯାଆନ୍ତୁ ଏବଂ ରୋପଣର 90 ଦିନ ପରେ ଏକର ପିଛା 26 କି. ଗ୍ରା. ୟୁରିଆ ଏବଂ 30 କି. ଗ୍ରା. ଏମ୍. ଓ. ପି. ଲଗାନ୍ତୁ ଏବଂ ଏକର ପିଛା 2 ଟନ୍ ହାରରେ ମଲ୍ଚିଙ୍ଗ୍ ଲଗାନ୍ତୁ।"
         ]
      },
      "cauliflower": {
         "advisory": [
            "ନର୍ସରୀ ଶଯ୍ଯ଼ା ପ୍ରସ୍ତୁତ କରନ୍ତୁ, ଯାହାର ପ୍ରତ୍ଯ଼େକଟିର ଲମ୍ବ 3 ମିଟର, ଓସାର 1 ମିଟର ଏବଂ ଉଚ୍ଚତା 15-20 ସେ. ମି.। ବୁଣିବାର ସାତ ଦିନ ପୂର୍ବରୁ ପ୍ରତ୍ଯ଼େକ ନର୍ସରୀ ଶଯ୍ଯ଼ାରେ 15-30 କିଲୋଗ୍ରାମ ଭଲ ଭାବେ ଅପଘଟିତ ଏଫ୍. ଆଇ. ଏମ୍. ଏବଂ 150 ଗ୍ରାମ କ୍ଲୋରପାଇରିଫସ୍ ଧୂଳି ଲଗାନ୍ତୁ। ଉନ୍ନତ କିସମ କ୍ଷେତ୍ରରେ, ଏକ ଏକର ଚାଷ ପାଇଁ 200-250 ଗ୍ରାମ ଏବଂ ସଂକର କ୍ଷେତ୍ରରେ 100-150 ଗ୍ରାମ ମଞ୍ଜି ଆବଶ୍ଯ଼କ ହୋଇଥାଏ।",
            "ଫୁଲକୋବି (60-75 ଦିନ)-ଏଚ. ୱାଇ. ଭି.: ପୁସା ଆର୍ଲି ସିନ୍ଥେଟିକ୍, ଆର୍ଲି କୁଆଁରୀ, କାର୍ତ୍ତିକ, ପୁସା ଦୀପାଲୀ, ଆର୍କା କ୍ରାନ୍ତି, ଆର୍କା ସୁରଥୀ, ହାଇବ୍ରିଡ୍ଃ ଶ୍ୱେତା, ପୁସ୍ପାଗିରି, ତୁସାର ଗୁଡମ୍ଯ଼ାନ୍ ଇତ୍ଯ଼ାଦି।"
         ]
      },
      "cabbage": {
         "advisory": [
            "ବନ୍ଧାକୋବି (60-75 ଦିନ)-ଏଚ. ୱାଇ. ଭି.: ଗୋଲ୍ଡେନ୍ ଏକର, ପ୍ରାଇଡ୍ ଅଫ୍ ଇଣ୍ଡିଆ, ପୁସା ସମ୍ବନ୍ଧ ହାଇବ୍ରିଡ୍ଃ ଗ୍ରୀନ୍ ବଲ୍, ପ୍ରିୟା, ଜେନିଥ୍ ଗୋଲ୍ଡ ଷ୍ଟାର, ପ୍ରଗତି ଇତ୍ୟାଦି।"
         ]
      },
      "ginger": {
         "advisory": [
            "3ଯ଼ ଘାସ କାଟିବା ଏବଂ 3ଯ଼ ଉପର ଡ୍ରେସିଂ ସମ୍ପୂର୍ଣ୍ଣ କରାଯାଇପାରେ।",
            "ଜିଞ୍ଜରରେ ରାଇଜୋମ କ୍ଷଯ଼କୁ ନିଯ଼ନ୍ତ୍ରଣ କରିବା ପାଇଁ ଲିଟର ପିଛା 1.25 ଗ୍ରାମ ମେଟାଲାକ୍ସିଲ-ମାନକୋଜେବ + 2 ମିଲି କ୍ୱିନାଲଫୋସ + 1 ଗ୍ରାମ ପ୍ଲାଣ୍ଟୋମାଇସିନ ସହିତ ମୃତ୍ତିକା ଭିଜାଇବା।",
            "ସଂକ୍ରମିତ ଗଛଗୁଡ଼ିକୁ କ୍ଷେତରୁ ବାହାର କରି ପୋଡ଼ି ଦିଅନ୍ତୁ।"
         ]
      },
      "cow and buffalo": {
         "advisory": [
            "ନିର୍ଜଲୀକରଣ, ଉତ୍ତାପ ଚାପ ଏବଂ ପରଜୀବୀ ସଂକ୍ରମଣର ଲକ୍ଷଣ ପାଇଁ ନିଯ଼ମିତ ଭାବରେ ପଶୁମାନଙ୍କୁ ଯାଞ୍ଚ କରନ୍ତୁ | ଆବଶ୍ଯ଼କ ଅନୁଯାଯ଼ୀ କୃମି ପଶୁମାନଙ୍କୁ ଛାଡ଼ନ୍ତୁ ଏବଂ ସେମାନଙ୍କୁ ପାଦ ଏବଂ ପାଟି ରୋଗ, ପିପିଆର ପରି ସାଧାରଣ ରୋଗ ବିରୁଦ୍ଧରେ ଟୀକାକରଣ କରନ୍ତୁ |"
         ]
      }
   },
   "date": "29-10-2024",
   "ERROR": "ନିଯ଼ମିତ ତଥ୍ଯ଼ ମିଳୁନାହିଁ।"
}