{
   "weather_details": {
      "02-11-2024": {
         "rainfall": 0.4,
         "t_max": 32,
         "t_min": 24,
         "rh_max": 85.3,
         "rh_min": 39.9,
         "wind_speed": 2,
         "wind_direction": 297,
         "cloud_cover": 4
      },
      "03-11-2024": {
         "rainfall": 0.1,
         "t_max": 32,
         "t_min": 23,
         "rh_max": 73.6,
         "rh_min": 36.3,
         "wind_speed": 1,
         "wind_direction": 0,
         "cloud_cover": 4
      },
      "04-11-2024": {
         "rainfall": 0.1,
         "t_max": 32,
         "t_min": 23,
         "rh_max": 73.8,
         "rh_min": 35.3,
         "wind_speed": 2,
         "wind_direction": 259,
         "cloud_cover": 3
      },
      "05-11-2024": {
         "rainfall": 0.2,
         "t_max": 31,
         "t_min": 23,
         "rh_max": 73.9,
         "rh_min": 36.5,
         "wind_speed": 2,
         "wind_direction": 225,
         "cloud_cover": 3
      },
      "06-11-2024": {
         "rainfall": 0.2,
         "t_max": 31,
         "t_min": 22,
         "rh_max": 79.8,
         "rh_min": 41.4,
         "wind_speed": 1,
         "wind_direction": 236,
         "cloud_cover": 2
      }
   },
   "names_of_crops": [
      "paddy",
      "cotton",
      "mustard & toria",
      "arhar",
      "brinjal",
      "chilli",
      "cattle & buffalo",
      "goat & sheep",
      "poultry"
   ],
   "general_advisory": "Harvest the matured vegetables & pulses and store in a safe place. Protect the vegetable nursery of Chill, tomato, onion, cole crops and brinjal etc. from rain by covering with plastic or polythene sheet...",
   "crops_data": {
      "paddy": {
         "advisory": [
            "In early maturing varieties, harvest the crop when 80-85% of the grains are matured either manually by sickle or by using combine harvester or reaper. Paddy grains need to be sun-dried to 14% moisture content...",
            "Pest Management: BPH: Infestation of BPH may be observed at this stage of paddy. If population of Brown Planthopper (BPH) exceeds ETL (5-10 hoppers/hill), farmers are advised to undertake alternate wetting and drying technique...",
            "Avoid using nitrogenous fertilizers during infestation of BPH."
         ]
      },
      "cotton": {
         "advisory": [
            "American bollworm: For chemical control, apply Emamectin benzoate 5% SG @ 4g or Profenophos 50% EC @ 30 ml mixed with 10 litres of water to control American bollworm in Non-Bt cotton areas...",
            "Bacterial leaf blight: Apply Streptocycline 1.5 g + Copper Oxychloride 50% WP..."
         ]
      },
      "mustard & toria": {
         "advisory": [
            "Suitable time for sowing is from Midd-October to Mid-November. Treat the seed with Thiram @ 2.5g/kg or Bavistin @ 2g/kg seed before sowing...",
            "Seed rate for Mustard 2.5-3 kg/acre and 1.5-2.0 kg/acre is for Toria...",
            "Suitable variety: Mustard -Pusa bold, Pusa Jaikisan, JD-6. Toria - M 29, Anuradha, Parbati."
         ]
      },
      "arhar": {
         "advisory": [
            "Leaf webber/Leaf folder/Defoliators: These insects may be observed at this stage. Spray Profenophos 50% EC or Chlorpyriphos 50% + Cypermethrin 5% EC @ 2 ml/lit @ 2ml/lit of water to control...",
            "Pod borer: To control, apply neem-based pesticides Azadiractin 0.03% (300 ppm) @ 5ml/liter of water at initial stage of infestation."
         ]
      },
      "brinjal": {
         "advisory": [
            "For monitoring of borer insect, farmers are advised to use pheromone trap @ 8/acre. To control chemically, spray Spinosad 45% SC @ 1.5 ml/4 litre of water or Emamectin benzoate 5% SG @ 4g/10 ltr of water or Thiodicarb 75% WP @ 2ml/ltr of water."
         ]
      },
      "chilli": {
         "advisory": [
            "Infestation of thrips has been noticed. Plants are affected by thrips if leaves curl upward...",
            "To manage thrips infestation install Blue sticky trap @ 8 nos./acre.For chemical control spray Emamectin Benzoate 5% SG @ 0.4 g/lit or Fipronil 5% SC @ 2ml/lit or Imidacloprid 17.8% SL 0.35 ml/lit of water."
         ]
      },
      "cattle & buffalo": {
         "advisory": [
            "Deworm the cattle and buffalo in regular interval and vaccinate them also. If the animal is not coming to heat even after 4 years consult with the veterinary doctors and follow the doctor's advice for onset of puberty."
         ]
      },
      "goat & sheep": {
         "advisory": [
            "Regularly check animals for signs of dehydration, heat stress, and parasitic infections. Deworm animals as needed and vaccinate them against common diseases such as foot-and-mouth disease, PPR."
         ]
      },
      "poultry": {
         "advisory": [
            "Raised platforms and deep litter systems in poultry houses help in maintaining cleanliness and temperature control. Regularly clean and disinfect the house to prevent the buildup of pathogens in the high-humidity conditions after rain. Maintain appropriate stocking density to reduce stress and prevent overheating."
         ]
      }
   },
   "date": "01-11-2024",
   "ERROR": "Not getting consistent data."
}