{
   "weather_details": {
      "2024-11-27": {
         "rainfall": 0.1,
         "t_max": 27,
         "t_min": 15,
         "rh_max": 73,
         "rh_min": 38,
         "wind_speed": 4,
         "wind_direction": 345,
         "cloud_cover": 2
      },
      "2024-11-28": {
         "rainfall": 0.1,
         "t_max": 27,
         "t_min": 16,
         "rh_max": 73,
         "rh_min": 42,
         "wind_speed": 5,
         "wind_direction": 356,
         "cloud_cover": 3
      },
      "2024-11-29": {
         "rainfall": 0.2,
         "t_max": 27,
         "t_min": 16,
         "rh_max": 80,
         "rh_min": 46,
         "wind_speed": 7,
         "wind_direction": 6,
         "cloud_cover": 2
      },
      "2024-11-30": {
         "rainfall": 2.0,
         "t_max": 26,
         "t_min": 15,
         "rh_max": 85,
         "rh_min": 52,
         "wind_speed": 7,
         "wind_direction": 9,
         "cloud_cover": 6
      },
      "2024-12-01": {
         "rainfall": 1.0,
         "t_max": 26,
         "t_min": 15,
         "rh_max": 90,
         "rh_min": 59,
         "wind_speed": 8,
         "wind_direction": 8,
         "cloud_cover": 4
      }
   },
   "names_of_crops": [
      "rice",
      "amaranth",
      "sunflower",
      "brinjal",
      "cauliflower",
      "onion",
      "tomato",
      "banana",
      "papaya",
      "cucumber"
   ],
   "general_advisory": "Go for harvesting of rice at physiological maturity stage to avoid lodging and germination in the field itself. Make provision for draining out rain water in standing rice crop by making alleys (Pahi) and keep the drain ends open. Go for threshing of the harvested paddy . After threshing, paddy grains need to be sun-dried to 14% moisture for consumption purpose and for seed purpose it should be dried to 12% moisture for better self-life. Rodent infestation has been found in the threshing floor and in the field itself. Use poison bait. For the preparation of 100 g poison bait mix 96 g flour , 2 g edible oil and 2 g Zinc phosphide. Keep water in earthen bowl near the poison bait. Keep one celphos tablet in the mouth of each rat hole. Use ‘Super Grain Bag’ for safe storage of paddy/rice for longer period of time or store the harvested paddy in properly bagged and stacked with suitable cover to avoid damage due to untimely rain. Start field preparation for green gram and black gram where irrigation facilities are available, grow Rabi crops like groundnut, Cowpea in medium/shallow lowlands utilising the available soil moisture in the field.",
   "crops_data": {
      "rice": {
         "advisory": [
            "The transplanted paddy is at hard dough to harvesting (thirteen to seventeen week) stage. The direct seeded rice crop is at harvesting stage. Drain out water from the crop field at maturity stage. Keep the harvested paddy by covering or carry to covered threshing floor . Cut Worm: Spray Chloropyriphos 50% + Cypermethrin 5% E.C. @ 400 ml or Profenophos 50% E.C. @ 400 ml per acre per 200 ltr of water in afternoon hour . Brown Plant Hopper: BPH may be seen in the prevailing weather conditions. To Manage BPH in rice fields make alley paths after every 8-10 rows, spraying of Buprofezin+Acephate @ 30 gram or Dinotefuran @ 5 gram per 15 litres of water can be beneficial.",
            "If population of Brown Plant Hopper (BPH) exceeds economic threshold level (ETL) (i.e., 5-10 hoppers/hill), it is advised to alter the micro-climate of the rice field by alternate wetting and drying technique (water should not stand in the field for long time). If problem still persists, spray Pymetrozine 50% WG @ 120 g/acre or Dinotefuran 20 % SG @ 80 g/acre or Flonicamid 50 % WG @ 60- gram/acre or Triflumezopyrim 10% SC @ 100 ml / acre at the base of the plant for control of above pests. Avoid using nitrogenous fertilizers during infestation of BPH. To control Neck Blast diseases first drain out excess water from the paddy field. Spray Hexaconazole @ 400- ml/acre or Azoxystrobin+ Difenoconazole @ 200-ml/acre or Tebuconazole + Trifloxystrobin @ 80-gram/acre."
         ]
      },
      "amaranth": {
         "advisory": [
            "October to March is suitable for greens amaranth. Amaranth are of two types- White or Red.Use 3 kg seeds/acre.Layout 5 ft long beds of 4 ft wide with bunds.Pulverise the beds, remove the weeds and apply 1 to 2 baskets of FYM/ bed. Because of small size seeds, mix some coarse sands with the seeds for easy and uniform sowing.After sowing cover the seeds with thin layer of soil and cover it with straw followed by light irrigation. Remove the straw after emergence."
         ]
      },
      "sunflower": {
         "advisory": [
            "Sunflower is a profitable rabi oilseed crop. Now the time is optimum for sowing of sunflower . Grow high yielding varieties like Morden, Sunrise, Surya and Hybrid varieties like KBSH-1, KBSH-3 and MSFH. Use 4 kg seeds/acre for high yielding varieties for rainfed condition, 3.5 kg for irrigated condition, 2-2.5 kg seeds/acre for hybrid varieties under rainfed condition and 1.5-2 kg seeds for irrigated condition. Before sowing treat the seeds with 2 g Carbendazim/kg seeds. To protect the crop from fungal wilt, treat the seeds with 4 g Trichoderma/kg. Soak the seeds for 10-12 hours for batter germination. Use 600 g PSB culture per acre after draining out the water . Apply 2 ton FYM along with 8:16:12 kg NPK per acre for high yielding varieties and double of it for hybrid varieities before sowing. Sow the seeds 30 cm apart maintaining a row spacing of 45 cm for loamy soil and 60 cm for clayey soil."
         ]
      },
      "brinjal": {
         "advisory": [
            "To control Phomopsis Blight disease in Brinjal spray Metalaxyl 8%+ Mancozeb 64 % WP @ 400 gram/acre or Propineb 70 % WP @ 400-gram/acre."
         ]
      },
      "cauliflower": {
         "advisory": [
            "Apply 33-kg of Urea and 23 kg MOP  per acre after hoeing and hand weeding at 15-20 DAT and 33 kg of urea and 23-kg of MOP  per acre as last top-dressing fertilizer at 30-35 DAT. If Borax was not applied during transplanting of seedlings than spray Borax @ 4 kg/acre or Folibor /Solubor @ 1.5 gram/litre. Spraying of Boron micronutrient should be done after two weeks of transplanting and two weeks before curd formation."
         ]
      },
      "onion": {
         "advisory": [
            "The onion seedlings in nursery are germination to one week stage. Complete nursery preparation for sowing onion and sowing seeds in nursery . For onion use varieties like Agrifound light Red, Bhima Super , Bhima Red, Bhima Shakti and seed rate is 4-5 kg/ac. Cover the nursery to protect from sunrays and rain. For 1 acre crop the nursery area should be of 50 sq.m (of dimension 3m X1m X 0.15 m). Seed treatment with Bavistin 1g + Thriam 2 g per kg seed should be done before sowing in the nursery . Drench the seed bed with streptocycline 0.1g with carbendazim 1g mixing in one litrer water to protect seedlings from damping off."
         ]
      },
      "tomato": {
         "advisory": [
            "The tomato seedlings in nursery are one to three week stage. Drench the seed bed with streptocycline 0.1g with carbendazim 1g mixing in one litrer water to protect seedlings from damping off. Prepare main field for transplanting tomato seedlings when they become 3-4 week old in nursery . After final land preparation of the main field, rings or mounds should be prepared at spacing of 60cm from row to row and 45cm from plant to plant within the row for tomato. Basal dose of 52kg DAP , 7kg Urea and 66kg MOP  should be applied per acre crop area before transplanting seedlings to mounds."
         ]
      },
      "banana": {
         "advisory": [
            "After rainfall there are chances of wilt disease in brinjal and chilli crop. To manage wilt disease in brinjal and chilli first uproot affected plants and destroy it away from the field. Don’t apply excess nitrogenous fertilizer . Drench the root zone of the plant with 200-ml of Tebuconazole mixed with 20-gram of Streptocycline per acre. Use 200-litre of water per acre for spraying."
         ]
      },
      "papaya": {
         "advisory": [
            "To manage stem weevil, install Cosmolure pheromone traps @ 10/acre in banana garden. Dip the banana stem in warm water for 30 minutes before planting. Fill the pit with 25 g neem pedia or 25-50 g any granular insecticide before planting. Cut the affected plant into pieces and dry under sun. Keep the banana garden neat and clean."
         ]
      },
      "cucumber": {
         "advisory": [
            "To manage fruit fly in cucurbits, prepare a poison bait by mixing 400-gram Jaggery and 8-ml Malathion or DDVP in 4-litre of water . Keep this mixture in Plastic cups or clay pots @80-nos/acre. The fruit flies will be attracted to this and eventually get killed by falling into the poison baits."
         ]
      }
   },
   "date": "26-11-2024",
   "ERROR": "Not getting consistent data."
}