{
   "weather_details": {
      "30-10-2024": {
         "rainfall": 7,
         "t_max": 32,
         "t_min": 26,
         "rh_max": 94.5,
         "rh_min": 67.8,
         "wind_speed": 3,
         "wind_direction": 344,
         "cloud_cover": 7
      },
      "31-10-2024": {
         "rainfall": 1,
         "t_max": 33,
         "t_min": 25,
         "rh_max": 93.4,
         "rh_min": 66.6,
         "wind_speed": 4,
         "wind_direction": 243,
         "cloud_cover": 6
      },
      "01-11-2024": {
         "rainfall": 1,
         "t_max": 33,
         "t_min": 25,
         "rh_max": 91.8,
         "rh_min": 57,
         "wind_speed": 5,
         "wind_direction": 241,
         "cloud_cover": 5
      },
      "02-11-2024": {
         "rainfall": 0,
         "t_max": 33,
         "t_min": 25,
         "rh_max": 92.8,
         "rh_min": 55,
         "wind_speed": 6,
         "wind_direction": 266,
         "cloud_cover": 4
      },
      "03-11-2024": {
         "rainfall": 0,
         "t_max": 33,
         "t_min": 24,
         "rh_max": 89.7,
         "rh_min": 49,
         "wind_speed": 5,
         "wind_direction": 294,
         "cloud_cover": 4
      }
   },
   "names_of_crops": [
      "rice",
      "sugarcane",
      "vegetables",
      "fruit",
      "pisciculture",
      "livestock"
   ],
   "general_advisory": "Visit to field regularly to observe the infestation levels of BPH, WBPH, Leaf folder, Gundhy bug and the incidence of BLB and Blast. Monitor the activity of Gundhy bug in rice field and install rotten snail trap for mass trapping and killing of the pest. Repair & strengthen of trellis in vine vegetables & cucurbits. Clean the animal shed by spraying disinfectant/bleaching powder/phenyl.",
   "crops_data": {
      "rice": {
         "advisory": [
            "If late transplanted rice is in PI/early flowering stage application of additional dose of MOP 12 Kg/acre recommended or foliar spray of MOP (0:0:50)@8-10g /litre of water along with 20%boron @1.5g/litre of water recommended.",
            "Prevailing microclimate condition after the cyclonic events may increase the population of Plant Hoppers. Make alleys in the field in every 3m/after 8-10 rows for proper penetration of sunlight and better aeration at plane base. At the early stage of infestation, to protect the crop, apply Dinotefuran or Clothianidin 50 @ 80g/acre WG along with Neem Oil Formulation @ 600 ml/acre targeting the plant base. Spraying of insecticide should be targeted at the plant base.",
            "Monitor the activity of Gundhy bug in rice field and install rotten snail trap for mass trapping and killing of the pest.",
            "Prevailing warm and humid weather after the cyclone may increase the incidence of BLB and neck Blast disease in rice. Apply (Tebuconazole 50%+ Trifloxystrobin 25% WG)@0.4 g /litre of water."
         ]
      },
      "sugarcane": {
         "advisory": [
            "Drain out excess water.",
            "Wrapping and propping of sugarcane should be done to avoid lodging."
         ]
      },
      "vegetables": {
         "advisory": [
            "High moisture content followed by heavy rainfall due to cyclone may increase the wilting or partial wilting in brinjal. To prevent this, drain the excess water from the field. Apply Neem or Karanja cake @ 1g/acre, Drenching of Tebuconazole @ 1ml/liter can be recommended.",
            "Repairing & strengthening of trellis in vines & standing cucurbit vegetables.",
            "If the seedlings of early duration varieties of vegetables are damaged, treat the seedlings with (Metalaxyl + Mancozeb) @ 2g/li of water and Plantomycin @ 1g per liter of water."
         ]
      },
      "fruit": {
         "advisory": [
            "Papaya- Install Yellow Sticky trap to trap the vector (Whitefly) of Papaya Leaf Curl Virus. Alternate spraying of Neem oil formulation 1500ppm @3ml/lit of water and spray flonicamid 50WG @0.3g/lit to control whitefly."
         ]
      },
      "pisciculture": {
         "advisory": [
            "After heavy rainfall, the water quality of fish ponds may be altered. Testing of water PH & need-based application of @100kg lime /acre in 3 splits (40:40:20) at 2 days interval is recommended."
         ]
      },
      "livestock": {
         "advisory": [
            "If the animals have not yet been vaccinated against FMD, Haemorrhagic Septicaemia, Black Quarter, Enterotoxemia, etc., these must be done.",
            "Keep shed clean by removing excreta and dry to protect animals from disease and insects."
         ]
      }
   },
   "date": "29-10-2024",
   "ERROR": "Not getting consistent data."
}