{
   "weather_details": {
      "2024-11-02": {
         "rainfall": 4,
         "t_max": 32,
         "t_min": 23,
         "rh_max": 95,
         "rh_min": 50,
         "wind_speed": 0,
         "wind_direction": 0,
         "cloud_cover": 6
      },
      "2024-11-03": {
         "rainfall": 0.6,
         "t_max": 32,
         "t_min": 22,
         "rh_max": 94,
         "rh_min": 42,
         "wind_speed": 1,
         "wind_direction": 18,
         "cloud_cover": 5
      },
      "2024-11-04": {
         "rainfall": 0.1,
         "t_max": 31,
         "t_min": 22,
         "rh_max": 94,
         "rh_min": 42,
         "wind_speed": 1,
         "wind_direction": 90,
         "cloud_cover": 5
      },
      "2024-11-05": {
         "rainfall": 0.1,
         "t_max": 31,
         "t_min": 22,
         "rh_max": 92,
         "rh_min": 42,
         "wind_speed": 1,
         "wind_direction": 90,
         "cloud_cover": 4
      },
      "2024-11-06": {
         "rainfall": 0.1,
         "t_max": 31,
         "t_min": 22,
         "rh_max": 92,
         "rh_min": 48,
         "wind_speed": 1,
         "wind_direction": 18,
         "cloud_cover": 3
      }
   },
   "names_of_crops": [
      "ଚିନାବାଦାମ",
      "ଘୋଡ଼ା ଗ୍ରାମ",
      "ସବୁଜ ଚଣା",
      "କଳା ଚଣା",
      "କଦଳୀ",
      "ମିଠା ଆଳୁ",
      "ତିଲ।",
      "କଦଳୀ",
      "ଫୁଲକୋବି",
      "ବ୍ରୋକୋଲି",
      "ବାଇଗଣ",
      "ଟମାଟୋ",
      "ଲଙ୍କା",
      "କ୍ୟାପ୍ସିକମ୍",
      "ଗାଜର",
      "ମୂଳା",
      "ରସୁଣ",
      "ରସୁଣ",
      "ପନିପରିବା",
      "ଗୋଲାପ।",
      "ବିନ୍ସ"
   ],
   "general_advisory": "ଉଚ୍ଚଭୂମି/ମଧ୍ଯ଼ମ ଜମିରେ ଚିନାବାଦାମ, ଚଣା, ସବୁଜ ଚଣା, କଳା ଚଣା, କାଉପି, ମିଠା ଆଳୁ ଏବଂ ତିଲ ଭଳି ରବି ଫସଲ ବୁଣିବା ପାଇଁ ମୃତ୍ତିକାର ଆର୍ଦ୍ରତା ଯଥେଷ୍ଟ। କୋଲ ଫସଲ (ବନ୍ଧାକୋବି, ବିଳମ୍ବିତ ଫୁଲକୋବି ଏବଂ ବ୍ରୋକୋଲି), ସୋଲାନାସିଯ଼ସ୍ ପନିପରିବା (ବାଇଗଣ, ଟମାଟୋ, ଲଙ୍କା ଏବଂ କ୍ଯ଼ାପ୍ସିକମ୍) ଭଳି ପନିପରିବା ବୁଣିବା ପାଇଁ ଏହା ସର୍ବୋତ୍ତମ ସମଯ଼। ଗାଜର, ମୂଳା, ସୋରିଷ, ରସୁଣ, ଡାଳିମ୍ବ ଇତ୍ଯ଼ାଦି ପନିପରିବା ରୋପଣ କରନ୍ତୁ। ଅକ୍ଟୋବର-ନଭେମ୍ବର ହେଉଛି ଶାଖାଗୁଡ଼ିକର ଏକ ଭଲ ବ୍ଯ଼ବଧାନ ଢାଞ୍ଚାରେ ପ୍ରଚୁର ଫୁଲ କଳ ଉତ୍ପାଦନ କରିବା ପାଇଁ ଗୋଲାପରେ କଠିନ ଛାଣିବା ପାଇଁ ଆଦର୍ଶ ସମଯ଼ | ଧନିଆ, ଟମାଟୋ, ଫୁଲକୋବି ଏବଂ ତିଲର ନର୍ସରୀ ବୁଣିବା ପାଇଁ ଯାଆନ୍ତୁ। କୋଲେ ଫସଲ ରୋପଣ ପାଇଁ ଯାଆନ୍ତୁ। କୋଲ୍ ଫସଲ ଚାରା ନର୍ସରୀରେ 3-ସପ୍ତାହ ପର୍ଯ୍ଯ଼ାଯ଼ରେ ଅଛି | ମୁଖ୍ଯ଼ କ୍ଷେତରେ ରୋପଣ କରନ୍ତୁ। ବିନ୍ ରୋପଣ ପାଇଁ ପାଗ ଅନୁକୂଳ ଅଟେ।",
   "crops_data": {
      "rice": {
         "advisory": [
            "ଧାନରେ ଏହି ଫସଲ ପର୍ଯ୍ଯ଼ାଯ଼ରେ ଶୀଥ୍ ବ୍ଲାଇଟ୍ ସଂକ୍ରମଣ ହୋଇପାରେ | ଧାନରେ ଶୀଥ୍ ବ୍ଲାଇଟ୍ ସଂକ୍ରମଣକୁ ନିଯ଼ନ୍ତ୍ରଣ କରିବା ପାଇଁ, ହେକ୍ସାକୋନାଜୋଲ୍ 5 ପ୍ରତିଶତ + ଭାଲିଡାମାଇସିନ୍ 2.5 ପ୍ରତିଶତ ଏସ୍. ସି. 400 ମିଲି. ଏକର ପିଛା @2 ମିଲି/ଲିଟର ପାଣି କିମ୍ବା ପ୍ରୋପିକୋନାଜୋଲ୍ <ଆଇ. ଡି. 1> + ଡିଫେନକୋନାଜୋଲ୍ <ଆଇ. ଡି. 1> ଇ. ସି. 200 ମିଲି. ଏକର ପିଛା @1 ମିଲି/ଲିଟର ପାଣି ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "cotton": {
         "advisory": [
            "ଯଦି କପା ଫସଲରେ ଏଫିଡ୍ ଏବଂ ଜ୍ଯାସିଡ୍, ଥ୍ରିପ୍ ଏବଂ ମିଲିବଗ୍ ପରି ଶୋଷକ କୀଟ ସଂକ୍ରମଣ ହୁଏ, ତେବେ 200-ଲିଟର ପାଣିରେ ମିଶ୍ରଣ କରି ନିମ୍ ଆଧାରିତ କୀଟନାଶକ (ନିମ୍ ତେଲ 1500 ପିପିଏମ୍) @600-ମିଲି/ଏକର ସ୍ପ୍ରେ କରନ୍ତୁ। ଯଦି ଶୋଷକ କୀଟ ସଂଖ୍ଯ଼ା ଇ. ଟି. ଏଲ୍. ଠାରୁ ଅଧିକ ବୋଲି ଜଣାପଡ଼େ, ତେବେ ଫ୍ଲୋନିକାମିଡ୍ 50 ପ୍ରତିଶତ ଡବ୍ଲୁ. ଜି. @60 ଗ୍ରାମ୍/ଏକର କିମ୍ବା ଥିଯ଼ାମେଥୋକ୍ସାମ୍ 25 ପ୍ରତିଶତ ଡବ୍ଲୁ. ଜି. @40 ଗ୍ରାମ୍/ଏକର କିମ୍ବା ଡିନୋଟେଫୁରାନ୍ 20 ପ୍ରତିଶତ ଏସ୍. ଜି. @80 ଗ୍ରାମ୍/ଏକର ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "horticulture": {
         "advisory": [
            "ପତ୍ର ଖାଉଥିବା କ୍ଯ଼ାଟର୍ପିଲର ଏବଂ ଫଳ ଛେଦକକୁ ନିଯ଼ନ୍ତ୍ରଣ କରିବା ପାଇଁ ପ୍ରତି ଲିଟର ପାଣିରେ 0.5 ଗ୍ରାମ ଇମାମେକ୍ଟିନ୍ ବେନ୍ଜୋଏଟ୍ କିମ୍ବା 0.4 ମିଲି ସ୍ପିନୋସଡ୍ ଲଗାନ୍ତୁ।",
            "ପତ୍ର ଖାଉଥିବା କ୍ଯ଼ାଟର୍ପିଲର ଏବଂ ଫଳ ଛେଦକକୁ ନିଯ଼ନ୍ତ୍ରଣ କରିବା ପାଇଁ ପ୍ରତି ଲିଟର ପାଣିରେ 0.5 ଗ୍ରାମ ଇମାମେକ୍ଟିନ୍ ବେନ୍ଜୋଏଟ୍ କିମ୍ବା 0.4 ମିଲି ସ୍ପିନୋସଡ୍ ଲଗାନ୍ତୁ।",
            "ଓକ୍ରାକୁ କାଣ୍ଡ ଏବଂ ଫଳ ଛେଦକରୁ ରକ୍ଷା କରିବା ପାଇଁ ଏକର ପିଛା 200 ଲିଟର ପାଣିରେ 70 ମିଲି ସ୍ପିନୋସାଦ୍ କିମ୍ବା 60 ଗ୍ରାମ୍ ଆମୋନିୟମ୍ ବେଞ୍ଜୋଏଟ୍ ଲଗାନ୍ତୁ।",
            "ଅଗ୍ରିଫାଉଣ୍ଡ୍ ଲାଇଟ୍ ରେଡ୍, ଭୀମ ସୁପର୍, ଭୀମ ରେଡ୍, ଭୀମ ଶକ୍ତି ପରି କିସମ ଏବଂ ବିହନ ହାର ଏସି ପିଛା 4 ରୁ 5 କିଲୋଗ୍ରାମ। ସୂର୍ଯ୍ଯ଼କିରଣ ଏବଂ ବର୍ଷାରୁ ରକ୍ଷା ପାଇବା ପାଇଁ ନର୍ସରୀକୁ ଢାଙ୍କି ଦିଅନ୍ତୁ। 1 ଏକର ଫସଲ ପାଇଁ ନର୍ସରୀ କ୍ଷେତ୍ର 50 ବର୍ଗ ମିଟର (ଆକାର 3 ମି. x1 ମି. x 0.15 ମି.) ହେବା ଉଚିତ। ନର୍ସରୀରେ ବୁଣିବା ପୂର୍ବରୁ ପ୍ରତି କିଲୋଗ୍ରାମ ମଞ୍ଜି ପିଛା ବାଭିଷ୍ଟିନ୍ 1 ଗ୍ରାମ୍ + ଥ୍ରିଯ଼ମ୍ 2 ଗ୍ରାମ୍ ସହିତ ମଞ୍ଜି ଚିକିତ୍ସା କରାଯିବା ଉଚିତ। ଚାରା ଗୁଡ଼ିକୁ ଭିଜିବା ଠାରୁ ରକ୍ଷା କରିବା ପାଇଁ ଏକ ଲିଟର ପାଣିରେ କାର୍ବେନଡାଜିମ୍ 1 ଗ୍ରାମ୍ ମିଶାଇ ଷ୍ଟ୍ରେପ୍ଟୋସାଇକ୍ଲିନ୍ 0.1 ଗ୍ରାମ୍ ସହିତ ବୀଜ ଶଯ୍ଯ଼ାକୁ ଭିଜାଇ ଦିଅନ୍ତୁ |"
         ]
      }
   },
   "date": "01-11-2024"
}