{
   "weather_details": {
      "03-07-2024": {
         "rainfall": 5,
         "t_max": 29,
         "t_min": 24,
         "rh_max": 81,
         "rh_min": 68,
         "wind_speed": 19,
         "wind_direction": 246,
         "cloud_cover": 8
      },
      "04-07-2024": {
         "rainfall": 10,
         "t_max": 30,
         "t_min": 24,
         "rh_max": 82,
         "rh_min": 54,
         "wind_speed": 13,
         "wind_direction": 248,
         "cloud_cover": 8
      },
      "05-07-2024": {
         "rainfall": 10,
         "t_max": 32,
         "t_min": 25,
         "rh_max": 81,
         "rh_min": 54,
         "wind_speed": 12,
         "wind_direction": 243,
         "cloud_cover": 8
      },
      "06-07-2024": {
         "rainfall": 5,
         "t_max": 32,
         "t_min": 25,
         "rh_max": 76,
         "rh_min": 54,
         "wind_speed": 14,
         "wind_direction": 238,
         "cloud_cover": 8
      },
      "07-07-2024": {
         "rainfall": 15,
         "t_max": 31,
         "t_min": 25,
         "rh_max": 78,
         "rh_min": 47,
         "wind_speed": 14,
         "wind_direction": 238,
         "cloud_cover": 8
      }
   },
   "names_of_crops": [
      "ଖରିଫ ଚାଉଳ",
      "କପା",
      "ପନିପରିବା ଫସଲ",
      "ଗାଈ/ମଇଁଷି",
      "କୁକୁଡ଼ା ମାଂସ"
   ],
   "general_advisory": "ଆଇଏମଡିର ବର୍ଦ୍ଧିତ ପରିସୀମା ପୂର୍ବାନୁମାନ ଅନୁଯାଯ଼ୀ, ବର୍ଷା ସ୍ୱାଭାବିକଠାରୁ ଅଧିକ ଏବଂ 2024 ଜୁଲାଇ 7 ରୁ 13 ମଧ୍ଯ଼ରେ ଓଡ଼ିଶା ରାଜ୍ଯ଼ରେ ଉଭଯ଼ ସର୍ବାଧିକ ଏବଂ ସର୍ବନିମ୍ନ ତାପମାତ୍ରା ସ୍ୱାଭାବିକ ହେବାର ଆଶା କରାଯାଉଛି, ତେଣୁ କୃଷକମାନଙ୍କୁ ଖରିଫ ଫସଲ ଚାଷ ଦିଗରେ ଆବଶ୍ଯ଼କ ପଦକ୍ଷେପ ନେବାକୁ ଏବଂ ସେହି ସମଯ଼ରେ ଜଳସେଚନ ଏଡ଼ାଇବାକୁ ପରାମର୍ଶ ଦିଆଯାଇଛି। ଖରିଫ ଧାନ ଏବଂ ପନିପରିବା ଫସଲ ପାଇଁ କୃଷକମାନେ ନର୍ସରୀ ଶଯ୍ଯ଼ା ପ୍ରସ୍ତୁତି ଆରମ୍ଭ କରିବା ଉଚିତ ଏବଂ ଅତୀତର ବର୍ଷା ସ୍ଥିତିର ଲାଭ ଉଠାଇ ଉଦ୍ଯ଼ାନରେ ନୂତନ ଫଳ ଫସଲ ରୋପଣ ମଧ୍ଯ଼ ଆରମ୍ଭ କରିବା ଉଚିତ। ପ୍ରଚଳିତ ପାଣିପାଗ ସ୍ଥିତି ସମସ୍ତ ପ୍ରକାରର ଫସଲରେ କ୍ଷୁଦ୍ର କୀଟ ଆକ୍ରମଣ ପାଇଁ ଅନୁକୂଳ, ତେଣୁ ସ୍ୱଚ୍ଛ ପାଣିପାଗ ସ୍ଥିତିରେ ଏହି କୀଟପତଙ୍ଗକୁ ନିଯ଼ନ୍ତ୍ରଣ କରିବା ପାଇଁ କୃଷକମାନେ ପ୍ରତି ଲିଟର ପାଣିରେ 25 ପ୍ରତିଶତ ୱିଜି @0.5-0.6g କିମ୍ବା ଇମିଡାକ୍ଲୋପ୍ରିଡ୍ 17.8% ଏସଏଲ @0.5ml କିମ୍ବା ଲାମ୍ବଡା ସାଇହାଲୋଥ୍ରିନ୍ 4.9 ପ୍ରତିଶତ ସିଏସ ସ୍ପ୍ରେ କରିବା ଉଚିତ। ଅଧିକ ଆପେକ୍ଷିକ ଆର୍ଦ୍ରତା ସହିତ ମେଘୁଆ ପାଗ ସ୍ଥାଯ଼ୀ ଫସଲରେ କିଛି ରୋଗ ସଂକ୍ରମଣକୁ ସମର୍ଥନ କରିପାରେ, ତେଣୁ ଏହାର ନିଯ଼ମିତ ତଦାରଖ ପାଇଁ ପରାମର୍ଶ ଦିଆଯିବା ଉଚିତ।",
   "crops_data": {
      "kharif rice": {
         "advisory": [
            "ପୂର୍ବ ବର୍ଷାର ଲାଭ ଉଠାଇ କୃଷକମାନେ ଧାନ ବୁଣିବା ପାଇଁ କ୍ଷେତ ପ୍ରସ୍ତୁତି ଆରମ୍ଭ କରିବା ଉଚିତ।",
            "କାର୍ବେଣ୍ଡାଜିମ୍ 50 ପ୍ରତିଶତ ଡବ୍ଲ୍ଯ଼ୁ. ପି. @2 ଗ୍ରାମ୍/କି. ଗ୍ରା. ମଞ୍ଜି କିମ୍ବା ଟ୍ରାଇକୋଡର୍ମା @10 ଗ୍ରାମ୍/କି. ଗ୍ରା. ମଞ୍ଜି ସାହାଯ୍ଯ଼ରେ ମଞ୍ଜି ଚିକିତ୍ସା କରାଯିବା ଉଚିତ।",
            "ମଞ୍ଜିଗୁଡ଼ିକୁ 24 ଘଣ୍ଟା ପାଇଁ ପାଣିରେ ଭିଜାଇ ରଖନ୍ତୁ ଏବଂ ତା \"ପରେ ପାଣି ବାହାର କରି ମଞ୍ଜିଗୁଡ଼ିକୁ ବସ୍ତା ଭିତରେ ରଖନ୍ତୁ। ଥରେ ମଞ୍ଜି ଅଙ୍କୁରିତ ହୋଇଗଲେ, ଏହାକୁ ବୁଣିବା ପାଇଁ ବ୍ଯ଼ବହାର କରନ୍ତୁ।"
         ]
      },
      "cotton": {
         "advisory": [
            "ଯେଉଁ କୃଷକମାନେ ଏପର୍ଯ୍ଯ଼ନ୍ତ କପା ଚାଷ ପାଇଁ କ୍ଷେତ୍ର ପ୍ରସ୍ତୁତି ଆରମ୍ଭ କରିନାହାଁନ୍ତି, ସେମାନଙ୍କୁ ଯଥାଶୀଘ୍ର ପ୍ରସ୍ତୁତି ଆରମ୍ଭ କରିବାକୁ ପରାମର୍ଶ ଦିଆଯାଇଛି।",
            "ବୁଣିବା ପୂର୍ବରୁ, ଶୋଷକ କୀଟପତଙ୍ଗରୁ ସୁରକ୍ଷା ପାଇଁ ଇମିଡାକ୍ଲୋପ୍ରିଡ୍ 70 ଡବ୍ଲୁଜି @7 ଗ୍ରାମ୍/କେଜି ମଞ୍ଜି ବ୍ଯ଼ବହାର କରିବା ଉଚିତ।",
            "ସାଧାରଣ ଏବଂ ହାଇବ୍ରିଡ୍ କିସମ ପାଇଁ ବ୍ଯ଼ବଧାନ ଯଥାକ୍ରମେ 90 × 45-60 ସେ. ମି. ଏବଂ 90-120 × 90 ସେ. ମି. ହେବା ଉଚିତ।"
         ]
      },
      "vegetable crops": {
         "advisory": [
            "ଅତୀତର ପାଣିପାଗ (ସମଯ଼ ସମଯ଼ରେ ମେଘୁଆ ଏବଂ ଉଜ୍ୱଳ) ସ୍ଥିତି ପନିପରିବା ଫସଲରେ କୀଟ ଆକ୍ରମଣ ପାଇଁ ଅନୁକୂଳ, ତେଣୁ ଏହାର ନିଯ଼ମିତ ତଦାରଖ ପାଇଁ ପରାମର୍ଶ ଦିଆଯିବା ଉଚିତ।",
            "ଆଗାମୀ ଦିନରେ ବର୍ଷା ହେବାର ସମ୍ଭାବନା ଥିବାରୁ କୃଷକମାନଙ୍କୁ ସିଞ୍ଚନ କାର୍ଯ୍ଯ଼ କରିବା ସମଯ଼ରେ ଉପଯୁକ୍ତ ଯତ୍ନ ନେବାକୁ ଏବଂ ଉପଯୁକ୍ତ ସୁରକ୍ଷା ସହିତ ନର୍ସରୀ ଶଯ୍ଯ଼ା ପ୍ରସ୍ତୁତି ଏବଂ ଖରିଫ ପନିପରିବା ଫସଲ ବୁଣିବା ଆରମ୍ଭ କରିବାକୁ ପରାମର୍ଶ ଦିଆଯାଇଛି।"
         ]
      },
      "cow/buffalo": {
         "advisory": [
            "ମୌସୁମୀ (ବର୍ଷା ଋତୁ) ଆରମ୍ଭ ହେବା ପୂର୍ବରୁ ଏଫଏମଡି, ଏଚଏସ ଏବଂ ବିକ୍ଯ଼ୁ ବିରୁଦ୍ଧରେ ପଶୁମାନଙ୍କର କୃମି ଦୂରୀକରଣ ଏବଂ ଟୀକାକରଣ ସୁନିଶ୍ଚିତ କରାଯିବା ଉଚିତ।",
            "ନରମ ଏବଂ କୋମଳ ଘାସ ଗୋରୁମାନଙ୍କ ପାଇଁ ଅଧିକ ସ୍ୱାଦିଷ୍ଟ, କିନ୍ତୁ ଅଧିକ ଅଳିଆ ଖାଇବା ସମଯ଼ରେ ଦୁଗ୍ଧ ଗାଈମାନଙ୍କଠାରେ ମ୍ଯ଼ାଗ୍ନେସିଯ଼ମ୍ ଅଭାବ ଦେଖାଯାଏ, ତେଣୁ କେବଳ ନରମ ଘାସ ପରିବର୍ତ୍ତେ ବିଭିନ୍ନ ପ୍ରକାରର ଘାସ ଖୁଆଇବା ଉଚିତ |"
         ]
      },
      "poultry": {
         "advisory": [
            "ବର୍ଷା ଋତୁରେ, ଦିନରେ ପାର୍ଶ୍ୱ ପର୍ଦାର ଶୀର୍ଷରେ 1 ରୁ 2 ଫୁଟ ଖୋଲିବାକୁ ଅନୁମତି ଦେଇ ଉପଯୁକ୍ତ ଭେଣ୍ଟିଲେସନ୍ ନିଶ୍ଚିତ କରିବାକୁ ବ୍ଯ଼ବସ୍ଥା କରନ୍ତୁ |",
            "ରାଣୀଖେତ୍ ରୋଗ ବିରୁଦ୍ଧରେ କୁକୁଡ଼ା ପକ୍ଷୀଙ୍କ କୃମି ଦୂରୀକରଣ ଏବଂ ଟୀକାକରଣ ନିଶ୍ଚିତ କରାଯିବା ଆବଶ୍ଯ଼କ।",
            "ବର୍ଷା ଋତୁରେ କୀଟପତଙ୍ଗ ଆକ୍ରମଣକୁ ଏଡାଇବା ପାଇଁ କୁକୁଡ଼ା ଫାର୍ମରେ ଉପଯୁକ୍ତ ବାଯ଼ୁ ଚଳାଚଳ ଏବଂ ସ୍ୱଚ୍ଛତା ସୁନିଶ୍ଚିତ କରନ୍ତୁ।"
         ]
      }
   },
   "date": "02-07-2024"
}