{
   "weather_details": {
      "03/04/2024": {
         "rainfall": 0,
         "t_max": 40,
         "t_min": 26,
         "rh_max": 57,
         "rh_min": 13,
         "wind_speed": 12,
         "wind_direction": 205,
         "cloud_cover": 0
      },
      "04/04/2024": {
         "rainfall": 0,
         "t_max": 40,
         "t_min": 26,
         "rh_max": 80,
         "rh_min": 15,
         "wind_speed": 11,
         "wind_direction": 180,
         "cloud_cover": 1
      },
      "05/04/2024": {
         "rainfall": 0,
         "t_max": 41,
         "t_min": 27,
         "rh_max": 70,
         "rh_min": 23,
         "wind_speed": 15,
         "wind_direction": 207,
         "cloud_cover": 1
      },
      "06/04/2024": {
         "rainfall": 0,
         "t_max": 41,
         "t_min": 27,
         "rh_max": 67,
         "rh_min": 15,
         "wind_speed": 13,
         "wind_direction": 210,
         "cloud_cover": 0
      },
      "07/04/2024": {
         "rainfall": 0,
         "t_max": 42,
         "t_min": 27,
         "rh_max": 55,
         "rh_min": 10,
         "wind_speed": 12,
         "wind_direction": 242,
         "cloud_cover": 2
      }
   },
   "names_of_crops": [
      "ଧାନ।",
      "ଆଖୁ",
      "ମକା",
      "ଟମାଟୋ",
      "ବାଇଗଣ",
      "ନଡ଼ିଆ",
      "ପନିପରିବା",
      "ଫିଙ୍ଗରଲିଙ୍ଗ୍"
   ],
   "general_advisory": "ଧାନ ଫସଲରେ, ପେନିକଲ୍ ଦୀକ୍ଷା, ପେନିକଲ୍ ଉତ୍ଥାନ, ଫୁଲ ଏବଂ କ୍ଷୀର ଦୋଇବା ପର୍ଯ୍ୟାୟ ହେଉଛି ଗୁରୁତ୍ୱପୂର୍ଣ୍ଣ ପର୍ଯ୍ୟାୟ | ଆଖୁରେ ଶୁଖିଲା ପତ୍ରରେ ଧାଡ଼ିଗୁଡ଼ିକୁ ଢାଙ୍କି ଦିଅନ୍ତୁ। ଉତ୍ତାପ ପ୍ରଭାବକୁ ହ୍ରାସ କରିବା ପାଇଁ ସ୍ପ୍ରିଂକଲର ଜଳସେଚନ ପ୍ରୟୋଗ କରନ୍ତୁ। ଅଧିକ ତାପମାତ୍ରା ମକା ଫସଲର ଜଳର ଆବଶ୍ୟକତାକୁ ବଢ଼ାଇଥାଏ। ଜଳ ଅପଚୟକୁ ରୋକିବା ପାଇଁ ଜଳସେଚନ ଚ୍ୟାନେଲରେ ପଲିଥିନ୍ ବିସ୍ତାର କରନ୍ତୁ। ଦିନର ଉଚ୍ଚ ତାପମାତ୍ରାରେ ଟମାଟୋ ଏବଂ ବାଇଗଣ ଶୁଖିଯାଇପାରେ। ଜଳକ୍ଷୟ ହ୍ରାସ କରିବା ପାଇଁ ନଡ଼ିଆ ଗଛ ଚାରିପାଖରେ ନଡ଼ିଆ ପତ୍ରକୁ ମଲ୍ଚ କରନ୍ତୁ। ଦିନ ସମୟରେ ପନିପରିବା ଚାରା ଗୁଡ଼ିକୁ ଢାଙ୍କି ଦିଅନ୍ତୁ। ଯଦି ପାଣିର ତାପମାତ୍ରା 30 ଡିଗ୍ରୀ ସେଲସିୟସ୍ ପର୍ଯ୍ୟନ୍ତ ବଢ଼ିଥାଏ, ତେବେ ଫିଙ୍ଗରଲିଙ୍ଗସ ଅମଳ କରନ୍ତୁ।",
   "crops_data": {
      "paddy": {
         "advisory": [
            "ଧାନ ଫସଲରେ, ପେନିକଲ୍ ଦୀକ୍ଷା, ପେନିକଲ୍ ଉତ୍ଥାନ, ଫୁଲ, ଏବଂ କ୍ଷୀର ଦୋଇବା ପର୍ଯ୍ୟାୟ ହେଉଛି ଗୁରୁତ୍ୱପୂର୍ଣ୍ଣ ପର୍ଯ୍ୟାୟ | ଏହି ପର୍ଯ୍ୟାୟଗୁଡ଼ିକରେ ଜଳର ଅଭାବକୁ ଏଡ଼ାଇବା ଉଚିତ।",
            "ହଳଦିଆ କାଣ୍ଡ ଛେଦକ ପରିଚାଳନା-ଫଳପ୍ରଦ ପରିଚାଳନା ପାଇଁ ସୁପାରିଶ କରାଯାଇଥିବା କୀଟନାଶକ ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "sugarcane": {
         "advisory": [
            "ଆଖୁରେ ଶୁଖିଲା ପତ୍ରରେ ଧାଡ଼ିଗୁଡ଼ିକୁ ଢାଙ୍କି ଦିଅନ୍ତୁ।",
            "ଗ୍ରୀଷ୍ମ ଋତୁରେ ପାଣିର ଅଭାବରୁ ରକ୍ଷା ପାଇବା ପାଇଁ ପୋଟାସିୟମ୍ ସହିତ ଶୀର୍ଷ ପୋଷାକ ପିନ୍ଧନ୍ତୁ |",
            "ଗରମ ମାସରେ ବାରମ୍ବାର ସ୍ପ୍ରିଂକ୍ଲର୍ ଜଳସେଚନ ପ୍ରୟୋଗ କରନ୍ତୁ |"
         ]
      },
      "maize": {
         "advisory": [
            "ଅଧିକ ତାପମାତ୍ରା ମକା ଫସଲର ଜଳର ଆବଶ୍ୟକତାକୁ ବଢ଼ାଇଥାଏ। ଫଳପ୍ରଦ ଭାବେ ଫସଲକୁ ଜଳସେଚନ କରନ୍ତୁ।"
         ]
      },
      "tomato": {
         "advisory": [
            "ଅତ୍ୟଧିକ ତାପମାତ୍ରାରେ ଟମାଟୋ ଶୁଖିଯାଇପାରେ। ପରିଚାଳନା ପାଇଁ ସ୍ଟ୍ରେପ୍ଟୋସାଇକ୍ଲିନ୍ ପ୍ରୟୋଗ କରନ୍ତୁ।"
         ]
      },
      "brinjal": {
         "advisory": [
            "ବାଇଗଣ ଶୁଟ୍ ଏବଂ ଫଳ ଛେଦକ ପରିଚାଳନା କରିବାକୁ, ଫେରୋମୋନ୍ ଟ୍ରାପ୍ ସ୍ଥାପନ କରନ୍ତୁ |"
         ]
      },
      "coconut": {
         "advisory": [
            "ଜଳକ୍ଷୟ ହ୍ରାସ କରିବା ପାଇଁ ଗଛ ଚାରିପାଖରେ ନଡ଼ିଆ ପତ୍ରକୁ ମଲ୍ଚ କରନ୍ତୁ।"
         ]
      },
      "vegetables": {
         "advisory": [
            "ଦିନରେ ନୂତନ ରୋପଣ କରାଯାଇଥିବା ପନିପରିବା ଚାରା ଗୁଡ଼ିକୁ କାଗଜ ଟୋପି ଦ୍ୱାରା ଢାଙ୍କି ଦିଅନ୍ତୁ।"
         ]
      },
      "fingerlings": {
         "advisory": [
            "ଯଦି ପାଣିର ତାପମାତ୍ରା 30 ଡିଗ୍ରୀ ସେଲସିୟସ୍ ପର୍ଯ୍ୟନ୍ତ ବଢ଼ିଥାଏ, ତେବେ ଫିଙ୍ଗରଲିଙ୍ଗସ ଅମଳ କରନ୍ତୁ।"
         ]
      }
   },
   "date": "02-04-2024"
}