{
   "weather_details": {
      "2024-07-03": {
         "rainfall": 10,
         "t_max": 35,
         "t_min": 27,
         "rh_max": 85,
         "rh_min": 78,
         "wind_speed": 8,
         "wind_direction": 248,
         "cloud_cover": 8
      },
      "2024-07-04": {
         "rainfall": 10,
         "t_max": 36,
         "t_min": 27,
         "rh_max": 83,
         "rh_min": 56,
         "wind_speed": 8,
         "wind_direction": 246,
         "cloud_cover": 8
      },
      "2024-07-05": {
         "rainfall": 15,
         "t_max": 36,
         "t_min": 28,
         "rh_max": 84,
         "rh_min": 66,
         "wind_speed": 6,
         "wind_direction": 249,
         "cloud_cover": 8
      },
      "2024-07-06": {
         "rainfall": 15,
         "t_max": 36,
         "t_min": 28,
         "rh_max": 83,
         "rh_min": 55,
         "wind_speed": 6,
         "wind_direction": 259,
         "cloud_cover": 8
      },
      "2024-07-07": {
         "rainfall": 15,
         "t_max": 34,
         "t_min": 26,
         "rh_max": 89,
         "rh_min": 61,
         "wind_speed": 7,
         "wind_direction": 249,
         "cloud_cover": 8
      }
   },
   "names_of_crops": [
      "ଚାଉଳ",
      "ଫିଙ୍ଗର ମିଲେଟ୍",
      "ମକା",
      "ପିଜନ୍ ମଟର",
      "ବାଇଗଣ"
   ],
   "general_advisory": "ଗତ ସପ୍ତାହରେ ଗଜପତି ଜିଲ୍ଲାର ହାରାହାରି ସର୍ବାଧିକ ଦୈନିକ ତାପମାତ୍ରା 34.1 ଡିଗ୍ରୀ ସେଲସିଯ଼ସ୍ ଏବଂ ହାରାହାରି ସର୍ବନିମ୍ନ ଦୈନିକ ତାପମାତ୍ରା 26.1 ଡିଗ୍ରୀ ସେଲସିଯ଼ସ୍ ଥିଲା। ଗତ ସପ୍ତାହରେ ଜିଲ୍ଲାରେ 75.1 ମିଲିମିଟର ବର୍ଷା ହୋଇଥିଲା। ବର୍ଷା ଜଳସେଚିତ ଉଚ୍ଚଭୂମିରେ ଚିନାବାଦାମ, ଅରହର, ତିଲ, ମଟର ଇତ୍ଯ଼ାଦି ଅଣ-ଧାନ ଫସଲ ବୁଣିବା ପାଇଁ ଯାଆନ୍ତୁ। ଲେଡିଜ ଫିଙ୍ଗର, କାଉପି, କ୍ଲଷ୍ଟର ବିନ୍ ଭଳି ଉଚ୍ଚଭୂମିରେ ପନିପରିବା ଚାଷ କରନ୍ତୁ। ଧାନ ମଞ୍ଜି ଗୁଡ଼ିକୁ ଧାଡ଼ିରେ ବୁଣିବା ପସନ୍ଦଯୋଗ୍ଯ଼, ଯଥାଃ ମଞ୍ଜି ବୁଣିବା କିମ୍ବା ତିନୋଟି ମଞ୍ଜି ବୁଣିବା-ତଥା-ମଞ୍ଜି ବୁଣିବା, କିମ୍ବା ଦେଶୀ ହଳ ପଛପଟେ 15 x 15 ସେ. ମି. କିମ୍ବା 20 x 10 ସେ. ମି. ବ୍ଯ଼ବଧାନରେ ବୁଣିବା। ବୀଜକୁ 4 ରୁ 6 ସେ. ମି. ଗଭୀରତାରେ ରଖିବା ଉଚିତ। ବୀଜର ପରୀକ୍ଷା ଓଜନ ଉପରେ ନିର୍ଭର କରି ପ୍ରସାରଣ ପାଇଁ ଏକର ପିଛା 1 କି. ଗ୍ରା. ଧାନ ମଞ୍ଜି ଏବଂ ବୀଜ ବୁଣିବା ପାଇଁ ଏକର ପିଛା 2 କି. ଗ୍ରା. ମଞ୍ଜି ବ୍ଯ଼ବହାର କରନ୍ତୁ। ଧାନ କ୍ଷେତରେ ପାଣି ଛିଡ଼ା କରି ରଖନ୍ତୁ ନାହିଁ। ପ୍ରତି ବର୍ଗ ମିଟର ନର୍ସରୀ ଶଯ୍ଯ଼ା ପାଇଁ 10 ଗ୍ରାମ ଡିଏପି ଏବଂ 10 ଗ୍ରାମ ଏମଓପି ଲଗାନ୍ତୁ। ଦିନ ବ୍ଯ଼ବଧାନରେ ଦୁଇଥର କ୍ଷେତକୁ କାଦୁଅ କରି ଏବଂ ସମାନ ଫସଲ ଷ୍ଟାଣ୍ଡ ପାଇଁ ଜମି ସମତଳ କରି ମୁଖ୍ଯ଼ କ୍ଷେତ୍ର ଜମି ପ୍ରସ୍ତୁତି କରାଯିବା ଉଚିତ। ମୁଖ୍ଯ଼ କ୍ଷେତର ପ୍ରାରମ୍ଭିକ କାଦୁଅ କରିବା ସମଯ଼ରେ ଧାଇଞ୍ଚା ସବୁଜ ସାର ଫସଲକୁ ସାମିଲ କରନ୍ତୁ।",
   "crops_data": {
      "rice": {
         "advisory": [
            "ସୁନିଶ୍ଚିତ ଜଳସେଚିତ ଅଞ୍ଚଳରେ ଭଲ ଜଳ ନିଷ୍କାସନ ସୁବିଧା ସହିତ ଜଳସେଚନ ଜଳ ଉତ୍ସ ନିକଟରେ ଓଦା ଶଯ୍ଯ଼ା ନର୍ସରୀ ପାଇଁ ଜମି ଚଯ଼ନ କରନ୍ତୁ | ଗ୍ରାମ ସ୍ତରରେ ଗୋଷ୍ଠୀ ନର୍ସରୀ ଆଭିମୁଖ୍ଯ଼ ଅନୁସରଣ କରିବାକୁ ପରାମର୍ଶ ଦିଆଯାଇଛି। ନର୍ସରୀ ଅଞ୍ଚଳକୁ 1.5-metre-long, 10 ସେ. ମି. ଉଚ୍ଚତା ଏବଂ ସୁବିଧାଜନକ ଲମ୍ବ ବିଶିଷ୍ଟ ଛୋଟ ଛୋଟ ପ୍ଲଟରେ ବିଭକ୍ତ କରନ୍ତୁ। ଜଳସେଚନ/ଜଳ ନିଷ୍କାସନ ପାଇଁ ଶଯ୍ଯ଼ା ସହିତ 30 ସେ. ମି. ଓସାରର ଜଳସେଚନ ଚ୍ଯ଼ାନେଲ ନିର୍ମାଣ କରାଯିବା ଉଚିତ। ପ୍ରତ୍ଯ଼େକ ଧାଡ଼ି କିମ୍ବା ସିଧାସଳଖ ପ୍ରସାରଣ ମଧ୍ଯ଼ରେ 5 ସେ. ମି. ବ୍ଯ଼ବଧାନ ସହିତ ଧାଡ଼ି ବୁଣିବା ଦ୍ୱାରା ଅଙ୍କୁରିତ ବୀଜଗୁଡିକ ବୀଜ ଶଯ୍ଯ଼ାର @40-50 ଗ୍ରାମ୍/ମି2 ଅଞ୍ଚଳରେ ରୋପଣ କରାଯିବା ଉଚିତ ଏବଂ ମଞ୍ଜି ଉପରେ ଶୁଖିଲା କମ୍ପୋଷ୍ଟ ପକାଇବା ଉଚିତ।"
         ]
      },
      "finger millet": {
         "advisory": [
            "ଏବେ ନର୍ସରୀରେ ରାଗି ବୁଣିବା ସମଯ଼। ଅର୍ଜୁନ, ଦିବ୍ଯ଼ସିଂହ, ଏ. କେ. ପି.-2, ଏ. କେ. ପି.-3, ଏ. କେ. ପି.-7, ଗୋଦାବରୀ, ନୀଳଚଲ, ଭୈରବୀ, ଶୁଭ୍ରା ଏବଂ ଚିଲିକା ଭଳି ଅଧିକ ଉତ୍ପାଦନକ୍ଷମ କିସମ ଚାଷ କରନ୍ତୁ। ରୋପଣ ପାଇଁ ଏକର ପିଛା 2 ରୁ 2.5 କି. ଗ୍ରା. ମଞ୍ଜି ବ୍ଯ଼ବହାର କରନ୍ତୁ। ବୁଣିବା ପୂର୍ବରୁ ପ୍ରତି କିଲୋଗ୍ରାମ ମଞ୍ଜି ପିଛା 3 ଗ୍ରାମ୍ ଥିରମ୍ କିମ୍ବା 1 ଗ୍ରାମ୍ ଟ୍ରାଇସିକ୍ଲୋଜୋଲ୍ ଦେଇ ମଞ୍ଜି ଉପଚାର କରନ୍ତୁ। ପ୍ରତି ବର୍ଗ ମିଟର ନର୍ସରୀ ଶଯ୍ଯ଼ାରେ 10 ଗ୍ରାମ୍ ନାଇଟ୍ରୋଜେନ୍ ଏବଂ ଫୋଫରସ୍ ଲଗାନ୍ତୁ ଏବଂ ଏହାକୁ ଭଲ ଭାବେ ମିଶାନ୍ତୁ। ଶଯ୍ଯ଼ା ଉପରେ ସମାନ ଭାବରେ ମଞ୍ଜି ବୁଣନ୍ତୁ ଏବଂ ପାଉଡର ମାଟି ସହିତ ମଞ୍ଜିଗୁଡ଼ିକୁ ପତଳା ଭାବରେ ଆଚ୍ଛାଦନ କରନ୍ତୁ |"
         ]
      },
      "maize": {
         "advisory": [
            "ମକା ପାଇଁ ବିହନ ହାର ଏକର ପିଛା 6-7 କିଲୋଗ୍ରାମ। ଫଲ୍ ଆର୍ମି କୃମିର ସଂକ୍ରମଣରୁ ରକ୍ଷା ପାଇବା ପାଇଁ, 1-କିଲୋଗ୍ରାମ ମଞ୍ଜି 4-ମିଲି Cyantraniliprole19.8% + ଥାଯ଼ାମେଥୋକ୍ସାମ୍ 19.8% ଏଫ୍. ଏସ୍. ସହିତ ଚିକିତ୍ସା କରନ୍ତୁ। ଧାଡ଼ି ଠାରୁ ଧାଡ଼ି ମଧ୍ଯ଼ରେ ଦୂରତା 60 ସେ. ମି. ରଖନ୍ତୁ ଏବଂ ଗଛ ଲଗାଇବା ପାଇଁ 20 ସେ. ମି. ରଖନ୍ତୁ। ସର୍ବୋତ୍ତମ ଉଦ୍ଭିଦ ସଂଖ୍ଯ଼ାକୁ ବଜାଯ଼ ରଖିବା ପାଇଁ, ବୁଣିବା ପାଇଁ କିମ୍ବା ହଳ ପଛରେ ମଞ୍ଜି ବୁଣିବା ପାଇଁ ବୀଜ ଡ୍ରିଲ୍ ବ୍ଯ଼ବହାର କରନ୍ତୁ | 55 କିଲୋଗ୍ରାମ ଡିଏପି ଏବଂ 22 କିଲୋଗ୍ରାମ ପୋଟାସକୁ ମୂଳ ସାର ଭାବେ ପ୍ରଯ଼ୋଗ କରନ୍ତୁ। ମକା ଉପରେ ରାସାଯ଼ନିକ ନିଯ଼ନ୍ତ୍ରଣ ପାଇଁ 1ରୁ 2 ଡିଏଏସ୍ ମଧ୍ଯ଼ରେ 200 ଲିଟର ପାଣିରେ ମିଶାଇ ଏକର ପିଛା 800 ଗ୍ରାମ ଦରରେ ଆଟ୍ରାଜିନ୍ 50 ପ୍ରତିଶତ ଡବ୍ଲୁ. ପି. ହର୍ବିସାଇଡ୍ ସିଞ୍ଚନ କରନ୍ତୁ।"
         ]
      },
      "pigeon pea": {
         "advisory": [
            "ଅରହରର କେତେକ ଉନ୍ନତ ପ୍ରଜାତି ହେଉଛି ପିଆରଜି-235, ପିଆରଜି 176, ଭିଏଲ ଅରହର-1, ଟି-ଅରହର ଇତ୍ଯ଼ାଦି। ଲାଇନ ବୁଣିବା ପାଇଁ ଶୀଘ୍ର ପରିପକ୍ୱ ହେଉଥିବା କିସମ ପାଇଁ ସୁପାରିସ କରାଯାଇଥିବା ବୀଜ ହାର 8 କିଲୋଗ୍ରାମ ଥିବାବେଳେ ବିଳମ୍ବରେ ପରିପକ୍ୱ ହେଉଥିବା ପ୍ରଜାତି ପାଇଁ ଏହା 6 କିଲୋଗ୍ରାମ ଅଟେ। ଭଲ ଚାଷ ପାଇଁ ଚାଷୀମାନଙ୍କ ଦ୍ୱାରା 3ରୁ 4 ଥର ଜମି ଚାଷ କରାଯିବା ଉଚିତ ଏବଂ ପରେ ଜମି ସମତଳ କରାଯିବା ଉଚିତ। ଅନ୍ତିମ ଜମି ପ୍ରସ୍ତୁତି ସମଯ଼ରେ 2 ଟନ୍ ଭଲ ଭାବେ କ୍ଷତବିକ୍ଷତ ଏଫ୍. ଆଇ. ଏମ୍. ପ୍ରଯ଼ୋଗ କରନ୍ତୁ। କାର୍ବେଣ୍ଡାଜିମ୍ 50 ପ୍ରତିଶତ ଡବ୍ଲ୍ଯ଼ୁ. ପି. @2 ଗ୍ରାମ/କେଜି ମଞ୍ଜି କିମ୍ବା କାରବକ୍ସିନ୍ <ଆଇ. ଡି. 1> + ଥିରମ୍ <ଆଇ. ଡି. 1> ଡି. ଏସ୍. ଡବ୍ଲ୍ଯ଼ୁ. ପି. ସହିତ ମଞ୍ଜି ଚିକିତ୍ସା କରାଯାଇପାରିବ। ବୁଣିବା 1 ଘଣ୍ଟା ପୂର୍ବରୁ 20 ଗ୍ରାମ୍/କି. ଗ୍ରା. ମୂଲ୍ଯ଼ର ସୁପାରିଶ କରାଯାଇଥିବା ପ୍ରଜାତିର ରାଇଜୋବିଯ଼ମ୍ ବ୍ଯ଼ାକ୍ଟେରିଆ କଲ୍ଚର୍ର ମଞ୍ଜି ବ୍ଯ଼ବହାର କରନ୍ତୁ। ରାସାଯ଼ନିକ ବୀଜ ଚିକିତ୍ସା ଏବଂ ରାଇଜୋବିଯ଼ମ୍ ଚିକିତ୍ସା ମଧ୍ଯ଼ରେ ବ୍ଯ଼ବଧାନ ଅତିକମରେ 7 ଦିନ ହେବା ଉଚିତ।"
         ]
      },
      "brinjal": {
         "advisory": [
            "20 କିଲୋଗ୍ରାମ ଯ଼ୁରିଆ, 52 କିଲୋଗ୍ରାମ ଡିଏପି ଏବଂ 20 କିଲୋଗ୍ରାମ ଏମଓପିକୁ ମୂଳ ସାର ଭାବେ ବ୍ଯ଼ବହାର କରନ୍ତୁ। ଧାଡ଼ି ଠାରୁ ଧାଡ଼ି ମଧ୍ଯ଼ରେ 75 ସେ. ମି. ବ୍ଯ଼ବଧାନ ରଖନ୍ତୁ ଏବଂ ଗଛ ଠାରୁ ଗଛ ମଧ୍ଯ଼ରେ 60 ସେ. ମି. ବ୍ଯ଼ବଧାନ ରଖନ୍ତୁ।"
         ]
      }
   },
   "date": "02-07-2024"
}