{
   "weather_details": {
      "03/04/2024": {
         "rainfall": 0,
         "t_max": 40,
         "t_min": 26,
         "rh_max": 57,
         "rh_min": 13,
         "wind_speed": 12,
         "wind_direction": 205,
         "cloud_cover": 0
      },
      "04/04/2024": {
         "rainfall": 0,
         "t_max": 40,
         "t_min": 26,
         "rh_max": 80,
         "rh_min": 15,
         "wind_speed": 11,
         "wind_direction": 180,
         "cloud_cover": 1
      },
      "05/04/2024": {
         "rainfall": 0,
         "t_max": 41,
         "t_min": 27,
         "rh_max": 70,
         "rh_min": 23,
         "wind_speed": 15,
         "wind_direction": 207,
         "cloud_cover": 1
      },
      "06/04/2024": {
         "rainfall": 0,
         "t_max": 41,
         "t_min": 27,
         "rh_max": 67,
         "rh_min": 15,
         "wind_speed": 13,
         "wind_direction": 210,
         "cloud_cover": 0
      },
      "07/04/2024": {
         "rainfall": 0,
         "t_max": 42,
         "t_min": 27,
         "rh_max": 55,
         "rh_min": 10,
         "wind_speed": 12,
         "wind_direction": 242,
         "cloud_cover": 2
      }
   },
   "names_of_crops": [
      "ଧାନ।",
      "ଆଖୁ",
      "ମକା",
      "ଟମାଟୋ",
      "ବାଇଗଣ",
      "ନଡ଼ିଆ",
      "ପନିପରିବା",
      "ଫିଙ୍ଗରଲିଙ୍ଗ୍",
      "କଳା ଚଣା",
      "ସବୁଜ ଚଣା",
      "ଓକ୍ରା",
      "ରସୁଣ",
      "ଆମ୍ବ"
   ],
   "general_advisory": "ଧାନ ଫସଲରେ, ପେନିକଲ୍ ଦୀକ୍ଷା, ପେନିକଲ୍ ଉତ୍ଥାନ, ଫୁଲ ଏବଂ କ୍ଷୀର ଦୋଇବା ପର୍ଯ୍ଯ଼ାଯ଼ ହେଉଛି ଗୁରୁତ୍ୱପୂର୍ଣ୍ଣ ପର୍ଯ୍ଯ଼ାଯ଼ | ଆଖୁରେ ଶୁଖିଲା ପତ୍ରରେ ଧାଡ଼ିଗୁଡ଼ିକୁ ଢାଙ୍କି ଦିଅନ୍ତୁ। ଉତ୍ତାପ ପ୍ରଭାବକୁ ହ୍ରାସ କରିବା ପାଇଁ ସ୍ପ୍ରିଂକଲର ଜଳସେଚନ ପ୍ରଯ଼ୋଗ କରନ୍ତୁ। ମକା ଫସଲକୁ ଠିକ୍ ଭାବେ ଜଳସେଚନ କରନ୍ତୁ। ଜଳ ଅପଚଯ଼କୁ ରୋକିବା ପାଇଁ ଜଳସେଚନ ଚ୍ଯ଼ାନେଲରେ ପଲିଥିନ୍ ବିସ୍ତାର କରନ୍ତୁ। ଟମାଟୋ ଏବଂ ବାଇଗଣରେ ସ୍ଟ୍ରେପ୍ଟୋସାଇକ୍ଲିନ୍ ଲଗାନ୍ତୁ। ଜଳକ୍ଷଯ଼ ହ୍ରାସ କରିବା ପାଇଁ ନଡ଼ିଆ ଗଛ ଚାରିପାଖରେ ନଡ଼ିଆ ପତ୍ରକୁ ମଲ୍ଚ କରନ୍ତୁ। ନୂତନ ରୋପଣ କରାଯାଇଥିବା ପନିପରିବା ଚାରା ଗୁଡ଼ିକୁ ଢାଙ୍କି ଦିଅନ୍ତୁ। ଯଦି ଜଳର ତାପମାତ୍ରା ବୃଦ୍ଧି ପାଏ, ତେବେ ଅଗଭୀର ପୋଖରୀରେ ଫିଙ୍ଗରଲିଂ ଅମଳ କରନ୍ତୁ। ଧାନରେ ହଳଦିଆ କାଣ୍ଡ ଛେଦକ ପରିଚାଳନା, ବିସ୍ଫୋରଣ ରୋଗ ପରିଚାଳନା, କଳା ଗହମ ଏବଂ ସବୁଜ ଗହମରେ ତମାଖୁ କ୍ଯ଼ାଟରପିଲର ପରିଚାଳନା, ଆଖୁରେ ପ୍ରାରମ୍ଭିକ ସୁଟ୍ ବୋରର୍, ବାଇଗଣ ସୁଟ୍ ଏବଂ ଫଳ ଛେଦକ, ଓକ୍ରାରେ ଧଳା ମାଛି ସଂକ୍ରମଣ ଏବଂ ଆମ୍ବ ହପର୍ ନିଯ଼ନ୍ତ୍ରଣ ପାଇଁ ପରାମର୍ଶ ଅନୁସରଣ କରନ୍ତୁ |",
   "crops_data": {
      "paddy": {
         "advisory": [
            "ପେନିକଲ୍ ଆରମ୍ଭ, ପେନିକଲ୍ ଉଦ୍ଭବ, ଫୁଲ ଏବଂ କ୍ଷୀର ଦୋଇବା ପର୍ଯ୍ଯ଼ାଯ଼ ହେଉଛି ଗୁରୁତ୍ୱପୂର୍ଣ୍ଣ ପର୍ଯ୍ଯ଼ାଯ଼ | ଏହି ପର୍ଯ୍ଯ଼ାଯ଼ରେ ଜଳ ଅଭାବରୁ ଦୂରେଇ ରୁହନ୍ତୁ।"
         ]
      },
      "sugarcane": {
         "advisory": [
            "ଆଖୁରେ ଶୁଖିଲା ପତ୍ରରେ ଧାଡ଼ିଗୁଡ଼ିକୁ ଢାଙ୍କି ଦିଅନ୍ତୁ।",
            "ଗ୍ରୀଷ୍ମ ଋତୁରେ ପାଣିର ଅଭାବରୁ ଫସଲକୁ ରକ୍ଷା କରିବା ପାଇଁ 4 ପ୍ରତିଶତ ପୋଟାସିଯ଼ମ ସହିତ ଉପର ପୋଷାକ ପିନ୍ଧନ୍ତୁ |",
            "ଗରମ ମାସରେ ଫସଲକୁ ବାରମ୍ବାର ଜଳସେଚନ କରନ୍ତୁ।",
            "ଆକ୍ରମଣ କରାଯାଇଥିବା ଶୁଟ୍ କୁ ଠିକ୍ ସମଯ଼ରେ ଭୂମି ସ୍ତରରେ କିମ୍ବା ତଳେ କାଟିବା ଅଧିକାଂଶ କ୍ଯ଼ାଟର୍ପିଲାରର ବିନାଶ ନିଶ୍ଚିତ କରେ |"
         ]
      },
      "maize": {
         "advisory": [
            "ଅଧିକ ତାପମାତ୍ରା ମକା ଫସଲର ଜଳର ଆବଶ୍ଯ଼କତାକୁ ବଢ଼ାଇଥାଏ। ସଠିକ ଭାବେ ଜଳସେଚନ କରନ୍ତୁ ଏବଂ ପାଣି ଜମା ହେବାରୁ ଦୂରେଇ ରୁହନ୍ତୁ।"
         ]
      },
      "tomato": {
         "advisory": [
            "ଶୁଷ୍କତାକୁ ରୋକିବା ପାଇଁ ମୂଳ ଅଞ୍ଚଳରେ 10-ଲିଟର ପାଣିରେ 1 ଗ୍ରାମ୍ ସ୍ଟ୍ରେପ୍ଟୋସାଇକ୍ଲିନ୍ ଲଗାନ୍ତୁ |"
         ]
      },
      "brinjal": {
         "advisory": [
            "ବାଇଗଣ ଶୁଟ୍ ଏବଂ ଫଳ ଛେଦକ ପରିଚାଳନା ପାଇଁ ଫେରୋମୋନ୍ ଟ୍ରାପ୍ ସ୍ଥାପନ କରନ୍ତୁ |",
            "ସଂକ୍ରମଣର ପ୍ରାଥମିକ ପର୍ଯ୍ଯ଼ାଯ଼ରେ ନିମ-ଆଧାରିତ କୀଟନାଶକ ସ୍ପ୍ରେ କରନ୍ତୁ।",
            "ଆବଶ୍ଯ଼କ ହେଲେ ରାସାଯ଼ନିକ ନିଯ଼ନ୍ତ୍ରଣ ପାଇଁ ଯାଆନ୍ତୁ।"
         ]
      },
      "coconut": {
         "advisory": [
            "ଜଳକ୍ଷଯ଼ ହ୍ରାସ କରିବା ପାଇଁ ନଡ଼ିଆ ଗଛ ଚାରିପାଖରେ ନଡ଼ିଆ ପତ୍ରକୁ ମଲ୍ଚ କରନ୍ତୁ।"
         ]
      },
      "vegetables": {
         "advisory": [
            "ଦିନରେ ନୂତନ ଭାବରେ ରୋପଣ କରାଯାଇଥିବା ପନିପରିବା ଚାରା ଉପରେ କାଗଜ କ୍ଯ଼ାପ୍ ସହିତ ଆଚ୍ଛାଦନ କରନ୍ତୁ |"
         ]
      },
      "fingerlings": {
         "advisory": [
            "ଯଦି ଜଳର ତାପମାତ୍ରା ବୃଦ୍ଧି ପାଏ, ତେବେ ଅଗଭୀର ପୋଖରୀରେ ଫିଙ୍ଗରଲିଂ ଅମଳ କରନ୍ତୁ।"
         ]
      },
      "black gram": {
         "advisory": [
            "କ୍ଷେତର ଚତୁଃପାର୍ଶ୍ୱରେ ଧୂଳି ଉଡ଼ାଇ ଶୁଆ ଗୁଡ଼ିକର ସ୍ଥାନାନ୍ତରଣକୁ ଯାଞ୍ଚ କରନ୍ତୁ।",
            "ରାସାଯ଼ନିକ ନିଯ଼ନ୍ତ୍ରଣ ପାଇଁ, ସୁପାରିସ କରାଯାଇଥିବା କୀଟନାଶକ ସିଞ୍ଚନ କରନ୍ତୁ।"
         ]
      },
      "green gram": {
         "advisory": [
            "କ୍ଷେତର ଚତୁଃପାର୍ଶ୍ୱରେ ଧୂଳି ଉଡ଼ାଇ ଶୁଆ ଗୁଡ଼ିକର ସ୍ଥାନାନ୍ତରଣକୁ ଯାଞ୍ଚ କରନ୍ତୁ।",
            "ରାସାଯ଼ନିକ ନିଯ଼ନ୍ତ୍ରଣ ପାଇଁ, ସୁପାରିସ କରାଯାଇଥିବା କୀଟନାଶକ ସିଞ୍ଚନ କରନ୍ତୁ।"
         ]
      },
      "okra": {
         "advisory": [
            "ଶ୍ୱେତ ମାଛି ସଂକ୍ରମଣକୁ ରୋକିବା ପାଇଁ ବୁଣିବା ପୂର୍ବରୁ ଇମିଡାକ୍ଲୋପ୍ରିଡ୍ ସହିତ ମଞ୍ଜି ଚିକିତ୍ସା କରନ୍ତୁ |",
            "ଶ୍ୱେତ ମାଛି ସଂକ୍ରମଣ ଉପରେ ନଜର ରଖିବା ପାଇଁ ହଳଦିଆ ଚଟପଟା ଜାଲ ଲଗାନ୍ତୁ।"
         ]
      },
      "onion": {
         "advisory": [
            "ଅମଳ ପରେ, କନ୍ଦ ଉପରେ 2.0-2.5 ସେ. ମି. ରଖି ଉପର ଭାଗକୁ କାଟି ଦିଅନ୍ତୁ।",
            "ଅମଳ ହୋଇଥିବା କନ୍ଦକୁ ଭଲ ଭାବେ ବାଯ଼ୁ ଚଳାଚଳ କରୁଥିବା କୋଠରୀରେ ଶୁଖାଇ ଦିଅନ୍ତୁ।"
         ]
      },
      "mango": {
         "advisory": [
            "ଆମ୍ବ ହପରକୁ ନିଯ଼ନ୍ତ୍ରଣ କରିବା ପାଇଁ, ସୁପାରିସ କରାଯାଇଥିବା କୀଟନାଶକ ସିଞ୍ଚନ କରନ୍ତୁ।",
            "ଗଛ ତଳେ ଧୂଆଁ ଲଗାଇବା ଦ୍ୱାରା କୀଟପତଙ୍ଗ ସଂଖ୍ଯ଼ା ହ୍ରାସ କରିବାରେ ମଧ୍ଯ଼ ସହାଯ଼ତା ମିଳିପାରିବ।"
         ]
      }
   },
   "date": "02-04-2024"
}