{
   "weather_details": {
      "03-07-2024": {
         "rainfall": 5,
         "t_max": 31,
         "t_min": 26,
         "rh_max": 84,
         "rh_min": 67,
         "wind_speed": 15,
         "wind_direction": 252,
         "cloud_cover": 8
      },
      "04-07-2024": {
         "rainfall": 10,
         "t_max": 32,
         "t_min": 26,
         "rh_max": 84,
         "rh_min": 54,
         "wind_speed": 12,
         "wind_direction": 238,
         "cloud_cover": 8
      },
      "05-07-2024": {
         "rainfall": 10,
         "t_max": 33,
         "t_min": 27,
         "rh_max": 84,
         "rh_min": 60,
         "wind_speed": 11,
         "wind_direction": 225,
         "cloud_cover": 8
      },
      "06-07-2024": {
         "rainfall": 15,
         "t_max": 33,
         "t_min": 27,
         "rh_max": 81,
         "rh_min": 56,
         "wind_speed": 12,
         "wind_direction": 243,
         "cloud_cover": 8
      },
      "07-07-2024": {
         "rainfall": 10,
         "t_max": 30,
         "t_min": 26,
         "rh_max": 80,
         "rh_min": 48,
         "wind_speed": 12,
         "wind_direction": 243,
         "cloud_cover": 8
      }
   },
   "names_of_crops": [
      "ଖରିଫ ଚାଉଳ",
      "କପା",
      "ପନିପରିବା ଫସଲ",
      "ଗାଈ/ମଇଁଷି",
      "କୁକୁଡ଼ା ମାଂସ"
   ],
   "general_advisory": "ଆଇଏମଡିର ବର୍ଦ୍ଧିତ ପରିସୀମା ପୂର୍ବାନୁମାନ ଅନୁଯାଯ଼ୀ, ବର୍ଷା ସ୍ୱାଭାବିକଠାରୁ ଅଧିକ ଏବଂ 2024 ଜୁଲାଇ 7 ରୁ 13 ମଧ୍ଯ଼ରେ ଓଡ଼ିଶା ରାଜ୍ଯ଼ରେ ଉଭଯ଼ ସର୍ବାଧିକ ଏବଂ ସର୍ବନିମ୍ନ ତାପମାତ୍ରା ସ୍ୱାଭାବିକ ରହିବ ବୋଲି ଆଶା କରାଯାଉଛି, ତେଣୁ କୃଷକମାନଙ୍କୁ ଖରିଫ ଫସଲ ଚାଷ ଦିଗରେ ଆବଶ୍ଯ଼କ ପଦକ୍ଷେପ ନେବାକୁ ଏବଂ ସେହି ସମଯ଼ରେ ଜଳସେଚନ ଏଡ଼ାଇବାକୁ ପରାମର୍ଶ ଦିଆଯାଇଛି। ଖରିଫ ଧାନ ଏବଂ ପନିପରିବା ଫସଲ ପାଇଁ କୃଷକମାନେ ନର୍ସରୀ ଶଯ୍ଯ଼ା ପ୍ରସ୍ତୁତି ଆରମ୍ଭ କରିବା ଉଚିତ ଏବଂ ଅତୀତର ବର୍ଷା ସ୍ଥିତିର ଲାଭ ଉଠାଇ ଉଦ୍ଯ଼ାନରେ ନୂତନ ଫଳ ଫସଲ ରୋପଣ ମଧ୍ଯ଼ ଆରମ୍ଭ କରିବା ଉଚିତ।",
   "crops_data": {
      "kharif rice": {
         "advisory": [
            "ପୂର୍ବ ବର୍ଷାର ଫାଇଦା ଉଠାଇ କୃଷକମାନେ ଧାନ ବୁଣିବା ପାଇଁ କ୍ଷେତ ପ୍ରସ୍ତୁତି ଆରମ୍ଭ କରିବା ଉଚିତ। ଉତ୍ତମ ଜଳ ନିଷ୍କାସନ ସୁବିଧା ସହିତ ଜଳସେଚନ ଜଳ ଉତ୍ସ ନିକଟବର୍ତ୍ତୀ ସୁନିଶ୍ଚିତ ଜଳସେଚିତ ଅଞ୍ଚଳ ପାଇଁ ଆର୍ଦ୍ର ଶଯ୍ଯ଼ା ନର୍ସରୀ ଚଯ଼ନ କରାଯିବା ଉଚିତ। ନର୍ସରୀ ଅଞ୍ଚଳକୁ 1.5-metre-long, 10-15 ସେ. ମି. ଉଚ୍ଚତା ଏବଂ ସୁବିଧାଜନକ ଦୈର୍ଘ୍ଯ଼ର ଛୋଟ ଛୋଟ ପ୍ଲଟରେ ବିଭକ୍ତ କରନ୍ତୁ। ଜଳସେଚନ/ଜଳ ନିଷ୍କାସନ ପାଇଁ ଶଯ୍ଯ଼ା ସହିତ 30 ସେ. ମି. ଓସାରର ଜଳସେଚନ ଚ୍ଯ଼ାନେଲ ନିର୍ମାଣ କରାଯିବା ଉଚିତ।",
            "ବୁଣିବା ପୂର୍ବରୁ, କାର୍ବେଣ୍ଡାଜିମ୍ 50 ପ୍ରତିଶତ ଡବ୍ଲ୍ଯ଼ୁ. ପି. @2 ଗ୍ରାମ୍/କି. ଗ୍ରା. ମଞ୍ଜି କିମ୍ବା ଟ୍ରାଇକୋଡର୍ମା @10 ଗ୍ରାମ୍/କି. ଗ୍ରା. ମଞ୍ଜି ସହିତ ମଞ୍ଜି ଚିକିତ୍ସା କରାଯିବା ଉଚିତ।",
            "ମଞ୍ଜିଗୁଡ଼ିକୁ 24 ଘଣ୍ଟା ପାଇଁ ପାଣିରେ ଭିଜାଇ ରଖନ୍ତୁ ଏବଂ ତା 'ପରେ ପାଣି ବାହାର କରି ଦିଅନ୍ତୁ ଏବଂ ମଞ୍ଜିଗୁଡ଼ିକୁ ଏକ ବସ୍ତା ଭିତରେ ରଖନ୍ତୁ। ଥରେ ମଞ୍ଜି ଅଙ୍କୁରିତ ହୋଇଗଲେ, ଏହାକୁ ବୁଣିବା ପାଇଁ ବ୍ଯ଼ବହାର କରନ୍ତୁ।"
         ]
      },
      "cotton": {
         "advisory": [
            "ଯେଉଁ କୃଷକମାନେ ଏପର୍ଯ୍ଯ଼ନ୍ତ କପା ଚାଷ ପାଇଁ କ୍ଷେତ୍ର ପ୍ରସ୍ତୁତି ଆରମ୍ଭ କରିନାହାଁନ୍ତି, ସେମାନଙ୍କୁ ଯଥାଶୀଘ୍ର ପ୍ରସ୍ତୁତି ଆରମ୍ଭ କରିବାକୁ ପରାମର୍ଶ ଦିଆଯାଇଛି।",
            "କୃଷକମାନେ ଏକର ପିଛା @800-1500 ଗ୍ରାମ୍ ମୂଲ୍ଯ଼ର ବିହନ ବ୍ଯ଼ବହାର କରିପାରିବେ। ବୁଣିବା ପୂର୍ବରୁ, ଶୋଷକ କୀଟପତଙ୍ଗରୁ ସୁରକ୍ଷା ପାଇଁ ଇମିଡାକ୍ଲୋପ୍ରିଡ୍ 70 ଡବ୍ଲୁଜି @7 ଗ୍ରାମ୍/କେଜି ମଞ୍ଜି ବ୍ଯ଼ବହାର କରିବା ଉଚିତ। ସାଧାରଣ ଏବଂ ହାଇବ୍ରିଡ୍ କିସମ ପାଇଁ ବ୍ଯ଼ବଧାନ ଯଥାକ୍ରମେ 90 × 45-60 ସେ. ମି. ଏବଂ 90-120 × 90 ସେ. ମି. ହେବା ଉଚିତ।",
            "ସାର ପ୍ରଯ଼ୋଗଃ ହାଇବ୍ରିଡ୍ ପ୍ରଜାତି ପାଇଁ 48 କି. ଗ୍ରା. ନାଇଟ୍ରୋଜେନ୍, ପ୍ରତ୍ଯ଼େକ ଫସ୍ଫରସ୍ ଏବଂ ପୋଟାଶ୍ ପାଇଁ 24 କି. ଗ୍ରା. ଏବଂ ସାଧାରଣ ପ୍ରଜାତି ପାଇଁ 32 କି. ଗ୍ରା. ନାଇଟ୍ରୋଜେନ୍, ପ୍ରତ୍ଯ଼େକ ଫସ୍ଫରସ୍ ଏବଂ ପୋଟାଶ୍ ପାଇଁ 16 କି. ଗ୍ରା. ସୁପାରିଶ କରାଯିବା ଉଚିତ। ସମସ୍ତ ଫସଫରସ୍ ଏବଂ ପୋଟାଶ୍ ଏବଂ ନାଇଟ୍ରୋଜେନର ଏକ ଚତୁର୍ଥାଂଶ ବେସାଲ୍ ଭାବରେ ପ୍ରଯ଼ୋଗ କରାଯିବା ଉଚିତ ଏବଂ ଅବଶିଷ୍ଟ ପରିମାଣର ନାଇଟ୍ରୋଜେନ୍ 2 ବିଭାଜନରେ ପ୍ରଯ଼ୋଗ କରାଯିବା ଉଚିତ |",
            "ଯେଉଁ କୃଷକମାନେ ପୂର୍ବରୁ ବୁଣି ସାରିଛନ୍ତି, ସେମାନଙ୍କୁ ଅଙ୍କୁରୋଦଗମ ପରେ 10-12 ଦିନରେ କପା କ୍ଷେତରେ ଦୁର୍ବଳ ଗଛଗୁଡ଼ିକୁ ପତଳା କରିବାକୁ ପରାମର୍ଶ ଦିଆଯାଏ ଏବଂ ପଲିଥିନ୍ ବ୍ଯ଼ାଗରେ ଉଠାଯାଇଥିବା ଚାରା ରୋପଣ ସହିତ ଶୂନ୍ଯ଼ସ୍ଥାନ ପୂରଣ କରାଯାଏ | ବୁଣିବା ପରେ 60 ଦିନ ପର୍ଯ୍ଯ଼ନ୍ତ କ୍ଷେତକୁ ଆଗାଛା ମୁକ୍ତ ରଖନ୍ତୁ।"
         ]
      },
      "vegetable crops": {
         "advisory": [
            "ଅତୀତର ପାଣିପାଗ (ସମଯ଼ ସମଯ଼ରେ ମେଘୁଆ ଏବଂ ଉଜ୍ୱଳ) ସ୍ଥିତି ପନିପରିବା ଫସଲରେ କୀଟ ଆକ୍ରମଣ ପାଇଁ ଅନୁକୂଳ, ତେଣୁ ଏହାର ନିଯ଼ମିତ ତଦାରଖ ପାଇଁ ପରାମର୍ଶ ଦିଆଯିବା ଉଚିତ। ଯଦି ସେହି କୀଟପତଙ୍ଗମାନଙ୍କର ଆକ୍ରମଣ ଲକ୍ଷ୍ଯ଼ କରାଯାଏ, ତେବେ ପ୍ରତି ଲିଟର ପାଣିରେ 25 ପ୍ରତିଶତ ଡବ୍ଲୁ. ଜି. @<ଆଇ. ଡି. 1> କିମ୍ବା ଇମିଡାକ୍ଲୋପ୍ରିଡ୍ <ଆଇ. ଡି. 3> ଏସ୍. ଏଲ୍. @<ଆଇ. ଡି. 2> ସିଞ୍ଚନ କରିବାକୁ ପରାମର୍ଶ ଦିଆଯିବା ଉଚିତ।",
            "ଆଗାମୀ ଦିନରେ ବର୍ଷା ହେବାର ସମ୍ଭାବନା ଥିବାରୁ କୃଷକମାନଙ୍କୁ ସ୍ପ୍ରେ କାର୍ଯ୍ଯ଼ କରିବା ସମଯ଼ରେ ଉପଯୁକ୍ତ ଯତ୍ନ ନେବାକୁ ଏବଂ ଉପଯୁକ୍ତ ସୁରକ୍ଷା ସହିତ ନର୍ସରୀ ଶଯ୍ଯ଼ା ପ୍ରସ୍ତୁତି ଏବଂ ଖରିଫ ପନିପରିବା ଫସଲ ବୁଣିବା ଆରମ୍ଭ କରିବାକୁ ପରାମର୍ଶ ଦିଆଯାଇଛି।"
         ]
      },
      "cow/buffalo": {
         "advisory": [
            "ସଂକ୍ରାମକ ରୋଗକୁ ରୋକିବା ପାଇଁ ବର୍ଷା ଋତୁ ଆରମ୍ଭରେ ଏଫଏମଡି, ଏଚଏସ ଏବଂ ବିକ୍ଯ଼ୁ ବିରୁଦ୍ଧରେ ପଶୁମାନଙ୍କର କୃମି ନିରାକରଣ ଏବଂ ଟୀକାକରଣ ନିଶ୍ଚିତ କରାଯିବା ଉଚିତ।",
            "ନରମ ଏବଂ କୋମଳ ଘାସ ଗୋରୁମାନଙ୍କ ପାଇଁ ଅଧିକ ସ୍ୱାଦିଷ୍ଟ, କିନ୍ତୁ ଅଧିକ ଅଳିଆ ଖାଇବା ସମଯ଼ରେ ଦୁଗ୍ଧ ଗାଈମାନଙ୍କଠାରେ ମ୍ଯ଼ାଗ୍ନେସିଯ଼ମ୍ ଅଭାବ ଦେଖାଯାଏ, ତେଣୁ କେବଳ ନରମ ଘାସ ପରିବର୍ତ୍ତେ ବିଭିନ୍ନ ପ୍ରକାରର ଘାସ ଖୁଆଇବା ଉଚିତ |"
         ]
      },
      "poultry": {
         "advisory": [
            "ବର୍ଷା ଋତୁରେ, କୁକୁଡ଼ା ଚାଷ ପାଇଁ ଉପଯୁକ୍ତ ବାଯ଼ୁ ଚଳାଚଳ ସୁନିଶ୍ଚିତ କରିବା ପାଇଁ ବ୍ଯ଼ବସ୍ଥା କରନ୍ତୁ।",
            "କୀଟପତଙ୍ଗକୁ ଏଡ଼ାଇବା ପାଇଁ ସେଡ୍ ଚାରିପାଖରେ ଥିବା ଡ୍ରେନେଜ୍ ଖାଲ ସଫା/ସଫା ହେବା ଉଚିତ୍ |",
            "ରାଣୀଖେତ୍ ରୋଗ ବିରୁଦ୍ଧରେ କୁକୁଡ଼ା ପକ୍ଷୀଙ୍କ କୃମି ଦୂରୀକରଣ ଏବଂ ଟୀକାକରଣ ନିଶ୍ଚିତ କରାଯିବା ଆବଶ୍ଯ଼କ।"
         ]
      }
   },
   "date": "02-07-2024"
}