{
   "weather_details": {
      "03/07/2024": {
         "rainfall": 5,
         "t_max": 33,
         "t_min": 29,
         "rh_max": 75,
         "rh_min": 67,
         "wind_speed": 21,
         "wind_direction": 248,
         "cloud_cover": 8
      },
      "04/07/2024": {
         "rainfall": 10,
         "t_max": 34,
         "t_min": 29,
         "rh_max": 77,
         "rh_min": 61,
         "wind_speed": 27,
         "wind_direction": 207,
         "cloud_cover": 8
      },
      "05/07/2024": {
         "rainfall": 10,
         "t_max": 35,
         "t_min": 30,
         "rh_max": 75,
         "rh_min": 63,
         "wind_speed": 23,
         "wind_direction": 202,
         "cloud_cover": 8
      },
      "06/07/2024": {
         "rainfall": 5,
         "t_max": 35,
         "t_min": 30,
         "rh_max": 79,
         "rh_min": 62,
         "wind_speed": 24,
         "wind_direction": 204,
         "cloud_cover": 8
      },
      "07/07/2024": {
         "rainfall": 5,
         "t_max": 34,
         "t_min": 29,
         "rh_max": 76,
         "rh_min": 61,
         "wind_speed": 19,
         "wind_direction": 208,
         "cloud_cover": 8
      }
   },
   "names_of_crops": [
      "ଧାନ।",
      "ମକା",
      "ଚିନାବାଦାମ",
      "କାକୁଡ଼ି",
      "ଆଖୁ",
      "ମତ୍ସ୍ଯ଼ଚାଷ"
   ],
   "general_advisory": "ଯେଉଁଠାରେ ଖରିଫ ମକା କିମ୍ବା ଡାଲି ଇତ୍ଯ଼ାଦି ରୋପଣ କରାଯାଇଛି, ସେଠାରେ ଜଳ ନିଷ୍କାସନ ବ୍ଯ଼ବସ୍ଥା କରନ୍ତୁ। ଧାନ କ୍ଷେତରେ ପାଣି ଛିଡ଼ା କରି ରଖନ୍ତୁ ନାହିଁ। ପନିପରିବା, ପକେଇଥିବା ଆମ୍ବ ଏବଂ ଅନ୍ଯ଼ାନ୍ଯ଼ ଫଳ ଅମଳ କରନ୍ତୁ। ପ୍ରାରମ୍ଭିକ କିମ୍ବା ମଧ୍ଯ଼-ଋତୁ ମରୁଡ଼ି କ୍ଷେତ୍ରରେ ଉପଯୋଗ ପାଇଁ ଅତିରିକ୍ତ ବର୍ଷା ଜଳ ସଞ୍ଚଯ଼ କରିବା ପାଇଁ ଜଳ ଅମଳ ଢାଞ୍ଚା, କ୍ଷେତ୍ର ବନ୍ଧ ମରାମତି କରନ୍ତୁ। ଧାନ ଚାଷ ପାଇଁ ସର୍ବଦା ପ୍ରମାଣିତ ମଞ୍ଜି ବ୍ଯ଼ବହାର କରନ୍ତୁ। ବୁଣିବା ପୂର୍ବରୁ ଅଙ୍କୁରୋଦଗମ ପରୀକ୍ଷା କରିବା ଉଚିତ। ମୁଖ୍ଯ଼ କ୍ଷେତର ପ୍ରାରମ୍ଭିକ କାଦୁଅ କରିବା ସମଯ଼ରେ ଧାଇଞ୍ଚା ସବୁଜ ସାର ଫସଲକୁ ସାମିଲ କରନ୍ତୁ। ସ୍ୱଚ୍ଛ ପାଗ ପର୍ଯ୍ଯ଼ନ୍ତ ସାର ଏବଂ କୀଟନାଶକ ପ୍ରଯ଼ୋଗ କରନ୍ତୁ ନାହିଁ।",
   "crops_data": {
      "paddy": {
         "advisory": [
            "10-ଦଶମିକ ନର୍ସରୀ ଅଞ୍ଚଳରେ ଶେଷ ପୁଡଲିଂ ସମଯ଼ରେ 200 କିଲୋଗ୍ରାମ ଏଫ୍. ୱାଇ. ଏମ୍., 4 କିଲୋଗ୍ରାମ ଡି. ଏ. ପି., 2.5 କିଲୋଗ୍ରାମ ଏମ୍. ଓ. ପି. ପ୍ରଯ଼ୋଗ କରନ୍ତୁ। କ୍ଲୋରେଣ୍ଟ୍ରାନିଲିପ୍ରୋଲ 0.4% ଜି (ଫର୍ଟେରା/ଏନ୍ଫ୍ଯ଼ୁଜ୍) @400-ଗ୍ରାମ୍ କିମ୍ବା କାର୍ଟାପ୍ ହାଇଡ୍ରୋକ୍ଲୋରାଇଡ୍ 4% ଜିଆର (କାଲ୍ଡାନ୍ 4ଜି/ବୋରେଗାନ୍ ଜି) @800-ଗ୍ରାମ୍ କିମ୍ବା ଫିପ୍ରୋନିଲ୍ 0.3% ଜିଆର (ସର୍ଜେଣ୍ଟ୍/ରିଆଜେଣ୍ଟ୍) @1-କିଲୋଗ୍ରାମ 10 ଦଶମାଂଶ ନର୍ସରୀ ଅଞ୍ଚଳରେ ପ୍ରତିରୋପଣର 7 ଦିନ ପୂର୍ବରୁ ପିତ୍ତ ମଧ୍ଯ଼ଭାଗ, ଷ୍ଟେମ ବୋରର୍, କେସ୍ୱାର୍ମ୍, ଲିଫ୍ ଫୋଲ୍ଡର୍ ଏବଂ ରୁଟ୍ ନାଟ୍ ନେମାଟୋଡ୍ ପ୍ରତିରୋପଣର 3 ସପ୍ତାହ ପର୍ଯ୍ଯ଼ନ୍ତ ପରିଚାଳନା କରନ୍ତୁ |"
         ]
      },
      "maize": {
         "advisory": [
            "ମକା ପାଇଁ ବିହନ ହାର ଏକର ପିଛା 6-7 କିଲୋଗ୍ରାମ। ଫଲ୍ ଆର୍ମି ୱର୍ମର ସଂକ୍ରମଣକୁ ଏଡ଼ାଇବା ପାଇଁ, 1-କିଲୋଗ୍ରାମ ମଞ୍ଜି 4-ମିଲି Cyantraniliprole19.8% + ଥାଯ଼ାମେଥୋକ୍ସାମ୍ 19.8% ଏଫ୍. ଏସ୍. ସହିତ ଚିକିତ୍ସା କରନ୍ତୁ। ଧାଡ଼ି ଠାରୁ ଧାଡ଼ି ମଧ୍ଯ଼ରେ ଦୂରତା 60 ସେ. ମି. ରଖନ୍ତୁ ଏବଂ ଗଛ ଲଗାଇବା ପାଇଁ 20 ସେ. ମି. ରଖନ୍ତୁ। ସର୍ବୋତ୍ତମ ଉଦ୍ଭିଦ ସଂଖ୍ଯ଼ାକୁ ବଜାଯ଼ ରଖିବା ପାଇଁ, ବୁଣିବା ପାଇଁ କିମ୍ବା ହଳ ପଛରେ ମଞ୍ଜି ବୁଣିବା ପାଇଁ ବୀଜ ଡ୍ରିଲ୍ ବ୍ଯ଼ବହାର କରନ୍ତୁ | 55 କିଲୋଗ୍ରାମ ଡିଏପି ଏବଂ 22 କିଲୋଗ୍ରାମ ପୋଟାସକୁ ମୂଳ ସାର ଭାବେ ପ୍ରଯ଼ୋଗ କରନ୍ତୁ। ମକା ଉପରେ ରାସାଯ଼ନିକ ନିଯ଼ନ୍ତ୍ରଣ ପାଇଁ, 1-2 ଡିଏଏସ ମଧ୍ଯ଼ରେ 200 ଲିଟର ପାଣିରେ ମିଶାଇ ଏକର ପିଛା 800 ଗ୍ରାମ ଦରରେ 50 ପ୍ରତିଶତ ଡବ୍ଲୁ. ପି. ହର୍ବିସାଇଡ୍ ଆଟ୍ରାଜିନ୍ ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "groundnut": {
         "advisory": [
            "ବୁଣିବା ପାଇଁ ପ୍ରାକ୍-ଉଦ୍ଭବ ହର୍ବିସାଇଡ୍ ଅକ୍ସିଫ୍ଲୁର୍ଫେନ 23.5% ଇସି (ଅକ୍ସିଗୋଲ୍ଡ/ଗାଲିଗାନ) @80 ମିଲି/ଏକର କିମ୍ବା ପେଣ୍ଡିମେଥାଲିନ୍ 30 ପ୍ରତିଶତ ଇସି (ଷ୍ଟମ୍ପ/ପେଣ୍ଡିହେର୍ବ) @1-ଲିଟର/ଏକର କିମ୍ବା 1-2 ଡି ଏଏସ ପ୍ରଯ଼ୋଗ କରନ୍ତୁ। ମାଟି ଆର୍ଦ୍ର ଥିବା ସମଯ଼ରେ ତୃଣନାଶକ ପ୍ରଯ଼ୋଗ କରନ୍ତୁ। ବୁଣିବା 1 ଘଣ୍ଟା ପୂର୍ବରୁ 20 ଗ୍ରାମ୍/କି. ଗ୍ରା. ମୂଲ୍ଯ଼ର ସୁପାରିଶ କରାଯାଇଥିବା ପ୍ରଜାତିର ରାଇଜୋବିଯ଼ମ୍ ବ୍ଯ଼ାକ୍ଟେରିଆ କଲ୍ଚର୍ର ମଞ୍ଜି ବ୍ଯ଼ବହାର କରନ୍ତୁ।"
         ]
      },
      "cucurbits": {
         "advisory": [
            "କଦଳୀରେ ଡାଉନି ମାଇଲ୍ଡ୍ଯ଼ୁ ରୋଗ ପରିଚାଳନା ପାଇଁ କପର୍ ହାଇଡ୍ରୋକ୍ସାଇଡ୍ 77 ପ୍ରତିଶତ ଡବ୍ଲ୍ଯ଼ୁ. ପି. (ହାଇ-ଡାଇସ୍/କୋସାଇଡ୍) @3-ଗ୍ରାମ୍/ଲିଟର କିମ୍ବା ଫୋସେଟିଲ୍-ଏ. ଏଲ୍. 80 ପ୍ରତିଶତ ଡବ୍ଲ୍ଯ଼ୁ. ପି. (ଏଲିଟ୍) @3-ଗ୍ରାମ୍/ଲିଟର କିମ୍ବା କାର୍ବେନଡାଜିମ୍ 12 ପ୍ରତିଶତ + ମାନକୋଜେବ୍ 63 ପ୍ରତିଶତ ଡବ୍ଲ୍ଯ଼ୁ. ପି. (ସାଫ୍/ସିକ୍ସର୍) @2-ଗ୍ରାମ୍/ଲିଟର ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "sugarcane": {
         "advisory": [
            "ଉଦ୍ଭିଦ ଆଖୁ ଫସଲରେ ଶୀର୍ଷ ଅଙ୍କୁର ଛେଦକ ସଂକ୍ରମଣ ହେବାର ସମ୍ଭାବନା ରହିଛି। ଆଖୁ ସ୍ପ୍ରେ ଫିପ୍ରୋନିଲ 5 ପ୍ରତିଶତ ଏସ୍. ସି. (ରିଆଜେଣ୍ଟ/ସର୍ଜେଣ୍ଟ/ଆଶିରୱାଡ) @600-ମିଲି/ଏକର କିମ୍ବା ପ୍ରୋଫେନୋଫସ୍ 50 ପ୍ରତିଶତ ଇ. ସି. (ପ୍ରୋଫେକ୍ସ/ପ୍ରହାର/କ୍ଯ଼ାପଚର) @400-ମିଲି/ଏକରକୁ 200-ଲିଟର ପାଣିରେ ମିଶାଇ ପରିଚାଳନା କରନ୍ତୁ।"
         ]
      },
      "fishery": {
         "advisory": [
            "ରୋହୁ, କାଟଲା ଏବଂ ମୃଗାଲ୍ ପରି କାର୍ପ, ଯାହା ଦ୍ରୁତ ଗତିରେ ବଢିଥାଏ, ଲାଭ ବୃଦ୍ଧି ପାଇଁ 4:3:3 ର ଏକ ନିର୍ଦ୍ଦିଷ୍ଟ ଅନୁପାତରେ ଷ୍ଟକ୍ କରାଯିବା ଉଚିତ୍ | ସାଧାରଣତଃ, ହେକ୍ଟର ପିଛା 5,000 ଫିଙ୍ଗରଲିଙ୍ଗର ଘନତ୍ୱ ଏକ ମାନକ ଷ୍ଟକିଂ ଭାବରେ ରଖାଯାଏ | ଚିନାବାଦାମ ତେଲ କେକ୍ ଏବଂ ଚାଉଳ ଚୋପା ଷ୍ଟକିଂ ସାମଗ୍ରୀର ମୋଟ ବାଯ଼ୋମାସର 5 ପ୍ରତିଶତ ଅନୁପାତରେ ସମାନ ଅନୁପାତରେ ଦିଆଯାଏ | ପୁଷ୍କରିଣୀର ଗୁଣବତ୍ତା ବୃଦ୍ଧି ପାଇଁ ଗୋବର, ଯ଼ୁରିଆ ଏବଂ ସୁପର ଫସଫେଟ୍ ପ୍ରଯ଼ୋଗ କରାଯିବା ଉଚିତ।"
         ]
      }
   },
   "date": "02-07-2024"
}