{
   "weather_details": {
      "05-10-2024": {
         "rainfall": 0,
         "t_max": 36,
         "t_min": 26,
         "rh_max": 44,
         "rh_min": 74,
         "wind_speed": 6,
         "wind_direction": 259,
         "cloud_cover": 2
      },
      "06-10-2024": {
         "rainfall": 0,
         "t_max": 36,
         "t_min": 25,
         "rh_max": 45,
         "rh_min": 79,
         "wind_speed": 5,
         "wind_direction": 270,
         "cloud_cover": 3
      },
      "07-10-2024": {
         "rainfall": 2,
         "t_max": 35,
         "t_min": 25,
         "rh_max": 48,
         "rh_min": 77,
         "wind_speed": 5,
         "wind_direction": 160,
         "cloud_cover": 6
      },
      "08-10-2024": {
         "rainfall": 0,
         "t_max": 35,
         "t_min": 25,
         "rh_max": 51,
         "rh_min": 92,
         "wind_speed": 6,
         "wind_direction": 156,
         "cloud_cover": 4
      },
      "09-10-2024": {
         "rainfall": 0,
         "t_max": 34,
         "t_min": 24,
         "rh_max": 49,
         "rh_min": 96,
         "wind_speed": 7,
         "wind_direction": 155,
         "cloud_cover": 4
      }
   },
   "names_of_crops": [
      "ଚାଉଳ",
      "ମାଟି ବାଦାମ",
      "ଓକ୍ରା",
      "ଆମ୍ବ",
      "ଗାଈ/ମଇଁଷି"
   ],
   "general_advisory": "ଯେହେତୁ ଆଗାମୀ ଦିନରେ ବର୍ଷା ହେବାର ସମ୍ଭାବନା ବହୁତ କମ୍, ତେଣୁ କୃଷକମାନଙ୍କୁ ଉପଯୁକ୍ତ ଯତ୍ନ ସହିତ କୃଷି କାର୍ଯ୍ଯ଼ (ଜଳସେଚନ, ସିଞ୍ଚନ, ଆନ୍ତଃସାଂସ୍କୃତିକ କାର୍ଯ୍ଯ଼ ଇତ୍ଯ଼ାଦି) କରିବାକୁ ପରାମର୍ଶ ଦିଆଯାଇଛି। ପଶୁମାନଙ୍କୁ ଉପଯୁକ୍ତ ଖାଦ୍ଯ଼ ପାଇବା ପାଇଁ ଆର୍ଦ୍ର ମାଟିରେ ସବୁଜ ପଶୁଖାଦ୍ଯ଼ ବୁଣିବା ପାଇଁ ପରାମର୍ଶ ଦିଆଯିବା ଉଚିତ। ଧାନ ଫସଲରେ କିଛି କୀଟ ଯଥା ୱାଇ. ଏସ୍. ବି., ଲିଫ୍ ଫୋଲ୍ଡର୍, କେସ୍ ୱର୍ମ୍, ଗାଲ୍ ମିଜ୍, ଲିଫ୍ ଇଟିଂ କ୍ଯ଼ାଟର୍ପିଲାର୍ ଇତ୍ଯ଼ାଦି ଏବଂ ବି. ଏଲ୍. ବି., ବ୍ଲାଷ୍ଟ ଇତ୍ଯ଼ାଦି ରୋଗ ବିରୁଦ୍ଧରେ ନିଯ଼ମିତ ତଦାରଖ କରିବାକୁ ପରାମର୍ଶ ଦିଆଯିବା ଉଚିତ। ପ୍ରଚଳିତ ପାଣିପାଗ ସ୍ଥିତି ବିଭିନ୍ନ ଫସଲରେ ବିଭିନ୍ନ ଶୋଷକ କୀଟ (ଏଫିଡ୍, ଜ୍ଯାସିଡ୍, ମିଲି ବଗ୍, ଥ୍ରୀପ୍ ଇତ୍ଯ଼ାଦି) ପାଇଁ ଅନୁକୂଳ, ତେଣୁ ଏହାର ନିଯ଼ମିତ ତଦାରଖ କରିବାକୁ ପରାମର୍ଶ ଦିଆଯିବା ଉଚିତ। ପଶୁମାନଙ୍କୁ ପାଦ ଏବଂ ମୁଖ ରୋଗ ଏବଂ ବ୍ରୁସେଲୋସିସ୍ ବିରୁଦ୍ଧରେ କୃମି ଦୂରୀକରଣ ଏବଂ ଟୀକାକରଣ ପରାମର୍ଶ ଦିଆଯିବା ଉଚିତ।",
   "crops_data": {
      "rice": {
         "advisory": [
            "ସଠିକ ବୃଦ୍ଧି ପାଇଁ କୃଷକମାନେ ଧାନ କ୍ଷେତରେ 5 ସେ. ମି. ଜଳ ସ୍ତର ବଜାଯ଼ ରଖିବା ଉଚିତ।",
            "ବ୍ଯ଼ାକ୍ଟେରିଆ ଲିଫ୍ ବ୍ଲାଇଟ୍ ରୋଗ ଦେଖାଦେଲେ, କୃଷକମାନେ ନାଇଟ୍ରୋଜେନ୍ ସାର (ଯ଼ୁରିଆ/ଡିଏପି) ର ଉପର ଡ୍ରେସିଂ ବନ୍ଦ କରିବା ଉଚିତ୍। ଯଦି ଜଳ ନିଷ୍କାସନ ସୁବିଧା ରହିଛି, ତେବେ ଅଟକି ରହିଥିବା ପାଣିକୁ ବାହାର କରିଦିଅନ୍ତୁ ଏବଂ ଏକର ପିଛା 5 କିଲୋଗ୍ରାମ ପୋଟାସିକ୍ ସାର (ଏମ୍. ଓ. ପି.) ଲଗାନ୍ତୁ। ଷ୍ଟ୍ରେପ୍ଟୋମାଇସିନ୍ ସଲଫେଟ୍ (9 ପ୍ରତିଶତ) + ଟେଟ୍ରାସାଇକ୍ଲିନ୍ ହାଇଡ୍ରୋକ୍ଲୋରାଇଡ୍ (1 ପ୍ରତିଶତ) ଏକର ପିଛା 120 ଗ୍ରାମ୍ ଏବଂ କପର ଅକ୍ସିକ୍ଲୋରାଇଡ୍ ଏକର ପିଛା 200 ଗ୍ରାମ୍ 200 ଲିଟର ପାଣିରେ ଲଗାନ୍ତୁ। ସ୍ୱଚ୍ଛ ପାଗ ସ୍ଥିତିରେ ସକାଳେ କିମ୍ବା ଅପରାହ୍ନରେ ସ୍ପ୍ରେ କରିବା ଉଚିତ।",
            "ଧାନ କ୍ଷେତରେ ପିତ୍ତ ମିଜ୍ ଆକ୍ରମଣକୁ ନିଯ଼ନ୍ତ୍ରଣ କରିବା ପାଇଁ କୃଷକମାନେ ଲାମ୍ବଡା-ସାଇହାଲୋଥ୍ରିନ୍ 05 ପ୍ରତିଶତ ଇସି @100 ମିଲି, ଥାଯ଼ାମେଥୋକ୍ସାମ୍ 25 ପ୍ରତିଶତ ଡବ୍ଲୁଜି @40 ଗ୍ରାମ୍ କିମ୍ବା ଫିପ୍ରୋନିଲ୍ 5 ପ୍ରତିଶତ ଏସ୍ସି @400 ମିଲି କିମ୍ବା ଗ୍ରାମୀଣ କୃଷି ମୌସମ ସେବା ଭାରତ ପାଣିପାଗ ବିଭାଗ ସ୍ପ୍ରେ କରିବା ଉଚିତ। ପତ୍ର ଫୋଲଡରକୁ ନିଯ଼ନ୍ତ୍ରଣ କରିବା ପାଇଁ, ସ୍ୱଚ୍ଛ ପାଗ ସମଯ଼ରେ ଏକର ପିଛା 200 ଲିଟର ପାଣିରେ କ୍ଲୋରାଣ୍ଟ୍ରାନିଲିପ୍ରୋଲ 18.5% ଏସ୍ସି @60 ମିଲି କିମ୍ବା ଟେଟ୍ରାନିଲିପ୍ରୋଲ 200 ଏସ୍ସି @100-120 ମିଲି କିମ୍ବା ଫ୍ଲୁବେଣ୍ଡିଆମାଇଡ୍ 20 ଡବ୍ଲୁଜି 50 ଗ୍ରାମ୍ ସିଞ୍ଚନ କରିବା ଉଚିତ।"
         ]
      },
      "ground nut": {
         "advisory": [
            "ଚିନାବାଦାମରେ ଟିକ୍କା ରୋଗକୁ ନିଯ଼ନ୍ତ୍ରଣ କରିବା ପାଇଁ, ସ୍ୱଚ୍ଛ ପାଣିପାଗ ସ୍ଥିତିରେ ଏକର ପିଛା 200 ଲିଟର ପାଣି ପିଛା 400 ମିଲିଲିଟରରେ କ୍ଲୋରୋଥାଲୋନିଲ୍ @400 ଗ୍ରାମ୍ କିମ୍ବା ହେକ୍ସାକୋନାଜୋଲ୍ 5 ପ୍ରତିଶତ ଇସି ସ୍ପ୍ରେ କରିବାକୁ ପରାମର୍ଶ ଦିଆଯିବା ଉଚିତ।"
         ]
      },
      "okra": {
         "advisory": [
            "ଯଦି ଓକ୍ରା ଫସଲରେ ହଳଦିଆ ଶିରା ମୋଜାଇକ ଲକ୍ଷଣ (ଯାହା ଏକ ଭାଇରାଲ ରୋଗ ଏବଂ ଧଳା ମାଛି ଏହି ରୋଗର ବାହକ) ଦେଖାଯାଏ, ତେବେ ଏହାକୁ ନିଯ଼ନ୍ତ୍ରଣ କରିବା ପାଇଁ ପ୍ରଥମେ ଗୁରୁତର ଭାବରେ ପ୍ରଭାବିତ ଗଛଗୁଡ଼ିକୁ ବାହାର କରି ମାଟି ତଳେ ପୋତି ଦିଅନ୍ତୁ। ଧଳା ମାଛିମାନଙ୍କୁ ନିଯ଼ନ୍ତ୍ରଣ କରିବା ପାଇଁ ଏକର ପିଛା 8ଟି ହଳଦିଆ କାର୍ଡ ବ୍ଯ଼ବହାର କରନ୍ତୁ ଏବଂ ପଡ଼ିଆକୁ ଆଗାଛା ମୁକ୍ତ କରାଯିବା ଉଚିତ। ଏହାର ରାସାଯ଼ନିକ ନିଯ଼ନ୍ତ୍ରଣ ପାଇଁ, ଡିଫେନଥିଉରୋନ୍ 50 ପ୍ରତିଶତ ଡବ୍ଲ୍ଯ଼ୁ. ପି. @20 ଗ୍ରାମ୍ କିମ୍ବା ଏସିଟାମିପ୍ରିଡ୍ 20 ପ୍ରତିଶତ ଏସ୍. ପି. @2.5 ଗ୍ରାମ୍ କିମ୍ବା ଇମିଡାକ୍ଲୋପ୍ରିଡ୍ <ଆଇ. ଡି. 1> ଏସ୍. ଏଲ୍. @3 ମିଲି. ପ୍ରତି 10 ଲିଟର ପାଣିରେ ସିଞ୍ଚନ କରିବା ଉଚିତ ଏବଂ ପାଗ ଶୁଖିଲା ଥିବାବେଳେ ପ୍ରଥମ ସିଞ୍ଚନ ପରେ ଏକ ସପ୍ତାହ ପରେ ଏହାକୁ ପୁନରାବୃତ୍ତି କରିବା ଉଚିତ। ଓକ୍ରା ଆଦିରେ ଫଳ ଏବଂ ଅଙ୍କୁର ଛେଦକକୁ ନିଯ଼ନ୍ତ୍ରଣ କରିବା ପାଇଁ ପ୍ରାରମ୍ଭିକ ପର୍ଯ୍ଯ଼ାଯ଼ରେ ଏକର ପିଛା ନିମ୍ବ ଆଧାରିତ କୀଟନାଶକ 1500 ପିପିଏମ @600ml ସିଞ୍ଚନ କରିବା ପାଇଁ ପରାମର୍ଶ ଦିଆଯିବା ଉଚିତ। ଗୁରୁତର କ୍ଷେତ୍ରରେ, 15 ଦିନର ବ୍ଯ଼ବଧାନରେ ଏକର ପିଛା ସ୍ପିନୋସାଦ୍ 45 ପ୍ରତିଶତ ଏସ୍. ସି. @70 ମିଲି ଏବଂ ଇମାମେକ୍ଟିନ୍ ବେନ୍ଜୋଏଟ୍ @80 ଗ୍ରାମ୍ ବିକଳ୍ପ ସ୍ପ୍ରେ କରିବା ପାଇଁ ପରାମର୍ଶ ଦିଆଯିବା ଉଚିତ। ଫୁଲ ଫୁଟିବା ସମଯ଼ରେ କୃଷକମାନେ କୌଣସି ରାସାଯ଼ନିକ କୀଟନାଶକ ସିଞ୍ଚନ କରିବା ଉଚିତ ନୁହେଁ।"
         ]
      },
      "mango": {
         "advisory": [
            "ପୁରୁଣା ଆମ୍ବ ବଗିଚାରେ, ଆଗାଛା, ରୋଗାକ୍ରାନ୍ତ ଏବଂ ସଂକ୍ରମିତ ଶାଖା ଏବଂ ପତ୍ରର ପ୍ରଶିକ୍ଷଣ, ଛାଣିବା ଏବଂ ସଫା କରିବା ପାଇଁ ପରାମର୍ଶ ଦିଆଯିବା ଉଚିତ। ଯଦି ପତ୍ର ୱେବର୍ ସଂକ୍ରମଣ ହୁଏ, ତେବେ କ୍ୱିନାଲ୍ଫସ୍ 20 ଇ. ସି. ଲିଟର ପିଛା 2.5 ମିଲି. ରେ ସ୍ପ୍ରେ କରିବାକୁ ପରାମର୍ଶ ଦିଆଯିବା ଉଚିତ। ନୂତନ ଭାବରେ ରୋପଣ କରାଯାଇଥିବା ଆମ୍ବ ବଗିଚାରେ, ଯଦି ପତ୍ର କାଟିବା ଦ୍ୱାରା କୀଟ ଆକ୍ରମଣ ହୁଏ, ତେବେ କୃଷକମାନେ ଏହି କୀଟକୁ ନିଯ଼ନ୍ତ୍ରଣ କରିବା ପାଇଁ ଲାମ୍ବଡା ସାଇହାଲୋଥ୍ରିନ୍ 5 ପ୍ରତିଶତ ଇସି ଲିଟର ପିଛା 0.5-1 ମିଲି କିମ୍ବା କ୍ଲୋରୋପାଇରିଫୋସ୍ 20 ଇସି ଲିଟର ପିଛା 2 ମିଲି କିମ୍ବା ସ୍ପିନୋସାଡ୍ 45 ପ୍ରତିଶତ ଏସସି ଲିଟର ପିଛା 0.4 ମିଲି କିମ୍ବା କ୍ୱିନାଲଫୋସ୍ 20 ଇସି ଲିଟର ପିଛା 2 ମିଲି ସ୍ପ୍ରେ କରିବା ଉଚିତ୍।"
         ]
      },
      "cow/buffalo": {
         "advisory": [
            "ଏଫଏମଡି ହେଉଛି ଏକ ଅତ୍ୟଧିକ ସଂକ୍ରାମକ ଭାଇରାଲ ରୋଗ ଯାହା ଜିଭ ଏବଂ ଓଠରେ, ପାଟିରେ, ଦାନ୍ତରେ ଏବଂ ଖୁର ମଧ୍ୟରେ ଜ୍ୱର ଏବଂ ଫୋଡ଼ା ପରି ଘା ଦ୍ୱାରା ଚିହ୍ନିତ | ବୟସ୍କ ପଶୁମାନଙ୍କ କ୍ଷେତ୍ରରେ ଏହି ରୋଗ କ୍ୱଚିତ୍ ମାରାତ୍ମକ ହୋଇଥାଏ, କିନ୍ତୁ ଛୋଟ ପଶୁମାନଙ୍କ କ୍ଷେତ୍ରରେ ମୃତ୍ୟୁ ହାର ଅଧିକ ରହିଥାଏ। ତେଣୁ କିଛି ପ୍ରତିଷେଧକ ଏବଂ ନିୟନ୍ତ୍ରଣ ପଦକ୍ଷେପ ନିମ୍ନରେ ଦିଆଯାଇଛିଃ-ଗୋରୁ ଏବଂ ମଇଁଷି ବାଛୁରୀମାନଙ୍କୁ 4-5 ମାସ ବୟସ ହେବା ପରେ ପ୍ରାଥମିକ ଟୀକାକରଣ କରାଯିବା ଉଚିତ ଏବଂ ପ୍ରତି ଛଅ ମାସରେ ସମାନ ପୁନରାବୃତ୍ତି କରିବା ଉଚିତ। କୃମି ଦୂରୀକରଣ ପାଇଁ ପରାମର୍ଶ ଦିଆଯିବା ଉଚିତ। ପ୍ରଭାବିତ ପଶୁମାନଙ୍କ ପାଟି ଏବଂ ପାଦକୁ 1 ପ୍ରତିଶତ ପୋଟାସିୟମ୍ ପର୍ମାଙ୍ଗାନେଟ୍ (କେଏମ୍ଏନ୍ଓ4) ଆଣ୍ଟିସେପ୍ଟିକ୍ ମାଉଥ୍ ୱାସ୍ ଦ୍ୱାରା ଦିନକୁ 3ରୁ 4 ଥର ଧୋଇବା ଉଚିତ। କ୍ଷତ ଉପରେ ଗ୍ଲିସରିନ୍ ଲଗାଯାଇପାରେ। ଆକ୍ରାନ୍ତ ପଶୁମାନଙ୍କୁ ସୁସ୍ଥ ପଶୁମାନଙ୍କଠାରୁ ଅଲଗା କରନ୍ତୁ। ଯୋଗ୍ୟ ପଶୁ ଚିକିତ୍ସକଙ୍କ ସହିତ ଆଣ୍ଟିବାୟୋଟିକ ଚିକିତ୍ସା ଏବଂ ପରାମର୍ଶ କରାଯିବା ଉଚିତ୍।"
         ]
      }
   },
   "date": "04-10-2024"
}