{
   "weather_details": {
      "05-10-2024": {
         "rainfall": 0,
         "t_max": 35,
         "t_min": 26,
         "rh_max": 73,
         "rh_min": 49,
         "wind_speed": 6,
         "wind_direction": 210,
         "cloud_cover": 4
      },
      "06-10-2024": {
         "rainfall": 0,
         "t_max": 35,
         "t_min": 25,
         "rh_max": 72,
         "rh_min": 47,
         "wind_speed": 5,
         "wind_direction": 216,
         "cloud_cover": 4
      },
      "07-10-2024": {
         "rainfall": 0,
         "t_max": 34,
         "t_min": 25,
         "rh_max": 82,
         "rh_min": 51,
         "wind_speed": 5,
         "wind_direction": 180,
         "cloud_cover": 4
      },
      "08-10-2024": {
         "rainfall": 5,
         "t_max": 34,
         "t_min": 24,
         "rh_max": 92,
         "rh_min": 54,
         "wind_speed": 6,
         "wind_direction": 153,
         "cloud_cover": 6
      },
      "09-10-2024": {
         "rainfall": 5,
         "t_max": 34,
         "t_min": 24,
         "rh_max": 93,
         "rh_min": 56,
         "wind_speed": 6,
         "wind_direction": 156,
         "cloud_cover": 6
      }
   },
   "names_of_crops": [
      "ସିଧାସଳଖ ବିହନ ବୁଣାଯାଇଥିବା ଧାନ",
      "କପା",
      "ଅରହର",
      "ସଂକର ମକା",
      "ବାଇଗଣ",
      "ଟମାଟୋ",
      "କୋଇଲା ଫସଲ",
      "କଦଳୀ",
      "ପେଁପେ",
      "ଗୋରୁ।",
      "ଛେଳି ଏବଂ ମେଣ୍ଢା",
      "କୁକୁଡ଼ା ମାଂସ"
   ],
   "general_advisory": "ଆଇଏମଡିରୁ ମିଳିଥିବା ପାଞ୍ଚ ଦିନିଆ ପାଣିପାଗ ପୂର୍ବାନୁମାନ ଆଧାରରେ, କୃଷକମାନେ ଆବଶ୍ଯ଼କତା ଅନୁଯାଯ଼ୀ ଆଗାମୀ ଚାରି ଦିନ ମଧ୍ଯ଼ରେ କୃଷି ସମ୍ବନ୍ଧୀଯ଼ ଅଭ୍ଯ଼ାସ, ଜଳସେଚନ, କୀଟନାଶକ ଏବଂ ସାର ପ୍ରଯ଼ୋଗ ଜାରି ରଖିପାରିବେ। କ୍ଷେତକୁ ଆଗାଛା ମୁକ୍ତ ରଖନ୍ତୁ ଏବଂ ସିପେଜ୍ କ୍ଷତିକୁ ରୋକିବା ପାଇଁ ବନ୍ଧରେ ଥିବା ଛିଦ୍ରଗୁଡ଼ିକୁ ପ୍ଲଗ୍ କରନ୍ତୁ | କୀଟପତଙ୍ଗ ଏବଂ ରୋଗର ପ୍ରକୋପ ପାଇଁ ଫସଲର ନିଯ଼ମିତ ତଦାରଖ କରାଯିବା ଉଚିତ।",
   "crops_data": {
      "direct seeded paddy": {
         "advisory": [
            "ଧାନର କ୍ଷୀର ଦୋଇବା ସମଯ଼ରେ ଗୁଣ୍ଡି ବଗ ସଂକ୍ରମଣ ସାଧାରଣତଃ ଦେଖାଯାଏ |",
            "ଯଦି ବ୍ରାଉନ୍ ପ୍ଲାଣ୍ଟୋପର୍ର ସଂଖ୍ଯ଼ା ଇ. ଟି. ଏଲ୍. ଠାରୁ ଅଧିକ ହୁଏ, ତେବେ ବିକଳ୍ପ ଭିଜା ଏବଂ ଶୁଖାଇବା କୌଶଳ ଅବଲମ୍ବନ କରନ୍ତୁ।",
            "ବିପିଏଚ ସଂକ୍ରମଣ ସମଯ଼ରେ ନାଇଟ୍ରୋଜେନ ସାର ବ୍ଯ଼ବହାରରୁ ଦୂରେଇ ରୁହନ୍ତୁ।"
         ]
      },
      "cotton": {
         "advisory": [
            "ଟପିଂ 90 ଡିଏଏସରେ କିମ୍ବା ଯେତେବେଳେ ଫସଲ 100 ସେ. ମି. ଉଚ୍ଚତା ଛୁଇଁବ ସେତେବେଳେ କରାଯିବା ଉଚିତ।",
            "ଗୋଲାପୀ ବୋଲୱର୍ମ ଏବଂ ଆମେରିକୀୟ ବୋଲୱର୍ମ ଉପରେ ନଜର ରଖିବା ପାଇଁ ଫେରୋମୋନ୍ ଟ୍ରାପ୍ ଲଗାନ୍ତୁ।"
         ]
      },
      "arhar": {
         "advisory": [
            "କୀଟପତଙ୍ଗକୁ ନିଯ଼ନ୍ତ୍ରଣ କରିବା ପାଇଁ ପ୍ରୋଫେନୋଫସ୍ କିମ୍ବା କ୍ଲୋରପାଇରିଫସ୍ ସ୍ପ୍ରେ କରନ୍ତୁ।",
            "ୱିଲ୍ଟକୁ ନିଯ଼ନ୍ତ୍ରଣ କରିବା ପାଇଁ ରୁଟ ଜୋନରେ ମେଟିରାମ 75 ପ୍ରତିଶତ ଡବ୍ଲ୍ଯ଼ୁ. ଜି. ଲଗାନ୍ତୁ।"
         ]
      },
      "hybrid maize": {
         "advisory": [
            "ଷ୍ଟେମ ବୋରର, ଏଫ. ଏ. ଡବ୍ଲ୍ଯ଼ୁ, ଏବଂ ବ୍ଯ଼ାଣ୍ଡେଡ ପତ୍ର ଏବଂ ସିଥ୍ ବ୍ଲାଇଟ୍ ପାଇଁ ନିଯ଼ମିତ ଭାବରେ କ୍ଷେତ୍ର ଉପରେ ନଜର ରଖନ୍ତୁ |",
            "ଷ୍ଟେମ ବୋରରର ପ୍ରଭାବଶାଳୀ ନିଯ଼ନ୍ତ୍ରଣ ପାଇଁ, ଫିପ୍ରୋନିଲ 5 ପ୍ରତିଶତ ଏସ୍. ସି. କିମ୍ବା ପ୍ରୋଫେନୋଫସ୍ 50 ପ୍ରତିଶତ ଇ. ସି. ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "brinjal": {
         "advisory": [
            "ବ୍ୟାକ୍ଟେରିଆ ୱିଲ୍ଟକୁ ପରିଚାଳନା କରିବା ପାଇଁ ତମ୍ବା ଅକ୍ସିକ୍ଲୋରାଇଡ୍ 50 ପ୍ରତିଶତ ଡବ୍ଲ୍ୟୁ. ପି. ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "tomato": {
         "advisory": [
            "ବୁଣିବା ପୂର୍ବରୁ ଏକ ସତର୍କତାମୂଳକ ପଦକ୍ଷେପ ଭାବରେ ଟ୍ରାଇକୋଡର୍ମା ଭାଇରିଡ୍ 1.5% ଡବ୍ଲ୍ଯ଼ୁ. ପି. ସହିତ ନର୍ସରୀ ଶଯ୍ଯ଼ାକୁ ଚିକିତ୍ସା କରନ୍ତୁ |"
         ]
      },
      "cole crops": {
         "advisory": [
            "ବୁଣିବା ପୂର୍ବରୁ ଭଲ ଭାବେ ସଙ୍କୁଚିତ ଏଫ୍. ୱାଇ. ଏମ୍. ଏବଂ କ୍ଲୋରପାଇରିଫୋସ୍ ଧୂଳି ସହିତ ନର୍ସରୀ ଶଯ୍ୟା ପ୍ରସ୍ତୁତ କରନ୍ତୁ।"
         ]
      },
      "banana": {
         "advisory": [
            "ସିଗଟୋକା ଲିଫ୍ ସ୍ପଟ୍ ଏବଂ ସିଗାର ଏଣ୍ଡ୍ ରଟ୍ ପରିଚାଳନା କରିବା ପାଇଁ ମାନକୋଜେବ୍ 75 ପ୍ରତିଶତ ଡବ୍ଲ୍ଯ଼ୁ. ପି. ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "papaya": {
         "advisory": [
            "ୱାଇ. ଭି. ଏମ୍. ଉପରେ ନଜର ରଖିବା ଏବଂ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ ହଳଦିଆ ଚଟପଟା ଜାଲ ଲଗାନ୍ତୁ।",
            "ରାସାଯ଼ନିକ ନିଯ଼ନ୍ତ୍ରଣ ପାଇଁ ନିମ୍ବ ତେଲ ଏବଂ ଡାଇଫେନ୍ଥିଓରନ୍ 50 ପ୍ରତିଶତ ଡବ୍ଲ୍ଯ଼ୁ. ପି. ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "cattle": {
         "advisory": [
            "ପଶୁଶାଳାରେ ଉପଯୁକ୍ତ ବାଯ଼ୁ ସଞ୍ଚାଳନ ସୁନିଶ୍ଚିତ କରନ୍ତୁ।",
            "ହାଇବ୍ରିଡ୍ ନେପିଯ଼ର୍ ଘାସ ଭଳି ମରୁଡ଼ି-ପ୍ରତିରୋଧକ ପଶୁଖାଦ୍ଯ଼ କିସମ ଚାଷ କରନ୍ତୁ।"
         ]
      },
      "goat & sheep": {
         "advisory": [
            "ଡିହାଇଡ୍ରେସନ୍, ଉତ୍ତାପ ଚାପ ଏବଂ ପରଜୀବୀ ସଂକ୍ରମଣର ଲକ୍ଷଣ ପାଇଁ ନିଯ଼ମିତ ଭାବରେ ପଶୁମାନଙ୍କୁ ଯାଞ୍ଚ କରନ୍ତୁ |",
            "ଆବଶ୍ଯ଼କ ଅନୁଯାଯ଼ୀ ପଶୁମାନଙ୍କୁ କୃମି ମୁକ୍ତ କରନ୍ତୁ ଏବଂ ସେମାନଙ୍କୁ ସାଧାରଣ ରୋଗ ବିରୁଦ୍ଧରେ ଟୀକାକରଣ କରନ୍ତୁ।"
         ]
      },
      "poultry": {
         "advisory": [
            "ଉଠାଯାଇଥିବା ମଞ୍ଚ ଏବଂ ଗଭୀର ଆବର୍ଜନା ବ୍ଯ଼ବସ୍ଥା ସ୍ୱଚ୍ଛତା ଏବଂ ତାପମାତ୍ରା ନିଯ଼ନ୍ତ୍ରଣ ବଜାଯ଼ ରଖିବାରେ ସାହାଯ୍ଯ଼ କରେ |",
            "ଜୀବାଣୁ ସୃଷ୍ଟି ହେବାରୁ ରୋକିବା ପାଇଁ ନିଯ଼ମିତ ଭାବରେ ଘରକୁ ସଫା ଏବଂ ଜୀବାଣୁମୁକ୍ତ କରନ୍ତୁ |"
         ]
      }
   },
   "date": "04-10-2024"
}