{
   "weather_details": {
      "06.07.2024": {
         "rainfall": 5,
         "t_max": 28,
         "t_min": 22,
         "rh_max": 81,
         "rh_min": 47,
         "wind_speed": 13,
         "wind_direction": 0,
         "cloud_cover": 6
      },
      "07.07.2024": {
         "rainfall": 5,
         "t_max": 29,
         "t_min": 22,
         "rh_max": 81,
         "rh_min": 47,
         "wind_speed": 13,
         "wind_direction": 0,
         "cloud_cover": 7
      },
      "08.07.2024": {
         "rainfall": 7,
         "t_max": 29,
         "t_min": 21,
         "rh_max": 81,
         "rh_min": 47,
         "wind_speed": 13,
         "wind_direction": 0,
         "cloud_cover": 7
      },
      "09.07.2024": {
         "rainfall": 10,
         "t_max": 28,
         "t_min": 21,
         "rh_max": 81,
         "rh_min": 47,
         "wind_speed": 13,
         "wind_direction": 0,
         "cloud_cover": 7
      },
      "10.07.2024": {
         "rainfall": 7,
         "t_max": 28,
         "t_min": 22,
         "rh_max": 81,
         "rh_min": 47,
         "wind_speed": 13,
         "wind_direction": 0,
         "cloud_cover": 7
      }
   },
   "names_of_crops": [
      "କାର୍ପ୍"
   ],
   "general_advisory": "ସୁନିଶ୍ଚିତ ଜଳସେଚିତ ଅଞ୍ଚଳରେ ଭଲ ଜଳ ନିଷ୍କାସନ ସୁବିଧା ସହିତ ଜଳସେଚନ ଜଳ ଉତ୍ସ ନିକଟରେ ଓଦା ଶଯ୍ଯ଼ା ନର୍ସରୀ ପାଇଁ ଜମି ଚଯ଼ନ କରନ୍ତୁ | ଗ୍ରାମ ସ୍ତରରେ ଗୋଷ୍ଠୀ ନର୍ସରୀ ଆଭିମୁଖ୍ଯ଼ ଅନୁସରଣ କରିବାକୁ ପରାମର୍ଶ ଦିଆଯାଇଛି। ନର୍ସରୀ ଅଞ୍ଚଳକୁ 1.5-metre-long, 10 ସେ. ମି. ଉଚ୍ଚତା ଏବଂ ସୁବିଧାଜନକ ଲମ୍ବ ବିଶିଷ୍ଟ ଛୋଟ ଛୋଟ ପ୍ଲଟରେ ବିଭକ୍ତ କରନ୍ତୁ। ଜଳସେଚନ/ଜଳ ନିଷ୍କାସନ ପାଇଁ ଶଯ୍ଯ଼ା ସହିତ 30 ସେ. ମି. ଓସାରର ଜଳସେଚନ ଚ୍ଯ଼ାନେଲ ନିର୍ମାଣ କରାଯିବା ଉଚିତ। ପ୍ରତ୍ଯ଼େକ ଧାଡ଼ି କିମ୍ବା ସିଧାସଳଖ ପ୍ରସାରଣ ମଧ୍ଯ଼ରେ 5 ସେ. ମି. ବ୍ଯ଼ବଧାନ ସହିତ ଧାଡ଼ି ବୁଣିବା ଦ୍ୱାରା ଅଙ୍କୁରିତ ବୀଜଗୁଡିକ ବୀଜ ଶଯ୍ଯ଼ାର @40-50 ଗ୍ରାମ୍/ମି2 ଅଞ୍ଚଳରେ ରୋପଣ କରାଯିବା ଉଚିତ ଏବଂ ମଞ୍ଜି ଉପରେ ଶୁଖିଲା କମ୍ପୋଷ୍ଟ ପକାଇବା ଉଚିତ। ଆଭ୍ଯ଼ନ୍ତରୀଣ ପରଜୀବୀଙ୍କ ଭାର ହ୍ରାସ କରିବା ପାଇଁ କୀଟପତଙ୍ଗ ପ୍ରାଣୀ। ବର୍ଷା ସମଯ଼ରେ ପଶୁମାନଙ୍କୁ ଘର ଭିତରେ ରଖନ୍ତୁ ଏବଂ ସ୍ୱଚ୍ଛ ତଥା ସ୍ୱାସ୍ଥ୍ଯ଼କର ଜଳ ଯୋଗାଇ ଦିଅନ୍ତୁ।",
   "crops_data": {
      "carp": {
         "advisory": [
            "ଦ୍ରୁତ ଗତିରେ ବଢ଼ୁଥିବା ରୋହୁ, କାଟଲା ଏବଂ ମ୍ରିଗଲ ଭଳି କାର୍ପକୁ 4ଃ3ଃ3 ଅନୁପାତରେ ମହଜୁଦ ରଖିବା ଉଚିତ, ଯାହାଦ୍ୱାରା ଏହାର ଲାଭ ବଢ଼ିପାରିବ। ସାଧାରଣତଃ, ହେକ୍ଟର ପିଛା 5,000 ଫିଙ୍ଗରଲିଙ୍ଗର ଘନତ୍ୱ ଏକ ମାନକ ଷ୍ଟକିଂ ଭାବରେ ରଖାଯାଏ | ଚିନାବାଦାମ ତେଲ କେକ୍ ଏବଂ ଚାଉଳ ଚୋପା ଷ୍ଟକିଂ ସାମଗ୍ରୀର ମୋଟ ବାଯ଼ୋମାସର 5 ପ୍ରତିଶତ ଅନୁପାତରେ ସମାନ ଅନୁପାତରେ ଦିଆଯାଏ | ପୁଷ୍କରିଣୀର ଗୁଣବତ୍ତା ବୃଦ୍ଧି ପାଇଁ ଗୋବର, ଯ଼ୁରିଆ ଏବଂ ସୁପର ଫସଫେଟ୍ ପ୍ରଯ଼ୋଗ କରାଯିବା ଉଚିତ।"
         ]
      }
   },
   "date": "05-07-2024"
}