{
   "weather_details": {
      "06-11-2024": {
         "rainfall": 3,
         "t_max": 32,
         "t_min": 23,
         "rh_max": 82,
         "rh_min": 54,
         "wind_speed": 6,
         "wind_direction": 357,
         "cloud_cover": 6
      },
      "07-11-2024": {
         "rainfall": 0,
         "t_max": 32,
         "t_min": 23,
         "rh_max": 84,
         "rh_min": 57,
         "wind_speed": 9,
         "wind_direction": 12,
         "cloud_cover": 5
      },
      "08-11-2024": {
         "rainfall": 0,
         "t_max": 33,
         "t_min": 23,
         "rh_max": 84,
         "rh_min": 57,
         "wind_speed": 9,
         "wind_direction": 7,
         "cloud_cover": 4
      },
      "09-11-2024": {
         "rainfall": 0,
         "t_max": 33,
         "t_min": 23,
         "rh_max": 84,
         "rh_min": 56,
         "wind_speed": 7,
         "wind_direction": 357,
         "cloud_cover": 4
      },
      "10-11-2024": {
         "rainfall": 0,
         "t_max": 33,
         "t_min": 22,
         "rh_max": 84,
         "rh_min": 51,
         "wind_speed": 7,
         "wind_direction": 6,
         "cloud_cover": 5
      }
   },
   "names_of_crops": [
      "ଚାଉଳ",
      "ବଳାତ୍କାର",
      "ସୋରିଷ"
   ],
   "general_advisory": "ଗଚ୍ଛିତ ମୃତ୍ତିକାର ଆର୍ଦ୍ରତାର ଲାଭ ଉଠାଇ କୃଷକମାନେ ସୋରିଷ, ତୋରିଆ, ସୂର୍ଯ୍ଯ଼ମୁଖୀ ଭଳି ରବି ଫସଲ ପାଇଁ ଜମି ପ୍ରସ୍ତୁତି ଆରମ୍ଭ କରିବା ଉଚିତ ଏବଂ ସର୍ବୋତ୍ତମ ଉତ୍ପାଦନ ପାଇବା ପାଇଁ ଶୀଘ୍ର ବୁଣିବା ଶେଷ କରିବା ଉଚିତ। ବିପିଏଚ, ଡବ୍ଲ୍ଯ଼ୁ. ବି. ପି. ଏଚ., ଲିଫ୍ ଫୋଲଡର, ଗୁଣ୍ଡି ବଗ ଏବଂ ଚାଉଳରେ ବି. ଏଲ. ବି. ଏବଂ ବିସ୍ଫୋରଣର ଘଟଣା ଉପରେ ନଜର ରଖିବା ପାଇଁ ନିଯ଼ମିତ ଭାବେ କ୍ଷେତକୁ ଯାଆନ୍ତୁ। ପଶୁମାନଙ୍କର ଟୀକାକରଣ ଏବଂ କୃମି ଦୂରୀକରଣ ପାଇଁ ନିକଟସ୍ଥ ପଶୁ ଚିକିତ୍ସକଙ୍କ ପରାମର୍ଶ ନିଅନ୍ତୁ।",
   "crops_data": {
      "rice": {
         "advisory": [
            "ପ୍ରଚଳିତ ଉଷ୍ମ ଏବଂ ଆର୍ଦ୍ର ପାଗ ଧାନରେ ବିଏଲବି ଏବଂ ନେକ ବ୍ଲାଷ୍ଟ ରୋଗର ଘଟଣା ବୃଦ୍ଧି କରିପାରେ ତେଣୁ ପ୍ରୟୋଗ କରନ୍ତୁ (ଟେବୁକୋନାଜୋଲ 50 ପ୍ରତିଶତ + ଟ୍ରାଇଫ୍ଲୋକ୍ସିସ୍ଟ୍ରୋବିନ୍ 25 ପ୍ରତିଶତ ଡବ୍ଲୁଜି) @0.4 ଗ୍ରାମ/ଲିଟର ପାଣି।",
            "ଘୂର୍ଣ୍ଣିବଳଯ଼ ଘଟଣା ପରେ ପ୍ରଚଳିତ ମାଇକ୍ରୋକ୍ଲାଇମେଟ୍ ଅବସ୍ଥା ପ୍ଲାଣ୍ଟ ହପର୍ସର ଜନସଂଖ୍ଯ଼ା ବୃଦ୍ଧି କରିପାରେ | ଭୂପୃଷ୍ଠରେ ସୂର୍ଯ୍ଯ଼କିରଣର ଉପଯୁକ୍ତ ପ୍ରବେଶ ଏବଂ ଉନ୍ନତ ବାଯ଼ୁ ସଞ୍ଚାଳନ ପାଇଁ ପ୍ରତି 3 ମିଟରରେ/8-10 ଧାଡ଼ି ପରେ ପଡ଼ିଆରେ ଗଳି ତିଆରି କରନ୍ତୁ। ସଂକ୍ରମଣର ପ୍ରାରମ୍ଭିକ ପର୍ଯ୍ଯ଼ାଯ଼ରେ, ଫସଲର ସୁରକ୍ଷା ପାଇଁ ଡିନୋଟେଫୁରାନ @80 ଗ୍ରାମ/ଏକର ଡବ୍ଲୁ. ଜି. ସହିତ ନିମ୍ବ ତେଲ ଫର୍ମ୍ଯ଼ୁଲେସନ୍ @600 ମିଲି/ଏକର ସହିତ ଗଛର ମୂଳକୁ ଲକ୍ଷ୍ଯ଼ କରି ଲଗାନ୍ତୁ। କୀଟନାଶକ ସିଞ୍ଚନ ଗଛର ମୂଳ ଅଂଶକୁ ଲକ୍ଷ୍ଯ଼ କରି କରାଯିବା ଉଚିତ।",
            "ଯଦି ବିଳମ୍ବରେ ପ୍ରତିରୋପଣ କରାଯାଇଥିବା ଚାଉଳ ପି. ଆଇ./ଫୁଲର ପ୍ରାରମ୍ଭିକ ପର୍ଯ୍ଯ଼ାଯ଼ରେ ଥାଏ, ତେବେ ଏମ୍. ଓ. ପି. 12 କି. ଗ୍ରା./ଏକରର ଅତିରିକ୍ତ ମାତ୍ରା ପ୍ରଯ଼ୋଗ କିମ୍ବା ଏମ୍. ଓ. ପି. (<ଆଇ. ଡି. 2> <ଆଇ. ଡି. 3>-10 ଗ୍ରାମ୍/ଲିଟର ପାଣି ସହିତ 20 ପ୍ରତିଶତ ବୋରନ୍ @<ଆଇ. ଡି. 1> ପାଣିର ପତ୍ର ସ୍ପ୍ରେ ସୁପାରିଶ କରାଯାଏ।"
         ]
      },
      "rapeseed": {
         "advisory": [
            "ଗଚ୍ଛିତ ମୃତ୍ତିକାର ଆର୍ଦ୍ରତାର ଲାଭ ଉଠାଇ, ସର୍ବୋତ୍ତମ ଉତ୍ପାଦନ ପାଇବା ପାଇଁ ଜମି ପ୍ରସ୍ତୁତି ଏବଂ ଫସଲର ସୋରିଷ ବୁଣିବା ଶୀଘ୍ର ଶେଷ କରାଯିବା ଉଚିତ।",
            "ଉପଯୁକ୍ତ କିସମଃ ତୋରିଆ-ଅନୁରାଧା, ପାର୍ବତୀ, ସୁଶ୍ରୀ ଭାରତୀଯ଼ ସୋରିଷ-ଏନ୍. ଆର୍. ସି. ଏଚ୍. ବି. 101, ମାହିକୋ ବୋଲ୍ଡ, ଜେ. ଡି. 6 ବିହନ ହାର-<ଆଇ. ଡି. 1> କି. ଗ୍ରା./ହେକ୍ଟର, ବ୍ଯ଼ବଧାନ-30 ସେ. ମି. x 10 ସେ. ମି.। ସାର ମାତ୍ରା-ତୋରିଆ @60:30:30 N-P2O5-K2O କିଲୋଗ୍ରାମ/ହେକ୍ଟର ସୋରିଷ @80:40:40 N-P2O5-K2O କିଲୋଗ୍ରାମ/ହେକ୍ଟର। 50 ପ୍ରତିଶତ ଏନ୍ ଏବଂ ସମସ୍ତ ପି2ଓ5 ଏବଂ କେ2ଓ ସାରକୁ ମୂଳ ସାର ଭାବେ ପ୍ରଯ଼ୋଗ କରାଯିବା ଉଚିତ।"
         ]
      },
      "mustard": {
         "advisory": [
            "ଗଚ୍ଛିତ ମୃତ୍ତିକାର ଆର୍ଦ୍ରତାର ଲାଭ ଉଠାଇ, ସର୍ବୋତ୍ତମ ଉତ୍ପାଦନ ପାଇବା ପାଇଁ ଜମି ପ୍ରସ୍ତୁତି ଏବଂ ଫସଲର ସୋରିଷ ବୁଣିବା ଶୀଘ୍ର ଶେଷ କରାଯିବା ଉଚିତ।"
         ]
      }
   },
   "date": "05-11-2024"
}