{
   "weather_details": {
      "2024-11-06": {
         "rainfall": 0,
         "t_max": 34,
         "t_min": 24,
         "rh_max": 91,
         "rh_min": 52,
         "wind_speed": 3,
         "wind_direction": 14,
         "cloud_cover": 5
      },
      "2024-11-07": {
         "rainfall": 0,
         "t_max": 34,
         "t_min": 24,
         "rh_max": 95,
         "rh_min": 54,
         "wind_speed": 4,
         "wind_direction": 17,
         "cloud_cover": 4
      },
      "2024-11-08": {
         "rainfall": 0,
         "t_max": 34,
         "t_min": 24,
         "rh_max": 96,
         "rh_min": 56,
         "wind_speed": 5,
         "wind_direction": 29,
         "cloud_cover": 5
      },
      "2024-11-09": {
         "rainfall": 0,
         "t_max": 33,
         "t_min": 24,
         "rh_max": 96,
         "rh_min": 56,
         "wind_speed": 5,
         "wind_direction": 27,
         "cloud_cover": 5
      },
      "2024-11-10": {
         "rainfall": 0,
         "t_max": 33,
         "t_min": 23,
         "rh_max": 95,
         "rh_min": 50,
         "wind_speed": 5,
         "wind_direction": 27,
         "cloud_cover": 3
      }
   },
   "names_of_crops": [
      "ଚାଉଳ",
      "ଉଦ୍ଯ଼ାନ କୃଷି",
      "ଗାଈ।",
      "ସାଧାରଣ ମାଛ"
   ],
   "general_advisory": "ଗତ ସପ୍ତାହରେ ଗଜପତି ଜିଲ୍ଲାରେ ହାରାହାରି ସର୍ବାଧିକ ଦୈନିକ ତାପମାତ୍ରା 34.7 ଡିଗ୍ରୀ ସେଲସିଯ଼ସ ଏବଂ ହାରାହାରି ସର୍ବନିମ୍ନ ଦୈନିକ ତାପମାତ୍ରା 24° ସେଲସିଯ଼ସ ରହିଥିଲା। ଗତ ସପ୍ତାହରେ ଜିଲ୍ଲାରେ 19.3 ମିଲିମିଟର ବର୍ଷା ହୋଇଥିଲା। ଫସଲ ଅମଳ କରିବାର 15 ଦିନ ପୂର୍ବରୁ ଧାନ କ୍ଷେତରୁ ପାଣି ବାହାର କରନ୍ତୁ। ଶାରୀରିକ ପରିପକ୍ୱତା ସମଯ଼ରେ ଧାନ ଫସଲ ଅମଳ କରନ୍ତୁ (85 ପ୍ରତିଶତ ଶସ୍ଯ଼ ଏକ ଗଣ୍ଠିରେ ପରିପକ୍ୱ ହୋଇଥାଏ) ଏବଂ ଏହା ଫିକା ହଳଦିଆ ରଙ୍ଗର ଦେଖାଯାଏ। ଯଦି ଶସ୍ଯ଼କୁ ବୀଜ ଉଦ୍ଦେଶ୍ଯ଼ରେ ରଖିବାକୁ ହେବ, ତେବେ ବନ୍ଧଠାରୁ ଏକ ମିଟର ଦୂରରେ ରଖି ଫସଲ ଅମଳ କରନ୍ତୁ। 14 ପ୍ରତିଶତ ଆର୍ଦ୍ରତା ପାଇବା ପାଇଁ ଅମଳ ହୋଇଥିବା ଧାନ ଶସ୍ଯ଼କୁ ସିଧାସଳଖ ସୂର୍ଯ୍ଯ଼ାଲୋକରେ 2ରୁ 3 ଦିନ ଶୁଖାଇ ଦିଅନ୍ତୁ। ମଞ୍ଜି ପାଇଁ ଶସ୍ଯ଼କୁ 12 ପ୍ରତିଶତରୁ କମ୍ ଆର୍ଦ୍ରତା ପର୍ଯ୍ଯ଼ନ୍ତ ଶୁଖାଇବା ଉଚିତ।",
   "crops_data": {
      "rice": {
         "advisory": [
            "ଯଦି ବ୍ରାଉନ୍ ପ୍ଲାଣ୍ଟ ହପର (ବିପିଏଚ) ର ଜନସଂଖ୍ୟା ଆର୍ଥିକ ସୀମା ସ୍ତର (ଇଟିଏଲ) (ଅର୍ଥାତ୍, 5-10 ହପର/ପାହାଡ) ଅତିକ୍ରମ କରେ, ତେବେ ବିକଳ୍ପ ଆର୍ଦ୍ରତା ଏବଂ ଶୁଖାଇବା କୌଶଳ ଦ୍ୱାରା ଧାନ କ୍ଷେତର ମାଇକ୍ରୋ-ଜଳବାୟୁ ପରିବର୍ତ୍ତନ କରିବାକୁ ପରାମର୍ଶ ଦିଆଯାଇଛି (ପାଣି ଦୀର୍ଘ ସମୟ ଧରି କ୍ଷେତରେ ଠିଆ ହେବା ଉଚିତ ନୁହେଁ)। ଯଦି ସମସ୍ୟା ଜାରି ରହେ, ତେବେ ଉପରୋକ୍ତ କୀଟପତଙ୍ଗ ନିୟନ୍ତ୍ରଣ ପାଇଁ ଗଛର ପାଦଦେଶରେ ଏକର ପିଛା 120 ଗ୍ରାମ୍ ପାଇମେଟ୍ରୋଜିନ୍ 50 ପ୍ରତିଶତ ଡବ୍ଲୁ. ଜି. କିମ୍ବା ଏକର ପିଛା 80 ଗ୍ରାମ୍ ଡାଇନୋଟେଫୁରାନ୍ 20 ପ୍ରତିଶତ ଏସ୍. ଜି. କିମ୍ବା ଏକର ପିଛା 60 ଗ୍ରାମ୍ ଫ୍ଲୋନିକାମିଡ୍ 50 ପ୍ରତିଶତ ଡବ୍ଲୁ. ଜି. କିମ୍ବା ଏକର ପିଛା 100 ମିଲି. ଟ୍ରାଇଫ୍ଲୁମେଜୋପାଇରିମ୍ 10 ପ୍ରତିଶତ ଏସ୍. ସି. ସ୍ପ୍ରେ କରନ୍ତୁ। ବିପିଏଚ ସଂକ୍ରମଣ ସମୟରେ ନାଇଟ୍ରୋଜେନ ସାର ବ୍ୟବହାରରୁ ଦୂରେଇ ରୁହନ୍ତୁ। ନେକ୍ ବ୍ଲାଷ୍ଟ ରୋଗକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ ପ୍ରଥମେ ଧାନ କ୍ଷେତରୁ ଅତିରିକ୍ତ ପାଣି ବାହାର କରନ୍ତୁ। ହେକ୍ଟର ପିଛା 400-ମିଲି ହେକ୍ସାକୋନାଜୋଲ୍ କିମ୍ବା ଏକର ପିଛା 200-ମିଲି ଆଜୋକ୍ସିସ୍ଟ୍ରୋବିନ୍ + ଡିଫେନୋକାନାଜୋଲ୍ କିମ୍ବା ଏକର ପିଛା 80-ଗ୍ରାମ୍ ଟେବୁକୋନାଜୋଲ୍ + ଟ୍ରାଇଫ୍ଲୋକ୍ସିସ୍ଟ୍ରୋବିନ୍ ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "horticulture": {
         "advisory": [
            "ବାଇଗଣରେ ଫୋମୋପ୍ସିସ୍ ବ୍ଲାଇଟ୍ ରୋଗକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ ମେଟାଲାକ୍ସିଲ୍ 8 ପ୍ରତିଶତ + ମାନକୋଜେବ୍ 64 ପ୍ରତିଶତ ଡବ୍ଲ୍ୟୁ. ପି. @400 ଗ୍ରାମ/ଏକର କିମ୍ବା ପ୍ରୋପିନେବ୍ 70 ପ୍ରତିଶତ ଡବ୍ଲ୍ୟୁ. ପି. @400 ଗ୍ରାମ/ଏକର ସ୍ପ୍ରେ କରନ୍ତୁ।",
            "ଟମାଟୋ ପାଇଁ 20 କିଲୋଗ୍ରାମ ଯ଼ୁରିଆ, 52 କିଲୋଗ୍ରାମ ଡିଏପି ଏବଂ 20 କିଲୋଗ୍ରାମ ଏମଓପି ମୂଳ ସାର ଭାବରେ ପ୍ରଯ଼ୋଗ କରନ୍ତୁ ଏବଂ ଧାଡ଼ି ଠାରୁ ଧାଡ଼ି ମଧ୍ଯ଼ରେ 60 ସେ. ମି. ଏବଂ ଗଛ ଠାରୁ ଗଛ ମଧ୍ଯ଼ରେ 45 ସେ. ମି. ବ୍ଯ଼ବଧାନ ବଜାଯ଼ ରଖନ୍ତୁ।",
            "ଏକର ପିଛା 33 କି. ଗ୍ରା. ଯ଼ୁରିଆ ଏବଂ 23 କି. ଗ୍ରା. ଏମ୍. ଓ. ପି. ପ୍ରଯ଼ୋଗ କରନ୍ତୁ ଏବଂ ହାତ କାଟିବା ପରେ <ଆଇ. ଡି. 1> ଡି. ଏ. ଟି. ଏବଂ ଏକର ପିଛା 33 କି. ଗ୍ରା. ଯ଼ୁରିଆ ଏବଂ 23 କି. ଗ୍ରା. ଏମ୍. ଓ. ପି. ପ୍ରଯ଼ୋଗ କରନ୍ତୁ। ଯଦି ଚାରା ରୋପଣ ସମଯ଼ରେ ବୋରାକ୍ସ ପ୍ରଯ଼ୋଗ କରାଯାଇନଥାଏ, ତେବେ ବୋରାକ୍ସ ସ୍ପ୍ରେ @4 କେଜି/ଏକର କିମ୍ବା ଫୋଲିବୋର/ସଲ୍ଯ଼ୁବର ସ୍ପ୍ରେ @1.5 ଗ୍ରାମ/ଲିଟର। ପ୍ରତିରୋପଣର ଦୁଇ ସପ୍ତାହ ପରେ ଏବଂ ଦହି ତିଆରି ହେବାର ଦୁଇ ସପ୍ତାହ ପୂର୍ବରୁ ବୋରନ ମାଇକ୍ରୋ ନ୍ଯ଼ୁଟ୍ରିଏଣ୍ଟ ସିଞ୍ଚନ କରାଯିବା ଉଚିତ।",
            "ବୁଣିବା ପୂର୍ବରୁ, କାର୍ବେନଡାଜିମ୍ 50 ପ୍ରତିଶତ ଡବ୍ଲ୍ଯ଼ୁ. ପି. ପ୍ରତି କିଲୋଗ୍ରାମ ମଞ୍ଜି କିମ୍ବା କାର୍ବୋକ୍ସିନ୍ <ଆଇ. ଡି. 1> + ଥିରମ୍ <ଆଇ. ଡି. 1> ଡି. ଏସ୍. ପ୍ରତି କିଲୋଗ୍ରାମ ମଞ୍ଜି ସହିତ ଚିକିତ୍ସା କରାଯିବା ଉଚିତ। ନର୍ସରୀରେ ରୋଗ ହ୍ରାସକୁ ରୋକିବା ପାଇଁ, ନର୍ସରୀ ଶଯ୍ଯ଼ାକୁ 15 ଦିନ ବ୍ଯ଼ବଧାନରେ କାର୍ବେନଡାଜିମ୍ @2 ଗ୍ରାମ୍/ଲିଟର ପାଣିରେ ଭିଜାଇ ଦିଅନ୍ତୁ। 8 ସପ୍ତାହ ପୁରୁଣା ଚାରା ମୁଖ୍ଯ଼ କ୍ଷେତରେ ରୋପଣ କରାଯାଏ |",
            "ମାରିଗୋଲ୍ଡ ଏବଂ ଗୋଲାପ ଫୁଲରେ ରେଡ୍ ସ୍ପାଇଡର ମାଇଟ୍କୁ ପରିଚାଳନା କରିବା ପାଇଁ 80 ପ୍ରତିଶତ ୱେଟେବଲ୍ ସଲଫର୍ (ସଲଫେକ୍ସ/ବଲୱାନ/ସଲଫାଡେକ୍ସ) @2 ଗ୍ରାମ/ଲିଟର ପାଣି କିମ୍ବା ପ୍ରୋପାର୍ଜାଇଟ୍ 57 ପ୍ରତିଶତ ଇସି (ଓମାଇଟ୍/ମାଇଟକିଲ/ସୁପର ଡାଇନାମାଇଟ୍) @2 ମିଲି/ଲିଟର ପାଣି କିମ୍ବା ଫେନପାଇରୋକ୍ସିମେଟ୍ 5 ପ୍ରତିଶତ ଇସି (ସିଗେଟ/ମିଟିଗେଟ/ଫର୍ମାଇଟ୍) @2 ମିଲି/ଲିଟର ପାଣି ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "cow": {
         "advisory": [
            "ପଶୁମାନଙ୍କୁ ନିଯ଼ମିତ ଭାବରେ ଲୁଣ ସହିତ ଖଣିଜ ମିଶ୍ରଣ ଦିଆଯିବା ଉଚିତ ଏବଂ ପଶୁମାନଙ୍କ ଶକ୍ତି ଆବଶ୍ଯ଼କତାକୁ ପୂରଣ କରିବା ପାଇଁ ଶୀତ ଋତୁରେ ଦୈନିକ ରାସନରେ ଗହମ ଶସ୍ଯ଼, ଗୁଡ଼ ଇତ୍ଯ଼ାଦି ଯୋଗାଇ ଦିଆଯାଇପାରେ |"
         ]
      },
      "common fish": {
         "advisory": [
            "ଶୀତ ଋତୁରେ, ମାଛରେ ବିଭିନ୍ନ ଫଙ୍ଗଲ୍, ବ୍ଯ଼ାକ୍ଟେରିଆ ଏବଂ ପରଜୀବୀ ରୋଗ ଦେଖାଯାଇପାରେ | ଶୀତ ଋତୁ ଆରମ୍ଭ ହେବାର ଠିକ୍ ପୂର୍ବରୁ ପୋଖରୀକୁ ସିଫାକ୍ସ @400 ମିଲି/ଏକରରେ ବ୍ଯ଼ବହାର କରନ୍ତୁ। ପୋଖରୀରେ ପୋଟାସିଯ଼ମ୍ ପର୍ମାଙ୍ଗାନେଟ୍ ପ୍ରତି ଏକର ପିଛା 1 ରୁ 2 କି. ଗ୍ରା. କିମ୍ବା ଚୂନପଥର ପ୍ରତି ଏକର ପିଛା 1 ରୁ 1 କି. ଗ୍ରା. ବ୍ଯ଼ବହାର କରନ୍ତୁ। ଏକର ପିଛା 100 କିଲୋଗ୍ରାମ ଲବଣ ପ୍ରଯ଼ୋଗ ମଧ୍ଯ଼ ଶୀତ ଋତୁରେ ମାଛମାନଙ୍କୁ ରୋଗ ପ୍ରାଦୁର୍ଭାବରୁ ରକ୍ଷା କରିବାରେ ସାହାଯ୍ଯ଼ କରିଥାଏ।"
         ]
      }
   },
   "date": "05-11-2024"
}