{
   "weather_details": {
      "05.11.2024": {
         "rainfall": 0,
         "t_max": 30,
         "t_min": 20,
         "rh_max": 85,
         "rh_min": 65,
         "wind_speed": 10,
         "wind_direction": 120,
         "cloud_cover": 3
      }
   },
   "names_of_crops": [
      "ଆଖୁ",
      "ରସୁଣ",
      "ଫ୍ରେଞ୍ଚ ବିନ୍",
      "କଦଳୀ",
      "ଫୁଲକୋବି",
      "ଆଳୁ",
      "ମାରିଗୋଲ୍ଡ",
      "ଗୋଲାପ।",
      "ମତ୍ସ୍ୟଚାଷ",
      "ପଶୁପାଳନ"
   ],
   "general_advisory": "ଉନ୍ନତ କୃଷି ଲାଭ ପାଇଁ, ଓଯ଼ୁଏଟି କାଲିଙ୍ଗା ଉତ୍ପାଦ (ଚାରା, ଚାରା ଏବଂ କ୍ଯ଼ୁ. ପି. ଏମ୍., ଟିସ୍ଯ଼ୁ କଲ୍ଚର ପ୍ଲାଣ୍ଟ, ଫଳ ଏବଂ ପନିପରିବା, ମୂଲ୍ଯ଼ଯୁକ୍ତ ଉତ୍ପାଦ, ଆଙ୍ଗୁଳି/ବାର୍ଷିକ, କୁକୁଡ଼ା ଛୁଆ, ପ୍ରଜାତି, ଛତୁ ଏବଂ ସ୍ପାନ, ବାଯ଼ୋ-ଫର୍ଟିଲାଇଜର, ବାଯ଼ୋ-କୀଟନାଶକ, ଭର୍ମି ଏବଂ ଭର୍ମି କମ୍ପୋଷ୍ଟ, ଏବଂ ଫାର୍ମ ଉପକରଣ) ବ୍ଯ଼ବହାର କରନ୍ତୁ।",
   "crops_data": {
      "sugarcane": {
         "advisory": [
            "ପରିପକ୍ୱତା ପର୍ଯ୍ଯ଼ାଯ଼ଃ ସ୍କେଲ କୀଟ ସଂକ୍ରମଣକୁ ରୋକିବା ପାଇଁ, ପ୍ରତ୍ଯ଼େକ କାର୍ଡକୁ 12 ଖଣ୍ଡରେ ବିଭକ୍ତ କରି ସାପ୍ତାହିକ ବ୍ଯ଼ବଧାନରେ 6 ଥର ପାଇଁ ଟ୍ରାଇକୋଗ୍ରାମ ଚିଲିନିସ୍ କାର୍ଡ @1-2/ଏକର (10000 ଅଣ୍ଡା/ହେକ୍ଟର) ବ୍ଯ଼ବହାର କରନ୍ତୁ।",
            "ପରିପକ୍ୱତା ପର୍ଯ୍ଯ଼ାଯ଼ଃ 200 ଲିଟର ପାଣି ସହିତ ମିଶ୍ରଣ କରି ଏକର ପିଛା 1 କି. ଗ୍ରା. ରେ ମେଟାରିଜିଯ଼ମ୍ ଆନିସୋପିଲା ସ୍ପ୍ରେ କରନ୍ତୁ।",
            "ପରିପକ୍ୱତା ପର୍ଯ୍ୟାୟଃ ରାସାୟନିକ ନିୟନ୍ତ୍ରଣ ପାଇଁ, 200 ଲିଟର ପାଣି ସହିତ ମିଶାଇ ଥିୟାମେଥୋକ୍ସାମ୍ 25 ପ୍ରତିଶତ ଡବ୍ଲୁଜି @60 ଗ୍ରାମ୍/ଏକର କିମ୍ବା ଇମିଡାକ୍ଲୋପ୍ରିଡ୍ 17.8% ଏସ୍. ଏଲ୍. @60 ମିଲି/ଏକର କିମ୍ବା ଏସିଟାମିପ୍ରିଡ୍ 20 ପ୍ରତିଶତ ଏସ୍. ପି. @60 ଗ୍ରାମ୍/ଏକର ଲଗାନ୍ତୁ।"
         ]
      },
      "onion": {
         "advisory": [
            "ପ୍ରାକ୍-ବୁଣିବା ପର୍ଯ୍ଯ଼ାଯ଼ଃ ଅଗ୍ରିଫାଉଣ୍ଡ୍ ଲାଇଟ୍ ରେଡ୍, ଅଗ୍ରିଫାଉଣ୍ଡ୍ ଡାର୍କ ରେଡ୍, ଭୀମ ଶକ୍ତି, ଭୀମ ସୁପର୍ ଇତ୍ଯ଼ାଦି ପିଆଜର କିସମ ଶୀତ ଋତୁରେ ଓଡ଼ିଶା ପରିସ୍ଥିତି ପାଇଁ ଉପଯୁକ୍ତ |"
         ]
      },
      "french bean": {
         "advisory": [
            "ପ୍ରାକ୍-ବୁଣିବା ପର୍ଯ୍ଯ଼ାଯ଼ଃ ଫ୍ରେଞ୍ଚ ବିନ୍ ଚାଷ ପାଇଁ, ବୁଶ୍ ପ୍ରଜାତି ପାଇଁ 20-30 କିଲୋଗ୍ରାମ ମଞ୍ଜି ଏବଂ ଲମ୍ବା ପ୍ରଜାତି ପାଇଁ 10-12 କିଲୋଗ୍ରାମ ମଞ୍ଜି ଏକର ପିଛା ଆବଶ୍ଯ଼କ। ବୁଣିବା 7 ଦିନ ପୂର୍ବରୁ, ପ୍ରତି କିଲୋଗ୍ରାମ ମଞ୍ଜି ପିଛା 2 ଗ୍ରାମ୍ କାର୍ବେନଡାଜିମ୍ କିମ୍ବା କାର୍ବୋକ୍ସିନ୍ 37.5% + ଥିରମ୍ 37.5% @2 ଗ୍ରାମ୍ ଦେଇ ଚିକିତ୍ସା କରନ୍ତୁ।"
         ]
      },
      "cabbage": {
         "advisory": [
            "ନର୍ସରୀ/ଚାରା ରୋପଣଃ ଯଥାଶୀଘ୍ର ପରିପକ୍ୱ ହେଉଥିବା କିସମଗୁଡ଼ିକ ପାଇଁ ଧାଡ଼ି ଠାରୁ ଧାଡ଼ି ମଧ୍ଯ଼ରେ 60 ସେ. ମି. ଏବଂ ଗଛରୁ ଗଛ ମଧ୍ଯ଼ରେ 30 ସେ. ମି. ବ୍ଯ଼ବଧାନ ବଜାଯ଼ ରଖନ୍ତୁ, ଯେତେବେଳେ କି ମଧ୍ଯ଼ମ ଏବଂ ବିଳମ୍ବ ଅବଧି କିସମଗୁଡ଼ିକ ପାଇଁ ଧାଡ଼ି ଠାରୁ ଧାଡ଼ି ମଧ୍ଯ଼ରେ <ଆଇ. ଡି. 2> ସେ. ମି. ଏବଂ ଗଛରୁ ଗଛ ମଧ୍ଯ଼ରେ <ଆଇ. ଡି. 1> ସେ. ମି. ବ୍ଯ଼ବଧାନ ବଜାଯ଼ ରଖନ୍ତୁ। ମଧ୍ଯ଼ାହ୍ନ ସମଯ଼ରେ ଚାରା ରୋପଣ କରାଯିବା ଉଚିତ।"
         ]
      },
      "cauliflower": {
         "advisory": [
            "ନର୍ସରୀ/ଚାରା ରୋପଣଃ ଯଥାଶୀଘ୍ର ପରିପକ୍ୱ ହେଉଥିବା କିସମଗୁଡ଼ିକ ପାଇଁ ଧାଡ଼ି ଠାରୁ ଧାଡ଼ି ମଧ୍ଯ଼ରେ 60 ସେ. ମି. ଏବଂ ଗଛରୁ ଗଛ ମଧ୍ଯ଼ରେ 30 ସେ. ମି. ବ୍ଯ଼ବଧାନ ବଜାଯ଼ ରଖନ୍ତୁ, ଯେତେବେଳେ କି ମଧ୍ଯ଼ମ ଏବଂ ବିଳମ୍ବ ଅବଧି କିସମଗୁଡ଼ିକ ପାଇଁ ଧାଡ଼ି ଠାରୁ ଧାଡ଼ି ମଧ୍ଯ଼ରେ <ଆଇ. ଡି. 2> ସେ. ମି. ଏବଂ ଗଛରୁ ଗଛ ମଧ୍ଯ଼ରେ <ଆଇ. ଡି. 1> ସେ. ମି. ବ୍ଯ଼ବଧାନ ବଜାଯ଼ ରଖନ୍ତୁ। ମଧ୍ଯ଼ାହ୍ନ ସମଯ଼ରେ ଚାରା ରୋପଣ କରାଯିବା ଉଚିତ।"
         ]
      },
      "potato": {
         "advisory": [
            "ପ୍ରାକ୍-ରୋପଣଃ ରୋପଣ ପୂର୍ବରୁ ମଞ୍ଜି ଗୁଡ଼ିକୁ ଚିକିତ୍ସା କରନ୍ତୁ। କନ୍ଦ ମଞ୍ଜି ଚିକିତ୍ସା ପାଇଁ ପ୍ରଥମେ 100 ଲିଟର ପାଣିରେ 600 ଗ୍ରାମ କାର୍ବେନଡାଜିମ୍ 25 ପ୍ରତିଶତ + ମାନକୋଜେବ୍ 50 ପ୍ରତିଶତ ୱାସ୍ ମିଶାଇ ଏକ ଦ୍ରବଣ ପ୍ରସ୍ତୁତ କରନ୍ତୁ। ଏହି ଦ୍ରବଣରେ ଏକ କ୍ୱିଣ୍ଟାଲ୍ କନ୍ଦ ମଞ୍ଜି 20-25 ମିନିଟ୍ ପାଇଁ ବୁଡ଼ାଇ ଦିଅନ୍ତୁ। ଏହି ଦ୍ରବଣରୁ କନ୍ଦ ମଞ୍ଜି ବାହାର କରି ଦିଅନ୍ତୁ ଏବଂ ରୋପଣ ପୂର୍ବରୁ 2ରୁ 4 ଘଣ୍ଟା ଶୁଖାଇବା ପାଇଁ ସେଡରେ ରଖନ୍ତୁ।"
         ]
      },
      "marigold": {
         "advisory": [
            "ଫୁଲ ଫୁଟାଇବାଃ ମାରିଗୋଲ୍ଡ ଏବଂ ଗୁଲାବରେ ରେଡ୍ ସ୍ପାଇଡର ମାଇଟ୍କୁ ନିଯ଼ନ୍ତ୍ରଣ କରିବା ପାଇଁ, ପ୍ରୋପାର୍ଜାଇଟ୍ 57 ପ୍ରତିଶତ ଇସି @2 ମିଲି/ଲିଟର ପାଣି କିମ୍ବା ଫେନପାଇରୋକ୍ସିମେଟ୍ 5 ପ୍ରତିଶତ ଇସି @2 ମିଲି/ଲିଟର ପାଣି ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "rose": {
         "advisory": [
            "ଫୁଲ ଫୁଟାଇବାଃ ମାରିଗୋଲ୍ଡ ଏବଂ ଗୁଲାବରେ ରେଡ୍ ସ୍ପାଇଡର ମାଇଟ୍କୁ ନିଯ଼ନ୍ତ୍ରଣ କରିବା ପାଇଁ, ପ୍ରୋପାର୍ଜାଇଟ୍ 57 ପ୍ରତିଶତ ଇସି @2 ମିଲି/ଲିଟର ପାଣି କିମ୍ବା ଫେନପାଇରୋକ୍ସିମେଟ୍ 5 ପ୍ରତିଶତ ଇସି @2 ମିଲି/ଲିଟର ପାଣି ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "fisheries": {
         "advisory": [
            "ଶୀତ ଋତୁରେ, ମାଛରେ ବିଭିନ୍ନ ଫଙ୍ଗଲ୍, ବ୍ଯ଼ାକ୍ଟେରିଆ ଏବଂ ପରଜୀବୀ ରୋଗ ଦେଖାଯାଇପାରେ | ଶୀତ ଋତୁ ଆରମ୍ଭ ହେବାର ଠିକ୍ ପୂର୍ବରୁ ପୋଖରୀକୁ ସିଫାକ୍ସ @400 ମିଲି/ଏକରରେ ବ୍ଯ଼ବହାର କରନ୍ତୁ। ପୋଖରୀରେ ପୋଟାସିଯ଼ମ୍ ପର୍ମାଙ୍ଗାନେଟ୍ ପ୍ରତି ଏକର ପିଛା 1 ରୁ 2 କି. ଗ୍ରା. କିମ୍ବା ଚୂନପଥର ପ୍ରତି ଏକର ପିଛା 1 ରୁ 1 କି. ଗ୍ରା. ବ୍ଯ଼ବହାର କରନ୍ତୁ। ଏକର ପିଛା 100 କି. ଗ୍ରା. ଲବଣ ପ୍ରଯ଼ୋଗ ମଧ୍ଯ଼ ଶୀତଦିନେ ରୋଗ ପ୍ରାଦୁର୍ଭାବରୁ ମାଛମାନଙ୍କୁ ରକ୍ଷା କରିବାରେ ସାହାଯ୍ଯ଼ କରେ |"
         ]
      },
      "animal husbandry": {
         "advisory": [
            "ପଶୁମାନଙ୍କୁ ନିଯ଼ମିତ ଭାବରେ ଲୁଣ ସହିତ ଖଣିଜ ମିଶ୍ରଣ ଦିଆଯିବା ଉଚିତ ଏବଂ ପଶୁମାନଙ୍କ ଶକ୍ତି ଆବଶ୍ଯ଼କତାକୁ ପୂରଣ କରିବା ପାଇଁ ଶୀତ ଋତୁରେ ଦୈନିକ ରାସନରେ ଗହମ ଶସ୍ଯ଼, ଗୁଡ଼ ଇତ୍ଯ଼ାଦି 10%-20% ରେ ଯୋଗାଇ ଦିଆଯାଇପାରେ |"
         ]
      }
   },
   "date": "05-11-2024"
}