{
   "weather_details": {
      "06-11-2024": {
         "rainfall": 0,
         "t_max": 33,
         "t_min": 22,
         "rh_max": 89,
         "rh_min": 43,
         "wind_speed": 3,
         "wind_direction": 0,
         "cloud_cover": 3
      },
      "07-11-2024": {
         "rainfall": 0,
         "t_max": 33,
         "t_min": 22,
         "rh_max": 91,
         "rh_min": 43,
         "wind_speed": 4,
         "wind_direction": 75,
         "cloud_cover": 3
      },
      "08-11-2024": {
         "rainfall": 0,
         "t_max": 32,
         "t_min": 21,
         "rh_max": 93,
         "rh_min": 44,
         "wind_speed": 4,
         "wind_direction": 73,
         "cloud_cover": 4
      },
      "09-11-2024": {
         "rainfall": 0,
         "t_max": 32,
         "t_min": 21,
         "rh_max": 93,
         "rh_min": 45,
         "wind_speed": 4,
         "wind_direction": 75,
         "cloud_cover": 4
      },
      "10-11-2024": {
         "rainfall": 0,
         "t_max": 32,
         "t_min": 21,
         "rh_max": 92,
         "rh_min": 43,
         "wind_speed": 4,
         "wind_direction": 70,
         "cloud_cover": 4
      }
   },
   "names_of_crops": [
      "ଚାଉଳ",
      "ମକା",
      "ଡାଲିଗୁଡ଼ିକ",
      "ସୋରିଷ",
      "ଫୁଲକୋବି",
      "କଦଳୀ",
      "ଗାଈ।",
      "ମଇଁଷି।"
   ],
   "general_advisory": "ପାଞ୍ଚ ଦିନର ପାଣିପାଗ ପୂର୍ବାନୁମାନ ଆଧାରରେ, କୃଷକମାନଙ୍କୁ ଆନ୍ତଃସାଂସ୍କୃତିକ କାର୍ଯ୍ୟକଳାପ ଜାରି ରଖିବାକୁ, ପରିପକ୍ୱ ଉତ୍ପାଦନ ଅମଳ କରିବାକୁ, ରବି ଫସଲ ପାଇଁ ପ୍ରସ୍ତୁତ ହେବାକୁ, ପରିପକ୍ୱ ଚାରା ରୋପଣ କରିବାକୁ, କୀଟପତଙ୍ଗ ପାଇଁ ନିୟମିତ ତଦାରଖ କରିବାକୁ, ଗହମ ଏବଂ ବଙ୍ଗଳା ଚଣା ବୁଣିବା, ମଞ୍ଜି ଚିକିତ୍ସା, ବିଭିନ୍ନ କୀଟପତଙ୍ଗ ପାଇଁ ସ୍ପ୍ରେ ନିୟନ୍ତ୍ରଣ ପଦକ୍ଷେପ, ସର୍ବୋତ୍ତମ ଉତ୍ପାଦନ ପାଇଁ ଜମି ପ୍ରସ୍ତୁତି ଏବଂ ଫସଲ ବୁଣିବା ଆରମ୍ଭ କରିବାକୁ ଏବଂ ପଶୁମାନଙ୍କ ଯତ୍ନ ନେବାକୁ ପରାମର୍ଶ ଦିଆଯାଇଛି।",
   "crops_data": {
      "rice": {
         "advisory": [
            "ନେକ୍ ବ୍ଲାସ୍ଟ୍ ରୋଗ ପରିଚାଳନା ପାଇଁ ଟ୍ରାଇସାଇକ୍ଲାଜୋଲ୍ (ବିମ୍) @0.6 ଗ୍ରାମ୍/ଲିଟର ପାଣି (120 ଗ୍ରାମ୍/ଏସି) ଲଗାନ୍ତୁ।",
            "ବାଷ୍ପ ଛେଦକ ଏବଂ ପତ୍ର ଫୋଲଡରକୁ ନିଯ଼ନ୍ତ୍ରଣ କରିବା ପାଇଁ କ୍ଲୋରପିରିଓଫସ୍/ପ୍ରୋଫେନୋଫସ୍ @2 ମିଲି/ଲିଟର ପାଣି ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "maize": {
         "advisory": [
            "ଆମେରିକୀୟ କୋବ୍ ବୋରରର ସଂକ୍ରମଣକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ 10 ଲିଟର ପାଣି ସହିତ ଫ୍ଲୁବେଣ୍ଡିଆମାଇଡ୍ 39.35% SC @4 ମିଲି ମିଶାନ୍ତୁ।"
         ]
      },
      "pulses": {
         "advisory": [
            "ବର୍ତ୍ତମାନର ପାଣିପାଗ ହର୍ସ ଗ୍ରାମ୍ ଏବଂ ବେଙ୍ଗଲ ଗ୍ରାମ୍ ବୁଣିବା ପାଇଁ ଅନୁକୂଳ ଅଟେ। ତେଣୁ, କୃଷକମାନଙ୍କୁ ମାଟିର ଆର୍ଦ୍ରତା ସ୍ଥିତି ଉପରେ ନିର୍ଭର କରି ମଞ୍ଜି ବୁଣିବା ପାଇଁ ପରାମର୍ଶ ଦିଆଯାଇଛି। ବୁଣିବା ପୂର୍ବରୁ, ମଞ୍ଜି ଗୁଡ଼ିକୁ ଫଙ୍ଗିସାଇଡ୍ ଦ୍ୱାରା ଚିକିତ୍ସା କରାଯିବା ଉଚିତ ଏବଂ ତା 'ପରେ ଗଣ୍ଠିକୁ ବଢ଼ାଇବା ପାଇଁ 20 ଗ୍ରାମ୍/କେଜି ମଞ୍ଜି ସହିତ ରାଇଜୋବିୟମ୍ ସଂସ୍କୃତି କରାଯିବା ଉଚିତ।"
         ]
      },
      "mustard": {
         "advisory": [
            "ଉପଲବ୍ଧ ମୃତ୍ତିକା ଆର୍ଦ୍ରତାର ଲାଭ ଉଠାଇ, ସର୍ବାଧିକ ଉତ୍ପାଦନ ପାଇବା ପାଇଁ ଜମି ପ୍ରସ୍ତୁତି ଏବଂ ଫସଲ ବୁଣିବା ଆରମ୍ଭ କରାଯିବା ଉଚିତ।",
            "ଉପଯୁକ୍ତ କିସମଃ ତୋରିଆ-ଅନୁରାଧା, ପାର୍ବତୀ, ସୁଶ୍ରୀ, ଭାରତୀୟ ସୋରିଷ-ପୁସା ବୋଲ୍ଡ, ପୁସା ଜୟ କିଷାନ। ବୀଜ ହାର-8-10 କିଲୋଗ୍ରାମ/ହେକ୍ଟର, ବ୍ୟବଧାନ-30 ସେ. ମି. x 10 ସେ. ମି.।",
            "ଚାରା ରୋପଣ ପର୍ଯ୍ଯ଼ାଯ଼ରେ ସୋରିଷ ଏବଂ ତୋରିଆରେ କୀଟପତଙ୍ଗକୁ ନିଯ଼ନ୍ତ୍ରଣ କରିବା ପାଇଁ ନିମ୍ବ ତେଲ 5 ମିଲି/ଲିଟର ପାଣି ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "cauliflower": {
         "advisory": [
            "ନର୍ସରୀ ଶଯ୍ଯ଼ା ପ୍ରସ୍ତୁତ କରନ୍ତୁ, ଭଲ ଭାବରେ ଅପଘଟିତ ଏଫ୍. ଆଇ. ଏମ୍. ଏବଂ କ୍ଲୋରପାଇରିଫୋସ୍ ଧୂଳି ଲଗାନ୍ତୁ, ନିର୍ଦ୍ଦିଷ୍ଟ କିସମର ମଞ୍ଜି ବୁଣନ୍ତୁ |"
         ]
      },
      "cabbage": {
         "advisory": [
            "ନର୍ସରୀ ଶଯ୍ଯ଼ା ପ୍ରସ୍ତୁତ କରନ୍ତୁ, ଭଲ ଭାବରେ ଅପଘଟିତ ଏଫ୍. ଆଇ. ଏମ୍. ଏବଂ କ୍ଲୋରପାଇରିଫୋସ୍ ଧୂଳି ଲଗାନ୍ତୁ, ନିର୍ଦ୍ଦିଷ୍ଟ କିସମର ମଞ୍ଜି ବୁଣନ୍ତୁ |"
         ]
      },
      "cow": {
         "advisory": [
            "ନିର୍ଜଲୀକରଣ, ଉତ୍ତାପ ଚାପ ଏବଂ ପରଜୀବୀ ସଂକ୍ରମଣର ଲକ୍ଷଣ ପାଇଁ ନିଯ଼ମିତ ଭାବରେ ପଶୁମାନଙ୍କୁ ଯାଞ୍ଚ କରନ୍ତୁ | ଆବଶ୍ଯ଼କ ଅନୁଯାଯ଼ୀ ପଶୁମାନଙ୍କୁ କୃମି ମୁକ୍ତ କରନ୍ତୁ ଏବଂ ସେମାନଙ୍କୁ ସାଧାରଣ ରୋଗ ବିରୁଦ୍ଧରେ ଟୀକାକରଣ କରନ୍ତୁ।"
         ]
      },
      "buffalo": {
         "advisory": [
            "ନିର୍ଜଲୀକରଣ, ଉତ୍ତାପ ଚାପ ଏବଂ ପରଜୀବୀ ସଂକ୍ରମଣର ଲକ୍ଷଣ ପାଇଁ ନିୟମିତ ଭାବରେ ପଶୁମାନଙ୍କୁ ଯାଞ୍ଚ କରନ୍ତୁ | ଆବଶ୍ୟକ ଅନୁଯାୟୀ ପଶୁମାନଙ୍କୁ କୃମି ମୁକ୍ତ କରନ୍ତୁ ଏବଂ ସେମାନଙ୍କୁ ସାଧାରଣ ରୋଗ ବିରୁଦ୍ଧରେ ଟୀକାକରଣ କରନ୍ତୁ।"
         ]
      }
   },
   "date": "05-11-2024"
}