{
   "weather_details": {
      "05.11.2024": {
         "rainfall": 0,
         "t_max": 30,
         "t_min": 20,
         "rh_max": 90,
         "rh_min": 60,
         "wind_speed": 15,
         "wind_direction": 180,
         "cloud_cover": 4
      }
   },
   "names_of_crops": [
      "ଆଖୁ",
      "ରସୁଣ",
      "ଫ୍ରେଞ୍ଚ ବିନ୍",
      "କଦଳୀ",
      "ଫୁଲକୋବି",
      "ଆଳୁ",
      "ମାରିଗୋଲ୍ଡ",
      "ଗୋଲାପ।",
      "ମତ୍ସ୍ଯ଼ଚାଷ",
      "ପଶୁପାଳନ"
   ],
   "general_advisory": "ଉନ୍ନତ କୃଷି ଲାଭ ପାଇଁ ଓଯ଼ୁଏଟି କାଲିଙ୍ଗା ଉତ୍ପାଦ ବ୍ଯ଼ବହାର କରନ୍ତୁ। ଶୀତ ଋତୁରେ ପଶୁମାନଙ୍କୁ ନିଯ଼ମିତ ଭାବେ ଲୁଣ ସହିତ ଖଣିଜ ମିଶ୍ରଣ ଦେବା ଉଚିତ।",
   "crops_data": {
      "sugarcane": {
         "advisory": [
            "ସ୍କେଲ୍ କୀଟ ସଂକ୍ରମଣକୁ ରୋକିବା ପାଇଁ ପ୍ରତ୍ଯ଼େକ କାର୍ଡକୁ 12 ଖଣ୍ଡରେ ବିଭକ୍ତ କରି ସାପ୍ତାହିକ ବ୍ଯ଼ବଧାନରେ 6 ଥର ପାଇଁ ଟ୍ରାଇକୋଗ୍ରାମ ଚିଲିନିସ୍ କାର୍ଡ @1-2/ଏକର ବ୍ଯ଼ବହାର କରନ୍ତୁ।",
            "200 ଲିଟର ପାଣି ସହିତ ମିଶ୍ରଣ କରି ଏକର ପିଛା 1 କି. ଗ୍ରା. ରେ ମେଟାରିଜିଯ଼ମ୍ ଆନିସୋପିଲା ସ୍ପ୍ରେ କରନ୍ତୁ।",
            "ରାସାୟନିକ ନିୟନ୍ତ୍ରଣ ପାଇଁ, ଥିୟାମେଥୋକ୍ସାମ୍ 25 ପ୍ରତିଶତ ଡବ୍ଲୁ. ଜି. @60 ଗ୍ରାମ୍/ଏକର କିମ୍ବା ଇମିଡାକ୍ଲୋପ୍ରିଡ୍ <ଆଇ. ଡି. 1> ଏସ୍. ଏଲ୍. @60 ମିଲି/ଏକର କିମ୍ବା ଏସ୍ ଟାମିପ୍ରିଡ୍ 20 ପ୍ରତିଶତ ଏସ୍. ପି. <ଆଇ. ଡି. 2> ଏକରକୁ 200 ଲିଟର ପାଣି ସହିତ ମିଶାଇ ଲଗାନ୍ତୁ।"
         ]
      },
      "onion": {
         "advisory": [
            "ଅଗ୍ରିଫାଉଣ୍ଡ୍ ଲାଇଟ୍ ରେଡ୍, ଅଗ୍ରିଫାଉଣ୍ଡ୍ ଡାର୍କ ରେଡ୍, ଭୀମ ଶକ୍ତି, ଭୀମ ସୁପର୍ ଇତ୍ଯ଼ାଦି ପିଆଜର କିସମ ଶୀତ ଋତୁରେ ଓଡ଼ିଶା ପାଇଁ ଉପଯୁକ୍ତ |"
         ]
      },
      "french bean": {
         "advisory": [
            "ଫ୍ରେଞ୍ଚ ବିନ୍ ଚାଷ ପାଇଁ ଏକର ପିଛା ବୁଶ୍ କିସମର କିଲୋଗ୍ରାମ ମଞ୍ଜି ଏବଂ ଲମ୍ବା କିସମର କିଲୋଗ୍ରାମ ମଞ୍ଜି ଆବଶ୍ୟକ ହୋଇଥାଏ। ବୁଣିବା 7 ଦିନ ପୂର୍ବରୁ ଏହାକୁ ପ୍ରତି କିଲୋଗ୍ରାମ ମଞ୍ଜି ପିଛା 2 ଗ୍ରାମ୍ କାର୍ବେନଡାଜିମ୍ କିମ୍ବା କାର୍ବୋକ୍ସିନ୍ 37.5% + ଥିରମ୍ 37.5% @2 ଗ୍ରାମ୍ ସହିତ ଉପଚାର କରନ୍ତୁ।"
         ]
      },
      "cabbage": {
         "advisory": [
            "ଶୀଘ୍ର ପରିପକ୍ୱ ହେଉଥିବା ପ୍ରଜାତି ପାଇଁ ଧାଡ଼ି ଠାରୁ ଧାଡ଼ି ମଧ୍ୟରେ 60 ସେ. ମି. ଏବଂ ଗଛ ଠାରୁ ଗଛ ମଧ୍ୟରେ 30 ସେ. ମି. ବ୍ୟବଧାନ ରଖନ୍ତୁ। ମଧ୍ୟମ ଏବଂ ବିଳମ୍ବ ଅବଧି ପାଇଁ କିସମଗୁଡ଼ିକ 60-75 ସେ. ମି. ର ଧାଡ଼ି ଠାରୁ ଧାଡ଼ି ବ୍ୟବଧାନ ବଜାୟ ରଖନ୍ତି ଏବଂ 40-45 ସେ. ମି. ର ଉଦ୍ଭିଦ ଠାରୁ ଉଦ୍ଭିଦ ବ୍ୟବଧାନ ବଜାୟ ରଖନ୍ତି | ମଧ୍ୟାହ୍ନ ସମୟରେ ଚାରା ରୋପଣ କରାଯିବା ଉଚିତ।"
         ]
      },
      "cauliflower": {
         "advisory": [
            "ଶୀଘ୍ର ପରିପକ୍ୱ ହେଉଥିବା ପ୍ରଜାତି ପାଇଁ ଧାଡ଼ି ଠାରୁ ଧାଡ଼ି ମଧ୍ଯ଼ରେ 60 ସେ. ମି. ଏବଂ ଗଛ ଠାରୁ ଗଛ ମଧ୍ଯ଼ରେ 30 ସେ. ମି. ବ୍ଯ଼ବଧାନ ରଖନ୍ତୁ। ମଧ୍ଯ଼ମ ଏବଂ ବିଳମ୍ବ ଅବଧି ପାଇଁ କିସମଗୁଡ଼ିକ 60-75 ସେ. ମି. ର ଧାଡ଼ି ଠାରୁ ଧାଡ଼ି ବ୍ଯ଼ବଧାନ ବଜାଯ଼ ରଖନ୍ତି ଏବଂ 40-45 ସେ. ମି. ର ଉଦ୍ଭିଦ ଠାରୁ ଉଦ୍ଭିଦ ବ୍ଯ଼ବଧାନ ବଜାଯ଼ ରଖନ୍ତି | ମଧ୍ଯ଼ାହ୍ନ ସମଯ଼ରେ ଚାରା ରୋପଣ କରାଯିବା ଉଚିତ।"
         ]
      },
      "potato": {
         "advisory": [
            "ରୋପଣ ପୂର୍ବରୁ ମଞ୍ଜିଗୁଡ଼ିକୁ କାର୍ବେନଡାଜିମ୍ 25 ପ୍ରତିଶତ + ମାନକୋଜେବ୍ 50 ପ୍ରତିଶତ ଡବ୍ଲୁ. ଏସ୍. ର ଏକ ଦ୍ରବଣରେ ବୁଡ଼ାଇ ଚିକିତ୍ସା କରନ୍ତୁ। ଚାରା ଲଗାଇବା ପୂର୍ବରୁ 2ରୁ 4 ଘଣ୍ଟା ପର୍ଯ୍ୟନ୍ତ ମଞ୍ଜି ଶୁଖାନ୍ତୁ।"
         ]
      },
      "marigold": {
         "advisory": [
            "ମାରିଗୋଲ୍ଡରେ ରେଡ୍ ସ୍ପାଇଡର ମାଇଟ୍କୁ ନିଯ଼ନ୍ତ୍ରଣ କରିବା ପାଇଁ, ପ୍ରୋପାର୍ଜାଇଟ୍ 57 ପ୍ରତିଶତ ଇସି @2 ମିଲି/ଲିଟର ପାଣି କିମ୍ବା ଫେନପାଇରୋକ୍ସିମେଟ୍ 5 ପ୍ରତିଶତ ଇସି @2 ମିଲି/ଲିଟର ପାଣି ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "rose": {
         "advisory": [
            "ଗୋଲାପରେ ରେଡ୍ ସ୍ପାଇଡର ମାଇଟ୍କୁ ନିଯ଼ନ୍ତ୍ରଣ କରିବା ପାଇଁ, ପ୍ରୋପାର୍ଜାଇଟ୍ 57 ପ୍ରତିଶତ ଇସି @2 ମିଲି/ଲିଟର ପାଣି କିମ୍ବା ଫେନପାଇରୋକ୍ସିମେଟ୍ 5 ପ୍ରତିଶତ ଇସି @2 ମିଲି/ଲିଟର ପାଣି ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "fisheries": {
         "advisory": [
            "ଶୀତ ଋତୁରେ, ମାଛରେ ବିଭିନ୍ନ ଫଙ୍ଗଲ୍, ବ୍ଯ଼ାକ୍ଟେରିଆ ଏବଂ ପରଜୀବୀ ରୋଗ ଦେଖାଯାଇପାରେ | ଶୀତ ଋତୁ ଆରମ୍ଭ ହେବାର ଠିକ୍ ପୂର୍ବରୁ ପୋଖରୀକୁ ସିଫାକ୍ସ @400 ମିଲି/ଏକରରେ ବ୍ଯ଼ବହାର କରନ୍ତୁ। ପୋଖରୀରେ ପୋଟାସିଯ଼ମ୍ ପର୍ମାଙ୍ଗାନେଟ୍ ପ୍ରତି ଏକର ପିଛା 1 ରୁ 2 କି. ଗ୍ରା. କିମ୍ବା ଚୂନପଥର ପ୍ରତି ଏକର ପିଛା 1 ରୁ 1 କି. ଗ୍ରା. ବ୍ଯ଼ବହାର କରନ୍ତୁ। ଏକର ପିଛା 100 କିଲୋଗ୍ରାମ ଲବଣ ପ୍ରଯ଼ୋଗ ମଧ୍ଯ଼ ଶୀତ ଋତୁରେ ମାଛମାନଙ୍କୁ ରୋଗ ପ୍ରାଦୁର୍ଭାବରୁ ରକ୍ଷା କରିବାରେ ସାହାଯ୍ଯ଼ କରିଥାଏ।"
         ]
      },
      "animal husbandry": {
         "advisory": [
            "ପଶୁମାନଙ୍କୁ ନିୟମିତ ଭାବରେ ଲୁଣ ସହିତ ଖଣିଜ ମିଶ୍ରଣ ଦିଆଯିବା ଉଚିତ ଏବଂ ପଶୁମାନଙ୍କ ଶକ୍ତି ଆବଶ୍ୟକତାକୁ ପୂରଣ କରିବା ପାଇଁ ଶୀତ ଋତୁରେ ଦୈନିକ ରାସନରେ ଗହମ ଶସ୍ୟ, ଗୁଡ଼ ଇତ୍ୟାଦି ଯୋଗାଇ ଦିଆଯାଇପାରେ |"
         ]
      }
   },
   "date": "05-11-2024"
}