{
   "weather_details": {
      "06/11/2024": {
         "rainfall": 0,
         "t_max": 33,
         "t_min": 19,
         "rh_max": 82,
         "rh_min": 42,
         "wind_speed": 3,
         "wind_direction": 40,
         "cloud_cover": 4
      },
      "07/11/2024": {
         "rainfall": 0,
         "t_max": 33,
         "t_min": 19,
         "rh_max": 83,
         "rh_min": 43,
         "wind_speed": 4,
         "wind_direction": 34,
         "cloud_cover": 3
      },
      "08/11/2024": {
         "rainfall": 0,
         "t_max": 32,
         "t_min": 19,
         "rh_max": 86,
         "rh_min": 44,
         "wind_speed": 4,
         "wind_direction": 31,
         "cloud_cover": 3
      },
      "09/11/2024": {
         "rainfall": 0,
         "t_max": 32,
         "t_min": 18,
         "rh_max": 86,
         "rh_min": 43,
         "wind_speed": 4,
         "wind_direction": 31,
         "cloud_cover": 2
      },
      "10/11/2024": {
         "rainfall": 0,
         "t_max": 32,
         "t_min": 18,
         "rh_max": 83,
         "rh_min": 40,
         "wind_speed": 4,
         "wind_direction": 49,
         "cloud_cover": 2
      }
   },
   "names_of_crops": [
      "ଧାନ।",
      "ମୁଙ୍ଗ",
      "ଗହମ",
      "ଆଳୁ",
      "ସୋରିଷ",
      "ବାଇଗଣ",
      "ମତ୍ସ୍ଯ଼ଚାଷ"
   ],
   "general_advisory": "ପକେଟରେ ଆର୍ଦ୍ରତାର ଚାପ କ୍ଷେତ୍ରରେ, ପ୍ରଜନନ ପର୍ଯ୍ୟାୟରେ 1 ପ୍ରତିଶତ କେ. ସି. ଏଲ୍. ଦ୍ରବଣର ପତ୍ର ପ୍ରୟୋଗ ଉତ୍ପାଦନରେ ଅଧିକ କ୍ଷତି ନକରି ଆର୍ଦ୍ରତା ଅବସ୍ଥାର ପ୍ରଭାବକୁ ହ୍ରାସ କରିବ। ରବି ଫସଲ ପାଇଁ, କୃଷକମାନେ ନଭେମ୍ବର ମାସରେ ପତିତ କ୍ଷେତରେ ସେମାନଙ୍କର କ୍ଷେତ୍ର କାର୍ଯ୍ୟ ଆରମ୍ଭ କରିପାରିବେ। ଟ୍ରାକ୍ଟର ଡ୍ରାଏଡ୍ ରୋଟାଭେଟର କିମ୍ବା କଲ୍ଟିଭେଟର ବ୍ୟବହାର କରାଯାଇପାରିବ ଏବଂ ଅଗଭୀର ହଳ କରିବା ଉଚିତ |",
   "crops_data": {
      "paddy": {
         "advisory": [
            "ସମଯ଼ୋଚିତ ଭାବେ ବୁଣାଯାଇଥିବା ଫସଲ ଯେତେବେଳେ 85 ପ୍ରତିଶତରୁ ଅଧିକ ପେନିକଲ୍ ହଳଦିଆ ହୋଇଯାଏ, ସେତେବେଳେ ଫସଲ ଅମଳ ପାଇଁ ଯାଇ ଦୁଇ ତିନି ଦିନ ପର୍ଯ୍ଯ଼ନ୍ତ ସୂର୍ଯ୍ଯ଼କିରଣ ତଳେ ଶୁଖାଇ ଦିଆଯାଏ।"
         ]
      },
      "mung": {
         "advisory": [
            "ନଭେମ୍ବର ମାସରେ, ଟ୍ରାମ-1, ଓ. ଯ଼ୁ. ଏମ୍. <ଆଇ. ଡି. 1>, ହମ୍-1, ଆଇ. ପି. <ଆଇ. ଡି. 4>, ଆଇ. ପି.-<ଆଇ. ଡି. 3> ପ୍ରତି କି. ଗ୍ରା. ର ମୁଗ କିସମ ରୋପଣ କରାଯିବ। ବୁଣିବା ପୂର୍ବରୁ ମଞ୍ଜିଗୁଡ଼ିକୁ କାର୍ବେନଡାଜିମ୍ @2 ଗ୍ରାମ୍/କି. ଗ୍ରା. ମଞ୍ଜି ସହିତ ଉପଚାର କରନ୍ତୁ। ପୂର୍ବ ରାତିରେ ବୁଣିବା ପୂର୍ବରୁ ସାତ ଦିନ ପରେ ପ୍ରତି କିଲୋଗ୍ରାମ ମଞ୍ଜି ପିଛା 20 ଗ୍ରାମ ମୂଲ୍ଯ଼ରେ ରାଇଜୋବିଯ଼ମ୍ ଚିକିତ୍ସା କରନ୍ତୁ। ଉପଯୁକ୍ତ ନୋଡ୍ଯ଼ୁଲେସନ୍ ପାଇଁ 10 କିଲୋଗ୍ରାମ ମଞ୍ଜି ପିଛା 3 ଗ୍ରାମିନ କୃଷି ମୌସମ୍ ସେବା @ଆମୋନିଯ଼ମ୍ ମୋଲ୍ବଡେଟ୍ ସହିତ ମଧ୍ଯ଼ ଚିକିତ୍ସା କରନ୍ତୁ |"
         ]
      },
      "wheat": {
         "advisory": [
            "ଯ଼ୁପି 262, କଲ୍ଯ଼ାଣସୋନା ଭଳି ଉନ୍ନତ ମାନର ମଞ୍ଜି ସଂଗ୍ରହ କରନ୍ତୁ। ପ୍ରତି କିଲୋଗ୍ରାମ ମଞ୍ଜି ପିଛା 2 ଗ୍ରାମ ମୂଲ୍ଯ଼ରେ ଭିଟାବ୍ଯ଼ାକ୍ସ ଶକ୍ତିରେ ମଞ୍ଜିଗୁଡ଼ିକୁ ଚିକିତ୍ସା କରନ୍ତୁ। ବୁଣିବା ପୂର୍ବରୁ ଏକର ପିଛା 600 ଗ୍ରାମ୍ ପି. ଏସ୍. ବି. ସହିତ ମଧ୍ଯ଼ ଉପଚାର କରନ୍ତୁ। ଏକର ପିଛା ଏହାର ବିହନ ମୂଲ୍ଯ଼ 40 କିଲୋଗ୍ରାମ ରହିଛି।"
         ]
      },
      "potato": {
         "advisory": [
            "କେ. ପୋଖରାଜ, କେ. ଲଲିମା, କେ. ସିନ୍ଦୁରୀ, କେ. ସୂର୍ଯ୍ଯ଼ଙ୍କ ଭଳି ମଞ୍ଜି 608 କ୍ଯ଼ୁ/ଏସି ହାରରେ ସଂଗ୍ରହ କରନ୍ତୁ। 20 ଗ୍ରାମ୍ ମାନକୋଜେବ୍, 1 ଗ୍ରାମ୍ ଷ୍ଟ୍ରେପ୍ଟୋସାଇକ୍ଲିନ୍ ସହିତ 10 ଲିଟର ପାଣିରେ ମଞ୍ଜି ମିଶାନ୍ତୁ ଏବଂ କନ୍ଦକୁ 30 ମିନିଟ୍ ଗଭୀର କରନ୍ତୁ ଏବଂ ତା 'ପରେ ସେଡ୍ ତଳେ ଶୁଖାନ୍ତୁ | ଅନ୍ତିମ ଜମି ପ୍ରସ୍ତୁତିରେ ସାରର ମାତ୍ରା ହେଉଛି ଏକର ପିଛା 5 ଟନ ଏଫୱାଇଏମ, 24-24-48 କେଜି ଏନପିକେ।"
         ]
      },
      "mustard": {
         "advisory": [
            "ଅବଶିଷ୍ଟ ମୃତ୍ତିକା ଆର୍ଦ୍ରତା ସ୍ଥିତିରେ ତୋରିଆ ମଞ୍ଜି ଯେପରିକି ସୁଶ୍ରୀ, ଏମ27, ଅନୁରାଧା ଇତ୍ଯ଼ାଦି ରହିଥାଏ। ଗୋଟିଏ ଏକର ଜମିରେ ଚାଷ କରିବା ପାଇଁ 3 କିଲୋ ମଞ୍ଜି ଆବଶ୍ଯ଼କ ହୋଇଥାଏ। 30 ସେ. ମି. ଦୂରରେ ଧାଡ଼ିରେ ମଞ୍ଜି ବୁଣନ୍ତୁ। (ଧାଡ଼ି ରୁ ଧାଡ଼ି) ଏବଂ 10 ସେ. ମି. (ଗଛରୁ ଗଛ)।"
         ]
      },
      "brinjal": {
         "advisory": [
            "ଶୁଟ୍ ଏବଂ ଫଳ ଛେଦକ ସଂକ୍ରମଣ ହେବାର ସମ୍ଭାବନା ଅଛି | ଏକର ପିଛା 200 ଲିଟର ପାଣିରେ ଏମାମେକ୍ଟିନ୍ ବେନ୍ଜୋଏଟ୍ 5 ପ୍ରତିଶତ ଏସ୍. ଜି. @80 ଗ୍ରାମ୍ କିମ୍ବା ଏକର ପିଛା 200 ଲିଟର ପାଣିରେ କାର୍ବାରିଲ୍ 50 ପ୍ରତିଶତ ଡବ୍ଲ୍ଯ଼ୁ. ପି. @800 ଗ୍ରାମ୍ ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "pisciculture": {
         "advisory": [
            "ଶରୀର ପୁଞ୍ଜିର 3 ପ୍ରତିଶତ ମାତ୍ରାରେ ଖଣିଜ ପଦାର୍ଥ ଦିଅନ୍ତୁ।"
         ]
      }
   },
   "date": "05-11-2024"
}