{
   "weather_details": {
      "06-11-2024": {
         "rainfall": 0,
         "t_max": 32,
         "t_min": 18,
         "rh_max": 84,
         "rh_min": 44,
         "wind_speed": 3,
         "wind_direction": 164,
         "cloud_cover": 3
      },
      "07-11-2024": {
         "rainfall": 2,
         "t_max": 32,
         "t_min": 18,
         "rh_max": 89,
         "rh_min": 45,
         "wind_speed": 1,
         "wind_direction": 124,
         "cloud_cover": 3
      },
      "08-11-2024": {
         "rainfall": 0,
         "t_max": 31,
         "t_min": 18,
         "rh_max": 91,
         "rh_min": 49,
         "wind_speed": 2,
         "wind_direction": 76,
         "cloud_cover": 4
      },
      "09-11-2024": {
         "rainfall": 0,
         "t_max": 31,
         "t_min": 18,
         "rh_max": 91,
         "rh_min": 47,
         "wind_speed": 2,
         "wind_direction": 112,
         "cloud_cover": 4
      },
      "10-11-2024": {
         "rainfall": 0,
         "t_max": 31,
         "t_min": 17,
         "rh_max": 88,
         "rh_min": 41,
         "wind_speed": 2,
         "wind_direction": 108,
         "cloud_cover": 4
      }
   },
   "names_of_crops": [
      "ଧାନ।",
      "କପା",
      "ସୋରିଷ",
      "ସୂର୍ଯ୍ଯ଼ମୁଖୀ",
      "ବାଇଗଣ",
      "ଲଙ୍କା",
      "ଗୋରୁ ଏବଂ ମଇଁଷି",
      "ଛେଳି ଏବଂ ମେଣ୍ଢା",
      "କୁକୁଡ଼ା ମାଂସ"
   ],
   "general_advisory": "ଆଇଏମଡିରୁ ପ୍ରାପ୍ତ ପାଞ୍ଚ ଦିନର ପାଣିପାଗ ପୂର୍ବାନୁମାନକୁ ଦୃଷ୍ଟିରେ ରଖି, କୃଷକମାନଙ୍କୁ ଆବଶ୍ଯ଼କ ଅନୁଯାଯ଼ୀ ନିଡ଼ାଇ, ସାର ପ୍ରଯ଼ୋଗ, ଜଳସେଚନ, ଅମଳ ଏବଂ ଉଦ୍ଭିଦ ସୁରକ୍ଷା ରାସାଯ଼ନିକ ପ୍ରଯ଼ୋଗ କରିବାକୁ ପରାମର୍ଶ ଦିଆଯାଇଛି। କୃଷକମାନଙ୍କୁ ମୁଖ୍ଯ଼ କ୍ଷେତରେ ଲଙ୍କା, ଟମାଟୋ, କ୍ଯ଼ାପ୍ସିକମ୍, ବନ୍ଧାକୋବି, ଫୁଲକୋବି, ବାଇଗଣ ଇତ୍ଯ଼ାଦି ଦିନ ପୁରୁଣା ପନିପରିବା ଚାରା ରୋପଣ କରିବାକୁ ପରାମର୍ଶ ଦିଆଯାଇଛି। ଭୂତାଣୁ ସଂକ୍ରମିତ ଫସଲର ଘାସକୁ ଲଙ୍କା, ଟମାଟୋ ଏବଂ ବାଇଗଣରେ କାଟିବା ଉଚିତ। ସଂକ୍ରମିତ ଗଛଗୁଡ଼ିକୁ ଉପୁଡ଼ାଇ ମାଟିରେ ପୋତିଦେବା ଉଚିତ। ସୋରିଷ, ସାରସନ୍, ସୂର୍ଯ୍ଯ଼ମୁଖୀ, କ୍ଷେତ ମଟର, ଗାଜର, ମୂଳା ଇତ୍ଯ଼ାଦି ବୁଣିବା ପାଇଁ ବର୍ତ୍ତମାନ ଉପଯୁକ୍ତ ସମଯ଼ | ତେଣୁ କୃଷକମାନଙ୍କୁ ସେହି ଅନୁଯାଯ଼ୀ କାର୍ଯ୍ଯ଼ କରିବାକୁ ପରାମର୍ଶ ଦିଆଯାଇଛି। ଡାଲି/କଳା ଚଣା/ସବୁଜ ଚଣା ଭଳି ଡାଲି ଗୁଡ଼ିକୁ ଅମଳ କରିବାର ଏକ ସପ୍ତାହ ପୂର୍ବରୁ ଠିଆ ହୋଇଥିବା ପରିପକ୍ୱ ଫସଲ (ଧାନ) ରେ ପ୍ରସାରଣ କରାଯାଇପାରିବ, ଯାହାଦ୍ୱାରା ଉପଯୁକ୍ତ ଅଞ୍ଚଳରେ ମାଟିରେ ଅବଶିଷ୍ଟ ଆର୍ଦ୍ରତାର ଉପଯୋଗ କରାଯାଇପାରିବ। ସୋରିଷ ବୁଣିବା ପୂର୍ବରୁ ଏକର ପିଛା 20-25 କେଜି ଡିଏପି + 10 କେଜି ଏମଓପିକୁ ଆଧାର ଭାବେ ଲଗାନ୍ତୁ।",
   "crops_data": {
      "paddy": {
         "advisory": [
            "ଶୀଘ୍ର ପରିପକ୍ୱ ହେଉଥିବା କିସମଗୁଡ଼ିକରେ, ଫସଲ ଅମଳ କରନ୍ତୁ ଯେତେବେଳେ 80-85% ଶସ୍ଯ଼ ହାତ ଦ୍ୱାରା ହାତୁଡ଼ି ଦ୍ୱାରା କିମ୍ବା କମ୍ବାଇନ୍ ହାରଭେଷ୍ଟର କିମ୍ବା ରିପ୍ପର୍ ବ୍ଯ଼ବହାର କରି ପରିପକ୍ୱ ହୁଏ |"
         ]
      },
      "cotton": {
         "advisory": [
            "ଯେତେବେଳେ ବୋଲ୍ ଗୁଡ଼ିକ ସମ୍ପୂର୍ଣ୍ଣ ଭାବେ ଫୁଟିଯାଏ, ସେତେବେଳେ ଉଠାଇବା ଉଚିତ।",
            "ଆର୍ଦ୍ରତାକୁ 8-10% କୁ ହ୍ରାସ କରିବା ପାଇଁ କଂକ୍ରିଟ୍ ଚଟାଣ କିମ୍ବା ତିରପାଲ ଶୀଟ୍ ଉପରେ ବୀଜ କପା ଶୁଖାଇ ଦିଅନ୍ତୁ | ଭଲ ମୂଲ୍ଯ଼ ପାଇବା ପାଇଁ ପ୍ରଥମ ଉଠାଣରୁ ମିଳିଥିବା ବିହନ କପଡ଼ାକୁ ଅଲଗା ଭାବେ ରଖନ୍ତୁ।",
            "ଉତ୍ତମ ଉଦ୍ଭିଦ ବୃଦ୍ଧି ଏବଂ ଶୁଣ୍ଢର ବିକାଶ ପାଇଁ ଏନ. ପି. କେ.-<ଆଇ. ଡି. 1> ପରି ତରଳ ସାରର ପତ୍ର ସ୍ପ୍ରେ 20 ଗ୍ରାମ୍/10 ଲିଟର ପାଣିରେ କରାଯିବା ଉଚିତ।",
            "କୌଣସି ନୂତନ କୀଟପତଙ୍ଗ ଏବଂ ରୋଗର ପ୍ରକୋପ ବିଷୟରେ ଜାଣିବା ପାଇଁ ଫସଲର ନିୟମିତ ତଦାରଖ।"
         ]
      },
      "mustard": {
         "advisory": [
            "ନଭେମ୍ବରର ପ୍ରଥମ ପନ୍ଦର ଦିନ ମଧ୍ୟରେ ବୁଣିବା ଶେଷ ହେବା ଉଚିତ। ବୀଜ ବୁଣିବା ପୂର୍ବରୁ ଥିରମ୍ @2.5g/kg କିମ୍ବା ବାଭିଷ୍ଟିନ୍ @2 ଗ୍ରାମ୍/କେଜି ମଞ୍ଜି ବ୍ୟବହାର କରନ୍ତୁ।",
            "ସୋରିଷ <ଆଇ. ଡି. 2> କି. ଗ୍ରା./ଏକର ଏବଂ <ଆଇ. ଡି. 1> କି. ଗ୍ରା./ଏକର ପାଇଁ ବିହନ ଦର ତୋରିଆ ପାଇଁ ଉଦ୍ଦିଷ୍ଟ।",
            "ଉପଯୁକ୍ତ କିସମଃ ସୋରିଷ-ପୁସା ବୋଲ୍ଡ, ପୁସା ଜୟକିସାନ, ଜେଡି-6। ତୋରିଆ-ଏମ୍ 29, ଅନୁରାଧା, ପାର୍ବତୀ।",
            "ପୋଷକ ତତ୍ତ୍ୱ ପରିଚାଳନାଃ ପ୍ରଥମ ଜଳସେଚନ ପୂର୍ବରୁ ଏକର ପିଛା 20-25 କେଜି ଡିଏପି + 10 କେଜି ଏମଓପିକୁ ଆଧାର ଭାବେ ଏବଂ 35-40 କେଜି ଯ଼ୁରିଆ + 5 କେଜି ଏମଓପି/ଏକର ଭାବେ ପ୍ରଯ଼ୋଗ କରନ୍ତୁ।"
         ]
      },
      "sunflower": {
         "advisory": [
            "ନଭେମ୍ବର ମଧ୍ଯ଼ଭାଗ ସୁଦ୍ଧା ବୁଣିବା ଶେଷ ହେବା ଉଚିତ। ବୁଣିବା ପୂର୍ବରୁ ଭିଟାବ୍ଯ଼ାକ୍ସ ପାୱାର (କାର୍ବୋକ୍ସିନ + ଥିରାମ) @2.5g/kg କିମ୍ବା ମେଟାଲ୍ଯ଼ାକ୍ସିଲ @5 ଗ୍ରାମ/କିଲୋଗ୍ରାମ ମଞ୍ଜି ବ୍ଯ଼ବହାର କରନ୍ତୁ।",
            "ବୀଜ ହାରଃ ପ୍ରଜନନ-4 କେଜି/ଏସି ଏବଂ ହାଇବ୍ରିଡ୍-2 କେଜି/ଏସି।",
            "ଉପଯୁକ୍ତ କିସମଃ ଇନବ୍ରେଡ୍-ଆଧୁନିକ, ଟି. ଏନ୍. ଏ. ୟୁ. ଏସ୍. ୟୁ. ଏଫ୍.-7, ଡି. ଆର୍. ଏସ୍. ଏଫ୍.-108 (90 ଦିନ), ହାଇବ୍ରିଡ୍-ପିଏସି 36, କେବିଏସ୍. ଏଚ୍. 1, ଏମ୍. ଏସ୍. ଏଫ୍. ଏଚ୍. 8, ଏମ୍. ଏସ୍. ଏଫ୍. ଏଚ୍. 17 (<ଆଇ. ଡି. 1> ଦିନ)"
         ]
      },
      "brinjal": {
         "advisory": [
            "ଛେଦକ କୀଟ ଉପରେ ନଜର ରଖିବା ପାଇଁ, କୃଷକମାନଙ୍କୁ ଏକର ପିଛା 8 ହାରରେ ଫେରୋମୋନ୍ ଫାନ୍ଦ ବ୍ୟବହାର କରିବାକୁ ପରାମର୍ଶ ଦିଆଯାଇଛି। ରାସାୟନିକ ନିୟନ୍ତ୍ରଣ ପାଇଁ, ସ୍ପିନୋସାଦ୍ 45 ପ୍ରତିଶତ ଏସ୍. ସି. @1.5 ମିଲି/4 ଲିଟର ପାଣି କିମ୍ବା ଇମାମେକ୍ଟିନ୍ ବେନ୍ଜୋଏଟ୍ 5 ପ୍ରତିଶତ ଏସ୍. ଜି. @4 ଗ୍ରାମ୍/10 ଲିଟର ପାଣି କିମ୍ବା ଥିଓଡିକାର୍ବ 75 ପ୍ରତିଶତ ଡବ୍ଲ୍ୟୁ. ପି. @2 ମିଲି/ଲିଟର ପାଣି ସିଞ୍ଚନ କରନ୍ତୁ।"
         ]
      },
      "chilli": {
         "advisory": [
            "ଥ୍ରୀପ୍ସର ସଂକ୍ରମଣ ପରିଲକ୍ଷିତ ହୋଇଛି। ଯଦି ପତ୍ରଗୁଡ଼ିକ ଉପରକୁ ଘୁଞ୍ଚିଯାଏ ତେବେ ଗଛଗୁଡ଼ିକ ଥ୍ରୀପ୍ ଦ୍ୱାରା ପ୍ରଭାବିତ ହୁଅନ୍ତି |",
            "ଥ୍ରିପ୍ସ ସଂକ୍ରମଣକୁ ପରିଚାଳନା କରିବା ପାଇଁ ବ୍ଲୁ ଷ୍ଟିକି ଟ୍ରାପ୍ @8 nos./acre ସ୍ଥାପନ କରନ୍ତୁ। ରାସାଯ଼ନିକ ନିଯ଼ନ୍ତ୍ରଣ ପାଇଁ ଇମାମେକ୍ଟିନ୍ ବେନ୍ଜୋଏଟ୍ 5 ପ୍ରତିଶତ ଏସ୍. ଜି. @4 ଗ୍ରାମ/ଲିଟର କିମ୍ବା ଫିପ୍ରୋନିଲ୍ 5 ପ୍ରତିଶତ ଏସ୍. ସି. @2 ମିଲି/ଲିଟର କିମ୍ବା ଇମିଡାକ୍ଲୋପ୍ରିଡ୍ <ଆଇ. ଡି. 1> ଏସ୍. ଏଲ୍. 0.35 ମିଲି/ଲିଟର ପାଣି ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "cattle & buffalo": {
         "advisory": [
            "ନିଯ଼ମିତ ବ୍ଯ଼ବଧାନରେ ଗୋରୁ ଏବଂ ମଇଁଷିକୁ କୃମି ମୁକ୍ତ କରନ୍ତୁ ଏବଂ ସେମାନଙ୍କୁ ଟୀକାକରଣ ମଧ୍ଯ଼ କରନ୍ତୁ। ଯଦି 4 ବର୍ଷ ପରେ ମଧ୍ଯ଼ ପଶୁଟି ଗରମ ହେଉନାହିଁ, ତେବେ ପଶୁ ଚିକିତ୍ସକଙ୍କ ସହ ପରାମର୍ଶ କରନ୍ତୁ ଏବଂ ଯୌବନ ଆରମ୍ଭ ପାଇଁ ଡାକ୍ତରଙ୍କ ପରାମର୍ଶ ଅନୁସରଣ କରନ୍ତୁ।"
         ]
      },
      "goat & sheep": {
         "advisory": [
            "ନିର୍ଜଲୀକରଣ, ଉତ୍ତାପ ଚାପ ଏବଂ ପରଜୀବୀ ସଂକ୍ରମଣର ଲକ୍ଷଣ ପାଇଁ ନିଯ଼ମିତ ଭାବରେ ପଶୁମାନଙ୍କୁ ଯାଞ୍ଚ କରନ୍ତୁ | ଆବଶ୍ଯ଼କ ଅନୁଯାଯ଼ୀ କୃମି ପଶୁମାନଙ୍କୁ ଛାଡ଼ନ୍ତୁ ଏବଂ ସେମାନଙ୍କୁ ପାଦ ଏବଂ ପାଟି ରୋଗ, ପିପିଆର ପରି ସାଧାରଣ ରୋଗ ବିରୁଦ୍ଧରେ ଟୀକାକରଣ କରନ୍ତୁ |"
         ]
      },
      "poultry": {
         "advisory": [
            "କୁକୁଡ଼ା ଘରେ ଉଠାଯାଇଥିବା ପ୍ଲାଟଫର୍ମ ଏବଂ ଗଭୀର ଆବର୍ଜନା ବ୍ଯ଼ବସ୍ଥା ସ୍ୱଚ୍ଛତା ଏବଂ ତାପମାତ୍ରା ନିଯ଼ନ୍ତ୍ରଣ ବଜାଯ଼ ରଖିବାରେ ସାହାଯ୍ଯ଼ କରେ | ବର୍ଷା ପରେ ଅତ୍ଯ଼ଧିକ ଆର୍ଦ୍ରତା ପରିସ୍ଥିତିରେ ଜୀବାଣୁ ସୃଷ୍ଟି ନହେବା ପାଇଁ ନିଯ଼ମିତ ଭାବରେ ଘରକୁ ସଫା ଏବଂ ଜୀବାଣୁମୁକ୍ତ କରନ୍ତୁ | ଚାପ ହ୍ରାସ କରିବା ଏବଂ ଅତ୍ଯ଼ଧିକ ଉତ୍ତାପକୁ ରୋକିବା ପାଇଁ ଉପଯୁକ୍ତ ଷ୍ଟକିଂ ଘନତ୍ୱ ବଜାଯ଼ ରଖନ୍ତୁ |"
         ]
      }
   },
   "date": "05-11-2024"
}