{
   "weather_details": {
      "2024-11-06": {
         "rainfall": 0,
         "t_max": 32,
         "t_min": 22,
         "rh_max": 84,
         "rh_min": 51,
         "wind_speed": 3,
         "wind_direction": 344,
         "cloud_cover": 4
      },
      "2024-11-07": {
         "rainfall": 2,
         "t_max": 32,
         "t_min": 22,
         "rh_max": 85,
         "rh_min": 54,
         "wind_speed": 4,
         "wind_direction": 354,
         "cloud_cover": 5
      },
      "2024-11-08": {
         "rainfall": 0,
         "t_max": 32,
         "t_min": 22,
         "rh_max": 87,
         "rh_min": 55,
         "wind_speed": 4,
         "wind_direction": 355,
         "cloud_cover": 3
      },
      "2024-11-09": {
         "rainfall": 0,
         "t_max": 31,
         "t_min": 22,
         "rh_max": 87,
         "rh_min": 54,
         "wind_speed": 4,
         "wind_direction": 349,
         "cloud_cover": 3
      },
      "2024-11-10": {
         "rainfall": 0,
         "t_max": 31,
         "t_min": 21,
         "rh_max": 84,
         "rh_min": 49,
         "wind_speed": 4,
         "wind_direction": 349,
         "cloud_cover": 4
      }
   },
   "names_of_crops": [
      "ଚାଉଳ",
      "ପିଜନ୍ ମଟର",
      "ଟମାଟୋ",
      "ଓକ୍ରା",
      "ଫୁଲକୋବି",
      "କଦଳୀ",
      "ରସୁଣ",
      "ବାଇଗଣ",
      "କଦଳୀ",
      "ପେଁପେ",
      "କାକୁଡ଼ି",
      "ଗାଈ।",
      "ମଧୁର ଜଳ।"
   ],
   "general_advisory": "ପ୍ରାକ୍-ରାବି ଫସଲ ଯଥା-ଚଣା, ସବୁଜ ଚଣା, ଗହମ, ତିଲ, ସୂର୍ଯ୍ଯ଼ମୁଖୀ ଏବଂ କାକୁଡ଼ିକୁ ମଧ୍ଯ଼ମ ଜମିରେ ବୁଣିବା ପାଇଁ ଯାଆନ୍ତୁ। ମଟର, ଗାଜର, ମୂଳା ଇତ୍ଯ଼ାଦି ପନିପରିବା ଫସଲ ବୁଣିବା ପାଇଁ ଯାଆନ୍ତୁ | ଯେତେବେଳେ 80-85% ଶସ୍ଯ଼ ହାତ ଦ୍ୱାରା ହାତୁଡ଼ି ଦ୍ୱାରା କିମ୍ବା କମ୍ବାଇନ୍ ହାରଭେଷ୍ଟର କିମ୍ବା ରିପ୍ପର୍ ବ୍ଯ଼ବହାର କରି ପରିପକ୍ୱ ହୁଏ ସେତେବେଳେ ଫସଲ ଅମଳ କରନ୍ତୁ | ବ୍ଯ଼ବହାର ଉଦ୍ଦେଶ୍ଯ଼ରେ ଧାନ ଶସ୍ଯ଼କୁ 14 ପ୍ରତିଶତ ଆର୍ଦ୍ରତା ପର୍ଯ୍ଯ଼ନ୍ତ ସୂର୍ଯ୍ଯ଼ାଲୋକରେ ଶୁଖାଇବା ଆବଶ୍ଯ଼କ ଏବଂ ଉନ୍ନତ ସ୍ୱଯ଼ଂ-ଜୀବନ ପାଇଁ ବୀଜ ଉଦ୍ଦେଶ୍ଯ଼ରେ ଏହାକୁ 12 ପ୍ରତିଶତ ଆର୍ଦ୍ରତା ପର୍ଯ୍ଯ଼ନ୍ତ ଶୁଖାଇବା ଆବଶ୍ଯ଼କ। ପରିପକ୍ୱ ମକା ଏବଂ ପନିପରିବା ଅମଳ କରନ୍ତୁ ଏବଂ ଏହାକୁ ଏକ ସୁରକ୍ଷିତ ସ୍ଥାନରେ ରଖନ୍ତୁ |",
   "crops_data": {
      "rice": {
         "advisory": [
            "ଯଦି ବ୍ରାଉନ୍ ପ୍ଲାଣ୍ଟ ହପର (ବିପିଏଚ) ର ଜନସଂଖ୍ଯ଼ା ଆର୍ଥିକ ସୀମା ସ୍ତର (ଇଟିଏଲ) (ଅର୍ଥାତ୍, 5-10 ହପର/ପାହାଡ) ଅତିକ୍ରମ କରେ, ତେବେ ବିକଳ୍ପ ଆର୍ଦ୍ରତା ଏବଂ ଶୁଖାଇବା କୌଶଳ ଦ୍ୱାରା ଧାନ କ୍ଷେତର ମାଇକ୍ରୋ-ଜଳବାଯ଼ୁ ପରିବର୍ତ୍ତନ କରିବାକୁ ପରାମର୍ଶ ଦିଆଯାଇଛି (ପାଣି ଦୀର୍ଘ ସମଯ଼ ଧରି କ୍ଷେତରେ ଠିଆ ହେବା ଉଚିତ ନୁହେଁ)। ଯଦି ସମସ୍ଯ଼ା ଜାରି ରହେ, ତେବେ ଉପରୋକ୍ତ କୀଟପତଙ୍ଗ ନିଯ଼ନ୍ତ୍ରଣ ପାଇଁ ଗଛର ପାଦଦେଶରେ ଏକର ପିଛା 120 ଗ୍ରାମ୍ ପାଇମେଟ୍ରୋଜିନ୍ 50 ପ୍ରତିଶତ ଡବ୍ଲୁ. ଜି. କିମ୍ବା ଏକର ପିଛା 80 ଗ୍ରାମ୍ ଡିନୋଟେଫୁରାନ୍ 20 ପ୍ରତିଶତ ଏସ୍. ଜି. କିମ୍ବା ଏକର ପିଛା 60 ଗ୍ରାମ୍ ଫ୍ଲୋନିକାମିଡ୍ 50 ପ୍ରତିଶତ ଡବ୍ଲୁ. ଜି. କିମ୍ବା ଏକର ପିଛା 100 ମିଲି. ଟ୍ରାଇଫ୍ଲୁମେଜୋପାଇରିମ୍ 10 ପ୍ରତିଶତ ଏସ୍. ସି. ସ୍ପ୍ରେ କରନ୍ତୁ। ବିପିଏଚ ସଂକ୍ରମଣ ସମଯ଼ରେ ନାଇଟ୍ରୋଜେନ ସାର ବ୍ଯ଼ବହାରରୁ ଦୂରେଇ ରୁହନ୍ତୁ। ନେକ୍ ବ୍ଲାଷ୍ଟ ରୋଗକୁ ନିଯ଼ନ୍ତ୍ରଣ କରିବା ପାଇଁ ପ୍ରଥମେ ଧାନ କ୍ଷେତରୁ ଅତିରିକ୍ତ ପାଣି ବାହାର କରନ୍ତୁ। ହେକ୍ଟର ପିଛା 400-କ୍ରପ୍ (ଷ୍ଟେଜ୍) ଫସଲ ନିର୍ଦ୍ଦିଷ୍ଟ ଆଡଭାଇଜରି ମିଲି କିମ୍ବା ଏଜୋକ୍ସିସ୍ଟ୍ରୋବିନ୍ + ଡିଫେନୋକାନାଜୋଲ୍ @ଏକର ପିଛା 200-ମିଲି କିମ୍ବା ଟେବୁକୋନାଜୋଲ୍ + ଟ୍ରାଇଫ୍ଲୋକ୍ସିସ୍ଟ୍ରୋବିନ୍ @ଏକର ପିଛା 80-ଗ୍ରାମ୍ ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "pigeon pea": {
         "advisory": [
            "ଏହି ଫସଲ ଫୁଲର ଆରମ୍ଭ (ପନ୍ଦରରୁ ଷୋହଳ ସପ୍ତାହ) ପର୍ଯ୍ୟାୟରେ ବିଶାଳ ବନସ୍ପତି ବୃଦ୍ଧିରେ ଅଛି | ଏହି ପର୍ଯ୍ୟାୟରେ ଲିଫ୍ ୱେବର୍ ସଂକ୍ରମଣ ହୋଇପାରେ | ଅରହରରେ ପତ୍ର ୱେବରକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ 400 ମିଲି କ୍ଲୋରୋପାଇରିଫସ୍ 50 ପ୍ରତିଶତ + ସାଇପର୍ମେଥ୍ରିନ୍ 5 ପ୍ରତିଶତ ଇସି କିମ୍ବା 400 ମିଲି ପ୍ରୋଫେନୋଫସ୍ 50 ପ୍ରତିଶତ ଇସି ସହିତ ଏକର ଫସଲ କ୍ଷେତ୍ର ପିଛା 200 ଲିଟର ପାଣି ମିଶାଇ ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "tomato": {
         "advisory": [
            "ନର୍ସରୀରେ ଟମାଟୋ ଚାରା ଏକରୁ ତିନି ସପ୍ତାହ ପର୍ଯ୍ଯ଼ାଯ଼ ଅଟେ | ଚାରା ଗୁଡ଼ିକୁ ଭିଜି ଯିବାରୁ ରକ୍ଷା କରିବା ପାଇଁ ଏକ ଲିଟର ପାଣିରେ କାର୍ବେନଡାଜିମ୍ 1 ଗ୍ରାମ୍ ମିଶାଇ ଷ୍ଟ୍ରେପ୍ଟୋସାଇକ୍ଲିନ୍ 0.1 ଗ୍ରାମ୍ ସହିତ ବୀଜ ଶଯ୍ଯ଼ାକୁ ଭିଜାଇ ଦିଅନ୍ତୁ | ନର୍ସରୀରେ 3ରୁ 4 ସପ୍ତାହ ବଯ଼ସ ହେବା ପରେ ଟମାଟୋ ଚାରା ରୋପଣ ପାଇଁ ମୁଖ୍ଯ଼ କ୍ଷେତ୍ର ପ୍ରସ୍ତୁତ କରନ୍ତୁ। ମୁଖ୍ଯ଼ କ୍ଷେତର ଚୂଡ଼ାନ୍ତ ଜମି ପ୍ରସ୍ତୁତି ପରେ, ଟମାଟୋ ପାଇଁ ଧାଡ଼ି ମଧ୍ଯ଼ରେ ଧାଡ଼ି ଠାରୁ ଧାଡ଼ି ମଧ୍ଯ଼ରେ 60 ସେ. ମି. ଏବଂ ଗଛରୁ ଗଛ ମଧ୍ଯ଼ରେ 45 ସେ. ମି. ବ୍ଯ଼ବଧାନରେ ରିଙ୍ଗ କିମ୍ବା ଢିପ ପ୍ରସ୍ତୁତ କରାଯିବା ଉଚିତ। ଢିପରେ ଚାରା ରୋପଣ କରିବା ପୂର୍ବରୁ ଏକର ପିଛା 52 କିଲୋଗ୍ରାମ ଡିଏପି, 7 କିଲୋଗ୍ରାମ ଯ଼ୁରିଆ ଏବଂ 66 କିଲୋଗ୍ରାମ ଏମଓପିର ମୂଳ ମାତ୍ରା ପ୍ରଯ଼ୋଗ କରାଯିବା ଉଚିତ।"
         ]
      },
      "okra": {
         "advisory": [
            "ଓକ୍ରାରେ ଏଫିଡ୍, ଜ୍ଯାସିଡ୍, ଥ୍ରୀପ୍ ଏବଂ ଶ୍ୱେତ ମାଛି ପରି ଶୋଷକ କୀଟକୁ ପରିଚାଳନା କରିବା ପାଇଁ ନିମ୍ବ-ଆଧାରିତ କୀଟନାଶକ (ନିମ୍ବ ତେଲ 1500 ପିପିଏମ୍ ଆଜାଦିରାକ୍ଟିନ୍ @600-ମିଲି/ଏକରକୁ 200 ଲିଟର ପାଣିରେ ମିଶାଇ ସ୍ପ୍ରେ କରନ୍ତୁ କିମ୍ବା କୀଟ ନିଯ଼ନ୍ତ୍ରଣ ପାଇଁ ଏକର ପିଛା ହଳଦିଆ ଚଟପଟା ଜାଲ ଲଗାନ୍ତୁ | ଥିଯ଼ାମେଥୋକ୍ସାମ୍ 25 ପ୍ରତିଶତ ଡବ୍ଲୁଜି @ଏକର ପିଛା 40 ଗ୍ରାମ୍ କିମ୍ବା ଏସିଟାମିପ୍ରିଡ୍ 20 ପ୍ରତିଶତ ଏସପି @ଏକର ପିଛା 50 ଗ୍ରାମ୍ କିମ୍ବା ଫେନୋବୁକାର୍ବ @ଏକର ପିଛା 400-ମିଲି କିମ୍ବା ଟଲ୍ଫେନପାଇରାଡ୍ 15 ପ୍ରତିଶତ ଇସି @ଏକର ପିଛା 400-ମିଲି ପାଣିରେ ମିଶ୍ରଣ କରି ସ୍ପ୍ରେ କରନ୍ତୁ ଯେତେବେଳେ ସଂକ୍ରମଣ ଗୁରୁତର |"
         ]
      },
      "cauliflower": {
         "advisory": [
            "ଏକର ପିଛା 33 କି. ଗ୍ରା. ୟୁରିଆ ଏବଂ 23 କି. ଗ୍ରା. ଏମ୍. ଓ. ପି. ପ୍ରୟୋଗ କରନ୍ତୁ ଏବଂ <ଆଇ. ଡି. 1> ଡି. ଏ. ଟି. ରେ ହାତ କାଟିବା ଏବଂ ଏକର ପିଛା 33 କି. ଗ୍ରା. ୟୁରିଆ ଏବଂ 23 କି. ଗ୍ରା. ଏମ୍. ଓ. ପି. କୁ <ଆଇ. ଡି. 2> ଡି. ଏ. ଟି. ରେ ଶେଷ ଟପ୍ ଡ୍ରେସିଙ୍ଗ୍ ସାର ଭାବରେ ପ୍ରୟୋଗ କରନ୍ତୁ। ଯଦି ଚାରା ରୋପଣ ସମୟରେ ବୋରାକ୍ସ ପ୍ରୟୋଗ କରାଯାଇନଥାଏ, ତେବେ ବୋରାକ୍ସ ସ୍ପ୍ରେ @4 କେଜି/ଏକର କିମ୍ବା ଫୋଲିବୋର/ସଲ୍ୟୁବର ସ୍ପ୍ରେ @1.5 ଗ୍ରାମ/ଲିଟର। ପ୍ରତିରୋପଣର ଦୁଇ ସପ୍ତାହ ପରେ ଏବଂ ଦହି ତିଆରି ହେବାର ଦୁଇ ସପ୍ତାହ ପୂର୍ବରୁ ବୋରନ ମାଇକ୍ରୋ ନ୍ୟୁଟ୍ରିଏଣ୍ଟ ସିଞ୍ଚନ କରାଯିବା ଉଚିତ।"
         ]
      },
      "cabbage": {
         "advisory": [
            "ନର୍ସରୀରେ ଥିବା ବନ୍ଧାକୋବି ଚାରା ହେଉଛି ଅଙ୍କୁରୋଦଗମ ପର୍ଯ୍ୟାୟ। ନର୍ସରୀ ପ୍ରସ୍ତୁତି ଏବଂ ବନ୍ଧାକୋବି ମଞ୍ଜି ବୁଣିବା ଆରମ୍ଭ କରନ୍ତୁ। ବନ୍ଧାକୋବି ପାଇଁ ଉପଯୁକ୍ତ କିସମଗୁଡ଼ିକ ହେଉଛି ଗୋଲ୍ଡେନ୍ ଏକର, ପ୍ରାଇଡ୍ ଅଫ୍ ଇଣ୍ଡିଆ ଇତ୍ୟାଦି ଏବଂ ବିହନ ହାର ଏକର ପିଛା 200 ଗ୍ରାମ୍ | 1 ଏକର ଫସଲ ପାଇଁ ନର୍ସରୀ କ୍ଷେତ୍ର 50 ବର୍ଗ ମିଟର (ଆକାର 3 ମି. x1 ମି. x 0.15 ମି.) ହେବା ଉଚିତ। ନର୍ସରୀରେ ବୁଣିବା ପୂର୍ବରୁ ପ୍ରତି କିଲୋଗ୍ରାମ ମଞ୍ଜି ପିଛା ବାଭିଷ୍ଟିନ୍ 1 ଗ୍ରାମ୍ + ଥ୍ରିୟମ୍ 2 ଗ୍ରାମ୍ ସହିତ ମଞ୍ଜି ଚିକିତ୍ସା କରାଯିବା ଉଚିତ। ଚାରା ଗୁଡ଼ିକୁ ଭିଜି ଯିବାରୁ ରକ୍ଷା କରିବା ପାଇଁ ଏକ ଲିଟର ପାଣିରେ କାର୍ବେନଡାଜିମ୍ 1 ଗ୍ରାମ୍ ମିଶାଇ ଷ୍ଟ୍ରେପ୍ଟୋସାଇକ୍ଲିନ୍ 0.1 ଗ୍ରାମ୍ ସହିତ ବୀଜ ଶଯ୍ୟାକୁ ଭିଜାଇ ଦିଅନ୍ତୁ |"
         ]
      },
      "onion": {
         "advisory": [
            "ନର୍ସରୀରେ ଥିବା ପିଆଜର ଚାରା ଏକ ସପ୍ତାହ ପର୍ଯ୍ଯ଼ାଯ଼ ପର୍ଯ୍ଯ଼ନ୍ତ ଅଙ୍କୁରିତ ହୋଇଥାଏ। ନର୍ସରୀରେ ଆଳୁ ବୁଣିବା ଏବଂ ମଞ୍ଜି ବୁଣିବା ପାଇଁ ସମ୍ପୂର୍ଣ୍ଣ ନର୍ସରୀ ପ୍ରସ୍ତୁତି। ଅଗ୍ରିଫାଉଣ୍ଡ୍ ଲାଇଟ୍ ରେଡ୍, ଭୀମ ସୁପର୍, ଭୀମ ରେଡ୍, ଭୀମ ଶକ୍ତି ପରି କିସମ ଏବଂ ବିହନ ହାର ଏସି ପିଛା 4 ରୁ 5 କିଲୋଗ୍ରାମ। ସୂର୍ଯ୍ଯ଼କିରଣ ଏବଂ ବର୍ଷାରୁ ରକ୍ଷା ପାଇବା ପାଇଁ ନର୍ସରୀକୁ ଢାଙ୍କି ଦିଅନ୍ତୁ। 1 ଏକର ଫସଲ ପାଇଁ ନର୍ସରୀ କ୍ଷେତ୍ର 50 ବର୍ଗ ମିଟର (ଆକାର 3 ମି. x1 ମି. x 0.15 ମି.) ହେବା ଉଚିତ। ନର୍ସରୀରେ ବୁଣିବା ପୂର୍ବରୁ ପ୍ରତି କିଲୋଗ୍ରାମ ମଞ୍ଜି ପିଛା ବାଭିଷ୍ଟିନ୍ 1 ଗ୍ରାମ୍ + ଥ୍ରିଯ଼ମ୍ 2 ଗ୍ରାମ୍ ସହିତ ମଞ୍ଜି ଚିକିତ୍ସା କରାଯିବା ଉଚିତ। ଚାରା ଗୁଡ଼ିକୁ ଭିଜି ଯିବାରୁ ରକ୍ଷା କରିବା ପାଇଁ ଏକ ଲିଟର ପାଣିରେ କାର୍ବେନଡାଜିମ୍ 1 ଗ୍ରାମ୍ ମିଶାଇ ଷ୍ଟ୍ରେପ୍ଟୋସାଇକ୍ଲିନ୍ 0.1 ଗ୍ରାମ୍ ସହିତ ବୀଜ ଶଯ୍ଯ଼ାକୁ ଭିଜାଇ ଦିଅନ୍ତୁ |"
         ]
      },
      "brinjal": {
         "advisory": [
            "ବର୍ଷା ପରେ ବାଇଗଣ ଏବଂ ଲଙ୍କା ଫସଲରେ ୱିଲ୍ଟ ରୋଗ ହେବାର ସମ୍ଭାବନା ରହିଛି। ବାଇଗଣ ଏବଂ ଲଙ୍କାରେ ୱିଲ୍ଟ ରୋଗକୁ ନିଯ଼ନ୍ତ୍ରଣ କରିବା ପାଇଁ ପ୍ରଥମେ ପ୍ରଭାବିତ ଗଛଗୁଡ଼ିକୁ ଉପୁଡ଼ାଇ କ୍ଷେତରୁ ଦୂରକୁ ନଷ୍ଟ କରିଦିଅନ୍ତୁ। ଅତ୍ଯ଼ଧିକ ନାଇଟ୍ରୋଜେନ ସାର ପ୍ରଯ଼ୋଗ କରନ୍ତୁ ନାହିଁ। ଏକର ପିଛା 20 ଗ୍ରାମ ଷ୍ଟ୍ରେପ୍ଟୋସାଇକ୍ଲିନ ସହିତ 200-ମିଲି ଟିବୁକୋନାଜୋଲ ମିଶାଇ ଗଛର ମୂଳ ଅଞ୍ଚଳକୁ ଭିଜାଇ ଦିଅନ୍ତୁ। ସ୍ପ୍ରେ କରିବା ପାଇଁ ଏକର ପିଛା 200 ଲିଟର ପାଣି ବ୍ଯ଼ବହାର କରନ୍ତୁ।"
         ]
      },
      "banana": {
         "advisory": [
            "ଷ୍ଟେମ ୱିଭିଲକୁ ପରିଚାଳନା କରିବା ପାଇଁ, କଦଳୀ ବଗିଚାରେ ଏକର ପିଛା 10ରେ କସମୋଲୁର ଫେରୋମୋନ୍ ଟ୍ରାପ୍ ଲଗାନ୍ତୁ। ରୋପଣ ପୂର୍ବରୁ କଦଳୀ କାଣ୍ଡକୁ 30 ମିନିଟ୍ ପାଇଁ ଉଷୁମ ପାଣିରେ ବୁଡ଼ାଇ ଦିଅନ୍ତୁ। ଚାରା ଲଗାଇବା ପୂର୍ବରୁ ଗର୍ତ୍ତରେ 25 ଗ୍ରାମ୍ ନିମ୍ବ ପେଡିଆ କିମ୍ବା 25-50 ଗ୍ରାମ୍ ଯେକୌଣସି ଦାଣାଦାର କୀଟନାଶକ ଭର୍ତ୍ତି କରନ୍ତୁ। ପ୍ରଭାବିତ ଗଛକୁ ଖଣ୍ଡ ଖଣ୍ଡ କରି କାଟି ସୂର୍ଯ୍ଯ଼କିରଣ ତଳେ ଶୁଖାଇ ଦିଅନ୍ତୁ। କଦଳୀ ବଗିଚାକୁ ପରିଷ୍କାର ପରିଚ୍ଛନ୍ନ ରଖନ୍ତୁ।"
         ]
      },
      "papaya": {
         "advisory": [
            "ସଂକ୍ରମଣର ପ୍ରାରମ୍ଭିକ ପର୍ଯ୍ଯ଼ାଯ଼ରେ କ୍ଷୁଦ୍ର କୀଟକୁ ପରିଚାଳନା କରିବା ପାଇଁ ନିମ୍ବ-ଆଧାରିତ କୀଟନାଶକ (ନିମ୍ବ ତେଲ 1500 ପିପିଏମ @30-ମିଲି/10 ଲିଟର ପାଣି କିମ୍ବା କୀଟନାଶକ ସାବୁନ) ସ୍ପ୍ରେ କରନ୍ତୁ। ଗୁରୁତର ସଂକ୍ରମଣ କ୍ଷେତ୍ରରେ ପ୍ରୋଫେନ୍ଫସ୍ 50 ପ୍ରତିଶତ ଇସି @20-ମିଲି/10-ଲିଟର ପାଣି କିମ୍ବା ଥିଯ଼ାମେଥୋକ୍ସାମ୍ 25 ପ୍ରତିଶତ ଡବ୍ଲୁଜି @3-ଗ୍ରାମ୍/10-ଲିଟର ପାଣି ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "cucumber": {
         "advisory": [
            "କାକୁଡ଼ିରେ ଫଳ ମାଛି ପରିଚାଳନା କରିବା ପାଇଁ, 4 ଲିଟର ପାଣିରେ 400-ଗ୍ରାମ ଗୁଡ଼ ଏବଂ 8-ମିଲି ମାଲାଥିଅନ୍ କିମ୍ବା ଡି. ଡି. ଭି. ପି. ମିଶାଇ ଏକ ବିଷାକ୍ତ ଚାରା ପ୍ରସ୍ତୁତ କରନ୍ତୁ। ଏହି ମିଶ୍ରଣକୁ ପ୍ଲାଷ୍ଟିକ୍ କପ୍ କିମ୍ବା ମାଟି ପାତ୍ରରେ ରଖନ୍ତୁ @80-ସଂଖ୍ଯ଼ା/ଏକର। ଫଳ ମାଛିମାନେ ଏହା ପ୍ରତି ଆକର୍ଷିତ ହେବେ ଏବଂ ଶେଷରେ ବିଷ ଜାଲରେ ପଡ଼ି ମୃତ୍ଯ଼ୁବରଣ କରିବେ।"
         ]
      },
      "cow": {
         "advisory": [
            "ଯଦି ଆପଣଙ୍କ ଗୃହପାଳିତ ପଶୁ ଖାଦ୍ଯ଼ରୁ ବଞ୍ଚିତ ହେଉଛି, ଦୁର୍ବଳ, ଦୁର୍ବଳ, ତରଳ ଝାଡ଼ା, କ୍ଷୀର ଉତ୍ପାଦନ କମ୍, ଆଖିରେ ଶୁଷ୍କତା ଏବଂ ପ୍ରତିବନ୍ଧକ ଅବସ୍ଥା ଦେଖାଯାଉଛି, ତେବେ ଏହା ପରଜୀବୀ ସଂକ୍ରମଣରେ ପୀଡ଼ିତ ହେବାର ସମସ୍ତ ସମ୍ଭାବନା ଅଛି | ଏହି କୃମି କିମ୍ବା ପରଜୀବୀ ପଶୁମାନଙ୍କର ଜୀବନୀଶକ୍ତି ଏବଂ ଉତ୍ପାଦନଶୀଳତାକୁ ହ୍ରାସ କରିଥାଏ। ତେଣୁ, କୃଷକମାନଙ୍କୁ ନିକଟତମ ଏଲ. ଏ. ସି., ପଶୁ ଚିକିତ୍ସା ଔଷଧ ଦୋକାନରେ ନିଯ଼ମିତ ବ୍ଯ଼ବଧାନରେ ସେମାନଙ୍କ ପଶୁମାନଙ୍କର ନମୁନା ପରୀକ୍ଷା କରିବାକୁ ପରାମର୍ଶ ଦିଆଯାଇଛି।"
         ]
      },
      "fresh water": {
         "advisory": [
            "ପୋଖରୀରେ ଅମ୍ଳଜାନର ଅଭାବ ହେଲେ, ମାଛଗୁଡ଼ିକ ଭୂପୃଷ୍ଠ ଜଳ ଉପରକୁ ଆସି ସେମାନଙ୍କ ମୁହଁ ଦେଇ ଘୁଞ୍ଚିବାକୁ ଆରମ୍ଭ କରିବେ | ଆଦର୍ଶ ଦ୍ରବୀଭୂତ ଅମ୍ଳଜାନ ପ୍ରାଯ଼ 5 ମି. ଗ୍ରା./ଲି.। ଏକ ଏରେଟର ବ୍ଯ଼ବହାର କରି ଏହାକୁ ବଜାଯ଼ ରଖାଯାଇପାରିବ। ବାଯ଼ୁ ସଞ୍ଚାରଣର ଏକ ସରଳ ଉପାଯ଼ ହେଉଛି ପୁଷ୍କରିଣୀର ଜଳ ସଞ୍ଚାଳନ କରିବା। ଏହା ଏକ ପମ୍ପ ବ୍ଯ଼ବହାର କରି କରାଯାଇପାରିବ ଯାହା ପୁଷ୍କରିଣୀର ତଳ ପୃଷ୍ଠରୁ ପାଣି ନେଇ ସେହି ପୋଖରୀରେ ଛିଞ୍ଚି ପାରିବ |"
         ]
      }
   },
   "date": "05-11-2024"
}