{
   "weather_details": {
      "01.11.2024": {
         "rainfall": 8,
         "t_max": 32,
         "t_min": 24,
         "rh_max": 0,
         "rh_min": 0,
         "wind_speed": 0,
         "wind_direction": 0,
         "cloud_cover": 0
      },
      "02.11.2024": {
         "rainfall": 1,
         "t_max": 33,
         "t_min": 23,
         "rh_max": 0,
         "rh_min": 0,
         "wind_speed": 0,
         "wind_direction": 0,
         "cloud_cover": 0
      },
      "03.11.2024": {
         "rainfall": 3,
         "t_max": 33,
         "t_min": 23,
         "rh_max": 0,
         "rh_min": 0,
         "wind_speed": 0,
         "wind_direction": 0,
         "cloud_cover": 0
      },
      "04.11.2024": {
         "rainfall": 0,
         "t_max": 33,
         "t_min": 21,
         "rh_max": 0,
         "rh_min": 0,
         "wind_speed": 0,
         "wind_direction": 0,
         "cloud_cover": 0
      },
      "05.11.2024": {
         "rainfall": 0,
         "t_max": 0,
         "t_min": 0,
         "rh_max": 0,
         "rh_min": 0,
         "wind_speed": 0,
         "wind_direction": 0,
         "cloud_cover": 0
      }
   },
   "names_of_crops": [
      "ଚାଉଳ",
      "ମକା",
      "ଡାଲିଗୁଡ଼ିକ",
      "ସୋରିଷ",
      "ଫୁଲକୋବି",
      "କଦଳୀ",
      "ଗାଈ।",
      "ମଇଁଷି।"
   ],
   "general_advisory": "ଆଇଏମଡିରୁ ମିଳିଥିବା ପାଞ୍ଚ ଦିନର ପାଣିପାଗ ପୂର୍ବାନୁମାନ ଆଧାରରେ, କୃଷକମାନେ ଆନ୍ତଃସାଂସ୍କୃତିକ କାର୍ଯ୍ଯ଼କଳାପ, ପରିପକ୍ୱ ଉତ୍ପାଦ ଅମଳ ଏବଂ ଆବଶ୍ଯ଼କ ଅନୁଯାଯ଼ୀ ପରବର୍ତ୍ତୀ ପାଞ୍ଚ ଦିନ ମଧ୍ଯ଼ରେ ଷ୍ଟିକର ସହିତ ମିଶ୍ରିତ କୀଟନାଶକ ପ୍ରଯ଼ୋଗ ଜାରି ରଖିପାରିବେ। ରବି ଫସଲ ପାଇଁ କ୍ଷେତ ପ୍ରସ୍ତୁତି ଆରମ୍ଭ କରାଯିବା ଉଚିତ। ବିଭିନ୍ନ କୀଟପତଙ୍ଗର ପ୍ରକୋପକୁ ନିଯ଼ନ୍ତ୍ରଣ କରିବା ପାଇଁ ସମସ୍ତ ଫସଲ ଉପରେ ନିଯ଼ମିତ ନଜର ରଖିବା ଉଚିତ।",
   "crops_data": {
      "rice": {
         "advisory": [
            "ନେକ୍ ବ୍ଲାସ୍ଟ୍ ରୋଗ ପରିଚାଳନା ପାଇଁ ଟ୍ରାଇସାଇକ୍ଲାଜୋଲ୍ (ବିମ୍) @0.6 ଗ୍ରାମ୍/ଲିଟର ପାଣି (120 ଗ୍ରାମ୍/ଏସି) ଲଗାନ୍ତୁ।",
            "ବାଷ୍ପ ଛେଦକ ଏବଂ ପତ୍ର ଫୋଲଡରକୁ ନିଯ଼ନ୍ତ୍ରଣ କରିବା ପାଇଁ କ୍ଲୋରପିରିଓଫସ୍/ପ୍ରୋଫେନୋଫସ୍ @2 ମିଲି/ଲିଟର ପାଣି ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "maize": {
         "advisory": [
            "ଆମେରିକୀଯ଼ କୋବ୍ ବୋରର୍ଃ ଆମେରିକୀଯ଼ କୋବ୍ ବୋରର୍ ସଂକ୍ରମଣକୁ ନିଯ଼ନ୍ତ୍ରଣ କରିବା ପାଇଁ 10 ଲିଟର ପାଣି ସହିତ ଫ୍ଲୁବେଣ୍ଡିଆମାଇଡ୍ 39.35% SC @4 ମିଲି ମିଶାନ୍ତୁ।"
         ]
      },
      "pulses": {
         "advisory": [
            "ବର୍ତ୍ତମାନର ପାଣିପାଗ ହର୍ସ ଗ୍ରାମ୍ ଏବଂ ବେଙ୍ଗଲ ଗ୍ରାମ୍ ବୁଣିବା ପାଇଁ ଅନୁକୂଳ ଅଟେ। ବୁଣିବା ପୂର୍ବରୁ, ମଞ୍ଜି ଗୁଡ଼ିକୁ ଫଙ୍ଗିସାଇଡ୍ ଦ୍ୱାରା ଚିକିତ୍ସା କରାଯିବା ଉଚିତ ଏବଂ ତା 'ପରେ ଗଣ୍ଠିକୁ ବଢ଼ାଇବା ପାଇଁ 20 ଗ୍ରାମ୍/କେଜି ମଞ୍ଜି ସହିତ ରାଇଜୋବିୟମ୍ ସଂସ୍କୃତି କରାଯିବା ଉଚିତ।"
         ]
      },
      "mustard": {
         "advisory": [
            "ଉପଲବ୍ଧ ମୃତ୍ତିକା ଆର୍ଦ୍ରତାର ଲାଭ ଉଠାଇ, ସର୍ବାଧିକ ଉତ୍ପାଦନ ପାଇବା ପାଇଁ ଜମି ପ୍ରସ୍ତୁତି ଏବଂ ଫସଲ ବୁଣିବା ଆରମ୍ଭ କରାଯିବା ଉଚିତ।",
            "ଉପଯୁକ୍ତ କିସମଃ ତୋରିଆ-ଅନୁରାଧା, ପାର୍ବତୀ, ସୁଶ୍ରୀ, ଭାରତୀଯ଼ ସୋରିଷ-ପୁସା ବୋଲ୍ଡ, ପୁସା ଜଯ଼ କିଷାନ। ବୀଜ ହାର-8-10 କିଲୋଗ୍ରାମ/ହେକ୍ଟର, ବ୍ଯ଼ବଧାନ-30 ସେ. ମି. x 10 ସେ. ମି.।",
            "ଚାରା ରୋପଣ ପର୍ଯ୍ୟାୟରେ ସୋରିଷ ଏବଂ ତୋରିଆରେ କୀଟପତଙ୍ଗକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ ନିମ୍ବ ତେଲ 5 ମିଲି/ଲିଟର ପାଣି ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "cauliflower": {
         "advisory": [
            "ନର୍ସରୀ ଶଯ୍ଯ଼ା ପ୍ରସ୍ତୁତ କରନ୍ତୁ, ଯାହାର ପ୍ରତ୍ଯ଼େକଟିର ଲମ୍ବ 3 ମିଟର, ଓସାର 1 ମିଟର ଏବଂ ଉଚ୍ଚତା 15-20 ସେ. ମି.। ବୁଣିବାର ସାତ ଦିନ ପୂର୍ବରୁ ପ୍ରତ୍ଯ଼େକ ନର୍ସରୀ ଶଯ୍ଯ଼ାରେ ଭଲ ଭାବେ ଅପଘଟିତ ହୋଇଥିବା ଏଫ. ୱାଇ. ଏମ୍. ଏବଂ 150 ଗ୍ରାମ କ୍ଲୋରପାଇରିଫସ୍ ଧୂଳି ଲଗାନ୍ତୁ।",
            "ଫୁଲକୋବି (60-75 ଦିନ)-ଏଚ. ୱାଇ. ଭି.: ପୁସା ଆର୍ଲି ସିନ୍ଥେଟିକ୍, ଆର୍ଲି କୁଆଁରୀ, କାର୍ତ୍ତିକ, ପୁସା ଦୀପାଲୀ, ଆର୍କା କ୍ରାନ୍ତି, ଆର୍କା ସୁରଥୀ, ହାଇବ୍ରିଡ୍ଃ ଶ୍ୱେତା, ପୁସ୍ପାଗିରି, ତୁସାର ଗୁଡମ୍ଯ଼ାନ୍ ଇତ୍ଯ଼ାଦି |"
         ]
      },
      "cabbage": {
         "advisory": [
            "ନର୍ସରୀ ଶଯ୍ଯ଼ା ପ୍ରସ୍ତୁତ କରନ୍ତୁ, ଯାହାର ପ୍ରତ୍ଯ଼େକଟିର ଲମ୍ବ 3 ମିଟର, ଓସାର 1 ମିଟର ଏବଂ ଉଚ୍ଚତା 15-20 ସେ. ମି.। ବୁଣିବାର ସାତ ଦିନ ପୂର୍ବରୁ ପ୍ରତ୍ଯ଼େକ ନର୍ସରୀ ଶଯ୍ଯ଼ାରେ ଭଲ ଭାବେ ଅପଘଟିତ ହୋଇଥିବା ଏଫ. ୱାଇ. ଏମ୍. ଏବଂ 150 ଗ୍ରାମ କ୍ଲୋରପାଇରିଫସ୍ ଧୂଳି ଲଗାନ୍ତୁ।",
            "ବନ୍ଧାକୋବି (60-75 ଦିନ)-ଏଚ. ୱାଇ. ଭି.: ଗୋଲ୍ଡେନ ଏକର, ପ୍ରାଇଡ୍ ଅଫ୍ ଇଣ୍ଡିଆ, ପୁସା ସମ୍ବନ୍ଧ ହାଇବ୍ରିଡ୍ଃ ଗ୍ରୀନ୍ ବଲ୍, ପ୍ରିଯ଼ା, ଜେନିଥ୍ ଗୋଲ୍ଡ ଷ୍ଟାର, ପ୍ରାଗାଟିକ୍ ଇତ୍ଯ଼ାଦି।"
         ]
      },
      "cow": {
         "advisory": [
            "ନିର୍ଜଲୀକରଣ, ଉତ୍ତାପ ଚାପ ଏବଂ ପରଜୀବୀ ସଂକ୍ରମଣର ଲକ୍ଷଣ ପାଇଁ ନିୟମିତ ଭାବରେ ପଶୁମାନଙ୍କୁ ଯାଞ୍ଚ କରନ୍ତୁ | ଆବଶ୍ୟକ ଅନୁଯାୟୀ କୃମି ପଶୁମାନଙ୍କୁ ଛାଡ଼ନ୍ତୁ ଏବଂ ସେମାନଙ୍କୁ ପାଦ ଏବଂ ପାଟି ରୋଗ, ପିପିଆର ପରି ସାଧାରଣ ରୋଗ ବିରୁଦ୍ଧରେ ଟୀକାକରଣ କରନ୍ତୁ |"
         ]
      },
      "buffalo": {
         "advisory": [
            "ନିର୍ଜଲୀକରଣ, ଉତ୍ତାପ ଚାପ ଏବଂ ପରଜୀବୀ ସଂକ୍ରମଣର ଲକ୍ଷଣ ପାଇଁ ନିଯ଼ମିତ ଭାବରେ ପଶୁମାନଙ୍କୁ ଯାଞ୍ଚ କରନ୍ତୁ | ଆବଶ୍ଯ଼କ ଅନୁଯାଯ଼ୀ କୃମି ପଶୁମାନଙ୍କୁ ଛାଡ଼ନ୍ତୁ ଏବଂ ସେମାନଙ୍କୁ ପାଦ ଏବଂ ପାଟି ରୋଗ, ପିପିଆର ପରି ସାଧାରଣ ରୋଗ ବିରୁଦ୍ଧରେ ଟୀକାକରଣ କରନ୍ତୁ |"
         ]
      }
   },
   "date": "05-11-2024"
}