{
   "weather_details": {
      "06/11/2024": {
         "rainfall": 2,
         "t_max": 31,
         "t_min": 24,
         "rh_max": 84,
         "rh_min": 57,
         "wind_speed": 10,
         "wind_direction": 3,
         "cloud_cover": 5
      },
      "07/11/2024": {
         "rainfall": 0,
         "t_max": 32,
         "t_min": 23,
         "rh_max": 85,
         "rh_min": 59,
         "wind_speed": 10,
         "wind_direction": 11,
         "cloud_cover": 4
      }
   },
   "names_of_crops": [
      "ଧାନ।",
      "ରବି ଡାଲି",
      "ଆଖୁ",
      "ସବୁଜ ଚଣା",
      "କଳା ଚଣା",
      "ଚିନାବାଦାମ",
      "ବାଇଗଣ",
      "ଟମାଟୋ",
      "ଲଙ୍କା",
      "ମାରିଗୋଲ୍ଡ",
      "ଗୋଲାପ।",
      "ମତ୍ସ୍ୟଚାଷ"
   ],
   "general_advisory": "85 ପ୍ରତିଶତ ପରିପକ୍ୱତା ହାସଲ କରିଥିବା ଏବଂ 14 ପ୍ରତିଶତ ଆର୍ଦ୍ରତା ପର୍ଯ୍ଯ଼ନ୍ତ ଶୁଖିଯାଇଥିବା ଧାନ ଫସଲ ଅମଳ କରନ୍ତୁ। ସ୍ୱଳ୍ପକାଳୀନ ରବି ଫସଲ ଚାଷ କରନ୍ତୁ ଏବଂ ନିଯ଼ମିତ ଭାବେ କୀଟ ନିରୀକ୍ଷଣ କରନ୍ତୁ। ସୂକ୍ଷ୍ମ ପୋଷକ ତତ୍ତ୍ୱର ଅଭାବ ପାଇଁ ସୂକ୍ଷ୍ମ ପୋଷକ ତତ୍ତ୍ୱ ପ୍ରଯ଼ୋଗ କରନ୍ତୁ।",
   "crops_data": {
      "paddy": {
         "advisory": [
            "ନିଯ଼ମିତ ଭାବରେ କୀଟପତଙ୍ଗ ଏବଂ ରୋଗ ପାଇଁ ଉପଯୁକ୍ତ କ୍ଷେତ୍ର ତଦାରଖ କରନ୍ତୁ ଏବଂ ସେହି ଅନୁଯାଯ଼ୀ ଉପଯୁକ୍ତ ଉଦ୍ଭିଦ ସୁରକ୍ଷା ପଦକ୍ଷେପ ନିଅନ୍ତୁ |"
         ]
      },
      "rabi pulses": {
         "advisory": [
            "ଉପଲବ୍ଧ ମୃତ୍ତିକା ଆର୍ଦ୍ରତା ବ୍ଯ଼ବହାର କରି ସବୁଜ ଚଣା, କଳା ଚଣା, କାଉପି, ଫିଲ୍ଡ ମଟର, ଡାଲି ଭଳି ସ୍ୱଳ୍ପକାଳୀନ ରବି ଫସଲ ଚାଷ କରିବାକୁ କୃଷକମାନଙ୍କୁ ପରାମର୍ଶ ଦିଆଯାଇଛି।"
         ]
      },
      "sugarcane": {
         "advisory": [
            "ଆଖୁ ପରିପକ୍ୱ ହେବା ପର୍ଯ୍ଯ଼ନ୍ତ ବିଶାଳ ଅଭିବୃଦ୍ଧି ପର୍ଯ୍ଯ଼ାଯ଼ରେ ଅଛି |"
         ]
      },
      "green gram": {
         "advisory": [
            "ସବୁଜ ଚଣା ପାଇଁ ଟି-9, ପି. ୟୁ. 11, ପି. ୟୁ. 19 ଏବଂ ପି. ୟୁ. 30 ଭଳି ଅଧିକ ଉତ୍ପାଦନକ୍ଷମ କିସମ ଚାଷ କରନ୍ତୁ।"
         ]
      },
      "black gram": {
         "advisory": [
            "କଳା ଚଣା ପାଇଁ ଟି-9, ପି. ଯ଼ୁ. 11, ପି. ଯ଼ୁ. 19 ଏବଂ ପି. ଯ଼ୁ. 30 ଭଳି ଅଧିକ ଉତ୍ପାଦନକ୍ଷମ କିସମ ଚାଷ କରନ୍ତୁ।"
         ]
      },
      "groundnut": {
         "advisory": [
            "ଓଡ଼ିଶା ପରିସ୍ଥିତି ପାଇଁ ଉପଯୁକ୍ତ ଚିନାବାଦାମ କିସମ ବ୍ଯ଼ବହାର କରନ୍ତୁ ଯେପରିକି କଳିଙ୍ଗ ଚିନାବାଦାମ 101, ଦେବୀ, ଏକ ଏକର ପାଇଁ 40 କର୍ଣ୍ଣଲ ଆବଶ୍ଯ଼କ |"
         ]
      },
      "brinjal": {
         "advisory": [
            "ବାଇଗଣ ଏବଂ ଟମାଟୋରେ ୱିଲ୍ଟ ଏବଂ ରଟ୍ ରୋଗକୁ ପରିଚାଳନା କରିବା ପାଇଁ, ପ୍ଲାଣ୍ଟୋମାଇସିନ୍ ର ଏକ ଦ୍ରବଣ ସହିତ ମୂଳ ଅଞ୍ଚଳକୁ ଭିଜାଇ ଦିଅନ୍ତୁ |"
         ]
      },
      "tomato": {
         "advisory": [
            "ବାଇଗଣ ଏବଂ ଟମାଟୋରେ ୱିଲ୍ଟ ଏବଂ ରଟ୍ ରୋଗକୁ ପରିଚାଳନା କରିବା ପାଇଁ, ପ୍ଲାଣ୍ଟୋମାଇସିନ୍ ର ଏକ ଦ୍ରବଣ ସହିତ ମୂଳ ଅଞ୍ଚଳକୁ ଭିଜାଇ ଦିଅନ୍ତୁ |"
         ]
      },
      "chilli": {
         "advisory": [
            "ଥ୍ରିପ୍ସ ସଂକ୍ରମଣକୁ ପରିଚାଳନା କରିବା ପାଇଁ, 8 nos./acre ରେ ବ୍ଲୁ ଷ୍ଟିକି ଟ୍ରାପ୍ ସ୍ଥାପନ କରନ୍ତୁ।"
         ]
      },
      "marigold": {
         "advisory": [
            "ମାରିଗୋଲ୍ଡ ଏବଂ ଗୋଲାପ ପରି ଫୁଲରେ ରେଡ୍ ସ୍ପାଇଡର ମାଇଟ୍କୁ ପରିଚାଳନା କରିବା ପାଇଁ, 80 ପ୍ରତିଶତ ୱେଟେବଲ୍ ସଲଫର୍ ଡବ୍ଲ୍ଯ଼ୁ. ପି. ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "rose": {
         "advisory": [
            "ମାରିଗୋଲ୍ଡ ଏବଂ ଗୋଲାପ ପରି ଫୁଲରେ ରେଡ୍ ସ୍ପାଇଡର ମାଇଟ୍କୁ ପରିଚାଳନା କରିବା ପାଇଁ, 80 ପ୍ରତିଶତ ୱେଟେବଲ୍ ସଲଫର୍ ଡବ୍ଲ୍ଯ଼ୁ. ପି. ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "fisheries": {
         "advisory": [
            "ଶୀତ ଋତୁରେ ମାଛରେ ବିଭିନ୍ନ ଫଙ୍ଗଲ୍, ବ୍ୟାକ୍ଟେରିଆ ଏବଂ ପରଜୀବୀ ରୋଗ ଦେଖା ଦେଇପାରେ। ସିଫାକ୍ସ ଦ୍ୱାରା ପୋଖରୀକୁ ଚିକିତ୍ସା କରନ୍ତୁ।"
         ]
      }
   },
   "date": "05-11-2024"
}