{
   "weather_details": {
      "06-11-2024": {
         "rainfall": 0,
         "t_max": 33,
         "t_min": 22,
         "rh_max": 85,
         "rh_min": 51,
         "wind_speed": 5,
         "wind_direction": 344,
         "cloud_cover": 4
      },
      "07-11-2024": {
         "rainfall": 0,
         "t_max": 33,
         "t_min": 22,
         "rh_max": 87,
         "rh_min": 52,
         "wind_speed": 7,
         "wind_direction": 357,
         "cloud_cover": 3
      },
      "08-11-2024": {
         "rainfall": 0,
         "t_max": 32,
         "t_min": 22,
         "rh_max": 87,
         "rh_min": 54,
         "wind_speed": 7,
         "wind_direction": 357,
         "cloud_cover": 3
      },
      "09-11-2024": {
         "rainfall": 0,
         "t_max": 32,
         "t_min": 22,
         "rh_max": 87,
         "rh_min": 53,
         "wind_speed": 6,
         "wind_direction": 357,
         "cloud_cover": 4
      },
      "10-11-2024": {
         "rainfall": 0,
         "t_max": 32,
         "t_min": 21,
         "rh_max": 87,
         "rh_min": 47,
         "wind_speed": 6,
         "wind_direction": 357,
         "cloud_cover": 4
      }
   },
   "names_of_crops": [
      "ଚାଉଳ",
      "ସୋରିଷ ଓ ସୋରିଷ",
      "ପନିପରିବା",
      "ଫଳ",
      "ମତ୍ସ୍ୟଚାଷ",
      "ପଶୁପାଳନ"
   ],
   "general_advisory": "ଗଚ୍ଛିତ ମୃତ୍ତିକାର ଆର୍ଦ୍ରତାର ଲାଭ ଉଠାଇ କୃଷକମାନେ ସୋରିଷ, ତୋରିଆ, ସୂର୍ଯ୍ୟମୁଖୀ ଭଳି ରବି ଫସଲ ପାଇଁ ଜମି ପ୍ରସ୍ତୁତି ଆରମ୍ଭ କରିବା ଉଚିତ ଏବଂ ସର୍ବୋତ୍ତମ ଉତ୍ପାଦନ ପାଇବା ପାଇଁ ଶୀଘ୍ର ବୁଣିବା ଶେଷ କରିବା ଉଚିତ। ବିପିଏଚ, ଡବ୍ଲ୍ୟୁ. ବି. ପି. ଏଚ., ଲିଫ୍ ଫୋଲଡର, ଗୁଣ୍ଡି ବଗ ଏବଂ ଚାଉଳରେ ବି. ଏଲ. ବି. ଏବଂ ବିସ୍ଫୋରଣର ଘଟଣା ଉପରେ ନଜର ରଖିବା ପାଇଁ ନିୟମିତ ଭାବେ କ୍ଷେତକୁ ଯାଆନ୍ତୁ। ପଶୁମାନଙ୍କର ଟୀକାକରଣ ଏବଂ କୃମି ଦୂରୀକରଣ ପାଇଁ ନିକଟସ୍ଥ ପଶୁ ଚିକିତ୍ସକଙ୍କ ପରାମର୍ଶ ନିଅନ୍ତୁ।",
   "crops_data": {
      "rice": {
         "advisory": [
            "ପ୍ରଚଳିତ ଉଷ୍ମ ଏବଂ ଆର୍ଦ୍ର ପାଗ ଧାନରେ ବିଏଲବି ଏବଂ ନେକ ବ୍ଲାଷ୍ଟ ରୋଗର ଘଟଣା ବୃଦ୍ଧି କରିପାରେ ତେଣୁ ପ୍ରଯ଼ୋଗ କରନ୍ତୁ (ଟେବୁକୋନାଜୋଲ 50 ପ୍ରତିଶତ + ଟ୍ରାଇଫ୍ଲୋକ୍ସିସ୍ଟ୍ରୋବିନ୍ 25 ପ୍ରତିଶତ ଡବ୍ଲୁଜି) @0.4 ଗ୍ରାମ/ଲିଟର ପାଣି।",
            "ଘୂର୍ଣ୍ଣିବଳଯ଼ ଘଟଣା ପରେ ପ୍ରଚଳିତ ମାଇକ୍ରୋକ୍ଲାଇମେଟ୍ ଅବସ୍ଥା ପ୍ଲାଣ୍ଟ ହପର୍ସର ଜନସଂଖ୍ଯ଼ା ବୃଦ୍ଧି କରିପାରେ | ଭୂପୃଷ୍ଠରେ ସୂର୍ଯ୍ଯ଼କିରଣର ଉପଯୁକ୍ତ ପ୍ରବେଶ ଏବଂ ଉନ୍ନତ ବାଯ଼ୁ ସଞ୍ଚାଳନ ପାଇଁ ପ୍ରତି 3 ମିଟରରେ/8-10 ଧାଡ଼ି ପରେ ପଡ଼ିଆରେ ଗଳି ତିଆରି କରନ୍ତୁ। ସଂକ୍ରମଣର ପ୍ରାରମ୍ଭିକ ପର୍ଯ୍ଯ଼ାଯ଼ରେ, ଫସଲର ସୁରକ୍ଷା ପାଇଁ ଡିନୋଟେଫୁରାନ @80 ଗ୍ରାମ/ଏକର ଡବ୍ଲୁ. ଜି. ସହିତ ନିମ୍ବ ତେଲ ଫର୍ମ୍ଯ଼ୁଲେସନ୍ @600 ମିଲି/ଏକର ସହିତ ଗଛର ମୂଳକୁ ଲକ୍ଷ୍ଯ଼ କରି ଲଗାନ୍ତୁ। କୀଟନାଶକ ସିଞ୍ଚନ ଗଛର ମୂଳ ଅଂଶକୁ ଲକ୍ଷ୍ଯ଼ କରି କରାଯିବା ଉଚିତ।",
            "ଯଦି ବିଳମ୍ବରେ ପ୍ରତିରୋପଣ କରାଯାଇଥିବା ଚାଉଳ ପି. ଆଇ./ଫୁଲର ପ୍ରାରମ୍ଭିକ ପର୍ଯ୍ଯ଼ାଯ଼ରେ ଥାଏ, ତେବେ ଏକର ପିଛା ଏମ୍. ଓ. ପି. 12 କି. ଜି. ର ଅତିରିକ୍ତ ମାତ୍ରା ପ୍ରଯ଼ୋଗ କିମ୍ବା ଏମ୍. ଓ. ପି. (<ଆଇ. ଡି. 2>) @<ଆଇ. ଡି. 3> ଗ୍ରାମ୍/ଲିଟର ପାଣିର ପତ୍ର ସ୍ପ୍ରେ ସହିତ 20 ପ୍ରତିଶତ ବୋରନ୍ @<ଆଇ. ଡି. 1> ପାଣିର ସୁପାରିଶ କରାଯାଇଥାଏ।"
         ]
      },
      "rapeseed and mustard": {
         "advisory": [
            "ଗଚ୍ଛିତ ମୃତ୍ତିକାର ଆର୍ଦ୍ରତାର ଲାଭ ଉଠାଇ, ସର୍ବୋତ୍ତମ ଉତ୍ପାଦନ ପାଇବା ପାଇଁ ଜମି ପ୍ରସ୍ତୁତି ଏବଂ ଫସଲ ବୁଣିବା ଶୀଘ୍ର ଶେଷ କରାଯିବା ଉଚିତ।",
            "ଉପଯୁକ୍ତ କିସମଃ ତୋରିଆ-ଅନୁରାଧା, ପାର୍ବତୀ, ସୁଶ୍ରୀ, ଭାରତୀଯ଼ ସୋରିଷ-ଏନ୍. ଆର୍. ସି. ଏଚ୍. ବି. 101, ମାହିକୋ ବୋଲ୍ଡ, ଜେ. ଡି. 6",
            "ବୀଜ ହାର-8-10 କିଲୋଗ୍ରାମ/ହେକ୍ଟର, ବ୍ଯ଼ବଧାନ-30 ସେ. ମି. x 10 ସେ. ମି.",
            "ସାର ମାତ୍ରା-ତୋରିଆ @60:30:30 N-P2O5-K2O କିଲୋଗ୍ରାମ/ହେକ୍ଟର, ସୋରିଷ @80:40:40 N-P2O5-K2O କିଲୋଗ୍ରାମ/ହେକ୍ଟର, 50 ପ୍ରତିଶତ N ଏବଂ ସମସ୍ତ P2O5 ଏବଂ K2O ସାରକୁ ମୂଳ ସାର ଭାବେ ବ୍ଯ଼ବହାର କରିବା ଉଚିତ।"
         ]
      },
      "vegetables": {
         "advisory": [
            "ବାଇଗଣରେ ଶୁଖିଯିବା କିମ୍ବା ଆଂଶିକ ଶୁଖିଯିବା ରୋକିବା ପାଇଁ କ୍ଷେତରୁ ଅତିରିକ୍ତ ପାଣି ବାହାର କରନ୍ତୁ। ନିମ୍ କିମ୍ବା କରଞ୍ଜା କେକ୍ 1 ଗ୍ରାମ୍/ଏକରରେ ଲଗାନ୍ତୁ, ଟେବୁକୋନାଜୋଲ୍ 1 ମିଲି/ଲିଟରରେ ଭିଜାଇବାକୁ ପରାମର୍ଶ ଦିଆଯାଇପାରେ |",
            "ଯଦି ପ୍ରାରମ୍ଭିକ ଅବଧି କିସମ ପନିପରିବାର ଚାରା ନଷ୍ଟ ହୋଇଯାଏ, ତେବେ ଚାରା ଗୁଡ଼ିକୁ (ମେଟାଲାକ୍ସିଲ + ମାନକୋଜେବ) 2 ଗ୍ରାମ/ଲି ପାଣିରେ ଏବଂ ପ୍ଲାଣ୍ଟୋମାଇସିନ ଲିଟର ପିଛା 1 ଗ୍ରାମ ପାଣିରେ ଚିକିତ୍ସା କରନ୍ତୁ।"
         ]
      },
      "fruit": {
         "advisory": [
            "ନଡ଼ିଆ-ନୂତନ ଭାବରେ ରୋପଣ କରାଯାଇଥିବା ନଡ଼ିଆ ଗଛରେ ପତ୍ର ବ୍ଲାଇଟର ପ୍ରକୋପକୁ ହ୍ରାସ କରିବା ପାଇଁ (ମେଟାଲାକ୍ସିଲ + ମାନକୋଜେବ) @2 ଗ୍ରାମ୍/ଲିଟର ପାଣି ସିଞ୍ଚନ କରିବାକୁ ପରାମର୍ଶ ଦିଆଯାଇଛି।",
            "ପେପା-ପେପା ଲିଫ୍ କର୍ଲ ଭାଇରସର ଭେକ୍ଟର (ହ୍ୱାଇଟ୍ଫ୍ଲାଇ) କୁ ଧରିବା ପାଇଁ ହଳଦିଆ ଷ୍ଟିକି ଫାନ୍ଦ ଲଗାନ୍ତୁ। ଶ୍ୱେତ ମାଛି ନିଯ଼ନ୍ତ୍ରଣ ପାଇଁ ନିମ୍ବ ତେଲ ଗଠନ 1500 ପିପିଏମ @3ml ଲିଟର ପାଣି ଏବଂ ଫ୍ଲୋନିକାମିଡ 50 ଡବ୍ଲୁଜି @0.3g/lit ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "pisciculture": {
         "advisory": [
            "ପ୍ରବଳ ବର୍ଷା ପରେ ମାଛ ପୋଖରୀଗୁଡ଼ିକର ଜଳର ଗୁଣବତ୍ତାରେ ପରିବର୍ତ୍ତନ କରାଯାଇପାରେ, ତେଣୁ ପାଣିର ପିଏଚ୍ ପରୀକ୍ଷା ଏବଂ ଆବଶ୍ଯ଼କତା-ଆଧାରିତ ପ୍ରଯ଼ୋଗ @100kg ଚୁନ/ଏକରକୁ 3 ଖଣ୍ଡରେ (40:40:20) 2 ଦିନ ବ୍ଯ଼ବଧାନରେ ସୁପାରିଶ କରାଯାଏ।"
         ]
      },
      "livestock": {
         "advisory": [
            "ପଶୁମାନଙ୍କୁ ନିଯ଼ମିତ ଭାବରେ ଲୁଣ ସହିତ ଖଣିଜ ମିଶ୍ରଣ ଦିଆଯିବା ଉଚିତ ଏବଂ ପଶୁମାନଙ୍କର ଶକ୍ତି ଆବଶ୍ଯ଼କତାକୁ ପୂରଣ କରିବା ପାଇଁ ଦୈନିକ ରାସନରେ ଗହମ ଶସ୍ଯ଼, ଗୁଡ଼ ଇତ୍ଯ଼ାଦି ଯୋଗାଇ ଦିଆଯାଇପାରେ |",
            "ଯଦି ପଶୁମାନଙ୍କୁ ଏପର୍ଯ୍ଯ଼ନ୍ତ ଏଫ୍. ଏମ୍. ଡି., ରକ୍ତସ୍ରାବଜନିତ ସେପ୍ଟିସେମିଆ, ବ୍ଲାକ୍ କ୍ୱାର୍ଟର୍, ଏଣ୍ଟେରୋଟକ୍ସିମିଆ ଇତ୍ଯ଼ାଦି ବିରୁଦ୍ଧରେ ଟୀକାକରଣ କରାଯାଇ ନାହିଁ, ତେବେ ଏଗୁଡ଼ିକ କରିବା ଆବଶ୍ଯ଼କ |"
         ]
      }
   },
   "date": "05-11-2024"
}