{
   "weather_details": {
      "06-11-2024": {
         "rainfall": 0,
         "t_max": 31,
         "t_min": 19,
         "rh_max": 88,
         "rh_min": 45,
         "wind_speed": 1,
         "wind_direction": 56,
         "cloud_cover": 4
      },
      "07-11-2024": {
         "rainfall": 0,
         "t_max": 30,
         "t_min": 19,
         "rh_max": 92,
         "rh_min": 45,
         "wind_speed": 4,
         "wind_direction": 53,
         "cloud_cover": 4
      },
      "08-11-2024": {
         "rainfall": 0,
         "t_max": 30,
         "t_min": 19,
         "rh_max": 94,
         "rh_min": 48,
         "wind_speed": 4,
         "wind_direction": 59,
         "cloud_cover": 3
      },
      "09-11-2024": {
         "rainfall": 0,
         "t_max": 30,
         "t_min": 18,
         "rh_max": 93,
         "rh_min": 49,
         "wind_speed": 4,
         "wind_direction": 63,
         "cloud_cover": 3
      },
      "10-11-2024": {
         "rainfall": 0,
         "t_max": 29,
         "t_min": 18,
         "rh_max": 90,
         "rh_min": 45,
         "wind_speed": 4,
         "wind_direction": 66,
         "cloud_cover": 5
      }
   },
   "names_of_crops": [
      "ଚାଉଳ",
      "ମକା",
      "ଡାଲିଗୁଡ଼ିକ",
      "ସୋରିଷ",
      "ହଳଦୀ",
      "ଫୁଲକୋବି",
      "କଦଳୀ",
      "ଅଦା।",
      "ଗାଈ ଏବଂ ମଇଁଷି"
   ],
   "general_advisory": "ପାଞ୍ଚ ଦିନର ପାଣିପାଗ ପୂର୍ବାନୁମାନ ଆଧାରରେ, କୃଷକମାନେ ଆନ୍ତଃସାଂସ୍କୃତିକ କାର୍ଯ୍ଯ଼କଳାପ, ପରିପକ୍ୱ ଉତ୍ପାଦ ଅମଳ ଏବଂ ଆବଶ୍ଯ଼କ ଅନୁଯାଯ଼ୀ ଷ୍ଟିକର ସହିତ ମିଶ୍ରିତ କୀଟନାଶକ ପ୍ରଯ଼ୋଗ ଜାରି ରଖିପାରିବେ। ରବି ଫସଲ ପାଇଁ କ୍ଷେତ ପ୍ରସ୍ତୁତି ଆରମ୍ଭ କରାଯିବା ଉଚିତ। କୀଟପତଙ୍ଗ ନିଯ଼ନ୍ତ୍ରଣ ପାଇଁ ନିଯ଼ମିତ ନିରୀକ୍ଷଣ କାର୍ଯ୍ଯ଼ ସୁପାରିଶ କରାଯାଏ |",
   "crops_data": {
      "rice": {
         "advisory": [
            "ନେକ୍ ବ୍ଲାସ୍ଟ୍ ରୋଗ ପରିଚାଳନା ପାଇଁ ଟ୍ରାଇସାଇକ୍ଲାଜୋଲ୍ (ବିମ୍) @0.6 ଗ୍ରାମ୍/ଲିଟର ପାଣି (120 ଗ୍ରାମ୍/ଏସି) ଲଗାନ୍ତୁ।",
            "ବାଷ୍ପ ଛେଦକ ଏବଂ ପତ୍ର ଫୋଲଡରକୁ ନିଯ଼ନ୍ତ୍ରଣ କରିବା ପାଇଁ କ୍ଲୋରପିରିଓଫସ୍/ପ୍ରୋଫେନୋଫସ୍ @2 ମିଲି/ଲିଟର ପାଣି ସ୍ପ୍ରେ କରନ୍ତୁ।",
            "ବି. ପି. ଏଚ୍. କୁ ନିଯ଼ନ୍ତ୍ରଣ କରିବା ପାଇଁ ଇମିଡାକ୍ଲୋପ୍ରିଡ୍ @0.6 ମିଲି/ଲିଟର ପାଣି ସ୍ପ୍ରେ କରନ୍ତୁ।",
            "କାନ କାଟିବା କ୍ଯ଼ାଟର୍ପିଲାରକୁ ନିଯ଼ନ୍ତ୍ରଣ କରିବା ପାଇଁ, ସକାଳେ ରୁଟ ଜୋନରେ ଏକର ପିଛା 400 ମିଲିମିଟରରେ କ୍ୱିନାଲଫସ୍ 25 ଇସି କିମ୍ବା ଏକର ପିଛା 500 ମିଲିମିଟରରେ କ୍ଲୋରପିରିଫସ୍ 20 ଇସି ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "maize": {
         "advisory": [
            "ପରିପକ୍ୱତା ପର୍ଯ୍ୟାୟରେ ଥିବା କୋବ୍ଗୁଡ଼ିକୁ ଅମଳ କରନ୍ତୁ ଏବଂ ସେଗୁଡ଼ିକୁ ଏକ ସୁରକ୍ଷିତ ସ୍ଥାନରେ ରଖନ୍ତୁ |"
         ]
      },
      "pulses": {
         "advisory": [
            "ବର୍ତ୍ତମାନର ପାଣିପାଗ ହର୍ସ ଗ୍ରାମ୍ ଏବଂ ବେଙ୍ଗଲ ଗ୍ରାମ୍ ବୁଣିବା ପାଇଁ ଅନୁକୂଳ ଅଟେ। ତେଣୁ, କୃଷକମାନଙ୍କୁ ମାଟିର ଆର୍ଦ୍ରତା ସ୍ଥିତି ଉପରେ ନିର୍ଭର କରି ମଞ୍ଜି ବୁଣିବା ପାଇଁ ପରାମର୍ଶ ଦିଆଯାଇଛି। ବୁଣିବା ପୂର୍ବରୁ, ମଞ୍ଜି ଗୁଡ଼ିକୁ ଫଙ୍ଗିସାଇଡ୍ ସହିତ ଚିକିତ୍ସା କରନ୍ତୁ ଏବଂ ତା 'ପରେ 20 ଗ୍ରାମ୍/କେଜି ମଞ୍ଜି ସହିତ ରାଇଜୋବିୟମ୍ ସଂସ୍କୃତି କରନ୍ତୁ।"
         ]
      },
      "mustard": {
         "advisory": [
            "ଉପଲବ୍ଧ ମୃତ୍ତିକା ଆର୍ଦ୍ରତାର ଲାଭ ଉଠାଇ, ସର୍ବୋତ୍ତମ ଉତ୍ପାଦନ ପାଇବା ପାଇଁ ଜମି ପ୍ରସ୍ତୁତି ଏବଂ ଫସଲ ବୁଣିବା ଆରମ୍ଭ କରନ୍ତୁ।",
            "ତୋରିଆ-ଅନୁରାଧା, ପାର୍ବତୀ, ସୁଶ୍ରୀ, ଭାରତୀୟ ସୋରିଷ-ପୁସା ବୋଲ୍ଡ, ପୁସା ଜୟ କିଷାନ ଭଳି ଉପଯୁକ୍ତ କିସମର ବ୍ୟବହାର କରନ୍ତୁ। ବୀଜ ହାର-8-10 କିଲୋଗ୍ରାମ/ହେକ୍ଟର, ବ୍ୟବଧାନ-30 ସେ. ମି. x 10 ସେ. ମି.।",
            "ଚାରା ରୋପଣ ପର୍ଯ୍ଯ଼ାଯ଼ରେ ସୋରିଷ ଏବଂ ତୋରିଆରେ କୀଟପତଙ୍ଗକୁ ନିଯ଼ନ୍ତ୍ରଣ କରିବା ପାଇଁ ନିମ୍ବ ତେଲ 5 ମିଲି/ଲିଟର ପାଣି ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "turmeric": {
         "advisory": [
            "ଆଗାଛା କାଟିବା ପାଇଁ ଯାଆନ୍ତୁ ଏବଂ ରୋପଣର 90 ଦିନ ପରେ ଏକର ପିଛା 26 କିଲୋଗ୍ରାମ ଯ଼ୁରିଆ ଏବଂ 30 କିଲୋଗ୍ରାମ ଏମଓପି ଲଗାନ୍ତୁ। ଏକର ପିଛା 2 ଟନ୍ର ହାରରେ ମଲ୍ଚିଙ୍ଗ ଲଗାନ୍ତୁ।",
            "ଜଳସେଚନ କରନ୍ତୁ କାରଣ ଗତ ଦିନରେ ପର୍ଯ୍ଯ଼ାପ୍ତ ବର୍ଷା ହୋଇନାହିଁ କାରଣ ହଳଦୀ ଭଲ ଭାବରେ ବଢିବା ପାଇଁ ଜଳ ଆବଶ୍ଯ଼କ କରେ |"
         ]
      },
      "cauliflower": {
         "advisory": [
            "ଫୁଲକୋବି ଚାଷ ପାଇଁ ଉପଯୁକ୍ତ ମାପ ଏବଂ ଆବଶ୍ଯ଼କ ସାମଗ୍ରୀ ସହିତ ନର୍ସରୀ ଶଯ୍ଯ଼ା ପ୍ରସ୍ତୁତ କରନ୍ତୁ |",
            "ପୁସା ଆର୍ଲି ସିନ୍ଥେଟିକ୍, ଆର୍ଲି କୁଆଁରୀ, କାର୍ତ୍ତିକ, ପୁସା ଦୀପାଲୀ, ଆର୍କା କ୍ରାନ୍ତି, ଆର୍କା ସୁରଥୀ, ହାଇବ୍ରିଡ୍ଃ ଶ୍ୱେତା, ପୁସ୍ପାଗିରି, ତୁସାର ଗୁଡମ୍ଯ଼ାନ୍ ଇତ୍ଯ଼ାଦି ନିର୍ଦ୍ଦିଷ୍ଟ କିସମର ବ୍ଯ଼ବହାର କରନ୍ତୁ |"
         ]
      },
      "cabbage": {
         "advisory": [
            "ବନ୍ଧାକୋବି ଚାଷ ପାଇଁ ନିର୍ଦ୍ଦିଷ୍ଟ ମାପ ଏବଂ ଆବଶ୍ଯ଼କ ସାମଗ୍ରୀ ସହିତ ନର୍ସରୀ ଶଯ୍ଯ଼ା ପ୍ରସ୍ତୁତ କରନ୍ତୁ |",
            "ଗୋଲ୍ଡେନ୍ ଏକର, ପ୍ରାଇଡ୍ ଅଫ୍ ଇଣ୍ଡିଆ, ପୁସା ସମ୍ବନ୍ଦ, ହାଇବ୍ରିଡ୍ଃ ଗ୍ରୀନ୍ ବଲ୍, ପ୍ରିଯ଼ା, ଜେନିଥ୍ ଗୋଲ୍ଡ ଷ୍ଟାର୍, ପ୍ରଗତି ଇତ୍ଯ଼ାଦି ନିର୍ଦ୍ଦିଷ୍ଟ କିସମର ବ୍ଯ଼ବହାର କରନ୍ତୁ |"
         ]
      },
      "ginger": {
         "advisory": [
            "ଅଦା ଚାଷ ପାଇଁ 3ଯ଼ ଘାସ କାଟିବା ଏବଂ ଉପର ଡ୍ରେସିଂ ସମ୍ପୂର୍ଣ୍ଣ କରନ୍ତୁ।",
            "ଜିଙ୍ଗରରେ ରାଇଜୋମ କ୍ଷଯ଼କୁ ନିଯ଼ନ୍ତ୍ରଣ କରିବା ପାଇଁ ନିର୍ଦ୍ଦିଷ୍ଟ ରାସାଯ଼ନିକ ପଦାର୍ଥ ସହିତ ମୃତ୍ତିକାକୁ ଭିଜାଇ ଦିଅନ୍ତୁ |",
            "କ୍ଷେତରୁ ସଂକ୍ରମିତ ଗଛଗୁଡ଼ିକୁ ବାହାର କରି ପୋଡ଼ି ଦିଅନ୍ତୁ।"
         ]
      },
      "cow and buffalo": {
         "advisory": [
            "ନିର୍ଜଲୀକରଣ, ଉତ୍ତାପ ଚାପ ଏବଂ ପରଜୀବୀ ସଂକ୍ରମଣର ଲକ୍ଷଣ ପାଇଁ ନିଯ଼ମିତ ଭାବରେ ପଶୁମାନଙ୍କୁ ଯାଞ୍ଚ କରନ୍ତୁ | ଆବଶ୍ଯ଼କ ଅନୁଯାଯ଼ୀ କୃମି ପଶୁମାନଙ୍କୁ ଛାଡ଼ନ୍ତୁ ଏବଂ ସେମାନଙ୍କୁ ପାଦ ଏବଂ ପାଟି ରୋଗ, ପିପିଆର ପରି ସାଧାରଣ ରୋଗ ବିରୁଦ୍ଧରେ ଟୀକାକରଣ କରନ୍ତୁ |"
         ]
      }
   },
   "date": "05-11-2024"
}