{
    "weather_details": {
        "2024-09-07": {
            "rainfall": 15,
            "t_max": 32,
            "t_min": 24,
            "rh_max": 95,
            "rh_min": 70,
            "wind_speed": 6,
            "wind_direction": 225,
            "cloud_cover": 7
        },
        "2024-09-08": {
            "rainfall": 25,
            "t_max": 30,
            "t_min": 23,
            "rh_max": 95,
            "rh_min": 71,
            "wind_speed": 8,
            "wind_direction": 288,
            "cloud_cover": 8
        },
        "2024-09-09": {
            "rainfall": 30,
            "t_max": 29,
            "t_min": 22,
            "rh_max": 95,
            "rh_min": 76,
            "wind_speed": 9,
            "wind_direction": 288,
            "cloud_cover": 8
        },
        "2024-09-10": {
            "rainfall": 35,
            "t_max": 29,
            "t_min": 22,
            "rh_max": 94,
            "rh_min": 75,
            "wind_speed": 11,
            "wind_direction": 288,
            "cloud_cover": 8
        },
        "2024-09-11": {
            "rainfall": 15,
            "t_max": 31,
            "t_min": 23,
            "rh_max": 92,
            "rh_min": 73,
            "wind_speed": 13,
            "wind_direction": 270,
            "cloud_cover": 8
        }
    },
    "names_of_crops": [
        "ଚାଉଳ",
        "ମକା",
        "କପା",
        "କଦଳୀ",
        "ଗାଈ।",
        "ଚିକେନ୍"
    ],
    "general_advisory": "ଧାନ ଚାଷ ସମୟରେ 2ରୁ 3 ସେ. ମି. ପାଣି ରଖି ଛିଡ଼ା ହୁଅନ୍ତୁ। ଯଦି ଫସଲ 45 ଦିନରୁ ଅଧିକ ପୁରୁଣା, ତେବେ ଚାଉଳରେ ବେଉଶନିଂ ଅଭ୍ୟାସ କରନ୍ତୁ ନାହିଁ।",
    "crops_data": {
        "rice": {
            "advisory": [
                "ବିସ୍ଫୋରଣ ରୋଗ ନିୟନ୍ତ୍ରଣ ପାଇଁ ହେକ୍ଟର ପିଛା 400-ମିଲି ହେକ୍ସାକୋନାଜୋଲ 5 ପ୍ରତିଶତ ଏସ୍. ସି. କିମ୍ବା ଏକର ପିଛା 200-ମିଲି ଡିଫେନୋକୋନାଜୋଲ ଏସ୍. ସି. କିମ୍ବା ଏକର ପିଛା 50 ପ୍ରତିଶତ ଟେବୁକୋନାଜୋଲ, ଟ୍ରାଇଫ୍ଲୋକ୍ସିସ୍ଟ୍ରୋବିନ 25 ପ୍ରତିଶତ ଡବ୍ଲୁ. ଜି., ଏକର ପିଛା 80-ଗ୍ରାମ୍ ସ୍ପ୍ରେ କରନ୍ତୁ। ଧାନରେ ଲିଫ୍ ଫୋଲ୍ଡର୍ ଏବଂ କେସ୍ ୱର୍ମ୍ କୀଟପତଙ୍ଗ ପରିଚାଳନା ପାଇଁ ଏକର ପିଛା 200 ମିଲି. ରେ ବାଇଫେନ୍ଥ୍ରିନ 10 ପ୍ରତିଶତ ଇସି କିମ୍ବା ଏକର ପିଛା 200 ମିଲି. ରେ ଲାମ୍ବଡା ସାଇହାଲୋଥ୍ରିନ 5 ପ୍ରତିଶତ ଇସି କିମ୍ବା ଏକର ପିଛା 400 ମିଲି. ରେ ଫିପ୍ରୋନିଲ 5 ପ୍ରତିଶତ ଏସସି କିମ୍ବା ଏକର ପିଛା 60 ମିଲି. ରେ କ୍ଲୋରାଣ୍ଟ୍ରାନିଲିପ୍ରୋଲ 18.5% ଏସସି ସ୍ପ୍ରେ କରନ୍ତୁ।"
            ]
        },
        "maize": {
            "advisory": [
                "ଶରତ ଋତୁର ପରିଚାଳନା ପାଇଁ ସେନା କୃମି କୀଟ 200 ଲିଟର ପାଣିରେ ମିଶାଇ ଏକର ପିଛା 1200-ଗ୍ରାମ୍ ବାୟୋପଷ୍ଟିସାଇଡ୍ ବିଉଭେରିଆ ବାସିଆନା ସ୍ପ୍ରେ କରନ୍ତୁ। ଏକର ପିଛା 10-12 ପକ୍ଷୀ ପର୍ଚ୍ ବ୍ୟବହାର କରନ୍ତୁ ଏବଂ ଟାସେଲିଂ ପର୍ଯ୍ୟାୟ ପୂର୍ବରୁ ସେଗୁଡ଼ିକୁ ବାହାର କରନ୍ତୁ | ପତ୍ର ଚକ୍ର ଭିତରେ ବାଲି, ମାଟି ଏବଂ କାଠର ଛାଇର ଧୂଳି ମିଶ୍ରଣ ଯାହା ଦ୍ୱାରା କ୍ୟାଟର୍ପିଲାର୍ମାନେ ପତ୍ରକୁ ଖାଇପାରିବେ ନାହିଁ | ରାସାୟନିକ ଉପାୟରେ ଏହି କୀଟକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ ଏକର ପିଛା 80 ଗ୍ରାମ୍ ବା ସ୍ପିନେଟୋରାମ୍ <ଆଇ. ଡି. 1> ଏସ୍. ସି. @100 ମିଲି/ଏକର କିମ୍ବା କ୍ଲୋରାଣ୍ଟ୍ରାନିଲିପ୍ରୋଲ୍ <ଆଇ. ଡି. 2> ଏସ୍. ସି. @80 ମିଲି/ଏକରକୁ 200 ଲିଟର ପାଣିରେ ମିଶାଇ ଇମାମେକ୍ଟିନ୍ ବେନ୍ଜୋଏଟ୍ 5 ପ୍ରତିଶତ ଏସ୍. ଜି. ସ୍ପ୍ରେ କରନ୍ତୁ।"
            ]
        },
        "cotton": {
            "advisory": [
                "ଉଚ୍ଚ ତାପମାତ୍ରା ଏବଂ ଆର୍ଦ୍ରତା ହେତୁ, କପା ଫସଲରେ ଏଫିଡ୍ ଏବଂ ଜ୍ଯାସିଡ୍ ପରି କୀଟ ଶୋଷିବାର ଘଟଣା ରିପୋର୍ଟ ହୋଇଛି | କୀଟପତଙ୍ଗ ଏବଂ ରୋଗର ଘଟଣା ପାଇଁ ଫସଲର ନିୟମିତ ତଦାରଖ ପାଇଁ ଯାଆନ୍ତୁ | ଯଦି ଏଫିଡ୍ ଏବଂ ଜ୍ଯାସିଡ୍ କପା ଫସଲ ପରି ଶୋଷକ କୀଟ ସଂକ୍ରମଣ ହୁଏ, ତେବେ ନିମ୍ବ-ଆଧାରିତ କୀଟନାଶକ (ନିମ୍ ତେଲ 1500 ପିପିଏମ୍) @600-ମିଲି/ଏକରକୁ 200 ଲିଟର ପାଣିରେ ମିଶାଇ ସ୍ପ୍ରେ କରନ୍ତୁ। ଏକର ପିଛା 8 ହାରରେ ହଳଦିଆ ଚଟପଟା ଜାଲ ବ୍ୟବହାର କରନ୍ତୁ। ଯଦି ଶୋଷକ କୀଟ ସଂଖ୍ୟା ଇ. ଟି. ଏଲ୍. ଠାରୁ ଅଧିକ ବୋଲି ଜଣାପଡ଼େ, ତେବେ ଫ୍ଲୋନିକାମିଡ୍ 50 ପ୍ରତିଶତ ଡବ୍ଲୁ. ଜି. @60 ଗ୍ରାମ୍/ଏକର କିମ୍ବା ଥିୟାମେଥୋକ୍ସାମ୍ 25 ପ୍ରତିଶତ ଡବ୍ଲୁ. ଜି. @40 ଗ୍ରାମ୍/ଏକର କିମ୍ବା ଡିନୋଟେଫୁରାନ୍ 20 ପ୍ରତିଶତ ଏସ୍. ଜି. @80 ଗ୍ରାମ୍/ଏକର ସ୍ପ୍ରେ କରନ୍ତୁ।"
            ]
        },
        "pumpkin": {
            "advisory": [
                "ପ୍ରବଳ ବର୍ଷା ପରେ, ରିଜ୍ ଲାଉ ଏବଂ ସ୍ନେକ୍ ଗାର୍ଡ ପରି କୁକୁର୍ବିଟ୍ ରେ ସେମିଲୋପର୍ କୀଟ ଘଟଣା ସାଧାରଣ | ନିମ୍ବ ଆଧାରିତ କୀଟନାଶକ (ନିମ୍ବ ତେଲ 15000 ପିପିଏମ) ଆଜାଦିରାକ୍ଟିନ ଏକର ପିଛା 600 ମିଲି କିମ୍ବା ବାସିଲସ ଥୁରିଙ୍ଗିୟେନ୍ସିସ ଏକର ପିଛା 400 ଗ୍ରାମକୁ 200 ଲିଟର ପାଣିରେ ମିଶାଇ ସିଞ୍ଚନ କରନ୍ତୁ। ରାସାୟନିକ ଉପାୟରେ ଏହି କୀଟକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ ମଧ୍ୟାହ୍ନ ସମୟରେ ଏକର ପିଛା 50-ମିଲି ଆଲ୍ଫା-ସାଇହାଲୋଥ୍ରିନ୍ କିମ୍ବା ଏକର ପିଛା 120-ମିଲି ଥାଇକ୍ଲୋପ୍ରିଡ୍ ସ୍ପ୍ରେ କରନ୍ତୁ ଏବଂ ଏଥିରେ 200 ଲିଟର ପାଣି ମିଶାନ୍ତୁ।"
            ]
        },
        "cow": {
            "advisory": [
                "ଆର୍ଦ୍ରତା ବୃଦ୍ଧି ଏବଂ କ୍ଷତିକାରକ କବକ ବୃଦ୍ଧିକୁ ରୋକିବା ପାଇଁ ଶସ୍ୟ ଭଣ୍ଡାରକୁ ଭଲ ଭାବେ ବାୟୁ-ସଞ୍ଚାଳିତ ଏବଂ ଲିକ୍-ମୁକ୍ତ ରଖନ୍ତୁ। ଗାଈ ଏବଂ ମଇଁଷିକୁ ଏଫ୍. ଏମ୍. ଡି., ଏଚ୍. ଏସ୍. ଏବଂ ବି. କ୍ୟୁ. ବିରୁଦ୍ଧରେ ଟୀକାକରଣ କରନ୍ତୁ ଏବଂ ଆର୍ଦ୍ର ପରିବେଶରେ ଆଭ୍ୟନ୍ତରୀଣ ପରଜୀବୀକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ ଏକ କୃମି ନିବାରଣ ଯୋଜନା ପ୍ରସ୍ତୁତ କରନ୍ତୁ।"
            ]
        },
        "chicken": {
            "advisory": [
                "ବାର୍ଡ ଫ୍ଲୁ ହେଉଛି କୁକୁଡ଼ାର ଏକ ଭୂତାଣୁଜନିତ ରୋଗ। ଏହା ଦୂଷିତ ଡେଣା, ଲାଳ, ପକ୍ଷୀଙ୍କ ବିଷ୍ଠା ମାଧ୍ୟମରେ ବ୍ୟାପିଥାଏ | ବେଳେବେଳେ ଏହା ପ୍ରଭାବିତ ପକ୍ଷୀଙ୍କଠାରୁ ମଣିଷକୁ ବ୍ୟାପିପାରେ | ଏହି ସମୟରେ ଦୟାକରି ପ୍ରତିଦିନ କୁକୁଡ଼ା ଘର ସଫା କରନ୍ତୁ ଏବଂ କୁକୁଡ଼ା ପକ୍ଷୀଙ୍କ ଖାଦ୍ୟ ଏବଂ ପାଣି ବାରମ୍ବାର ପରିବର୍ତ୍ତନ କରନ୍ତୁ। ମୃତ କୁକୁଡ଼ା ପକ୍ଷୀମାନଙ୍କୁ ଏଠାରେ ଏବଂ ସେଠାରେ ଫିଙ୍ଗି ଦିଅନ୍ତୁ ନାହିଁ। ଦୟାକରି ଗ୍ଲୋଭସ୍ ଏବଂ ମାସ୍କ ପିନ୍ଧି ସେମାନଙ୍କୁ ପୋତି ଦିଅନ୍ତୁ ଏବଂ ବ୍ଲିଚିଂ ପାଉଡରରେ ସେହି ସ୍ଥାନକୁ ସାନିଟାଇଜ୍ କରନ୍ତୁ। ପ୍ରଭାବିତ ଅଞ୍ଚଳରୁ କୁକୁଡ଼ା ପକ୍ଷୀ କିମ୍ବା ଅଣ୍ଡା ଘରକୁ ଆଣନ୍ତୁ ନାହିଁ।"
            ]
        }
    },
    "date": "06-09-2024"
}