{
   "weather_details": {
      "2024-09-07": {
         "rainfall": 10,
         "t_max": 35,
         "t_min": 25,
         "rh_max": 93,
         "rh_min": 67,
         "wind_speed": 5,
         "wind_direction": 288,
         "cloud_cover": 7
      },
      "2024-09-08": {
         "rainfall": 15,
         "t_max": 33,
         "t_min": 25,
         "rh_max": 93,
         "rh_min": 68,
         "wind_speed": 6,
         "wind_direction": 288,
         "cloud_cover": 8
      },
      "2024-09-09": {
         "rainfall": 25,
         "t_max": 31,
         "t_min": 24,
         "rh_max": 95,
         "rh_min": 76,
         "wind_speed": 7,
         "wind_direction": 291,
         "cloud_cover": 8
      },
      "2024-09-10": {
         "rainfall": 15,
         "t_max": 33,
         "t_min": 24,
         "rh_max": 93,
         "rh_min": 76,
         "wind_speed": 8,
         "wind_direction": 292,
         "cloud_cover": 8
      },
      "2024-09-11": {
         "rainfall": 10,
         "t_max": 34,
         "t_min": 25,
         "rh_max": 90,
         "rh_min": 69,
         "wind_speed": 10,
         "wind_direction": 291,
         "cloud_cover": 7
      }
   },
   "names_of_crops": [
      "ମକା",
      "ଚାଉଳ",
      "ଫିଙ୍ଗର ମିଲେଟ୍",
      "କପା",
      "ପେଁପେ",
      "ବାଇଗଣ",
      "ଗାଈ।",
      "ସାଧାରଣ ମାଛ",
      "ଚିକେନ୍"
   ],
   "general_advisory": "ଆଇଏମଡିରୁ ମିଳିଥିବା ପୂର୍ବାନୁମାନର ବର୍ଦ୍ଧିତ ପରିସର ଅନୁଯାୟୀ, ସପ୍ତାହ-1 (6 ରୁ 12 ସେପ୍ଟେମ୍ବର, 2024) ମଧ୍ୟରେ ଓଡ଼ିଶାର ଜିଲ୍ଲାଗୁଡ଼ିକରେ ବ୍ୟାପକ ବର୍ଷା/ବଜ୍ରପାତ ହେବାର ସମ୍ଭାବନା ରହିଛି ଏବଂ ସେପ୍ଟେମ୍ବର 6 ରେ ଦକ୍ଷିଣ ଓଡ଼ିଶାର ଜିଲ୍ଲାଗୁଡ଼ିକରେ ପ୍ରବଳ ବର୍ଷା ହେବାର ସମ୍ଭାବନା ରହିଛି; ସେପ୍ଟେମ୍ବର 7 ରେ ଦକ୍ଷିଣ ଓଡ଼ିଶାର ଜିଲ୍ଲାଗୁଡ଼ିକରେ ପ୍ରବଳରୁ ଅତି ପ୍ରବଳ ବର୍ଷା ହେବାର ସମ୍ଭାବନା ରହିଛି; ସେପ୍ଟେମ୍ବର 8 ରେ କେନ୍ଦ୍ରୀୟ ଓଡ଼ିଶାର ଜିଲ୍ଲାଗୁଡ଼ିକରେ ପ୍ରବଳରୁ ଅତି ପ୍ରବଳ ବର୍ଷା ହେବାର ସମ୍ଭାବନା ରହିଛି, ସେପ୍ଟେମ୍ବର 9 ଏବଂ 10 ରେ ଉତ୍ତର ଓଡ଼ିଶାର ଜିଲ୍ଲାଗୁଡ଼ିକରେ ପ୍ରବଳ ବର୍ଷା ହେବାର ସମ୍ଭାବନା ରହିଛି। ଦ୍ୱିତୀୟ ସପ୍ତାହରେ (13 ରୁ 19 ସେପ୍ଟେମ୍ବର, 2024) ଓଡ଼ିଶା ରାଜ୍ୟରେ ବ୍ୟାପକ ବର୍ଷା/ବଜ୍ରପାତ ହେବାର ସମ୍ଭାବନା ରହିଛି। ଆଇଏମଡିରୁ ମିଳିଥିବା ପାଞ୍ଚ ଦିନିଆ ପାଣିପାଗ ପୂର୍ବାନୁମାନକୁ ଦୃଷ୍ଟିରେ ରଖି, କୃଷକମାନଙ୍କୁ ବର୍ତ୍ତମାନ ପାଇଁ ସାର ଏବଂ ଉଦ୍ଭିଦ ସୁରକ୍ଷା ରାସାୟନିକ ପ୍ରୟୋଗ ବନ୍ଦ କରିବାକୁ ପରାମର୍ଶ ଦିଆଯାଇଛି। ଫସଲର ବୃଦ୍ଧି ପର୍ଯ୍ୟାୟ ଅନୁଯାୟୀ ସନ୍ତୁଳିତ ଏବଂ ଉପଯୁକ୍ତ ସାର ପ୍ରୟୋଗ କରନ୍ତୁ। ଅତ୍ୟଧିକ ନାଇଟ୍ରୋଜେନ୍ ଠାରୁ ଦୂରେଇ ରୁହନ୍ତୁ କାରଣ ଏହା ଅତ୍ୟଧିକ ଉଦ୍ଭିଦ ବୃଦ୍ଧିକୁ ପ୍ରୋତ୍ସାହିତ କରେ ଏବଂ ଜଳ ଚାହିଦା ବୃଦ୍ଧି କରେ | ଯଦି ଫସଲକୁ କୀଟପତଙ୍ଗରୁ ରକ୍ଷା କରିବା ପାଇଁ ଉପଲବ୍ଧ ଥାଏ, ତେବେ ଜୈବିକ ଚିକିତ୍ସା ସହିତ ସର୍ବଦା ପ୍ରତିଷେଧକ ପଦକ୍ଷେପଗୁଡ଼ିକର ଏକ ସମନ୍ୱିତ ଆଭିମୁଖ୍ୟ ଉପରେ ବିଚାର କରନ୍ତୁ। ବ୍ୟାପକ କୀଟନାଶକ ବ୍ୟବହାର କୀଟପତଙ୍ଗରେ ପ୍ରତିରୋଧ ସୃଷ୍ଟି କରିପାରେ। ଏହାକୁ ରୋକିବା ପାଇଁ, କୀଟନାଶକ ଏବଂ ମିଶ୍ରଣ ବ୍ୟବହାର ମଧ୍ୟରେ ଉପଯୁକ୍ତ ଘୂର୍ଣ୍ଣନ ନିଶ୍ଚିତ କରନ୍ତୁ |",
   "date": "06-09-2024",
   "crops_data": {
      "maize": {
         "advisory": [
            "ଶରତ ଋତୁର ପରିଚାଳନା ପାଇଁ ସେନା କୃମି କୀଟ 200 ଲିଟର ପାଣିରେ ମିଶାଇ ଏକର ପିଛା 1200-ଗ୍ରାମ୍ ବାୟୋପଷ୍ଟିସାଇଡ୍ ବିଉଭେରିଆ ବାସିଆନା ସ୍ପ୍ରେ କରନ୍ତୁ। ଏକର ପିଛା 10-12 ପକ୍ଷୀ ପର୍ଚ୍ ବ୍ୟବହାର କରନ୍ତୁ ଏବଂ ଟାସେଲିଂ ପର୍ଯ୍ୟାୟ ପୂର୍ବରୁ ସେଗୁଡ଼ିକୁ ବାହାର କରନ୍ତୁ | ପତ୍ର ଚକ୍ର ଭିତରେ ବାଲି, ମାଟି ଏବଂ କାଠର ଛାଇର ଧୂଳି ମିଶ୍ରଣ ଯାହା ଦ୍ୱାରା କ୍ୟାଟର୍ପିଲାର୍ମାନେ ପତ୍ରକୁ ଖାଇପାରିବେ ନାହିଁ | ରାସାୟନିକ ଉପାୟରେ ଏହି କୀଟକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ ଇମାମେକ୍ଟିନ୍ ବେନ୍ଜୋଏଟ୍ 5 ପ୍ରତିଶତ ଏସ୍. ଜି. @80-ଗ୍ରାମ୍/ଏକର କିମ୍ବା ସ୍ପିନେଟୋରାମ୍ <ଆଇ. ଡି. 1> ଏସ୍. ସି. @100-ମିଲି/ଏକର କିମ୍ବା କ୍ଲୋରାଣ୍ଟ୍ରାନିଲିପ୍ରୋଲ୍ <ଆଇ. ଡି. 2> ଏସ୍. ସି. @80-ମିଲି/ଏକରକୁ 200-ଲିଟର ପାଣିରେ ମିଶାଇ ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "rice": {
         "advisory": [
            "ବିସ୍ଫୋରଣ ରୋଗ ନିୟନ୍ତ୍ରଣ ପାଇଁ ହେକ୍ଟର ପିଛା 400-ମିଲି ହେକ୍ସାକୋନାଜୋଲ 5 ପ୍ରତିଶତ ଏସ୍. ସି. କିମ୍ବା ଏକର ପିଛା 200-ମିଲି ଡିଫେନୋକୋନାଜୋଲ ଏସ୍. ସି. କିମ୍ବା ଏକର ପିଛା 50 ପ୍ରତିଶତ ଟେବୁକୋନାଜୋଲ, ଟ୍ରାଇଫ୍ଲୋକ୍ସିସ୍ଟ୍ରୋବିନ 25 ପ୍ରତିଶତ ଡବ୍ଲୁ. ଜି., ଏକର ପିଛା 80-ଗ୍ରାମ୍ ସ୍ପ୍ରେ କରନ୍ତୁ। ଧାନରେ ଲିଫ୍ ଫୋଲ୍ଡର୍ ଏବଂ କେସ୍ ୱର୍ମ୍ କୀଟପତଙ୍ଗ ପରିଚାଳନା ପାଇଁ ଏକର ପିଛା 200 ମିଲି. ରେ ବାଇଫେନ୍ଥ୍ରିନ 10 ପ୍ରତିଶତ ଇସି କିମ୍ବା ଏକର ପିଛା 200 ମିଲି. ରେ ଲାମ୍ବଡା ସାଇହାଲୋଥ୍ରିନ 5 ପ୍ରତିଶତ ଇସି କିମ୍ବା ଏକର ପିଛା 400 ମିଲି. ରେ ଫିପ୍ରୋନିଲ 5 ପ୍ରତିଶତ ଏସସି କିମ୍ବା ଏକର ପିଛା 60 ମିଲି. ରେ କ୍ଲୋରାଣ୍ଟ୍ରାନିଲିପ୍ରୋଲ 18.5% ଏସସି ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "finger millet": {
         "advisory": [
            "ଫିଙ୍ଗର ମିଲେଟ୍ ଫସଲରେ ଗୋଲାପୀ କାଣ୍ଡ ଛେଦକ ପରିଚାଳନାଃ ଶୀଘ୍ର ଚାରା ରୋପଣ କରନ୍ତୁ। ପ୍ରଭାବିତ ଗଛଗୁଡ଼ିକୁ ବାହାର କରି ନଷ୍ଟ କରିଦିଅନ୍ତୁ। ଏକର ପିଛା 10ଟି ହାଲୁକା ଫାନ୍ଦ ଏବଂ 6ଟି ଫେରୋମୋନ୍ ଫାନ୍ଦ ରଖନ୍ତୁ। ଏକର ପିଛା 8 ରୁ 10 ଟି 'ଟି' ଆକୃତିର ଲାଠି ରୋପଣ କରନ୍ତୁ ଯାହା ଦ୍ୱାରା ପକ୍ଷୀମାନେ ସେମାନଙ୍କ ଉପରେ ବସି ଗଛ ଉପରେ ଚଢୁଥିବା ଡାଳଗୁଡ଼ିକୁ ଖାଇପାରିବେ | ରୋପଣର 30 ରୁ 40 ଦିନ ପରେ, ପ୍ରଦତ୍ତ ଛିଦ୍ରରେ ପ୍ରତ୍ୟେକ କାର୍ଡକୁ 12 ଖଣ୍ଡରେ ବିଭକ୍ତ କରି ସାପ୍ତାହିକ ବ୍ୟବଧାନରେ 6 ଥର ପାଇଁ 1-2/ଏକର (10000 ଅଣ୍ଡା/ହେକ୍ଟର) ହାରରେ ଟ୍ରାଇକୋଗ୍ରାମ ଚିଲିନିସ୍ କାର୍ଡ ବ୍ୟବହାର କରନ୍ତୁ। ଏହା ସହିତ ବ୍ୟାସିଲସ୍ ଥାଇରିଙ୍ଗେନେସିସ୍ @400 ଗ୍ରାମ୍/ଏକର କିମ୍ବା ମେଟାରିଜିୟମ୍ ଆନିସୋପିଲା @500 ଗ୍ରାମ୍/ଏକର ସ୍ପ୍ରେ କରନ୍ତୁ। 20 ଲିଟର ପାଣିରେ 1 ଲିଟର ହାଣ୍ଡି-ଖାତା ଏକ୍ସଟ୍ରାକ୍ଟ ମିଶାନ୍ତୁ ଏବଂ ସପ୍ତାହରେ ଥରେ ସ୍ପ୍ରେ କରନ୍ତୁ। 20 ଲିଟର ପାଣିରେ 15 ଲିଟର ବ୍ରହ୍ମାସ୍ତ୍ର ଏକ୍ସଟ୍ରାକ୍ଟ ସହିତ 1 ଲିଟର ନିମାସ୍ତ୍ର ମିଶାନ୍ତୁ ଏବଂ ରୋପଣର 30 ଦିନ ପରେ ସ୍ପ୍ରେ କରନ୍ତୁ, ବନ୍ଧରେ ନିଆଁ ଲଗାନ୍ତୁ। 15 ଲିଟର ପାଣିରେ କାଲୋଟ୍ରୋପିସ୍ ପତ୍ର (1 କି. ଗ୍ରା.), ନିମ ପତ୍ର (1 କି. ଗ୍ରା.), ବାସଙ୍ଗ ପତ୍ର (1 କି. ଗ୍ରା.), ଷ୍ଟାର୍ଟିଆ ପତ୍ର (1 କି. ଗ୍ରା.) କୁ ଭାଙ୍ଗି ଭଲ ଭାବେ ମିଶାନ୍ତୁ। ତା 'ପରେ 1 ଲିଟର ଗୋମୂତ୍ର ଏବଂ 50 ଗ୍ରାମ ହିଙ୍ଗକୁ ମିଶାଇ ଭଲ ଭାବେ ଘାଣ୍ଟନ୍ତୁ ଏବଂ ଡ୍ରମ୍କୁ ଏପରି ଢାଙ୍କି ଦିଅନ୍ତୁ ଯେ ଡ୍ରମ୍ ଭିତରକୁ କୌଣସି ବାୟୁ ପ୍ରବେଶ କରିପାରିବ ନାହିଁ। ପ୍ରତିଦିନ ସକାଳେ ଏବଂ ସନ୍ଧ୍ୟାରେ ଏକ ଲାଠିରେ ଏହି ମିଶ୍ରଣକୁ ଘାଣ୍ଟନ୍ତୁ। 7 ଦିନ ପରେ ଏହାକୁ ପତ୍ରରେ ଛିଞ୍ଚନ୍ତୁ।"
         ]
      },
      "cotton": {
         "advisory": [
            "ଉଚ୍ଚ ତାପମାତ୍ରା ଏବଂ ଆର୍ଦ୍ରତା ହେତୁ, କପା ଫସଲରେ ଏଫିଡ୍ ଏବଂ ଜ୍ଯାସିଡ୍ ପରି କୀଟ ଶୋଷିବାର ଘଟଣା ରିପୋର୍ଟ ହୋଇଛି | କୀଟପତଙ୍ଗ ଏବଂ ରୋଗର ଘଟଣା ପାଇଁ ଫସଲର ନିୟମିତ ତଦାରଖ ପାଇଁ ଯାଆନ୍ତୁ | ଯଦି ଏଫିଡ୍ ଏବଂ ଜ୍ଯାସିଡ୍ କପା ଫସଲ ପରି ଶୋଷକ କୀଟ ସଂକ୍ରମଣ ହୁଏ, ତେବେ ନିମ୍ବ-ଆଧାରିତ କୀଟନାଶକ (ନିମ୍ ତେଲ 1500 ପିପିଏମ୍) @600-ମିଲି/ଏକରକୁ 200 ଲିଟର ପାଣିରେ ମିଶାଇ ସ୍ପ୍ରେ କରନ୍ତୁ। ଏକର ପିଛା 8 ହାରରେ ହଳଦିଆ ଚଟପଟା ଜାଲ ବ୍ୟବହାର କରନ୍ତୁ। ଯଦି ଶୋଷକ କୀଟ ସଂଖ୍ୟା ଇ. ଟି. ଏଲ୍. ଠାରୁ ଅଧିକ ବୋଲି ଜଣାପଡ଼େ, ତେବେ ଫ୍ଲୋନିକାମିଡ୍ 50 ପ୍ରତିଶତ ଡବ୍ଲୁ. ଜି. @60 ଗ୍ରାମ୍/ଏକର କିମ୍ବା ଥିୟାମେଥୋକ୍ସାମ୍ 25 ପ୍ରତିଶତ ଡବ୍ଲୁ. ଜି. @40 ଗ୍ରାମ୍/ଏକର କିମ୍ବା ଡିନୋଟେଫୁରାନ୍ 20 ପ୍ରତିଶତ ଏସ୍. ଜି. @80 ଗ୍ରାମ୍/ଏକର ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "papaya": {
         "advisory": [
            "ପ୍ରଚଳିତ ପାଣିପାଗ ସ୍ଥିତିରେ ମିଲି ବଗ୍ର ସଂକ୍ରମଣ ପରିଲକ୍ଷିତ ହୋଇପାରେ। ଯଦି ଲକ୍ଷଣ ଦେଖାଯାଏ, ତେବେ ସଂକ୍ରମଣର ପ୍ରାରମ୍ଭିକ ପର୍ଯ୍ୟାୟରେ ନିମ୍ବ କ୍ଷାରକ ଆଜାଦିରାକ୍ଟିନ (1500 ପିପିଏମ) @3 ମିଲି/ଲିଟର ପାଣି ସ୍ପ୍ରେ କରନ୍ତୁ। ଗୁରୁତର ସଂକ୍ରମଣ କ୍ଷେତ୍ରରେ ପ୍ରୋଫେନୋଫସ୍ 50 ପ୍ରତିଶତ ଇସି @20 ମିଲି କିମ୍ବା ଥିୟାମେଥୋକ୍ସାମ୍ 25 ଡବ୍ଲୁଜି @2 ଗ୍ରାମ କିମ୍ବା ଇମିଡାକ୍ଲୋପ୍ରିଡ୍ 17.8% ଏସଏଲ @3 ମିଲି 10 ଲିଟର ପାଣି ସହିତ ମିଶାଇ ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "brinjal": {
         "advisory": [
            "ବାଇଗଣ ଫୁଲ ଫୁଟାଇବାର ପର୍ଯ୍ୟାୟ ପର୍ଯ୍ୟନ୍ତ ରହିଛି। ବର୍ଷା ହ୍ରାସ ପାଇବା ପରେ ଏବଂ ଦିନ ଓ ରାତିର ତାପମାତ୍ରା ବୃଦ୍ଧି ହେବାର ସମ୍ଭାବନା ରହିଛି ଏବଂ ସକାଳର ଆପେକ୍ଷିକ ଆର୍ଦ୍ରତା 70 ପ୍ରତିଶତରୁ ଅଧିକ ବାଇଗଣରେ ଶୁଟ୍ ଏବଂ ଫଳ ଛେଦକକୁ ପସନ୍ଦ କରେ | କୀଟକୁ ପରିଚାଳନା କରିବା ପାଇଁ, ଛିଦ୍ର ଏବଂ ପ୍ରଭାବିତ ଫଳ ଦେଖାଇଥିବା ପ୍ରଭାବିତ ଟର୍ମିନାଲ୍ ଶୁଟ୍ ଅପସାରଣ କରନ୍ତୁ | ଏହି କୀଟକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ, ଏକର ପିଛା ଲିଉସିନ୍ ଲ୍ୟୁର୍ ଥିବା 8ଟି ଫେରୋମୋନ୍ ଫାନ୍ଦ ଲଗାନ୍ତୁ। ରାସାୟନିକ ନିୟନ୍ତ୍ରଣ ବ୍ୟବହାର କରନ୍ତୁ ଯଦି ଟର୍ମିନାଲ୍ ଶୁଟର 4 ପ୍ରତିଶତ ଶୁଖିଲା ଅଛି କିମ୍ବା 14 ପ୍ରତିଶତ ଫଳ ବୋରର ଦ୍ୱାରା ସଂକ୍ରମିତ | ରାସାୟନିକ ନିୟନ୍ତ୍ରଣ ପାଇଁ ଏମାମେକ୍ଟିନ୍ ବେନ୍ଜୋଏଟ୍ 5 ପ୍ରତିଶତ ଏସ୍ଜି @80-ଗ୍ରାମ୍/ଏକର କିମ୍ବା କ୍ଲୋରାଣ୍ଟ୍ରାନିଲିପ୍ରୋଲ୍ 18.5% ଏସ୍ସି @80-ମିଲି/ଏକର କିମ୍ବା ସ୍ପିନେଟୋରାମ୍ 11.7% ଏସ୍ସି @200-ମିଲି/ଏକର ସ୍ପ୍ରେ କରନ୍ତୁ। କୀଟନାଶକ ପ୍ରୟୋଗ ଏବଂ ଅମଳ ମଧ୍ୟରେ 7-10 ଦିନର ବ୍ୟବଧାନ ରହିବା ଉଚିତ୍। ଉପରୋକ୍ତ ଯେ କୌଣସି କୀଟନାଶକକୁ 15 ଦିନର ବ୍ୟବଧାନରେ ବିକଳ୍ପ ଭାବେ ବ୍ୟବହାର କରନ୍ତୁ।"
         ]
      },
      "cow": {
         "advisory": [
            "ବର୍ଷା ଦିନରେ ଘାସରେ ଆର୍ଦ୍ରତା ଅଧିକ ଥିବାରୁ ଗୋରୁମାନେ ସେଥିରୁ ପର୍ଯ୍ୟାପ୍ତ ଶୁଖିଲା ପଦାର୍ଥ ପାଆନ୍ତି ନାହିଁ | ତେଣୁ, ଦୁଗ୍ଧ ପଶୁମାନଙ୍କୁ ପ୍ରତି 2 କି. ଗ୍ରା. କ୍ଷୀର ପାଇଁ 1 କି. ଗ୍ରା. ଦିଅନ୍ତୁ।"
         ]
      },
      "common fish": {
         "advisory": [
            "ଫିଙ୍ଗରଲିଙ୍ଗ ଷ୍ଟକ୍ କରିବା ପରେ, ଚିନାବାଦାମ ତେଲ କେକ୍ ଏବଂ ଚାଉଳ ଚୋପା 1:1 ଅନୁପାତରେ ଦିନକୁ ଦୁଇଥର ସେମାନଙ୍କ ଶରୀରର ଓଜନର 5 ପ୍ରତିଶତ ଖାଦ୍ୟ ଭାବରେ ଦିଆଯାଏ | ମାଛକୁ ଦିଆଯାଉଥିବା ମୋଟ ଖାଦ୍ୟରେ ଭିଟାମିନ୍ ଏବଂ ଖଣିଜ ମିଶ୍ରଣ @1% ମିଶାନ୍ତୁ। ଫିଙ୍ଗରଲିଙ୍ଗ୍ ଷ୍ଟକ୍ କରିବା ପରେ ନିୟମିତ ଭାବରେ ପିଏଚ୍ ଏବଂ ଜଳ ତାପମାତ୍ରା ଯାଞ୍ଚ କରନ୍ତୁ | ପୋଖରୀ ଜଳକୁ ଶୁଦ୍ଧ କରିବା ପାଇଁ ଏକର ପିଛା 40 କିଲୋଗ୍ରାମ ଚୂନ ମିଶାନ୍ତୁ। ପୋଖରୀରେ ପ୍ଲାଙ୍କଟନର ପରିମାଣ ବଢ଼ାଇବା ପାଇଁ, ମାସକୁ ଦୁଇଥର ଏକର ପିଛା 200 କିଲୋଗ୍ରାମ ଗୋବର ଏବଂ 4 କିଲୋଗ୍ରାମ ସୁପରଫସଫେଟ ଲଗାନ୍ତୁ।"
         ]
      },
      "chicken": {
         "advisory": [
            "ବାର୍ଡ ଫ୍ଲୁ ହେଉଛି କୁକୁଡ଼ାର ଏକ ଭୂତାଣୁଜନିତ ରୋଗ। ଏହା ଦୂଷିତ ଡେଣା, ଲାଳ, ପକ୍ଷୀଙ୍କ ବିଷ୍ଠା ମାଧ୍ୟମରେ ବ୍ୟାପିଥାଏ | ବେଳେବେଳେ ଏହା ପ୍ରଭାବିତ ପକ୍ଷୀଙ୍କଠାରୁ ମଣିଷକୁ ବ୍ୟାପିପାରେ | ଏହି ସମୟରେ ଦୟାକରି ପ୍ରତିଦିନ କୁକୁଡ଼ା ଘର ସଫା କରନ୍ତୁ ଏବଂ କୁକୁଡ଼ା ପକ୍ଷୀଙ୍କ ଖାଦ୍ୟ ଏବଂ ପାଣି ବାରମ୍ବାର ପରିବର୍ତ୍ତନ କରନ୍ତୁ। ମୃତ କୁକୁଡ଼ା ପକ୍ଷୀମାନଙ୍କୁ ଏଠାରେ ଏବଂ ସେଠାରେ ଫିଙ୍ଗି ଦିଅନ୍ତୁ ନାହିଁ। ଦୟାକରି ଗ୍ଲୋଭସ୍ ଏବଂ ମାସ୍କ ପିନ୍ଧି ସେମାନଙ୍କୁ ପୋତି ଦିଅନ୍ତୁ ଏବଂ ବ୍ଲିଚିଂ ପାଉଡରରେ ସେହି ସ୍ଥାନକୁ ସାନିଟାଇଜ୍ କରନ୍ତୁ। ପ୍ରଭାବିତ ଅଞ୍ଚଳରୁ କୁକୁଡ଼ା ପକ୍ଷୀ କିମ୍ବା ଅଣ୍ଡା ଘରକୁ ଆଣନ୍ତୁ ନାହିଁ।"
         ]
      }
   }
}