{
    "weather_details": {
        "2024-09-07": {
            "rainfall": 10,
            "t_max": 33,
            "t_min": 24,
            "rh_max": 87,
            "rh_min": 54,
            "wind_speed": 7,
            "wind_direction": 135,
            "cloud_cover": 5
        },
        "2024-09-08": {
            "rainfall": 12,
            "t_max": 32,
            "t_min": 23,
            "rh_max": 92,
            "rh_min": 60,
            "wind_speed": 6,
            "wind_direction": 112,
            "cloud_cover": 7
        },
        "2024-09-09": {
            "rainfall": 20,
            "t_max": 30,
            "t_min": 21,
            "rh_max": 94,
            "rh_min": 63,
            "wind_speed": 6,
            "wind_direction": 236,
            "cloud_cover": 8
        },
        "2024-09-10": {
            "rainfall": 25,
            "t_max": 29,
            "t_min": 21,
            "rh_max": 94,
            "rh_min": 58,
            "wind_speed": 9,
            "wind_direction": 249,
            "cloud_cover": 8
        },
        "2024-09-11": {
            "rainfall": 10,
            "t_max": 31,
            "t_min": 22,
            "rh_max": 94,
            "rh_min": 69,
            "wind_speed": 11,
            "wind_direction": 270,
            "cloud_cover": 7
        }
    },
    "names_of_crops": [
        "ଚାଉଳ",
        "ବାଇଗଣ"
    ],
    "general_advisory": "ଜିଲ୍ଲାରେ ହାଲୁକା ରୁ ମଧ୍ୟମ ବର୍ଷା ହେବାର ସମ୍ଭାବନା ଅଛି ତେଣୁ କୌଣସି ଉଦ୍ଭିଦ ସୁରକ୍ଷା ରାସାୟନିକ ପ୍ରୟୋଗ ପାଇଁ ଯାଆନ୍ତୁ ନାହିଁ, ଆପଣ ଅନ୍ୟ ଦିନରେ କେବଳ ଉଦ୍ଭିଦ ସୁରକ୍ଷା ରାସାୟନିକ ସହିତ ଷ୍ଟିକର ବ୍ୟତୀତ ପ୍ରୟୋଗ ପାଇଁ ଯାଇପାରିବେ |",
    "crops_data": {
        "rice": {
            "advisory": [
                "ରୋପଣ କରାଯାଇଥିବା ଧାନ ମୁଖ୍ୟ କ୍ଷେତରେ ଏକରୁ ପାଞ୍ଚ ସପ୍ତାହ ପର୍ଯ୍ୟନ୍ତ ରହିଥାଏ। ସିଧାସଳଖ ବିହନ ବୁଣାଯାଇଥିବା ଫସଲ ସାତରୁ ନଅ ସପ୍ତାହର ପର୍ଯ୍ୟାୟରେ ହୋଇଥାଏ। ସର୍ବନିମ୍ନ ତାପମାତ୍ରା ଏବଂ ଆପେକ୍ଷିକ ଆର୍ଦ୍ରତା ବିସ୍ଫୋରଣ ରୋଗର ପ୍ରାଦୁର୍ଭାବ ପାଇଁ ଅନୁକୂଳ | ବିସ୍ଫୋରଣ ଜନିତ ରୋଗକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ ପ୍ରଥମେ ଧାନ କ୍ଷେତରୁ ଅତିରିକ୍ତ ପାଣି ବାହାର କରିଦିଅନ୍ତୁ। ହେକ୍ଟର ପିଛା 400-ମିଲି ହେକ୍ସାକୋନାଜୋଲ୍ କିମ୍ବା ଏକର ପିଛା 200-ମିଲି ଆଜୋକ୍ସିସ୍ଟ୍ରୋବିନ୍ + ଡିଫେନୋକାନାଜୋଲ୍ କିମ୍ବା ଏକର ପିଛା 80-ଗ୍ରାମ୍ ଟେବୁକୋନାଜୋଲ୍ + ଟ୍ରାଇଫ୍ଲୋକ୍ସିସ୍ଟ୍ରୋବିନ୍ ସ୍ପ୍ରେ କରନ୍ତୁ। ବର୍ଷା ଜଳ ହ୍ରାସ ପାଇବା ପରେ ଧାନରେ ସ୍ୱାର୍ମିଙ୍ଗ କ୍ୟାଟରପିଲର ସଂକ୍ରମଣ ହେବାର ସମ୍ଭାବନା ରହିଛି। ଏହି ସ୍ପ୍ରେକୁ ପରିଚାଳନା କରିବା ପାଇଁ କ୍ଲୋରପିରିଫସ୍ 50 ପ୍ରତିଶତ + ସାଇପର୍ମେଥ୍ରିନ୍ 5 ପ୍ରତିଶତ ଇସି @400-ମିଲି/ଏକର କିମ୍ବା ଲାମ୍ବଡା-ସାଇହାଲୋଥ୍ରିନ୍ @400-ମିଲି/ଏକର। ଆଚରଣରେ କୀଟ ନିଶାଚର ହୋଇଥିବାରୁ ଉତ୍ତମ ଫଳାଫଳ ପାଇଁ ସନ୍ଧ୍ୟାରେ କୀଟନାଶକ ସିଞ୍ଚନ କରାଯିବା ଉଚିତ। (ପାଣିପାଗ ସ୍ୱଚ୍ଛ ଥିବାବେଳେ ପ୍ରୟୋଗ ପାଇଁ ଯାଆନ୍ତୁ)"
            ]
        },
        "brinjal": {
            "advisory": [
                "ଅଧିକ ମୃତ୍ତିକା ଆର୍ଦ୍ରତା ଏବଂ ଅଧିକ ଆର୍ଦ୍ରତା କାରଣରୁ ବର୍ଷା ଋତୁରେ ବାଇଗଣ ତରଳିବାର କାରଣ ହୋଇପାରେ। ସଂକ୍ରମିତ ଗଛ ଏବଂ ଅବଶିଷ୍ଟାଂଶକୁ ଜାଳି ନଷ୍ଟ କରନ୍ତୁ, ଅନ୍ୟ କ୍ଷେତକୁ ଯିବା ପୂର୍ବରୁ ଉପକରଣକୁ ଜୀବାଣୁମୁକ୍ତ କରନ୍ତୁ। କ୍ଷେତକୁ ଭଲ ଜଳ ନିଷ୍କାସନ ବ୍ୟବସ୍ଥା କରନ୍ତୁ। ରାସାୟନିକ ଚିକିତ୍ସା ପାଇଁ 15 ଲିଟର ପାଣିରେ ମାଟି ବୁଡ଼ାଇବା ପାଇଁ ସ୍ଟ୍ରେପ୍ଟୋସାଇକ୍ଲିନ୍ 6 ଗ୍ରାମ୍ + ବାଭିଷ୍ଟିନ୍ 15 ଗ୍ରାମ୍ ବ୍ୟବହାର କରନ୍ତୁ। (ପାଣିପାଗ ସ୍ୱଚ୍ଛ ଥିବାବେଳେ ପ୍ରୟୋଗ କରନ୍ତୁ)"
            ]
        }
    },
    "date": "06-09-2024"
}