{
    "weather_details": {
        "07/09/2024": {
            "rainfall": 10,
            "t_max": 33,
            "t_min": 26,
            "rh_max": 82,
            "rh_min": 59,
            "wind_speed": 15,
            "wind_direction": 64,
            "cloud_cover": 7
        },
        "08/09/2024": {
            "rainfall": 12,
            "t_max": 31,
            "t_min": 25,
            "rh_max": 86,
            "rh_min": 65,
            "wind_speed": 12,
            "wind_direction": 66,
            "cloud_cover": 7
        },
        "09/09/2024": {
            "rainfall": 20,
            "t_max": 29,
            "t_min": 24,
            "rh_max": 86,
            "rh_min": 66,
            "wind_speed": 12,
            "wind_direction": 68,
            "cloud_cover": 8
        },
        "10/09/2024": {
            "rainfall": 25,
            "t_max": 29,
            "t_min": 24,
            "rh_max": 87,
            "rh_min": 64,
            "wind_speed": 14,
            "wind_direction": 281,
            "cloud_cover": 8
        },
        "11/09/2024": {
            "rainfall": 15,
            "t_max": 31,
            "t_min": 25,
            "rh_max": 84,
            "rh_min": 67,
            "wind_speed": 8,
            "wind_direction": 248,
            "cloud_cover": 7
        }
    },
    "names_of_crops": [
        "ଧାନ।",
        "ମକା",
        "ପନିପରିବା",
        "ଟମାଟୋ",
        "ପେଁପେ",
        "କଦଳୀ"
    ],
    "general_advisory": "କେନ୍ଦ୍ରାପଡ଼ା ଜିଲ୍ଲାରେ ଆଗାମୀ ପାଞ୍ଚ ଦିନ ପାଇଁ ହାଲୁକା ରୁ ମଧ୍ୟମ ବର୍ଷା ହେବାର ସମ୍ଭାବନା ରହିଛି। ବର୍ଷାର ପୂର୍ବାନୁମାନକୁ ଧ୍ୟାନରେ ରଖି କୃଷକମାନଙ୍କୁ କୌଣସି ପ୍ରକାରର ସ୍ପ୍ରେ ନକରିବାକୁ ଏବଂ ଡାଲି ଫସଲ ଏବଂ ପନିପରିବା ନର୍ସରୀରେ ଉପଯୁକ୍ତ ଜଳ ନିଷ୍କାସନ ପରିଚାଳନା କରିବାକୁ ପରାମର୍ଶ ଦିଆଯାଇଛି। ବର୍ଷା ହ୍ରାସ ପାଇବା ପରେ, ପ୍ରତିରୋପଣ କରାଯାଇଥିବା କିମ୍ବା ସିଧାସଳଖ ବୁଣାଯାଇଥିବା ଚାଉଳରେ ସାରର ଉପର ଡ୍ରେସିଂ ଲଗାନ୍ତୁ। ନିମ୍ନ/ମଧ୍ୟମ ଜମିରେ ଧାନ ପ୍ରତିରୋପଣ କ୍ଷେତ୍ରରେ ଯେଉଁଠାରେ ୟୁରିଆର ଟପ୍ ଡ୍ରେସିଂ ପ୍ରୟୋଗ କରାଯାଇ ନାହିଁ, ବର୍ଷା ପରେ 2 ପ୍ରତିଶତ ୟୁରିଆ ସ୍ପ୍ରେ କରନ୍ତୁ। ପାଣି ଅଟକି ରହିବା କାରଣରୁ ଲୌହ ବିଷାକ୍ତତାର ଲକ୍ଷଣ ଦେଖାଯିବା ସମ୍ଭାବନା ରହିଛି। ଏଭଳି ସ୍ଥିତିରେ ଅଟକି ରହିଥିବା ପାଣି ବାହାର କରିଦିଅନ୍ତୁ ଏବଂ ଏକର ପିଛା 10 କିଲୋଗ୍ରାମ ଏମଓପି ଏବଂ ଜିଙ୍କ ସଲଫେଟ୍ 21 ପ୍ରତିଶତ ଲଗାନ୍ତୁ। ଫସଲରେ କୀଟପତଙ୍ଗ ଏବଂ ରୋଗ ଘଟଣା ପାଇଁ ନିୟମିତ ନିରୀକ୍ଷଣ ଅତ୍ୟନ୍ତ ସୁପାରିଶ କରାଯାଏ |",
    "crops_data": {
        "paddy": {
            "advisory": [
                "ବର୍ଷା ଜଳ ହ୍ରାସ ପାଇବା ପରେ ସ୍ୱାର୍ମିଙ୍ଗ କ୍ୟାଟରପିଲର ସଂକ୍ରମଣ ହେବାର ସମ୍ଭାବନା ରହିଛି। ଏହାକୁ ପରିଚାଳନା କରିବା ପାଇଁ, କ୍ଲୋରପିରିଫସ୍ 50 ପ୍ରତିଶତ + ସାଇପର୍ମେଥ୍ରିନ୍ 5 ପ୍ରତିଶତ ଇସି @400-ମିଲି/ଏକର କିମ୍ବା ଲାମ୍ବଡା-ସାଇହାଲୋଥ୍ରିନ୍ @400-ମିଲି/ଏକର ସ୍ପ୍ରେ କରନ୍ତୁ।"
            ]
        },
        "maize": {
            "advisory": [
                "ଏକ ଶୁଖିଲା ଋତୁ ପରେ ବର୍ଷା ମକା ରେ ପତନ ସେନା କୃମିର ସଂକ୍ରମଣକୁ ବୃଦ୍ଧି କରିପାରେ | ଏହି କୀଟକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ ବାୟୋପେଷ୍ଟିସାଇଡ୍ ବିଉଭେରିଆ ବାସିଆନାକୁ ପ୍ରତି ଏକର ପିଛା 200 ଲିଟର ପାଣିରେ ମିଶାଇ ସ୍ପ୍ରେ କରନ୍ତୁ। ପତ୍ର ଚକ୍ର ଭିତରେ ବାଲି, ମାଟି ଏବଂ କାଠର ଛାଇର ଧୂଳି ମିଶ୍ରଣ ଯାହା ଦ୍ୱାରା କ୍ୟାଟର୍ପିଲାର୍ମାନେ ପତ୍ରକୁ ଖାଇପାରିବେ ନାହିଁ | ରାସାୟନିକ ଉପାୟରେ ଏହି କୀଟକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ ଏକର ପିଛା 80 ଗ୍ରାମ୍ ବିଶିଷ୍ଟ ଏମାମେକ୍ଟିନ୍ ବେନ୍ଜୋଏଟ୍ 5 ପ୍ରତିଶତ ଏସ୍. ଜି. କିମ୍ବା ଏକର ପିଛା 100 ମିଲି ବିଶିଷ୍ଟ ସ୍ପିନେଟୋରାମ୍ ଏସ୍. ସି. କିମ୍ବା ଏକର ପିଛା 80 ମିଲି ବିଶିଷ୍ଟ କ୍ଲୋରାଣ୍ଟ୍ରାନିଲିପ୍ରୋଲ୍ ଏସ୍. ସି. ସ୍ପ୍ରେ କରନ୍ତୁ। କୀଟନାଶକ ସିଞ୍ଚନ ପାଇଁ ଏକର ପିଛା 200 ଲିଟର ପାଣି ଆବଶ୍ୟକ ହୋଇଥାଏ।"
            ]
        },
        "vegetables": {
            "advisory": [
                "ଟମାଟୋ, ବାଇଗଣ ଏବଂ ଲଙ୍କା ପରି ପନିପରିବା ନର୍ସରୀରେ ରୋଗ ହ୍ରାସ ହେବାର ସମ୍ଭାବନା ଅଛି | ଏହାକୁ ପରିଚାଳନା କରିବା ପାଇଁ, ନର୍ସରୀ ଶଯ୍ୟାକୁ 2-ଗ୍ରାମ୍ କ୍ୟାପଟେନ୍/ଲିଟର ପାଣି କିମ୍ବା 2.5-gram କପର୍ ଅକ୍ସିକ୍ଲୋରାଇଡ୍/ଲିଟର ପାଣିରେ ଭିଜାଇ ଦିଅନ୍ତୁ।"
            ]
        },
        "tomato": {
            "advisory": [
                "ନର୍ସରୀରେ ଟମାଟୋ ଚାଷ ପାଇଁ ସେପ୍ଟେମ୍ବର ହେଉଛି ସର୍ବୋତ୍ତମ ସମୟ। ବି. ଟି.-2, ବି. ଟି.-10, ବି. ଟି.-12, ନୀଳାଦ୍ରି, ସଦାବାହାର, ମାଧୁରୀ, ମହାରଥି, ରଶ୍ମୀ, ନବୀନ ଇତ୍ୟାଦି ପ୍ରତିରୋଧୀ କିସମର ଚାଷ କରନ୍ତୁ।"
            ]
        },
        "papaya": {
            "advisory": [
                "ପେଁପେ କ୍ରାଉନ୍ କୁଞ୍ଚନକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ, 15 ଦିନ ବ୍ୟବଧାନରେ କପର୍ ଅକ୍ସିକ୍ଲୋରାଇଡ୍ @3 ଗ୍ରାମ୍/ଲିଟର ପାଣି କିମ୍ବା କାର୍ବେନଡାଜିମ୍ @1 ଗ୍ରାମ୍/ଲିଟର କିମ୍ବା ଥିଓଫାନେଟ୍ ମିଥାଇଲ @1 ଗ୍ରାମ୍/ଲିଟର ସ୍ପ୍ରେ କରନ୍ତୁ।"
            ]
        },
        "banana": {
            "advisory": [
                "ଜଳ ନିଷ୍କାସନ ବ୍ୟବସ୍ଥା କରନ୍ତୁ। ଗଛଗୁଡ଼ିକୁ ଷ୍ଟାକିଂ ଦିଅନ୍ତୁ। ସିଗଟୋକା ରୋଗ ପାଇଁ, ସତର୍କତାମୂଳକ ପଦକ୍ଷେପ ଭାବରେ 200 ଲିଟର ପାଣି ସହିତ ଏକର ପିଛା ମାନକୋଜେବ୍ 75 ପ୍ରତିଶତ ଡବ୍ଲ୍ୟୁ. ପି. (@400-ଗ୍ରାମ କିମ୍ବା ଜିନେବ୍ 75 ପ୍ରତିଶତ ଡବ୍ଲ୍ୟୁ. ପି. @400 ଗ୍ରାମ କିମ୍ବା କାର୍ବେଣ୍ଡାଜିମ୍ 12 ପ୍ରତିଶତ + ମାନକୋଜେବ୍ 63 ପ୍ରତିଶତ ଡବ୍ଲ୍ୟୁ. ପି. @400 ଗ୍ରାମ ସ୍ପ୍ରେ କରନ୍ତୁ।"
            ]
        }
    },
    "date": "06-09-2024"
}