{
   "weather_details": {
      "07-09-2024": {
         "rainfall": 15,
         "t_max": 30,
         "t_min": 25,
         "rh_max": 93,
         "rh_min": 65,
         "wind_speed": 7,
         "wind_direction": 248,
         "cloud_cover": 7
      },
      "08-09-2024": {
         "rainfall": 15,
         "t_max": 30,
         "t_min": 25,
         "rh_max": 94,
         "rh_min": 67,
         "wind_speed": 9,
         "wind_direction": 283,
         "cloud_cover": 7
      },
      "09-09-2024": {
         "rainfall": 20,
         "t_max": 29,
         "t_min": 24,
         "rh_max": 96,
         "rh_min": 76,
         "wind_speed": 13,
         "wind_direction": 283,
         "cloud_cover": 8
      },
      "10-09-2024": {
         "rainfall": 25,
         "t_max": 29,
         "t_min": 24,
         "rh_max": 94,
         "rh_min": 74,
         "wind_speed": 16,
         "wind_direction": 257,
         "cloud_cover": 8
      },
      "11-09-2024": {
         "rainfall": 15,
         "t_max": 30,
         "t_min": 25,
         "rh_max": 94,
         "rh_min": 78,
         "wind_speed": 14,
         "wind_direction": 252,
         "cloud_cover": 7
      }
   },
   "names_of_crops": [
      "ସିଧାସଳଖ ବିହନ ବୁଣାଯାଇଥିବା ଧାନ",
      "ରୋପଣ କରାଯାଇଥିବା ଧାନ",
      "କପା",
      "ଅରହର",
      "ସଂକର ମକା",
      "ବାଇଗଣ",
      "ଲଙ୍କା",
      "ଟମାଟୋ",
      "ଗାଈ ଏବଂ ମଇଁଷି",
      "ଛେଳି ଏବଂ ମେଣ୍ଢା",
      "କୁକୁଡ଼ା ମାଂସ"
   ],
   "general_advisory": "ଆଇଏମଡିରୁ ମିଳିଥିବା ପୂର୍ବାନୁମାନର ବର୍ଦ୍ଧିତ ପରିସର ଅନୁଯାୟୀ, ପ୍ରଥମ ସପ୍ତାହରେ (6 ରୁ 12 ସେପ୍ଟେମ୍ବର, 2024) ଓଡ଼ିଶାର ଜିଲ୍ଲାଗୁଡ଼ିକରେ ବ୍ୟାପକ ବର୍ଷା/ବଜ୍ରପାତ ହେବାର ସମ୍ଭାବନା ରହିଛି ଏବଂ ସେପ୍ଟେମ୍ବର 6 ରେ ଦକ୍ଷିଣ ଓଡ଼ିଶାର ଜିଲ୍ଲାଗୁଡ଼ିକରେ ପ୍ରବଳ ବର୍ଷା ହେବାର ସମ୍ଭାବନା ରହିଛି; ସେପ୍ଟେମ୍ବର 7 ରେ ଦକ୍ଷିଣ ଓଡ଼ିଶାର ଜିଲ୍ଲାଗୁଡ଼ିକରେ ପ୍ରବଳରୁ ଅତି ପ୍ରବଳ ବର୍ଷା ହେବାର ସମ୍ଭାବନା ରହିଛି; ସେପ୍ଟେମ୍ବର 8 ରେ କେନ୍ଦ୍ରୀୟ ଓଡ଼ିଶାର ଜିଲ୍ଲାଗୁଡ଼ିକରେ ପ୍ରବଳରୁ ଅତି ପ୍ରବଳ ବର୍ଷା ହେବାର ସମ୍ଭାବନା ରହିଛି, ସେପ୍ଟେମ୍ବର 9 ଏବଂ 10 ରେ ଉତ୍ତର ଓଡ଼ିଶାର ଜିଲ୍ଲାଗୁଡ଼ିକରେ ପ୍ରବଳ ବର୍ଷା ହେବାର ସମ୍ଭାବନା ରହିଛି। ଦ୍ୱିତୀୟ ସପ୍ତାହରେ (13 ରୁ 19 ସେପ୍ଟେମ୍ବର, 2024) ଓଡ଼ିଶା ରାଜ୍ୟରେ ବ୍ୟାପକ ବର୍ଷା/ବଜ୍ରପାତ ହେବାର ସମ୍ଭାବନା ରହିଛି। ଆଇଏମଡିରୁ ମିଳିଥିବା ପାଞ୍ଚ ଦିନିଆ ପାଣିପାଗ ପୂର୍ବାନୁମାନକୁ ଦୃଷ୍ଟିରେ ରଖି, କୃଷକମାନଙ୍କୁ ବର୍ତ୍ତମାନ ପାଇଁ ସାର ଏବଂ ଉଦ୍ଭିଦ ସୁରକ୍ଷା ରାସାୟନିକ ପ୍ରୟୋଗ ବନ୍ଦ କରିବାକୁ ପରାମର୍ଶ ଦିଆଯାଇଛି। ଫସଲର ବୃଦ୍ଧି ପର୍ଯ୍ୟାୟ ଅନୁଯାୟୀ ସନ୍ତୁଳିତ ଏବଂ ଉପଯୁକ୍ତ ସାର ପ୍ରୟୋଗ କରନ୍ତୁ। ଅତ୍ୟଧିକ ନାଇଟ୍ରୋଜେନ୍ ଠାରୁ ଦୂରେଇ ରୁହନ୍ତୁ କାରଣ ଏହା ଅତ୍ୟଧିକ ଉଦ୍ଭିଦ ବୃଦ୍ଧିକୁ ପ୍ରୋତ୍ସାହିତ କରେ ଏବଂ ଜଳ ଚାହିଦା ବୃଦ୍ଧି କରେ | ଯଦି ଫସଲକୁ କୀଟପତଙ୍ଗରୁ ରକ୍ଷା କରିବା ପାଇଁ ଉପଲବ୍ଧ ଥାଏ, ତେବେ ଜୈବିକ ଚିକିତ୍ସା ସହିତ ସର୍ବଦା ପ୍ରତିଷେଧକ ପଦକ୍ଷେପଗୁଡ଼ିକର ଏକ ସମନ୍ୱିତ ଆଭିମୁଖ୍ୟ ଉପରେ ବିଚାର କରନ୍ତୁ। ବ୍ୟାପକ କୀଟନାଶକ ବ୍ୟବହାର କୀଟପତଙ୍ଗରେ ପ୍ରତିରୋଧ ସୃଷ୍ଟି କରିପାରେ। ଏହାକୁ ରୋକିବା ପାଇଁ, କୀଟନାଶକ ଏବଂ ମିଶ୍ରଣ ବ୍ୟବହାର ମଧ୍ୟରେ ଉପଯୁକ୍ତ ଘୂର୍ଣ୍ଣନ ନିଶ୍ଚିତ କରନ୍ତୁ | କୀଟ ସଂଖ୍ୟା ଉପରେ ନଜର ରଖିବା ପାଇଁ ହାଲୁକା ଫାନ୍ଦ ବ୍ୟବହାର କରନ୍ତୁ ଯାହା ଦ୍ୱାରା ସମୟୋଚିତ ନିୟନ୍ତ୍ରଣ ପଦକ୍ଷେପ ନିଆଯାଇପାରିବ। ଏସ୍. ଏମ୍. ଏସ୍. ପରାମର୍ଶ-ଯଦି ମକା ଫସଲ ଟାସେଲିଂ ପର୍ଯ୍ୟାୟରେ (9 ସପ୍ତାହ) ଥାଏ, ତା \"ହେଲେ ୟୁରିଆକୁ ଏସି ପିଛା 25 କି. ଗ୍ରା. ରେ ଲଗାନ୍ତୁ।",
   "crops_data": {
      "direct seeded paddy": {
         "advisory": [
            "କୀଟପତଙ୍ଗ ଏବଂ ରୋଗର ପ୍ରକୋପକୁ ହ୍ରାସ କରିବା ପାଇଁ କୃଷକମାନଙ୍କୁ ଲିଟର ପିଛା ବେଲ୍, ତୁଳସୀ କିମ୍ବା ନିମ ପତ୍ରର ନିର୍ଯାସ ସ୍ପ୍ରେ କରିବାକୁ ପରାମର୍ଶ ଦିଆଯାଇଛି।"
         ]
      },
      "transplanted paddy": {
         "advisory": [
            "କାଣ୍ଡ ଛେଦକ, ପତ୍ର ଫୋଲଡର, ଏବଂ ଧାନ କାନ ଖାଉଥିବା କ୍ୟାଟର୍ପିଲରର ଜନସଂଖ୍ୟାକୁ ନିରୀକ୍ଷଣ ଏବଂ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ ଫେରୋମୋନ୍ ଟ୍ରାପ୍ ସ୍ଥାପନ କରନ୍ତୁ |"
         ]
      },
      "cotton": {
         "advisory": [
            "କପା ବୀଜ ଉତ୍ପାଦନରେ ଉନ୍ନତି ଆଣିବା ପାଇଁ 60-65 DAS ରେ ଉଦ୍ଭିଦ ହରମୋନ୍ ପ୍ଲାନୋଫିକ୍ସର ପ୍ରୟୋଗ।",
            "ଆଗାଛା ନିୟନ୍ତ୍ରଣ ପାଇଁ ଟୋଟାଲ୍ କିଲର୍ ହର୍ବିସାଇଡ୍ ଗ୍ଲାଇଫୋସେଟ୍ କିମ୍ବା ଗ୍ଲୁଫୋସିନେଟ୍ ଆମୋନିୟମ୍ 13.5% ଲଗାନ୍ତୁ।"
         ]
      },
      "arhar": {
         "advisory": [
            "ପତ୍ର ୱେବର୍ ସଂକ୍ରମଣକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ, ପ୍ରୋଫେନୋଫସ୍ 50 ପ୍ରତିଶତ ଇ. ସି. କିମ୍ବା କ୍ଲୋରପାଇରିଫସ୍ 50 ପ୍ରତିଶତ + ସାଇପର୍ମେଥ୍ରିନ 5 ପ୍ରତିଶତ ଇ. ସି. ଲିଟର ପିଛା ପାଣି ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "hybrid maize": {
         "advisory": [
            "ଯଦି ଫସଲ ଟାସେଲିଂ ପର୍ଯ୍ୟାୟରେ ଥାଏ, ତା \"ହେଲେ ଏସି ପିଛା 25 କିଲୋଗ୍ରାମ ୟୁରିଆ ଲଗାନ୍ତୁ ଏବଂ ଯଦି ପର୍ଯ୍ୟାପ୍ତ ପାଣି ନଥାଏ, ତେବେ ଜଳସେଚନ କରନ୍ତୁ।",
            "କୀଟ ସଂକ୍ରମଣର ଲକ୍ଷଣ ପାଇଁ ନିୟମିତ ଭାବରେ କ୍ଷେତ୍ର ଉପରେ ନଜର ରଖନ୍ତୁ |"
         ]
      },
      "brinjal": {
         "advisory": [
            "ଶୋଷକ କୀଟପତଙ୍ଗ ଉପରେ ନଜର ରଖିବା ପାଇଁ ହଳଦିଆ ଚଟପଟା ଜାଲ ଲଗାନ୍ତୁ।",
            "ମୂଳ ଅଞ୍ଚଳରେ 200 ମି. ଲି./ଏକରରେ ଟେବୁକୋନାଜୋଲ୍ + 30 ଗ୍ରାମ/ଏକରରେ ସ୍ଟ୍ରେପ୍ଟୋସାଇକ୍ଲିନ୍ ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "chilli": {
         "advisory": [
            "ଥ୍ରୀପ୍ସର ସଂକ୍ରମଣ ଉପରେ ନଜର ରଖିବା ପାଇଁ ବ୍ଲୁ ଷ୍ଟିକି ଟ୍ରାପ୍ ଲଗାନ୍ତୁ।",
            "ଯଦି ଥ୍ରିପ୍ସ ସଂକ୍ରମଣର ଲକ୍ଷଣ ଦେଖାଯାଏ, ତେବେ ସଂକ୍ରମଣର ପ୍ରାରମ୍ଭିକ ପର୍ଯ୍ୟାୟରେ ନିମ୍ବ-ଆଧାରିତ କୀଟନାଶକ ଆଜାଦିରାକ୍ଟିନ ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "tomato": {
         "advisory": [
            "ଟମାଟୋ ଚାରା ଲଗାଇବା ପାଇଁ ଏବେ ଉପଯୁକ୍ତ ସମୟ।",
            "ବିହନ ହାର ଏକର ପିଛା 150 ରୁ 200 ଗ୍ରାମ।"
         ]
      },
      "cow & buffalo": {
         "advisory": [
            "ବର୍ଷା ଦିନରେ ଘାସରେ ଅଧିକ ଆର୍ଦ୍ରତା ଥିବାରୁ ଦୁଗ୍ଧ ପଶୁମାନଙ୍କୁ ପ୍ରତି 2 କିଲୋଗ୍ରାମ କ୍ଷୀର ପାଇଁ 1 କିଲୋଗ୍ରାମ କନସେଣ୍ଟ୍ରେଟ୍ ଦିଅନ୍ତୁ।"
         ]
      },
      "goat & sheep": {
         "advisory": [
            "ବର୍ଷା ଋତୁରେ ମେଣ୍ଢା ଏବଂ ଛେଳି ପାଇଁ ଘରେ ଶୁଖିଲା ପଶୁଖାଦ୍ୟ ଏବଂ ନଡ଼ିଆ ପ୍ରସ୍ତୁତ ରଖନ୍ତୁ ଏବଂ ଛେଳି ଏବଂ ଛେଳିଙ୍କୁ ମଜା କରିବା ଏବଂ ଛେଳି ମାରିବାର ଏକ ମାସ ପୂର୍ବରୁ ସନ୍ତୁଳିତ ସାନ୍ଦ୍ରତା ଦେବା ପାଇଁ ଫ୍ଲାଶିଂ ଅଭ୍ୟାସ ନିଶ୍ଚିତ କରନ୍ତୁ |"
         ]
      },
      "poultry": {
         "advisory": [
            "ପ୍ରତିଦିନ କୁକୁଡ଼ା ଘର ସଫା କରନ୍ତୁ ଏବଂ କୁକୁଡ଼ା ପକ୍ଷୀଙ୍କ ଖାଦ୍ୟ ଏବଂ ପାଣି ବାରମ୍ବାର ପରିବର୍ତ୍ତନ କରନ୍ତୁ |",
            "ମୃତ କୁକୁଡ଼ା ପକ୍ଷୀମାନଙ୍କୁ କବର ଦିଅନ୍ତୁ ଏବଂ ବ୍ଲିଚିଂ ପାଉଡରରେ ସେହି ସ୍ଥାନକୁ ସାନିଟାଇଜ କରନ୍ତୁ।",
            "ପ୍ରଭାବିତ ଅଞ୍ଚଳରୁ କୁକୁଡ଼ା ପକ୍ଷୀ କିମ୍ବା ଅଣ୍ଡା ଘରକୁ ଆଣନ୍ତୁ ନାହିଁ।"
         ]
      }
   },
   "date": "06-09-2024"
}