{
   "weather_details": {
      "07-09-2024": {
         "rainfall": 10,
         "t_max": 34,
         "t_min": 23,
         "rh_max": 94,
         "rh_min": 66,
         "wind_speed": 6,
         "wind_direction": 225,
         "cloud_cover": 7
      },
      "08-09-2024": {
         "rainfall": 15,
         "t_max": 33,
         "t_min": 23,
         "rh_max": 94,
         "rh_min": 66,
         "wind_speed": 8,
         "wind_direction": 257,
         "cloud_cover": 7
      },
      "09-09-2024": {
         "rainfall": 25,
         "t_max": 32,
         "t_min": 23,
         "rh_max": 95,
         "rh_min": 73,
         "wind_speed": 9,
         "wind_direction": 257,
         "cloud_cover": 8
      },
      "10-09-2024": {
         "rainfall": 25,
         "t_max": 32,
         "t_min": 23,
         "rh_max": 95,
         "rh_min": 74,
         "wind_speed": 11,
         "wind_direction": 257,
         "cloud_cover": 8
      },
      "11-09-2024": {
         "rainfall": 10,
         "t_max": 33,
         "t_min": 24,
         "rh_max": 94,
         "rh_min": 75,
         "wind_speed": 13,
         "wind_direction": 248,
         "cloud_cover": 7
      }
   },
   "names_of_crops": [
      "ସିଧାସଳଖ ବିହନ ବୁଣାଯାଇଥିବା ଧାନ",
      "ରୋପଣ କରାଯାଇଥିବା ଧାନ",
      "କପା",
      "ଅରହର",
      "ସଂକର ମକା",
      "ବାଇଗଣ",
      "ଲଙ୍କା",
      "ଟମାଟୋ",
      "ଗାଈ ଏବଂ ମଇଁଷି",
      "ଛେଳି ଏବଂ ମେଣ୍ଢା",
      "କୁକୁଡ଼ା ମାଂସ"
   ],
   "general_advisory": "ଆଇଏମଡିରୁ ମିଳିଥିବା ପୂର୍ବାନୁମାନର ବର୍ଦ୍ଧିତ ପରିସର ଅନୁଯାୟୀ, ସପ୍ତାହ-1 (ସେପ୍ଟେମ୍ବର 6-12,2024) ରେ ଓଡ଼ିଶାର ଜିଲ୍ଲାଗୁଡ଼ିକରେ ବ୍ୟାପକ ବର୍ଷା/ବଜ୍ରପାତ ହେବାର ସମ୍ଭାବନା ରହିଛି ଏବଂ ସେପ୍ଟେମ୍ବର 6 ରେ ଦକ୍ଷିଣ ଓଡ଼ିଶାର ଜିଲ୍ଲାଗୁଡ଼ିକରେ ବିଚ୍ଛିନ୍ନ ଭାବେ ପ୍ରବଳ ବର୍ଷା ହେବାର ସମ୍ଭାବନା ରହିଛି; ସେପ୍ଟେମ୍ବର 7 ରେ ଦକ୍ଷିଣ ଓଡ଼ିଶାର ଜିଲ୍ଲାଗୁଡ଼ିକରେ ବିଚ୍ଛିନ୍ନ ଭାବେ ପ୍ରବଳରୁ ଅତି ପ୍ରବଳ ବର୍ଷା ହେବାର ସମ୍ଭାବନା ରହିଛି; ସେପ୍ଟେମ୍ବର 8 ରେ କେନ୍ଦ୍ରୀୟ ଓଡ଼ିଶାର ଜିଲ୍ଲାଗୁଡ଼ିକରେ ବିଚ୍ଛିନ୍ନ ଭାବେ ପ୍ରବଳରୁ ଅତି ପ୍ରବଳ ବର୍ଷା ହେବାର ସମ୍ଭାବନା ରହିଛି, ସେପ୍ଟେମ୍ବର 9 ଏବଂ 10 ରେ ଉତ୍ତର ଓଡ଼ିଶାର ଜିଲ୍ଲାଗୁଡ଼ିକରେ ପ୍ରବଳ ବର୍ଷା ହେବାର ସମ୍ଭାବନା ରହିଛି।",
   "crops_data": {
      "direct seeded paddy": {
         "advisory": [
            "କୀଟପତଙ୍ଗ ଏବଂ ରୋଗର ପ୍ରକୋପକୁ ହ୍ରାସ କରିବା ପାଇଁ କୃଷକମାନଙ୍କୁ ଲିଟର ପିଛା ବେଲ୍ (25 ଗ୍ରାମ୍ ତାଜା ପତ୍ର) କିମ୍ବା ତୁଳସୀ (25 ଗ୍ରାମ୍ ତାଜା ପତ୍ର) କିମ୍ବା ନିମ୍ (200 ଗ୍ରାମ୍ ତାଜା ପତ୍ର) ର ପତ୍ରର ନିର୍ଯାସ ସ୍ପ୍ରେ କରିବାକୁ ପରାମର୍ଶ ଦିଆଯାଇଛି।",
            "ବର୍ତ୍ତମାନର ପାଣିପାଗ ବିସ୍ଫୋରଣ ସଂକ୍ରମଣ ପାଇଁ ଅନୁକୂଳ ଅଟେ। ଯଦି ଧାନ କ୍ଷେତରେ ପତ୍ରର ବିସ୍ଫୋରଣ ପରିଲକ୍ଷିତ ହୁଏ, ତେବେ 200 ଲିଟର ପାଣି ସହିତ ମିଶ୍ରଣ କରି ଏକର ପିଛା 80 ଗ୍ରାମ୍ ପିଛା ଟେବୁକୋନାଜୋଲ୍ 50 ପ୍ରତିଶତ + ଟ୍ରାଇଫ୍ଲୋକ୍ସିସ୍ଟ୍ରୋବିନ୍ 25 ପ୍ରତିଶତ ଡବ୍ଲୁଜି (ନାଟିଭୋ) କିମ୍ବା ଆଇସୋପ୍ରୋଥିଓଲେନ୍ 40 ଇସି (ସୁଲତାନ/ଫୁଜିଟା/ଫୁଜିଓନ୍) 300 ମିଲି ଲେଖାଏଁ ସ୍ପ୍ରେ କରନ୍ତୁ। 7-10 ଦିନ ବ୍ୟବଧାନରେ ସ୍ପ୍ରେକୁ ପୁନରାବୃତ୍ତି କରନ୍ତୁ।",
            "ବର୍ତ୍ତମାନର ପାଣିପାଗ ସ୍ଥିତିରେ ଧାନରେ ଶୀଥ୍ ରଟ୍ ଏବଂ ଶୀଥ୍ ବ୍ଲାଇଟ୍ ସଂକ୍ରମଣ ହେବାର ସମ୍ଭାବନା ରହିଛି। ଏହି ରୋଗକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ ଟେବୁକୋନାଜୋଲ 50 ପ୍ରତିଶତ + ଟ୍ରାଇଫ୍ଲୋକ୍ସିସ୍ଟ୍ରୋବିନ 25 ପ୍ରତିଶତ ଡବ୍ଲୁ. ଜି. (ନାଟିଭୋ) @80 ଗ୍ରାମ/ଏକର କିମ୍ବା ପ୍ରୋପିକୋନାଜୋଲ 25 ପ୍ରତିଶତ ଇ. ସି. ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "transplanted paddy": {
         "advisory": [
            "ଷ୍ଟେମ ବୋରର, ଲିଫ୍ ଫୋଲଡର ଏବଂ ଚାଉଳ କାନ ଖାଉଥିବା କ୍ୟାଟର୍ପିଲରର ଜନସଂଖ୍ୟା ଉପରେ ନଜର ରଖିବା ଏବଂ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ ଫେରୋମୋନ୍ ଟ୍ରାପ୍ @8nos./acre ଏବଂ ଲାଇଟ୍ ଟ୍ରାପ୍ @1no./acre ସ୍ଥାପନ କରନ୍ତୁ ଏବଂ ତିନି ସପ୍ତାହ ପରେ ଲୋଭକୁ ବଦଳାନ୍ତୁ |",
            "ଷ୍ଟେମ ବୋରର ସ୍ଥାନୀୟ ଅଞ୍ଚଳରେ, ଅଣ୍ଡା ପରଜୀବୀ ଟ୍ରାଇକୋଗ୍ରାମମା ଜାପୋନିକମ (ଟ୍ରାଇକୋ କାର୍ଡ) @60000 ଅଣ୍ଡା (3 କାର୍ଡ)/ଏକର ଛାଡ଼ିବା ଆବଶ୍ୟକ।",
            "ଧାନ କେସ୍ କୃମିର ସଂକ୍ରମଣ ପରିଲକ୍ଷିତ ହୋଇଛି। ସଂକ୍ରମଣକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ ଫାଇପ୍ରୋନିଲ୍ 5 ପ୍ରତିଶତ ଏସ୍. ସି. କିମ୍ବା ଫେନ୍ଥୋଏଟ୍ 50 ପ୍ରତିଶତ ଇ. ସି. କିମ୍ବା ପ୍ରୋଫେନୋଫସ୍ 50 ପ୍ରତିଶତ ଇ. ସି. @2 ମିଲି/ଲିଟର ପାଣି ଲଗାନ୍ତୁ।"
         ]
      },
      "cotton": {
         "advisory": [
            "କପା ମଞ୍ଜି ଉତ୍ପାଦନରେ ଉନ୍ନତି ଆଣିବା ପାଇଁ ଉଦ୍ଭିଦ ହରମୋନ୍ ପ୍ଲାନୋଫିକ୍ସ @7 ମିଲିଲିଟରକୁ 15 ଲିଟର ପାଣି ସହିତ ମିଶାଇ 60-65 ଡିଏଏସରେ ପ୍ରୟୋଗ କରିବା ଉଚିତ।",
            "ଆଗାଛା ପରିଚାଳନାଃ ସମସ୍ତ ପ୍ରକାରର ଆଗାଛାକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ ହୁଡ୍ ବ୍ୟବହାର କରି ନିର୍ଦ୍ଦେଶିତ ସ୍ପ୍ରେ ଭାବରେ ଟୋଟାଲ୍ କିଲର୍ ହର୍ବିସାଇଡ୍ ଗ୍ଲାଇଫୋସେଟ୍ କିମ୍ବା ଗ୍ଲୁଫୋସିନେଟ୍ ଆମୋନିୟମ୍ 13.5% @50 ମିଲି/10-ଲିଟର ପାଣି ପ୍ରୟୋଗ କରନ୍ତୁ।",
            "ପୋଷକ ତତ୍ତ୍ୱ ପରିଚାଳନାଃ ହାଇବ୍ରିଡରେ ଏକର ପିଛା 20 କି. ଗ୍ରା. ୟୁରିଆ ଏବଂ ଉଚ୍ଚ ଉତ୍ପାଦନକାରୀ କିସମର ଏକର ପିଛା 15 କି. ଗ୍ରା. ୟୁରିଆ 60 ଡିଏଏସରେ ଦ୍ୱିତୀୟ ଶୀର୍ଷ ଡ୍ରେସିଂ ଭାବେ ପ୍ରୟୋଗ କରନ୍ତୁ।"
         ]
      },
      "arhar": {
         "advisory": [
            "ପତ୍ର ୱେବର୍ ସଂକ୍ରମଣକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ ପ୍ରୋଫେନୋଫସ୍ 50 ପ୍ରତିଶତ ଇସି କିମ୍ବା କ୍ଲୋରପିରିଫସ୍ 50 ପ୍ରତିଶତ + ସାଇପର୍ମେଥ୍ରିନ୍ 5 ପ୍ରତିଶତ ଇସି @2 ମିଲି/ଲିଟର @2 ମିଲି/ଲିଟର ପାଣି ସ୍ପ୍ରେ କରନ୍ତୁ।",
            "କୀଟ ସଂକ୍ରମଣର ଲକ୍ଷଣଗୁଡ଼ିକ ପାଇଁ ନିୟମିତ ଭାବେ ନିଜ କ୍ଷେତ ଉପରେ ନଜର ରଖନ୍ତୁ। ପ୍ରଚଳିତ ପାଣିପାଗ ସ୍ଥିତିରେ ଶୋଷକ କୀଟ ସଂକ୍ରମଣ ଦେଖିବାକୁ ମିଳିପାରେ। ଏଫିଡ୍, ଜ୍ଯାସିଡ୍ ଏବଂ ଥ୍ରୀପ୍ ପରି ଶୋଷକ କୀଟକୁ ରୋକିବା ପାଇଁ, ନିମ୍ବ-ଆଧାରିତ କୀଟନାଶକ (1500 ପିପିଏମ୍) ସଂକ୍ରମଣର ପ୍ରାରମ୍ଭିକ ପର୍ଯ୍ୟାୟରେ 3 ମିଲି/ଲିଟର ପାଣିରେ ସ୍ପ୍ରେ କରାଯାଇପାରେ |",
            "ବର୍ଷା କମିବା ପରେ ତରଳିବାର ଦୃଶ୍ୟମାନ ହୋଇପାରେ। ଏକ ନିୟନ୍ତ୍ରଣ ପଦକ୍ଷେପ ଭାବରେ ଗଛର ମୂଳ ଅଞ୍ଚଳରେ ମେଟିରାମ୍ 75 ପ୍ରତିଶତ WG @1.5g/liter ପ୍ରୟୋଗ କରନ୍ତୁ।"
         ]
      },
      "hybrid maize": {
         "advisory": [
            "ପୋଷକ ତତ୍ତ୍ୱ ପରିଚାଳନାଃ ଯଦି ଫସଲ ଟାସେଲିଂ ପର୍ଯ୍ୟାୟରେ ଥାଏ, ତା \"ହେଲେ ଏସି ପିଛା 25 କିଲୋଗ୍ରାମ ୟୁରିଆ ଲଗାନ୍ତୁ ଏବଂ ଯଦି ପର୍ଯ୍ୟାପ୍ତ ପାଣି ନଥାଏ, ତେବେ ଜଳସେଚନ କରନ୍ତୁ।",
            "କୀଟ ପରିଚାଳନାଃ ଷ୍ଟେମ ବୋରରର ପ୍ରଭାବଶାଳୀ ନିୟନ୍ତ୍ରଣ ପାଇଁ ଫିପ୍ରୋନିଲ 5 ପ୍ରତିଶତ ଏସସି କିମ୍ବା ପ୍ରୋଫେନୋଫସ୍ 50 ପ୍ରତିଶତ ଇସି @400 ମିଲି/ଏକରରେ 200 ଲିଟର ପାଣି ସହିତ ମିଶାଇ ସ୍ପ୍ରେ କରନ୍ତୁ।",
            "ଏଫ. ଏ. ଡବ୍ଲ୍ୟୁ. ସଂକ୍ରମଣକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ 200 ଲିଟର ପାଣି ସହିତ ମିଶ୍ରଣ କରି ଏକର ପିଛା 80 ଗ୍ରାମ ପିଛା 5 ପ୍ରତିଶତ ଏସ୍. ଜି. ଇମାମେକ୍ଟିନ୍ ବେନ୍ଜୋଏଟ୍ ଲଗାନ୍ତୁ।",
            "ବି. ଏଲ୍. ଏସ୍. ବି.-ଭିଜାଇ ରଖିଥିବା, ରଙ୍ଗହୀନ ଏକକେନ୍ଦ୍ରିକ ବ୍ୟାଣ୍ଡ ଏବଂ ପତ୍ର ଏବଂ ଆବରଣ ଉପରେ ରିଙ୍ଗ। ନିୟନ୍ତ୍ରଣ ପାଇଁ, ଭାଲିଡାମାଇସିନ୍ 3 ପ୍ରତିଶତ ଏସ୍. ଏଲ୍. କିମ୍ବା ହେକ୍ସାକୋନାଜୋଲ୍ 5 ପ୍ରତିଶତ ଇ. ସି. @2 ମିଲି/ଲିଟର ପାଣି ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "brinjal": {
         "advisory": [
            "ଶୋଷକ କୀଟପତଙ୍ଗ ଉପରେ ନଜର ରଖିବା ପାଇଁ @8nos./acre ହଳଦିଆ ଚଟପଟା ଜାଲ ଲଗାନ୍ତୁ।",
            "ବିଲ୍ଟିଂଃ 200 ଲିଟର ପାଣି ସହିତ ମିଶ୍ରଣ କରି ମୂଳ ଅଞ୍ଚଳରେ ଟେବୁକୋନାଜୋଲ୍ 25.9% ଇସି @200-ମିଲି/ଏକର + ସ୍ଟ୍ରେପ୍ଟୋସାଇକ୍ଲିନ୍ @30 ଗ୍ରାମ୍/ଏକର ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "chilli": {
         "advisory": [
            "ଥ୍ରୀପ୍ସର ସଂକ୍ରମଣ ଉପରେ ନଜର ରଖିବା ପାଇଁ ବ୍ଲୁ ଷ୍ଟିକି ଟ୍ରାପ୍ @8nos./acre ଲଗାନ୍ତୁ।",
            "ପ୍ରଚଳିତ ପାଣିପାଗ ସ୍ଥିତି ଥ୍ରିପ୍ସ ଆକ୍ରମଣ ପାଇଁ ଅନୁକୂଳ | ଯଦି ପତ୍ରଗୁଡ଼ିକ ଉପରକୁ ଘୁଞ୍ଚିଯାଏ ତେବେ ଗଛଗୁଡ଼ିକ ଥ୍ରୀପ୍ ଦ୍ୱାରା ପ୍ରଭାବିତ ହୁଅନ୍ତି | ଯଦି ଲକ୍ଷଣ ଦେଖାଯାଏ, ତେବେ ସଂକ୍ରମଣର ପ୍ରାରମ୍ଭିକ ପର୍ଯ୍ୟାୟରେ ନିମ୍ବ କ୍ଷାରକ ଆଜାଦିରାକ୍ଟିନ (1500 ପିପିଏମ) @3 ମିଲି/ଲିଟର ପାଣି ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "tomato": {
         "advisory": [
            "ଏବେ ଟମାଟୋ ଚାରା ଲଗାଇବା ପାଇଁ ଉପଯୁକ୍ତ ସମୟ।",
            "ଉପଯୁକ୍ତ ପ୍ରକାରଃ ଉତ୍କଳ କୁମାରୀ (ବି. ଟି.-10), ଉତ୍କଳ ଦୀପ୍ତି (ବି. ଟି.-2), ଉତ୍କଳ ରାଜା, ଉତ୍କଳ ପ୍ରଜ୍ଞାନ, ଏବଂ ସ୍ୱର୍ଣ୍ଣ ସମ୍ପଦ।",
            "ବିହନ ହାରଃ ଏକର ପିଛା 150 ରୁ 200 ଗ୍ରାମ"
         ]
      },
      "cow & buffalo": {
         "advisory": [
            "ବର୍ଷା ଦିନରେ ଘାସରେ ଆର୍ଦ୍ରତା ଅଧିକ ଥିବାରୁ ଗୋରୁମାନେ ସେଥିରୁ ପର୍ଯ୍ୟାପ୍ତ ଶୁଖିଲା ପଦାର୍ଥ ପାଆନ୍ତି ନାହିଁ | ତେଣୁ, ଦୁଗ୍ଧ ପଶୁମାନଙ୍କୁ ପ୍ରତି 2 କିଲୋ କ୍ଷୀର ପାଇଁ 1 କିଲୋ କନସେଣ୍ଟ୍ରେଟ୍ ଦିଅନ୍ତୁ।"
         ]
      },
      "goat & sheep": {
         "advisory": [
            "ବର୍ଷା ଋତୁରେ ମେଣ୍ଢା ଏବଂ ଛେଳିମାନଙ୍କ ପାଇଁ ଘରେ ଶୁଖିଲା ପଶୁଖାଦ୍ୟ ଏବଂ ନଡ଼ିଆ ପ୍ରସ୍ତୁତ ରଖନ୍ତୁ ଏବଂ ଚମକିବା ଏବଂ ଛେଳି ମାରିବାର ଏକ ମାସ ପୂର୍ବରୁ ମେଣ୍ଢା ଏବଂ ଛେଳିମାନଙ୍କୁ ସନ୍ତୁଳିତ ସାନ୍ଦ୍ରତା ଦେବା ପାଇଁ ଫ୍ଲାଶିଂ ଅଭ୍ୟାସ ନିଶ୍ଚିତ କରନ୍ତୁ |"
         ]
      },
      "poultry": {
         "advisory": [
            "ବାର୍ଡ ଫ୍ଲୁ ହେଉଛି କୁକୁଡ଼ାର ଏକ ଭୂତାଣୁଜନିତ ରୋଗ। ଏହା ଦୂଷିତ ଡେଣା, ଲାଳ, ପକ୍ଷୀଙ୍କ ବିଷ୍ଠା ମାଧ୍ୟମରେ ବ୍ୟାପିଥାଏ | ବେଳେବେଳେ ଏହା ପ୍ରଭାବିତ ପକ୍ଷୀଙ୍କଠାରୁ ମଣିଷକୁ ବ୍ୟାପିପାରେ |",
            "ଏହି ସମୟରେ, ଦୟାକରି ପ୍ରତିଦିନ କୁକୁଡ଼ା ଘର ସଫା କରନ୍ତୁ ଏବଂ କୁକୁଡ଼ା ପକ୍ଷୀଙ୍କ ଖାଦ୍ୟ ଏବଂ ପାଣି ବାରମ୍ବାର ପରିବର୍ତ୍ତନ କରନ୍ତୁ।",
            "ମୃତ କୁକୁଡ଼ା ପକ୍ଷୀମାନଙ୍କୁ ଏଠାକୁ ଓ ସେଠାକୁ ଫିଙ୍ଗି ଦିଅନ୍ତୁ ନାହିଁ। ଦୟାକରି ଗ୍ଲୋଭସ୍ ଏବଂ ମାସ୍କ ପିନ୍ଧି ସେମାନଙ୍କୁ ପୋତି ଦିଅନ୍ତୁ ଏବଂ ବ୍ଲିଚିଂ ପାଉଡରରେ ସେହି ସ୍ଥାନକୁ ସାନିଟାଇଜ୍ କରନ୍ତୁ।",
            "ପ୍ରଭାବିତ ଅଞ୍ଚଳରୁ କୁକୁଡ଼ା ପକ୍ଷୀ କିମ୍ବା ଅଣ୍ଡା ଘରକୁ ଆଣନ୍ତୁ ନାହିଁ।"
         ]
      }
   },
   "date": "06-09-2024"
}