{
   "weather_details": {
      "08-02-2025": {
         "rainfall": 0,
         "t_max": 33,
         "t_min": 15,
         "rh_max": 13,
         "rh_min": 43,
         "wind_speed": 5,
         "wind_direction": 347,
         "cloud_cover": 2
      },
      "09-02-2025": {
         "rainfall": 0,
         "t_max": 33,
         "t_min": 14,
         "rh_max": 11,
         "rh_min": 40,
         "wind_speed": 4,
         "wind_direction": 346,
         "cloud_cover": 2
      },
      "10-02-2025": {
         "rainfall": 0,
         "t_max": 33,
         "t_min": 13,
         "rh_max": 11,
         "rh_min": 44,
         "wind_speed": 4,
         "wind_direction": 0,
         "cloud_cover": 1
      },
      "11-02-2025": {
         "rainfall": 0,
         "t_max": 34,
         "t_min": 13,
         "rh_max": 12,
         "rh_min": 46,
         "wind_speed": 3,
         "wind_direction": 90,
         "cloud_cover": 1
      },
      "12-02-2025": {
         "rainfall": 0,
         "t_max": 35,
         "t_min": 13,
         "rh_max": 15,
         "rh_min": 48,
         "wind_speed": 2,
         "wind_direction": 225,
         "cloud_cover": 3
      }
   },
   "names_of_crops": [
      "ଶୁଖିଲା ଋତୁ ଚାଉଳ",
      "ସବୁଜ ଚଣା",
      "କଳା ଚଣା",
      "ଆମ୍ବ",
      "ପନିପରିବା ଫସଲ",
      "ପଶୁପାଳନ"
   ],
   "general_advisory": "ବର୍ଦ୍ଧିତ ପରିସୀମା ପୂର୍ବାନୁମାନ ଅନୁଯାୟୀ, ପ୍ରଥମ ସପ୍ତାହରେ ଓଡ଼ିଶାର ଜିଲ୍ଲାଗୁଡ଼ିକରେ ଶୁଖିଲା ପାଗ ରହିବାର ସମ୍ଭାବନା ରହିଛି। ଠିଆ ହୋଇଥିବା ଫସଲରେ ଗୋଟିଏ ଜୀବନ ରକ୍ଷାକାରୀ ଜଳସେଚନ ପ୍ରଦାନ କରିବାକୁ ଏବଂ ସେହି ସମୟରେ ସକାଳେ କିମ୍ବା ସନ୍ଧ୍ୟାରେ ସମସ୍ତ ପ୍ରକାରର ସ୍ପ୍ରେ ଏବଂ ଆନ୍ତଃସାଂସ୍କୃତିକ କାର୍ଯ୍ୟ କରିବାକୁ କୃଷକମାନଙ୍କୁ ପରାମର୍ଶ ଦିଆଯାଇଛି।",
   "crops_data": {
      "dry season rice": {
         "advisory": [
            "ପ୍ରତିରୋପଣ କରାଯାଇଥିବା ଚାଉଳରେ, ଏକର ପିଛା 35 କିଲୋଗ୍ରାମ ୟୁରିଆ ଲଗାଇବା, ପ୍ରତିରୋପଣର 20-25 ଦିନ ପରେ କିମ୍ବା ସର୍ବାଧିକ ଟିଲରିଙ୍ଗ୍ ପର୍ଯ୍ୟାୟରେ ପ୍ରଥମ ଟପ୍ ଡ୍ରେସିଂ ଭାବରେ ପରାମର୍ଶ ଦିଆଯିବା ଉଚିତ।",
            "କୀଟ/କୀଟ ପରିଚାଳନାଃ କେବଳ ରୋପଣ କରାଯାଇଥିବା କ୍ଷେତରେ ହଳଦିଆ କାଣ୍ଡ ଛେଦକ ଏବଂ ପତ୍ର ଫୋଲଡର ଉପରେ ନଜର ରଖିବା ପାଇଁ ଧାନ କ୍ଷେତରେ ଏକର ପିଛା 5 ମି. ଗ୍ରା. ଲୁଚକାଳି ସହିତ 3ଟି ଫେରୋମୋନ୍ ଫାନ୍ଦ ବ୍ୟବହାର କରନ୍ତୁ। ଏହି କୀଟପତଙ୍ଗକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ କୃଷକମାନେ ଦାଣାଦାର କୀଟନାଶକ ମଧ୍ୟ ପ୍ରସାରଣ କରିପାରନ୍ତି କିମ୍ବା କୀଟନାଶକ ସ୍ପ୍ରେ କରିପାରନ୍ତି।"
         ]
      },
      "green gram": {
         "advisory": [
            "ଯଦି ସବୁଜ/କଳା ଗହମ କ୍ଷେତରେ ଶୋଷକ କୀଟ ଆକ୍ରମଣ ଲକ୍ଷ୍ୟ କରାଯାଏ, ତେବେ କୃଷକମାନେ ବୃକ୍ଷରୋପଣ ପର୍ଯ୍ୟାୟରେ ଏହି କୀଟପତଙ୍ଗକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ ଏକର ପିଛା ହଳଦିଆ ଚଟପଟା ଜାଲ ବ୍ୟବହାର କରିବା ଉଚିତ୍ | କୀଟ ଆକ୍ରମଣକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ ନିମ୍ବ ତେଲ କିମ୍ବା ଅନ୍ୟାନ୍ୟ କୀଟନାଶକ ସିଞ୍ଚନ କରିବାକୁ ପରାମର୍ଶ ଦିଆଯିବା ଉଚିତ।",
            "କ୍ଷେତରେ ହଳଦିଆ ମୋଜାଇକ ଜୀବାଣୁ ଆକ୍ରମଣକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ, ନିର୍ଦ୍ଦିଷ୍ଟ କୀଟନାଶକ ସିଞ୍ଚନ କରିବାକୁ ପରାମର୍ଶ ଦିଆଯିବା ଉଚିତ। ଫୁଲ ଫୁଟିବା ସମୟରେ ରାସାୟନିକ ପ୍ରୟୋଗରୁ ଦୂରେଇ ରୁହନ୍ତୁ।"
         ]
      },
      "black gram": {
         "advisory": [
            "ସବୁଜ ଚଣା ପରାମର୍ଶ ଭଳି"
         ]
      },
      "mango": {
         "advisory": [
            "ବଗିଚାରେ ଆମ୍ବ ହପର ଆକ୍ରମଣ ଉପରେ ନିୟମିତ ନଜର ରଖିବା ପାଇଁ ପରାମର୍ଶ ଦିଆଯିବା ଉଚିତ। ଫୁଲ ଝଡ଼ିବା ହ୍ରାସ କରିବା ପାଇଁ ଫୁଲ ଉଠିବା ସମୟରେ ଜଳସେଚନରୁ ଦୂରେଇ ରୁହନ୍ତୁ। ଆମ୍ବ ଗଛରେ ପଲିଥିନ୍/ଆଲ୍କାଥେନ୍ ଚାଦରକୁ ଆବୃତ କରି ଆମ୍ବ ମେଲି ବଗ୍କୁ ପରିଚାଳନା କରନ୍ତୁ।",
            "ଆମ୍ବ ବଗିଚାରେ ଫଙ୍ଗଲ୍ ସଂକ୍ରମଣକୁ ପରିଚାଳନା କରିବା ପାଇଁ, ସିଞ୍ଚନ ପାଇଁ ନିର୍ଦ୍ଦିଷ୍ଟ ଫଙ୍ଗିସାଇଡ୍ ପରାମର୍ଶ ଦିଆଯିବା ଉଚିତ |"
         ]
      },
      "vegetable crops": {
         "advisory": [
            "ଟମାଟୋ, ବାଇଗଣ ଏବଂ ଫୁଲକୋବି ଫସଲରେ ପତ୍ର ଖାଉଥିବା କ୍ୟାଟର୍ପିଲର, ଫଳ ଛେଦକ ଏବଂ ଅନ୍ୟାନ୍ୟ କୀଟପତଙ୍ଗକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ ନିର୍ଦ୍ଦିଷ୍ଟ କୀଟନାଶକ ସିଞ୍ଚନ କରାଯିବା ଉଚିତ। ଶୋଷକ କୀଟ ଆକ୍ରମଣ ବିରୁଦ୍ଧରେ ନିୟମିତ ତଦାରଖ କରିବାକୁ ପରାମର୍ଶ ଦିଆଯାଇଛି। ଫୁଲ ଫୁଟିବା ସମୟରେ ରାସାୟନିକ ପ୍ରୟୋଗରୁ ଦୂରେଇ ରୁହନ୍ତୁ।",
            "ପିଆଜ ଗଛରେ ପର୍ପଲ ବ୍ଲଚ୍ ରୋଗ ସଂକ୍ରମଣ ପାଇଁ ନିୟମିତ ତଦାରଖ କରିବାକୁ ପରାମର୍ଶ ଦିଆଯାଇଛି।"
         ]
      },
      "livestock": {
         "advisory": [
            "ତାପମାତ୍ରା ବୃଦ୍ଧି ହେତୁ ପଶୁମାନଙ୍କୁ ତାଜା ସ୍ୱଚ୍ଛ ପାନୀୟ ଜଳ ଯୋଗାଣ ବୃଦ୍ଧି କରନ୍ତୁ। ମଧ୍ୟାହ୍ନ ସମୟରେ ଚାରଣରୁ ଦୂରେଇ ରୁହନ୍ତୁ। ନିର୍ଦ୍ଦିଷ୍ଟ ରୋଗ ବିରୁଦ୍ଧରେ ଟୀକାକରଣ ପରାମର୍ଶ ଦିଆଯିବା ଉଚିତ୍ | ପଶୁମାନଙ୍କୁ କୃମି ମୁକ୍ତ କରିବା ପାଇଁ ପରାମର୍ଶ ଦିଆଯାଇଛି।"
         ]
      }
   },
   "date": "07-02-2025"
}