{
   "weather_details": {
      "08-02-2025": {
         "rainfall": 0,
         "t_max": 33,
         "t_min": 15,
         "rh_max": 44,
         "rh_min": 14,
         "wind_speed": 5,
         "wind_direction": 347,
         "cloud_cover": 2
      },
      "09-02-2025": {
         "rainfall": 0,
         "t_max": 33,
         "t_min": 14,
         "rh_max": 40,
         "rh_min": 11,
         "wind_speed": 3,
         "wind_direction": 346,
         "cloud_cover": 1
      },
      "10-02-2025": {
         "rainfall": 0,
         "t_max": 33,
         "t_min": 14,
         "rh_max": 37,
         "rh_min": 10,
         "wind_speed": 1,
         "wind_direction": 0,
         "cloud_cover": 1
      },
      "11-02-2025": {
         "rainfall": 0,
         "t_max": 34,
         "t_min": 13,
         "rh_max": 43,
         "rh_min": 11,
         "wind_speed": 2,
         "wind_direction": 90,
         "cloud_cover": 2
      },
      "12-02-2025": {
         "rainfall": 0,
         "t_max": 34,
         "t_min": 13,
         "rh_max": 48,
         "rh_min": 15,
         "wind_speed": 3,
         "wind_direction": 225,
         "cloud_cover": 2
      }
   },
   "names_of_crops": [
      "ଶୁଖିଲା ଋତୁ ଚାଉଳ",
      "ସବୁଜ ଚଣା",
      "ଆମ୍ବ",
      "ପନିପରିବା ଫସଲ",
      "ପଶୁପାଳନ"
   ],
   "general_advisory": "ବର୍ଦ୍ଧିତ ପରିସୀମା ପୂର୍ବାନୁମାନ ଅନୁଯାୟୀ, ଓଡ଼ିଶାର ଜିଲ୍ଲାଗୁଡ଼ିକରେ ଶୁଖିଲା ପାଗ ରହିବାର ସମ୍ଭାବନା ରହିଛି। ଠିଆ ହୋଇଥିବା ଫସଲରେ ଗୋଟିଏ ଜୀବନ୍ତ ସଞ୍ଚୟ ଜଳସେଚନ ପ୍ରଦାନ କରିବାକୁ ଏବଂ ସକାଳେ କିମ୍ବା ସନ୍ଧ୍ୟାରେ ସେହି ସମୟରେ ସମସ୍ତ ପ୍ରକାରର ସ୍ପ୍ରେ ଏବଂ ଆନ୍ତଃସାଂସ୍କୃତିକ କାର୍ଯ୍ୟ କରିବାକୁ କୃଷକମାନଙ୍କୁ ପରାମର୍ଶ ଦିଆଯାଇଛି।",
   "crops_data": {
      "dry season rice": {
         "advisory": [
            "ରୋପଣ କରାଯାଇଥିବା ଚାଉଳରେ, ଏକର ପିଛା 35 କିଲୋଗ୍ରାମ ୟୁରିଆକୁ ରୋପଣ କିମ୍ବା ସର୍ବାଧିକ ଚାଷ ପର୍ଯ୍ୟାୟର 20-25 ଦିନ ପରେ ପ୍ରଥମ ଟପ୍ ଡ୍ରେସିଂ ଭାବରେ ବ୍ୟବହାର କରିବାକୁ ପରାମର୍ଶ ଦିଆଯିବା ଉଚିତ।",
            "କୀଟପତଙ୍ଗ/କୀଟ ପରିଚାଳନାଃ କେବଳ ରୋପଣ କରାଯାଇଥିବା କ୍ଷେତରେ ହଳଦିଆ କାଣ୍ଡ ଛେଦକ ଏବଂ ପତ୍ର ଫୋଲଡର ଉପରେ ନଜର ରଖିବା ପାଇଁ ଧାନ କ୍ଷେତରେ ଏକର ପିଛା 5 ମି. ଗ୍ରା. ଲୁଚକାଳି ସହିତ 3ଟି ଫେରୋମୋନ୍ ଫାନ୍ଦ ବ୍ୟବହାର କରନ୍ତୁ। ଯେତେବେଳେ ଫାନ୍ଦରେ ପୁରୁଷ ପତଙ୍ଗ ସଂଖ୍ୟା 4 କିମ୍ବା 5 ରେ ପହଞ୍ଚେ, ଆଜାଦିରାକ୍ଟିନ 0.15% ନିମ୍ବ ମଞ୍ଜି କର୍ଣ୍ଣଲ ଆଧାରିତ ଇସି ଫର୍ମୁଲେସନ @800 ମିଲି/ଏକର ସ୍ପ୍ରେ କରିବାକୁ ପରାମର୍ଶ ଦିଆଯିବା ଉଚିତ।"
         ]
      },
      "green gram": {
         "advisory": [
            "ଯଦି ସବୁଜ/କଳା ଗହମ କ୍ଷେତରେ ଶୋଷକ କୀଟ ଆକ୍ରମଣ ଦେଖାଯାଏ, ତେବେ କୃଷକମାନେ ବୃକ୍ଷରୋପଣ ପର୍ଯ୍ୟାୟରେ ଏହି କୀଟକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ ଏକର ପିଛା 8 ଟି ହଳଦିଆ ଚଟପଟା ଜାଲ ବ୍ୟବହାର କରିବା ଉଚିତ୍ | ଆକ୍ରମଣର ପ୍ରାରମ୍ଭିକ ପର୍ଯ୍ୟାୟରେ କୃଷକମାନେ ଏହି କୀଟପତଙ୍ଗକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ ଲିଟର ପିଛା 5 ମିଲି ନିମ ତେଲ ସିଞ୍ଚନ କରିବା ଉଚିତ।",
            "କ୍ଷେତରେ ହଳଦିଆ ମୋଜାଇକ ଜୀବାଣୁ ଆକ୍ରମଣକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ, ଇମିଡାକ୍ଲୋପ୍ରିଡ୍ 17.8% ଏସଏଲ @0.3 ମିଲି କିମ୍ବା ଥାୟାମେଥୋକ୍ସାମ 25% ଡବ୍ଲୁଜି @0.3-0.5 ମିଲି ଲିଟର ପିଛା ପାଣି ସିଞ୍ଚନ କରିବା ପରାମର୍ଶ ଦିଆଯିବା ଉଚିତ।"
         ]
      },
      "mango": {
         "advisory": [
            "ତାପମାତ୍ରା ବୃଦ୍ଧି ଫଳରେ ବଗିଚାରେ ଆମ୍ବ ହପର ଆକ୍ରମଣ ତ୍ୱରାନ୍ୱିତ ହୋଇପାରେ, ତେଣୁ ଏହାର ନିୟମିତ ତଦାରଖ ପାଇଁ ପରାମର୍ଶ ଦିଆଯିବା ଉଚିତ।",
            "ଆମ୍ବ ବଗିଚାରେ ଫୁଲ ଝଡ଼ିବା ହ୍ରାସ କରିବା ପାଇଁ ଫୁଲ ଉଠିବା ସମୟରେ ଜଳସେଚନରୁ ଦୂରେଇ ରୁହନ୍ତୁ।",
            "ଆମ୍ବ ଗୁଳ୍ମକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ ଆମ୍ବ ଗଛରେ ପଲିଥିନ୍/ଆଲ୍କାଥେନ୍ ଚାଦରକୁ ଜୋରରେ ବାନ୍ଧି ରଖନ୍ତୁ। ରୋଗାକ୍ରାନ୍ତ ଏବଂ ଅନାବଶ୍ୟକ ଶାଖା ଏବଂ ପତ୍ର ଗୁଡ଼ିକର ପ୍ରଶିକ୍ଷଣ ଏବଂ ଛାଣିବା ପାଇଁ ପରାମର୍ଶ ଦିଆଯିବା ଉଚିତ।"
         ]
      },
      "vegetable crops": {
         "advisory": [
            "ଟମାଟୋ ଏବଂ ବାଇଗଣରେ ପତ୍ର ଖାଉଥିବା କ୍ୟାଟର୍ପିଲର ଏବଂ ଫଳ ଛେଦକ/ଶୁଟ୍ ଏବଂ ଫଳ ଛେଦକକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ, ଲିଟର ପିଛା 0.40 ଗ୍ରାମ୍ ଇମାମେକ୍ଟିନ୍ ବେନ୍ଜୋଏଟ୍ ସିଞ୍ଚନ କରିବାକୁ ପରାମର୍ଶ ଦିଆଯିବା ଉଚିତ।",
            "ଫୁଲକୋବିରେ ଡାଇମଣ୍ଡ ବ୍ୟାକ୍ ମଥ୍ ଆକ୍ରମଣ ପାଇଁ, ସ୍ପିନୋସାଡ୍ 45 ଏସ୍. ସି. @0.5 ମିଲି କିମ୍ବା ଫିପ୍ରୋନିଲ୍ 5 ପ୍ରତିଶତ ଏସ୍. ସି. @2 ମିଲି କିମ୍ବା ନିମ୍ବ ତେଲ @5 ମିଲି ପ୍ରତି ଲିଟର ପାଣି ସିଞ୍ଚନ କରିବାକୁ ପରାମର୍ଶ ଦିଆଯିବା ଉଚିତ।",
            "ଶୋଷକ କୀଟ ଆକ୍ରମଣ (ଏଫିଡ୍, ଥ୍ରୀପ୍ ଇତ୍ୟାଦି) ବିରୁଦ୍ଧରେ ନିୟମିତ ତଦାରଖ କରିବାକୁ ପରାମର୍ଶ ଦିଆଯିବା ଉଚିତ। ଫୁଲ ଫୁଟିବା ସମୟରେ ରାସାୟନିକ ପ୍ରୟୋଗରୁ ଦୂରେଇ ରୁହନ୍ତୁ।",
            "ବର୍ତ୍ତମାନର ପାଣିପାଗ ସ୍ଥିତି ପିଆଜ୍ ଗଛରେ ବାଇଗଣୀ ବ୍ଲଚ୍ ରୋଗ ସଂକ୍ରମଣ ପାଇଁ ଅନୁକୂଳ, ତେଣୁ ଏହାର ନିୟମିତ ତଦାରଖ କରିବାକୁ ପରାମର୍ଶ ଦିଆଯାଇଛି।"
         ]
      },
      "livestock": {
         "advisory": [
            "ଆଗାମୀ ସପ୍ତାହରେ ତାପମାତ୍ରା ବୃଦ୍ଧିକୁ ଦୃଷ୍ଟିରେ ରଖି କୃଷକମାନଙ୍କୁ ପଶୁମାନଙ୍କୁ ତାଜା ସ୍ୱଚ୍ଛ ପାନୀୟ ଜଳ ଯୋଗାଣ ବୃଦ୍ଧି କରିବାକୁ ପରାମର୍ଶ ଦିଆଯାଇଛି। ମଧ୍ୟାହ୍ନ ସମୟରେ ପଶୁମାନଙ୍କୁ ଚରାଇବା ଠାରୁ ଦୂରେଇ ରୁହନ୍ତୁ।",
            "ଏଫ୍. ଏମ୍. ଏଫ୍., ଏଚ୍. ଏସ୍., ବି. କ୍ୟୁ. ଇତ୍ୟାଦି ବିରୁଦ୍ଧରେ ଟୀକାକରଣ ପାଇଁ ପରାମର୍ଶ ଦିଆଯିବା ଉଚିତ। କ୍ଷତିକାରକ କୃମିକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ ପଶୁମାନଙ୍କୁ କୃମି ମୁକ୍ତ କରିବା ପାଇଁ ପରାମର୍ଶ ଦିଆଯାଇଛି।"
         ]
      }
   },
   "date": "07-02-2025"
}