{
   "weather_details": {
      "08-02-2025": {
         "rainfall": 0,
         "t_max": 33,
         "t_min": 17,
         "rh_max": 78,
         "rh_min": 24,
         "wind_speed": 2,
         "wind_direction": 63,
         "cloud_cover": 2
      },
      "09-02-2025": {
         "rainfall": 0,
         "t_max": 33,
         "t_min": 16,
         "rh_max": 83,
         "rh_min": 19,
         "wind_speed": 1,
         "wind_direction": 90,
         "cloud_cover": 1
      },
      "10-02-2025": {
         "rainfall": 0,
         "t_max": 33,
         "t_min": 14,
         "rh_max": 81,
         "rh_min": 16,
         "wind_speed": 1,
         "wind_direction": 162,
         "cloud_cover": 2
      },
      "11-02-2025": {
         "rainfall": 0,
         "t_max": 34,
         "t_min": 14,
         "rh_max": 76,
         "rh_min": 18,
         "wind_speed": 3,
         "wind_direction": 203,
         "cloud_cover": 2
      },
      "12-02-2025": {
         "rainfall": 0,
         "t_max": 34,
         "t_min": 14,
         "rh_max": 58,
         "rh_min": 17,
         "wind_speed": 4,
         "wind_direction": 221,
         "cloud_cover": 1
      }
   },
   "names_of_crops": [
      "ଟମାଟୋ",
      "ଚାଉଳ",
      "ସୋରିଷ ଏବଂ ତୋରିଆ",
      "ଲଙ୍କା",
      "ଆଳୁ",
      "ଓକ୍ରା"
   ],
   "general_advisory": "କୃଷକମାନଙ୍କୁ ମକା, ଚିନାବାଦାମ, ସବୁଜ ଚଣା, ଚିକେନ୍ ମଟର ଏବଂ ପନିପରିବା ପରି ଠିଆ ଫସଲରେ ଆଗାଛା କାଟିବା ଏବଂ ହୋଇଂ କରିବାକୁ ପରାମର୍ଶ ଦିଆଯାଇଛି ଯାହା ସେମାନଙ୍କୁ ଆଗାଛାରୁ ରକ୍ଷା କରିବ | ଫସଲର ବୃଦ୍ଧି ପର୍ଯ୍ୟାୟ ଅନୁଯାୟୀ ସନ୍ତୁଳିତ ଏବଂ ଉପଯୁକ୍ତ ସାର ପ୍ରୟୋଗ କରନ୍ତୁ। ଉଦ୍ଭିଦ ପର୍ଯ୍ୟାୟରେ ପନିପରିବାରେ ଧଳା ମାଛି, ଏଫିଡ୍, ଜ୍ଯାସିଡ୍ ଏବଂ ଥର୍ପସ୍ ପରି ଶୋଷକ କୀଟ ଉପରେ ନଜର ରଖିବା ପାଇଁ ଏକର ପିଛା 8ରେ ହଳଦିଆ ଚଟପଟା ଜାଲ ଲଗାନ୍ତୁ। ଭାଇରାଲ ସଂକ୍ରମିତ ଗଛର ରୁଜିଂ ପନିପରିବାରେ କରାଯିବା ଉଚିତ। ସଂକ୍ରମିତ ଗଛଗୁଡ଼ିକୁ ଉପୁଡ଼ାଇ ମାଟିରେ ପୋତିଦେବା ଉଚିତ। ରୁଜିଂ ପରେ, ଯଦି ସଂକ୍ରମଣ ଅଧିକ ହୁଏ, ତେବେ ଭେକ୍ଟରକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ 3-4 ଲିଟର ପାଣିରେ 1 ମିଲି @ଇମିଡାକ୍ଲୋପ୍ରିଡ୍ ସ୍ପ୍ରେ କରିବାକୁ ପରାମର୍ଶ ଦିଆଯାଇଛି। ବାଇଗଣ, ଫୁଲକୋବି, ବନ୍ଧାକୋବି, ଟମାଟୋ ଇତ୍ୟାଦି ପନିପରିବାରେ ଛିଦ୍ରକାରୀ କୀଟ ଉପରେ ନଜର ରଖିବା ପାଇଁ ଏକର ପିଛା 8 ହାରରେ ଫେରୋମୋନ୍ ଟ୍ରାପ୍ ବ୍ୟବହାର କରନ୍ତୁ।",
   "crops_data": {
      "tomato": {
         "advisory": [
            "ଟମାଟୋ କ୍ଷେତରେ ଶୀଘ୍ର ଏବଂ ବିଳମ୍ବରେ ରୋଗକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ ଆଜୋକ୍ସିସ୍ଟ୍ରୋବିନ୍ 23 ପ୍ରତିଶତ ଏସ୍. ସି. ଲିଟର ପିଛା 1 ମିଲି କିମ୍ବା ଜିନେବ୍ 75 ପ୍ରତିଶତ ଡବ୍ଲ୍ୟୁ. ପି. ଲିଟର ପିଛା 2.5 ଗ୍ରାମ ପାଣି ସିଞ୍ଚନ କରନ୍ତୁ।"
         ]
      },
      "rice": {
         "advisory": [
            "ଆବଶ୍ୟକ ସମୟରେ ନର୍ସରୀ ଶଯ୍ୟାଗୁଡ଼ିକରେ ହାଲୁକା ଜଳସେଚନ ପ୍ରୟୋଗ କରନ୍ତୁ। 4-5 ପତ୍ର ପର୍ଯ୍ୟାୟରେ ଧାନ ଚାରା ରୋପଣ ପାଇଁ ପ୍ରସ୍ତୁତ।",
            "ବିସ୍ଫୋରଣ ସଂକ୍ରମଣକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ ନର୍ସରୀ ଅଞ୍ଚଳରେ ଟେବୁକୋନାଜୋଲ୍ 50 ପ୍ରତିଶତ + ଟ୍ରାଇଫ୍ଲୋକ୍ସିସ୍ଟ୍ରୋବିନ୍ 25 ପ୍ରତିଶତ ଡବ୍ଲୁ. ଜି. @0.4 ଗ୍ରାମ୍/ଲିଟର ପାଣିରେ ସ୍ପ୍ରେ କରନ୍ତୁ।",
            "ମୁଖ୍ୟ ପଡ଼ିଆରେ ପାଣି ଭର୍ତ୍ତି କରିବା ପାଇଁ ଯାଆନ୍ତୁ। 8 କି. ଗ୍ରା. ଏନ୍., 16 କି. ଗ୍ରା. ପି2ଓ5 ଏବଂ 16 କି. ଗ୍ରା. କେ2ଓ. କୁ ମୂଳ ସାର ଭାବେ ଶେଷ ପର୍ଯ୍ୟାୟ ପୁଡଲିଂ ସମୟରେ ପ୍ରୟୋଗ କରନ୍ତୁ। ପାହାଡ଼ ପିଛା 2ରୁ 3ଟି ଚାରା 15ରୁ 20 ସେ. ମି. ବ୍ୟବଧାନରେ ଏବଂ ପାହାଡ଼ରୁ ପାହାଡ଼ ମଧ୍ୟରେ 10 ସେ. ମି. ବ୍ୟବଧାନରେ ଲଗାନ୍ତୁ।",
            "ଫସଲ ବୃଦ୍ଧିର ପ୍ରାରମ୍ଭିକ ପର୍ଯ୍ୟାୟରେ ଆଗାଛାକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ ରୋପଣର 2-3 ଦିନ ପରେ 12 କିଲୋଗ୍ରାମ ଶୁଖିଲା ବାଲି ସହିତ ଏକର ପିଛା 4 କିଲୋଗ୍ରାମ ବେନ୍ସଲ୍ଫୁରନ୍ ମିଥାଇଲ + ପ୍ରିଟିଲାକ୍ଲୋର ପ୍ରୟୋଗ କରନ୍ତୁ।"
         ]
      },
      "mustard and toria": {
         "advisory": [
            "ସିଲିକା ବିକାଶ ପର୍ଯ୍ୟାୟରେ ଅଛି ଯାହା ଘାସ, ଏଫିଡ୍ ଏବଂ ଲାର୍ଭା ପରି ବିଭିନ୍ନ କୀଟକୁ ଆକର୍ଷିତ କରିପାରେ | ତେଣୁ ନିୟମିତ ଭାବେ ଫସଲ କ୍ଷେତ ଉପରେ ନଜର ରଖନ୍ତୁ।",
            "ଏଫିଡ୍ ସହିତ ସୋରଡ୍ ସଫ୍ଲାଇ ଲାର୍ଭା ଏବଂ ବୟସ୍କଙ୍କ ଘଟଣା କ୍ଷେତରେ ଦେଖିବାକୁ ମିଳିପାରେ | ଇମାମେକ୍ଟିନ୍ ବେନ୍ଜୋଏଟ୍ 4 ପ୍ରତିଶତ ଏସ୍ଜି @5 ଗ୍ରାମ୍/10 ଲିଟର ପାଣି ସ୍ପ୍ରେ କରନ୍ତୁ।",
            "ଏଫିଡ୍ସର ଗୁରୁତର ସଂକ୍ରମଣ କ୍ଷେତ୍ରରେ, ଇମିଡାକ୍ଲୋପ୍ରିଡ୍ କିମ୍ବା ଡାଇମେଥୋଏଟ୍ @2 ମିଲି/ଲିଟର ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "chilli": {
         "advisory": [
            "ଧନିଆରେ ଥିବା ଛୋଟ ପତ୍ରକୁ କ୍ଷେତରେ ଦେଖିବାକୁ ମିଳିଥାଏ। ଯଦି ଏହା ଘଟେ ତେବେ ଡାଇମେଥୋଏଟ୍ @2 ମିଲି/ଲିଟର ସ୍ପ୍ରେ କରନ୍ତୁ।",
            "କ୍ଷେତରେ ଏଫିଡ୍ ଏବଂ ଜ୍ଯାସିଡ୍ ସଂକ୍ରମଣ ଦେଖାଯାଇପାରେ | ଏହାକୁ ପରିଚାଳନା କରିବା ପାଇଁ ଇମିଡାକ୍ଲୋପ୍ରିଡ୍ 17.8% ଏସଏଲ @1 ମିଲି/ଲିଟର ସ୍ପ୍ରେ କରନ୍ତୁ।",
            "ମାଇଟ୍ଃ ମାଇଟ୍-ସଂକ୍ରମିତ ଲଙ୍କା ଗଛରେ ନିମ୍ନମୁଖୀ ବକ୍ରତା ଏବଂ ପତ୍ର ସଙ୍କୁଚିତ ହେବା ସହିତ ଷ୍ଟାଣ୍ଟେଡ୍ ବୃଦ୍ଧି ଦେଖାଯାଏ | ମାଇଟ୍ ସଂକ୍ରମଣକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ ଇଥିୟନ୍ 50 ପ୍ରତିଶତ ଇସି କିମ୍ବା ପ୍ରୋପାର୍ଜାଇଟ୍ 57 ପ୍ରତିଶତ ଇସି @600-ମିଲି/ଏକର ସହିତ 200 ଲିଟର ପାଣି ମିଶାଇ ଲଗାନ୍ତୁ।"
         ]
      },
      "potato": {
         "advisory": [
            "ଫସଲର ଆବଶ୍ୟକତା ଅନୁଯାୟୀ ଜଳସେଚନ ବ୍ୟବସ୍ଥା କରନ୍ତୁ।",
            "ସିଧାସଳଖ ସୂର୍ଯ୍ୟକିରଣ ସଂସ୍ପର୍ଶରେ ନ ଆସିବା ପାଇଁ ଆଳୁରେ ମୃତ୍ତିକା ଉତ୍ତୋଳନ କରିବା ଆବଶ୍ୟକ। ଯେହେତୁ ଏହା ସୋଲାନିନ ଉତ୍ପାଦନ ଦ୍ୱାରା ଆଲୁର ଗୁଣବତ୍ତା ଖରାପ କରିବ।",
            "ଯଦି କ୍ଷେତରେ ଶୁଷ୍କତା ଦେଖାଯାଏ, ତେବେ ବ୍ଲିଟକ୍ସ-50 @45 ଗ୍ରାମ + ସ୍ଟ୍ରେପ୍ଟୋସାଇକ୍ଲିନ @2 ଗ୍ରାମକୁ 10 ଲିଟର ପାଣିରେ ଭିଜାଇ ଦିଅନ୍ତୁ।"
         ]
      },
      "okra": {
         "advisory": [
            "ଓକ୍ରାରେ ଫଳ ଛେଦକକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ ନିମ୍ବ-ଆଧାରିତ କୀଟନାଶକ 300 ପିପିଏମ @5 ମିଲି/ଲିଟର ପାଣି ସ୍ପ୍ରେ କରନ୍ତୁ। ପରବର୍ତ୍ତୀ ପର୍ଯ୍ୟାୟରେ ସ୍ପିନୋସାଦ୍ 45 ପ୍ରତିଶତ ଏସ୍. ସି. @0.4 ମିଲି/ଲିଟର ପାଣି ସିଞ୍ଚନ କରାଯାଏ।"
         ]
      }
   },
   "date": "07-02-2025"
}