{
   "weather_details": {
      "01/02/2025": {
         "rainfall": 0,
         "t_max": 30,
         "t_min": 19,
         "rh_max": 76,
         "rh_min": 29,
         "wind_speed": 7,
         "wind_direction": 11,
         "cloud_cover": 0
      },
      "07/02/2025": {
         "rainfall": 0,
         "t_max": 31,
         "t_min": 19,
         "rh_max": 85,
         "rh_min": 29,
         "wind_speed": 7,
         "wind_direction": 11,
         "cloud_cover": 0
      }
   },
   "names_of_crops": [
      "ଧାନ।",
      "ଚିନାବାଦାମ",
      "ଆଖୁ",
      "କଳା ଚଣା",
      "ଲଙ୍କା",
      "କୋଇଲା ଫସଲ",
      "ରସୁଣ",
      "ଆମ୍ବ",
      "ଗୋଲାପ।",
      "ପଶୁପାଳନ",
      "କୁକୁଡ଼ା ମାଂସ"
   ],
   "general_advisory": "ମୁଖ୍ୟତଃ ସ୍ୱଚ୍ଛ ଆକାଶ ସହିତ ଶୁଖିଲା ପାଗ ହେବାର ସମ୍ଭାବନା ରହିଛି। କୀଟ କାର୍ଯ୍ୟକଳାପ ଉପରେ ନଜର ରଖିବା, ଜଳସେଚନ କରିବା ଏବଂ ଆବଶ୍ୟକତା ଅନୁଯାୟୀ ରୋଗ ପରିଚାଳନା ଅଭ୍ୟାସ କାର୍ଯ୍ୟକାରୀ କରିବାକୁ କୃଷକମାନଙ୍କୁ ପରାମର୍ଶ ଦିଆଯାଇଛି।",
   "crops_data": {
      "paddy": {
         "advisory": [
            "ରୋପଣ କରାଯାଇଥିବା ଧାନରେ, ସୁପାରିଶ କରାଯାଇଥିବା କୀଟନାଶକ ସିଞ୍ଚନ କରି ଘାସ, ସେଜ୍ ଏବଂ ବ୍ରଡ୍ଲିଫ୍ ଆଗାଛାକୁ ନିୟନ୍ତ୍ରଣ କରନ୍ତୁ।"
         ]
      },
      "groundnut": {
         "advisory": [
            "ନିମ୍ବ ଆଧାରିତ କୀଟନାଶକ କିମ୍ବା ରାସାୟନିକ କୀଟନାଶକ ସିଞ୍ଚନ କରି ବଡ ନେକ୍ରୋସିସ୍ ରୋଗ ପରିଚାଳନା କରନ୍ତୁ।"
         ]
      },
      "sugarcane": {
         "advisory": [
            "ସୁପାରିଶ କରାଯାଇଥିବା କୀଟନାଶକ ସହିତ ଉପଯୁକ୍ତ ଡ୍ରେଞ୍ଚିଂ କିମ୍ବା ପତ୍ର ସ୍ପ୍ରେ ମାଧ୍ୟମରେ ରଟ୍ ରୋଗକୁ ପରିଚାଳନା କରନ୍ତୁ |"
         ]
      },
      "black gram": {
         "advisory": [
            "ନିମ-ଆଧାରିତ କୀଟନାଶକ ଏବଂ ତା 'ପରେ ରାସାୟନିକ କୀଟନାଶକ ଦ୍ୱାରା ଏଫିଡ୍କୁ ନିୟନ୍ତ୍ରଣ କରନ୍ତୁ।"
         ]
      },
      "chilli": {
         "advisory": [
            "ସମୟୋଚିତ ଫଙ୍ଗିସାଇଡ୍ ସ୍ପ୍ରେ ମାଧ୍ୟମରେ ଫଳ ରଟ୍ ଏବଂ ଡାଇ ବ୍ୟାକ୍ ରୋଗ ପରିଚାଳନା କରନ୍ତୁ |"
         ]
      },
      "cole crops": {
         "advisory": [
            "ସୁପାରିସ କରାଯାଇଥିବା କବକନାଶକ ବ୍ୟବହାର କରି ଅଲ୍ଟରନେରିଆ ଲିଫ୍ ସ୍ପଟ୍ ରୋଗକୁ ନିୟନ୍ତ୍ରଣ କରନ୍ତୁ।"
         ]
      },
      "onion": {
         "advisory": [
            "ନିୟମିତ ବ୍ୟବଧାନରେ ଉପଯୁକ୍ତ ଫଙ୍ଗିସାଇଡ୍ ସହିତ ପର୍ପଲ ବ୍ଲଚ୍ ଏବଂ ଷ୍ଟେମଫିଲିଅମ୍ ଲିଫ୍ ବ୍ଲାଇଟ୍ ପରିଚାଳନା କରନ୍ତୁ |"
         ]
      },
      "mango": {
         "advisory": [
            "ନିର୍ଦ୍ଦିଷ୍ଟ ପର୍ଯ୍ୟାୟରେ ସୁପାରିଶ କରାଯାଇଥିବା କୀଟନାଶକ ସିଞ୍ଚନ କରି ଆମ୍ବ ହପର ପରିଚାଳନା କରନ୍ତୁ।"
         ]
      },
      "rose": {
         "advisory": [
            "ପ୍ରତିଷେଧକ ଫଙ୍ଗିସାଇଡ୍ ସ୍ପ୍ରେ କରି ପାଉଡର ଫଙ୍ଗସ୍ ସଂକ୍ରମଣକୁ ରୋକନ୍ତୁ |"
         ]
      },
      "animal husbandry": {
         "advisory": [
            "ଗୋରୁମାନଙ୍କ ପାଇଁ ପାଦ ଏବଂ ପାଟି ରୋଗ ଟୀକାକରଣ ନିଶ୍ଚିତ କରନ୍ତୁ |"
         ]
      },
      "poultry": {
         "advisory": [
            "ନିର୍ଦ୍ଦିଷ୍ଟ ଟିକା ବ୍ୟବହାର କରି ଶୋଇଥିବା ରୋଗ ବିରୁଦ୍ଧରେ ଛୁଆମାନଙ୍କୁ ଟୀକାକରଣ କରନ୍ତୁ |"
         ]
      }
   },
   "date": "07-02-2025"
}