{
   "weather_details": {
      "07-02-2025": {
         "rainfall": 0,
         "t_max": 34,
         "t_min": 19,
         "rh_max": 66,
         "rh_min": 16,
         "wind_speed": 3,
         "wind_direction": 194,
         "cloud_cover": 1
      },
      "08-02-2025": {
         "rainfall": 0,
         "t_max": 32,
         "t_min": 18,
         "rh_max": 52,
         "rh_min": 16,
         "wind_speed": 3,
         "wind_direction": 236,
         "cloud_cover": 2
      },
      "09-02-2025": {
         "rainfall": 0,
         "t_max": 32,
         "t_min": 18,
         "rh_max": 49,
         "rh_min": 13,
         "wind_speed": 2,
         "wind_direction": 231,
         "cloud_cover": 2
      },
      "10-02-2025": {
         "rainfall": 0,
         "t_max": 32,
         "t_min": 18,
         "rh_max": 56,
         "rh_min": 11,
         "wind_speed": 3,
         "wind_direction": 186,
         "cloud_cover": 3
      },
      "11-02-2025": {
         "rainfall": 0,
         "t_max": 33,
         "t_min": 18,
         "rh_max": 66,
         "rh_min": 13,
         "wind_speed": 3,
         "wind_direction": 90,
         "cloud_cover": 1
      }
   },
   "names_of_crops": [
      "ଶୁଖିଲା ଋତୁ ଚାଉଳ",
      "ସବୁଜ ଚଣା",
      "କଳା ଚଣା",
      "ଆମ୍ବ",
      "ପନିପରିବା ଫସଲ",
      "ପଶୁପାଳନ"
   ],
   "general_advisory": "ଓଡ଼ିଶାର ଜିଲ୍ଲାଗୁଡ଼ିକରେ ସପ୍ତାହ-1 (7 ରୁ 13 ଫେବୃଆରୀ, 2025) ମଧ୍ୟରେ ଶୁଖିଲା ପାଗ ରହିବାର ସମ୍ଭାବନା ରହିଛି ଏବଂ ସର୍ବନିମ୍ନ ତାପମାତ୍ରା ସ୍ୱାଭାବିକଠାରୁ କମ୍ ରହିବ। ଦ୍ୱିତୀୟ ସପ୍ତାହରେ, କେତେକ ଅଞ୍ଚଳରେ ସର୍ବନିମ୍ନ ତାପମାତ୍ରା ସ୍ୱାଭାବିକ ଠାରୁ ସ୍ୱାଭାବିକଠାରୁ କମ୍ ରହିବ ବୋଲି ଆଶା କରାଯାଉଛି। ଉପଯୁକ୍ତ ସମୟରେ ନିର୍ଦ୍ଦିଷ୍ଟ ସମୟରେ ଜଳସେଚନ, ସିଞ୍ଚନ ଏବଂ ଆନ୍ତଃସାଂସ୍କୃତିକ କାର୍ଯ୍ୟ କରିବା ପାଇଁ କୃଷକମାନଙ୍କୁ ପରାମର୍ଶ ଦିଆଯାଇଛି।",
   "crops_data": {
      "dry season rice": {
         "advisory": [
            "ପ୍ରତିରୋପଣ କରାଯାଇଥିବା ଚାଉଳରେ, ପ୍ରତି ଏକର ପିଛା 35 କି. ଗ୍ରା. ୟୁରିଆକୁ ପ୍ରତିରୋପଣ କିମ୍ବା ସର୍ବାଧିକ ଟିଲରିଙ୍ଗ୍ ପର୍ଯ୍ୟାୟର 20-25 ଦିନରେ ପ୍ରଥମ ଟପ୍ ଡ୍ରେସିଙ୍ଗ୍ ଭାବରେ ଲଗାନ୍ତୁ।",
            "ହଳଦିଆ କାଣ୍ଡ ଛେଦକ ଏବଂ ପତ୍ର ଫୋଲଡର ଉପରେ ନଜର ରଖିବା ପାଇଁ ଫେରୋମୋନ୍ ଟ୍ରାପ୍ ବ୍ୟବହାର କରନ୍ତୁ। ଆବଶ୍ୟକ ପଡ଼ିଲେ ଉପଯୁକ୍ତ କୀଟନାଶକ ସିଞ୍ଚନ କରନ୍ତୁ।",
            "କୀଟପତଙ୍ଗ ନିୟନ୍ତ୍ରଣ ପାଇଁ 200 ଲିଟର ପାଣିରେ କ୍ଲୋରାଣ୍ଟ୍ରାନିଲିପ୍ରୋଲ 18.5% ଏସସି @60 ମିଲି/ଏକର ଲଗାନ୍ତୁ।"
         ]
      },
      "green gram": {
         "advisory": [
            "ବନସ୍ପତି ପର୍ଯ୍ୟାୟରେ ଶୋଷକ କୀଟ ଆକ୍ରମଣକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ ହଳଦିଆ ଚଟପଟା ଫାନ୍ଦ ବ୍ୟବହାର କରନ୍ତୁ।",
            "ଆକ୍ରମଣର ପ୍ରାରମ୍ଭିକ ପର୍ଯ୍ୟାୟରେ ପ୍ରତି ଲିଟର ପାଣିରେ ନିମ୍ବ ତେଲ ସ୍ପ୍ରେ କରନ୍ତୁ।",
            "ପ୍ରସ୍ତାବିତ କୀଟନାଶକ ଦ୍ୱାରା ହଳଦିଆ ମୋଜାଇକ ଭୂତାଣୁକୁ ନିୟନ୍ତ୍ରଣ କରନ୍ତୁ।"
         ]
      },
      "black gram": {
         "advisory": [
            "କୀଟ ନିୟନ୍ତ୍ରଣ ଏବଂ ଭୂତାଣୁ ପରିଚାଳନା ପାଇଁ ସବୁଜ ଚଣା ଭଳି ସମାନ ଅଭ୍ୟାସ ଅନୁସରଣ କରନ୍ତୁ।"
         ]
      },
      "mango": {
         "advisory": [
            "ବଗିଚାରେ ଆମ୍ବ ହପର ଆକ୍ରମଣ ଉପରେ ନିୟମିତ ନଜର ରଖନ୍ତୁ।",
            "ଫୁଲ ଝଡ଼ିବା ହ୍ରାସ କରିବା ପାଇଁ ଫୁଲ ଉଠିବା ସମୟରେ ଜଳସେଚନରୁ ଦୂରେଇ ରୁହନ୍ତୁ।",
            "ପଲିଥିନ୍/ଆଲ୍କାଥେନ୍ ଶୀଟ୍ ଏବଂ ଉପଯୁକ୍ତ ଛାଣିବା ସହିତ ଆମ୍ବ ମେଲି ବଗ୍କୁ ପରିଚାଳନା କରନ୍ତୁ |",
            "ଓଦା ଯାଇପାରୁଥିବା ସଲଫର୍ ସ୍ପ୍ରେ ଦ୍ୱାରା ପାଉଡରଯୁକ୍ତ ଫଙ୍ଗୁର ଚିକିତ୍ସା କରନ୍ତୁ।"
         ]
      },
      "vegetable crops": {
         "advisory": [
            "ଟମାଟୋ, ବାଇଗଣ ଏବଂ ଫୁଲକୋବିରେ କୀଟପତଙ୍ଗକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ ନିର୍ଦ୍ଦିଷ୍ଟ କୀଟନାଶକ ବ୍ୟବହାର କରନ୍ତୁ।",
            "ପିଆଜରେ ବାଇଗଣୀ ରଙ୍ଗର ଦାଗ ଭଳି ରୋଗ ସଂକ୍ରମଣ ଉପରେ ନଜର ରଖନ୍ତୁ।",
            "ଫୁଲ ଫୁଟିବା ସମୟରେ ରାସାୟନିକ ପ୍ରୟୋଗରୁ ଦୂରେଇ ରୁହନ୍ତୁ।"
         ]
      },
      "livestock": {
         "advisory": [
            "ବର୍ଦ୍ଧିତ ତାପମାତ୍ରା ସ୍ଥିତିରେ ପଶୁମାନଙ୍କର ସ୍ୱଚ୍ଛ ପାନୀୟ ଜଳ ଉପଲବ୍ଧ ହେବା ସୁନିଶ୍ଚିତ କରନ୍ତୁ।",
            "ନିୟମିତ ଭାବେ ସାଧାରଣ ରୋଗ ଏବଂ କୃମିନାଶକ ବିରୁଦ୍ଧରେ ପଶୁମାନଙ୍କୁ ଟୀକାକରଣ କରନ୍ତୁ।"
         ]
      }
   },
   "date": "07-02-2025"
}