{
   "weather_details": {
      "2025-02-08": {
         "rainfall": 0,
         "t_max": 35,
         "t_min": 20,
         "rh_max": 81,
         "rh_min": 25,
         "wind_speed": 2,
         "wind_direction": 338,
         "cloud_cover": 2
      },
      "2025-02-09": {
         "rainfall": 0,
         "t_max": 35,
         "t_min": 19,
         "rh_max": 90,
         "rh_min": 20,
         "wind_speed": 3,
         "wind_direction": 320,
         "cloud_cover": 1
      },
      "2025-02-10": {
         "rainfall": 0,
         "t_max": 35,
         "t_min": 19,
         "rh_max": 86,
         "rh_min": 20,
         "wind_speed": 2,
         "wind_direction": 315,
         "cloud_cover": 2
      },
      "2025-02-11": {
         "rainfall": 0,
         "t_max": 35,
         "t_min": 20,
         "rh_max": 80,
         "rh_min": 20,
         "wind_speed": 2,
         "wind_direction": 288,
         "cloud_cover": 1
      },
      "2025-02-12": {
         "rainfall": 0,
         "t_max": 36,
         "t_min": 20,
         "rh_max": 66,
         "rh_min": 17,
         "wind_speed": 3,
         "wind_direction": 277,
         "cloud_cover": 2
      }
   },
   "names_of_crops": [
      "ଚାଉଳ",
      "ଚିନାବାଦାମ",
      "ଆଳୁ",
      "ମେନାସିନାକାହି",
      "ଲଙ୍କା",
      "କଦଳୀ",
      "ରସୁଣ",
      "ଆମ୍ବ",
      "ଉଦ୍ଭିଦ ସୁରକ୍ଷା"
   ],
   "general_advisory": "ଗତ ସପ୍ତାହରେ ଗଜପତି ଜିଲ୍ଲାର ହାରାହାରି ସର୍ବାଧିକ ଦୈନିକ ତାପମାତ୍ରା 35.7 ଡିଗ୍ରୀ ସେଲସିୟସ୍ ଏବଂ ହାରାହାରି ସର୍ବନିମ୍ନ ଦୈନିକ ତାପମାତ୍ରା 19 ଡିଗ୍ରୀ ସେଲସିୟସ୍ ଥିଲା। ଗତ ସପ୍ତାହରେ ଜିଲ୍ଲାରେ 0 ମିଲିମିଟର ବର୍ଷା ହୋଇଥିଲା। ଯଦି ନର୍ସରୀରେ ପୂର୍ବରୁ ଗ୍ରାନୁଲାର କୀଟନାଶକ ପ୍ରୟୋଗ କରାଯାଇ ନାହିଁ, ତେବେ ମୁଖ୍ୟ କ୍ଷେତରେ ଷ୍ଟେମବୋରରକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ 10-12 ଘଣ୍ଟା ପାଇଁ 0.2% କ୍ଲୋରୋପାଇରିଫସ୍ ସହିତ ଚାରା ଚିକିତ୍ସା। ବିଳମ୍ବରେ ରୋପଣ ଅଧୀନରେ ଧାନର ମୁଖ୍ୟ କ୍ଷେତରେ ପାଣି ବାନ୍ଧି ରଖନ୍ତୁ | ମୃତ୍ତିକାର ଆର୍ଦ୍ରତାକୁ ଧ୍ୟାନରେ ରଖି ଗ୍ରୀଷ୍ମକାଳୀନ ଧାନ ଏବଂ ଅନ୍ୟାନ୍ୟ ଫସଲ ପାଇଁ ଜଳସେଚନ ପାଇଁ ଯୋଜନା କରନ୍ତୁ। ଆନ୍ତଃସାଂସ୍କୃତିକ ପରିଚାଳନା, ସାର, ଏବଂ ଅପତୃଣନାଶକ ପ୍ରୟୋଗ ଜାରି ରଖନ୍ତୁ। ପରିପକ୍ୱ ଫସଲ ଅମଳ ଜାରି ରଖନ୍ତୁ ଏବଂ ଉତ୍ପାଦଗୁଡ଼ିକୁ ବର୍ଷାରୁ ରକ୍ଷା କରିବା ପାଇଁ ଏକ ସୁରକ୍ଷିତ ସ୍ଥାନରେ ରଖନ୍ତୁ। ଆବଶ୍ୟକତା ଅନୁଯାୟୀ ଫସଲରେ କୀଟନାଶକ କିମ୍ବା କୀଟନାଶକ ସିଞ୍ଚନ କରନ୍ତୁ।",
   "crops_data": {
      "rice": {
         "advisory": [
            "ଘାସ, ସେଜ୍ ଏବଂ ବ୍ରଡ ଲିଫ୍ ଆଗାଛାକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ ରୋପଣ କରାଯାଇଥିବା ଧାନରେ କୃଷକମାନଙ୍କୁ ସ୍ପ୍ରେ କରିବାକୁ ପରାମର୍ଶ ଦିଆଯାଇଛି, ବିସ୍ପିରିବାକ୍ ସୋଡିୟମ୍ 10 ପ୍ରତିଶତ ଇ. ସି. ଏକର ପିଛା 100 ମିଲି କିମ୍ବା ଇଥୋକ୍ସିସଲ୍ଫୁରନ୍ 15 ପ୍ରତିଶତ ଡବ୍ଲ୍ୟୁ. ଡି. ଜି. ଏକର ପିଛା 40 ଗ୍ରାମ କିମ୍ବା ପ୍ରସ୍ତୁତ ମିଶ୍ରଣ ମେଟସଲ୍ଫୁରନ୍ ମିଥାଇଲ 10 ପ୍ରତିଶତ + କ୍ଲୋରିମୁରନ୍ ଇଥାଇଲ 10 ପ୍ରତିଶତ ଡବ୍ଲ୍ୟୁ. ପି. ଏକର ପିଛା 8 ଗ୍ରାମ ପିଛା 3 ରୁ 4 ପତ୍ର ପର୍ଯ୍ୟାୟରେ 200 ଲିଟର ପାଣିରେ ମିଶ୍ରଣ କରି।"
         ]
      },
      "groundnut": {
         "advisory": [
            "ଟିକ୍କାଃ ଯଦି ଲକ୍ଷଣ ଦେଖାଯାଏ, କ୍ଲୋରୋଥାଲୋନିଲ୍ 75 ପ୍ରତିଶତ ଡବ୍ଲ୍ୟୁ. ପି. @400 ଗ୍ରାମ/ଏସି କିମ୍ବା ହେକ୍ସାକୋନାଜୋଲ୍ 5 ପ୍ରତିଶତ ଇ. ସି. @300 ମିଲି/ଏସି କିମ୍ବା ମାନକୋଜେବ୍ 75 ପ୍ରତିଶତ ଡବ୍ଲ୍ୟୁ. ପି. @600 ଜି./ଏସି. କୁ 200 ଲିଟର ପାଣି ସହିତ ମିଶାଇ ଲଗାଇବା ପାଇଁ ପରାମର୍ଶ ଦିଆଯାଏ।"
         ]
      },
      "potato": {
         "advisory": [
            "ଆଳୁ ଫସଲରେ କଟା କୃମିକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ କ୍ଲୋରପିରିଫସ୍ 50 ପ୍ରତିଶତ + ସାଇପର୍ମେଥ୍ରିନ୍ 5 ପ୍ରତିଶତ ଇ. ସି. ପ୍ରତି ଏକର 400 ମିଲି. ରେ 200 ଲିଟର ପାଣିରେ ମିଶାଇ ସ୍ପ୍ରେ କରନ୍ତୁ। କଟା କୃମି ନିଶାଚର, ତେଣୁ ସନ୍ଧ୍ୟାରେ କୀଟନାଶକ ସ୍ପ୍ରେ କରାଯିବା ଉଚିତ। କ୍ଲୋରପିରିଫସ୍ର ଧୂଳି ପୋଛିବା କାର୍ଯ୍ୟ 1.5% ଡିପି @10 କି. ଗ୍ରା./ଏକରରେ ବନ୍ଧ ଉପରେ କରାଯିବା ଉଚିତ।"
         ]
      },
      "menacinakahi": {
         "advisory": [
            "ଲଙ୍କାରେ ଥିବା ମାଇଟ୍କୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ, ଇଥିୟନ 50 ପ୍ରତିଶତ ଇସି @600 ମିଲି/ଏକର କିମ୍ବା ସ୍ପାଇରୋମେସିଫେନ୍ 22.9% ଏସସି @200 ମିଲି/ଏକର କିମ୍ବା ପ୍ରୋପାର ଗାଇଟ 57 ପ୍ରତିଶତ ଇସି @600 ମିଲି/ଏକର ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "chilli": {
         "advisory": [
            "ଲଙ୍କାରେ ଥିବା ମାଇଟ୍କୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ, ଇଥିୟନ 50 ପ୍ରତିଶତ ଇସି @600 ମିଲି/ଏକର କିମ୍ବା ସ୍ପାଇରୋମେସିଫେନ୍ 22.9% ଏସସି @200 ମିଲି/ଏକର କିମ୍ବା ପ୍ରୋପାର ଗାଇଟ 57 ପ୍ରତିଶତ ଇସି @600 ମିଲି/ଏକର ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "cabbage": {
         "advisory": [
            "ବର୍ତ୍ତମାନର ମେଘୁଆ ପାଗ କାରଣରୁ କୋଲ୍ ଫସଲରେ ଅଲ୍ଟରନେରିଆ ଲିଫ୍ ସ୍ପଟ୍ ରୋଗ ହେବାର ସମ୍ଭାବନା ରହିଛି। କୋଇଲା ଫସଲରେ ଏହି ରୋଗକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ 200 ଲିଟର ପାଣିରେ ମିଶାଇ ଏକର ପିଛା ମାନକୋଜେବ୍ 75 ପ୍ରତିଶତ ଡବ୍ଲ୍ୟୁ. ପି. @600-ଗ୍ରାମ୍ କିମ୍ବା କାର୍ବେଣ୍ଡାଜିମ୍ 12 ପ୍ରତିଶତ + ମାନକୋଜେବ୍ 63 ପ୍ରତିଶତ ଡବ୍ଲ୍ୟୁ. ପି. @400-ଗ୍ରାମ୍ ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "onion": {
         "advisory": [
            "ପିଆଜରେ ବାଇଗଣୀ ରଙ୍ଗର ବ୍ଲଚ୍ ଏବଂ ଷ୍ଟେମଫିଲିଅମ୍ ଲିଫ୍ ବ୍ଲାଇଟ୍ ରୋଗକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ 15 ଦିନର ବ୍ୟବଧାନରେ 200 ଲିଟର ପାଣିରେ ମିଶାଇ ଏକର ପିଛା ମାନକୋଜେବ୍ 75 ପ୍ରତିଶତ ଡବ୍ଲ୍ୟୁ. ପି. @600 ଗ୍ରାମ୍ କିମ୍ବା ଡିଫେନୋକାନାଜୋଲ୍ 25 ପ୍ରତିଶତ ଇ. ସି. @200 ମିଲି କିମ୍ବା ଟେବୁକୋନାଜୋଲ୍ 25.9% ଇ. ସି. @100 ମିଲି. ସ୍ପ୍ରେ କରନ୍ତୁ। ପିଆଜର ସିଧା ପତ୍ରରେ ସ୍ପ୍ରେ ତରଳ ପଦାର୍ଥର ଧାରଣ ଏବଂ ବିସ୍ତାର ପାଇଁ ଏକ ସ୍ପ୍ରେଡର କିମ୍ବା ଷ୍ଟିକର ମିଶାନ୍ତୁ |"
         ]
      },
      "mango": {
         "advisory": [
            "ମେଘୁଆ ଏବଂ କୁହୁଡ଼ି ପାଗରେ ଆମ୍ବ ହପର ଦ୍ରୁତ ଗତିରେ ବୃଦ୍ଧି ପାଇଥାଏ | ଆମ୍ବ ହପରମାନଙ୍କୁ ପରିଚାଳନା କରିବା ପାଇଁ ଇମିଡାକ୍ଲୋପ୍ରିଡ୍ 17.8% ଏସଏଲ @5 ମିଲି/15 ଲିଟର ପାଣି କିମ୍ବା ଥିୟାମେଥୋକ୍ସାମ 25 ପ୍ରତିଶତ ଡବ୍ଲୁ. ଜି. @3 ମିଲି/15 ଲିଟର ପାଣି କିମ୍ବା ଏସିଟାମିପ୍ରିଡ୍ 20 ପ୍ରତିଶତ ଏସ. ପି. @4 ଗ୍ରାମ/15 ଲିଟର ପାଣି ସିଞ୍ଚନ କରନ୍ତୁ। ପେନିକଲ୍ ବାହାରିବା ସମୟରେ ପ୍ରଥମ ସ୍ପ୍ରେ ଏବଂ ପ୍ରଥମ ସ୍ପ୍ରେ ହେବାର ଦୁଇ ସପ୍ତାହ ପରେ ଦ୍ୱିତୀୟ ସ୍ପ୍ରେ କରାଯିବା ଉଚିତ। ଗଛ ତଳେ ଧୂଆଁ ଲଗାଇବା ଦ୍ୱାରା କୀଟପତଙ୍ଗ ସଂଖ୍ୟା ହ୍ରାସ କରିବାରେ ମଧ୍ୟ ସହାୟକ ହୋଇଥାଏ।"
         ]
      },
      "plant protection": {
         "advisory": [
            "ବାଇଗଣ, ଟମାଟୋ ଏବଂ ଲଙ୍କାରେ ବ୍ୟାକ୍ଟେରିଆଲ୍ ୱିଲ୍ଟର ସଂକ୍ରମଣ ଅଛି | ଏହି ରୋଗକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ 10 ଲିଟର ପାଣିରେ ସ୍ଟ୍ରେପ୍ଟୋସାଇକ୍ଲିନ୍ @1.5 ଗ୍ରାମ କିମ୍ବା ପ୍ଲାଣ୍ଟୋମାଇସିନ୍ @15 ଗ୍ରାମ + କପର ଅକ୍ସିକ୍ଲୋରାଇଡ୍ @30 ଗ୍ରାମରେ ଭିଜାଇ ଦିଅନ୍ତୁ।"
         ]
      }
   },
   "date": "07-02-2025"
}