{
   "weather_details": {
      "08-02-2025": {
         "rainfall": 0,
         "t_max": 31,
         "t_min": 17,
         "rh_max": 61,
         "rh_min": 18,
         "wind_speed": 5,
         "wind_direction": 4,
         "cloud_cover": 2
      },
      "09-02-2025": {
         "rainfall": 0,
         "t_max": 31,
         "t_min": 16,
         "rh_max": 72,
         "rh_min": 18,
         "wind_speed": 5,
         "wind_direction": 4,
         "cloud_cover": 2
      },
      "10-02-2025": {
         "rainfall": 0,
         "t_max": 31,
         "t_min": 16,
         "rh_max": 82,
         "rh_min": 19,
         "wind_speed": 4,
         "wind_direction": 334,
         "cloud_cover": 1
      },
      "11-02-2025": {
         "rainfall": 0,
         "t_max": 31,
         "t_min": 15,
         "rh_max": 84,
         "rh_min": 21,
         "wind_speed": 4,
         "wind_direction": 261,
         "cloud_cover": 1
      },
      "12-02-2025": {
         "rainfall": 0,
         "t_max": 32,
         "t_min": 15,
         "rh_max": 82,
         "rh_min": 17,
         "wind_speed": 5,
         "wind_direction": 242,
         "cloud_cover": 3
      }
   },
   "names_of_crops": [
      "ଗ୍ରୀଷ୍ମକାଳୀନ ଚାଉଳ",
      "ଚିନାବାଦାମ",
      "ବ୍ଲାକଗ୍ରାମ/ଗ୍ରୀନଗ୍ରାମ",
      "ସୋରିଷ ଓ ସୋରିଷ",
      "ପନିପରିବା",
      "ଫଳ",
      "ଫୁଲ।",
      "ଗୋରୁ।"
   ],
   "general_advisory": "ପ୍ରଚଳିତ କୁହୁଡ଼ି ଅବସ୍ଥା ଏବଂ ତାପମାତ୍ରାରେ କ୍ରମିକ ବୃଦ୍ଧି ପନିପରିବାରେ ଧଳା ମାଛି, ଏଫିଡ୍, ଜ୍ଯାସିଡ୍ ଏବଂ ଥର୍ପସ୍ ପରି କୀଟ ଶୋଷିବା ପାଇଁ ସଂକ୍ରମଣ ବୃଦ୍ଧି କରିପାରେ ତେଣୁ ନିୟମିତ ଭାବରେ ଫସଲ ଉପରେ ନଜର ରଖନ୍ତୁ ଏବଂ ଏକର ପିଛା 8 ରେ ହଳଦିଆ ଷ୍ଟିକ୍ ଫାନ୍ଦ ସ୍ଥାପନ କରନ୍ତୁ | ମହୁମାଛିଙ୍କୁ ରକ୍ଷା କରିବା ପାଇଁ ଅପରାହ୍ନ 3ଟା ପରେ କୀଟନାଶକ ସିଞ୍ଚନ କରାଯିବ।",
   "crops_data": {
      "summer rice": {
         "advisory": [
            "20x15 ସେ. ମି. ବ୍ୟବଧାନରେ 25-30 ଦିନ ପୁରୁଣା ଚାରା ରୋପଣ କରାଯିବା ଉଚିତ, ଅଧିକ ଉତ୍ପାଦନକ୍ଷମ ପ୍ରଜାତି ପାଇଁ ପ୍ରତି ପାହାଡ଼ରେ 2ରୁ 3 ଚାରା ଲଗାଇବା ଉଚିତ।",
            "ରୋପଣ କରିବାକୁ ଯାଉଥିବା କୃଷକମାନେ ଏକର ପିଛା 35 କିଲୋଗ୍ରାମ ଡିଏପି, 20 କିଲୋଗ୍ରାମ ଏମଓପି ଏବଂ 8 କିଲୋଗ୍ରାମ ୟୁରିଆ ପ୍ରୟୋଗ କରିବା ଉଚିତ୍। ଜିଙ୍କ ଅଭାବ ଥିବା ମାଟିରେ ଜିଙ୍କ ସଲ୍ଫେଟ୍ (21 ପ୍ରତିଶତ) ଏକର ପିଛା 10 କିଲୋଗ୍ରାମରେ ଲଗାନ୍ତୁ।",
            "ନର୍ସରୀ ଏବଂ ମୁଖ୍ୟ କ୍ଷେତରେ ରୋଗ ପରିଚାଳନା ପାଇଁ ପ୍ରତିରୋପଣର 5ରୁ 6 ଦିନ ପୂର୍ବରୁ (ଟେବୁକୋନାଜୋଲ୍ + ଟ୍ରାଇଫ୍ଲୋକ୍ସିସ୍ଟ୍ରୋବିନ୍) ପତ୍ରପତ୍ରିକା ଉପରେ ପ୍ଲାଣ୍ଟୋମାଇସିନ୍ ସହିତ ଲିଟର ପିଛା 0.5 ମିଲି ପାଣି ସିଞ୍ଚନ କରିବା ସୁପାରିସ କରାଯାଏ।"
         ]
      },
      "groundnut": {
         "advisory": [
            "ଧଳା ଗ୍ରବର କାର୍ଯ୍ୟକଳାପ ଉପରେ ନଜର ରଖନ୍ତୁ ଏବଂ ଭୃଣମାନଙ୍କୁ ଆକର୍ଷିତ କରିବା ପାଇଁ ହାଲୁକା ଫାନ୍ଦ ଲଗାନ୍ତୁ | କ୍ଲୋରୋପାଇରିଫସ୍ ଧୂଳିକଣାର ସ୍ଥାନୀୟ ପ୍ରୟୋଗ ଦ୍ୱାରା ଚିନାବାଦାମରେ ଧଳା ଗ୍ରାବ୍ ସଂକ୍ରମଣକୁ ହ୍ରାସ କରାଯାଇପାରିବ।",
            "ଫସଲକୁ କଳାର ରଟ୍, ଷ୍ଟେମ ରଟ୍ ଏବଂ ଟିକ୍କା ରୋଗରୁ ରକ୍ଷା କରିବା ପାଇଁ (କାର୍ବେଣ୍ଡାଜିମ୍ + ମାଙ୍କୋଜେବ୍) କିମ୍ବା (ମେଟାଲୋକ୍ସିଲ୍ + ମାଙ୍କୋଜେବ୍) @2 ଗ୍ରାମ/ଲିଟର ପାଣି ସହିତ ସ୍ପ୍ରେ ଏବଂ ଡ୍ରେଞ୍ଚିଂ ଆବଶ୍ୟକ |"
         ]
      },
      "blackgram/greengram": {
         "advisory": [
            "ଫ୍ଲି ବିଟଲ ଏବଂ ଅନ୍ୟାନ୍ୟ ଡିଫୋଲିଏଟର ବୃଦ୍ଧିକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ ପ୍ରାରମ୍ଭିକ ଫସଲ ବୃଦ୍ଧି ପର୍ଯ୍ୟାୟରେ ପ୍ରୋଫେନୋଫସ୍ @2 ମିଲି/ଲିଟର ପାଣି ସ୍ପ୍ରେ କରିବାକୁ ସୁପାରିସ କରାଯାଏ।",
            "ଏମ୍. ୱାଇ. ଏମ୍. ଭି. ଏବଂ ୟୁ. ଏଲ୍. ସି. ଭି. ସଂକ୍ରମିତ ଗଛ ଗୁଡ଼ିକୁ ରୁଜ୍ କରିବା ଏବଂ ଡାଇଫେନ୍ଥୁରିୟନ୍ 50 ଡବ୍ଲ୍ୟୁ. ପି. @ଏକର ପିଛା 200 ଗ୍ରାମ୍ କିମ୍ବା ଲିଟର ପିଛା 1 ଗ୍ରାମ୍ ପାଣି ସିଞ୍ଚନ କରିବା ପାଇଁ ପରାମର୍ଶ ଦିଆଯାଇଛି।"
         ]
      },
      "rapeseed and mustard": {
         "advisory": [
            "ପ୍ରଚଳିତ କୁହୁଡ଼ି ଅବସ୍ଥା ଏବଂ ତାପମାତ୍ରାରେ କ୍ରମିକ ବୃଦ୍ଧି ଏଫିଡର ସଂକ୍ରମଣକୁ ବଢ଼ାଇପାରେ | ଏଫିଡ୍କୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ ଆବଶ୍ୟକତା ଅନୁଯାୟୀ ଏକର ପିଛା 600 ମିଲି ନିମ୍ବ ତେଲ କିମ୍ବା ଏକର ପିଛା 60 ଗ୍ରାମ୍ ଫ୍ଲୋନିକାମିଡ ସିଞ୍ଚନ କରିବା ପାଇଁ ପରାମର୍ଶ ଦିଆଯାଇଛି।",
            "ବନ୍ଧାକୋବି ୱେବର୍ ଏବଂ ସ୍ପୋଡୋପ୍ଟେରା ଲିଟୁରାର ସଂକ୍ରମଣକୁ ହ୍ରାସ କରିବା ପାଇଁ ଏକର ପିଛା ଇମାମେକ୍ଟିନ୍ ବେନ୍ଜୋଏଟ୍ @80gm ର ଆବଶ୍ୟକତା ଆଧାରିତ ସ୍ପ୍ରେ।"
         ]
      },
      "vegetables": {
         "advisory": [
            "3 ରୁ 4 ସପ୍ତାହ ପର୍ଯ୍ୟାୟରେ ଥିବା ରବି ପନିପରିବାରେ ସାର ପ୍ରୟୋଗ ପାଇଁ ପାଣିପାଗ ଉପଯୁକ୍ତ |",
            "ବାଇଗଣ ଏବଂ ଟମାଟୋରେ ଶୁଖିଲା କିମ୍ବା ଆଂଶିକ ଶୁଖିଲା ହେବାରୁ ରକ୍ଷା ପାଇବା ପାଇଁ ନିମ୍ବ କିମ୍ବା କରଞ୍ଜା କେକ୍ ଲଗାନ୍ତୁ ଏବଂ ସ୍ପ୍ରେ (ବେସାଲ୍ + ପତ୍ର) ଟେବୁକୋନାଜୋଲ୍ ଫଙ୍ଗିସାଇଡ୍ @1 ମିଲି/ଲିଟର କରନ୍ତୁ।"
         ]
      },
      "fruit": {
         "advisory": [
            "ପେପା-ପେପା ଲିଫ୍ କର୍ଲ ଭାଇରସର ଭେକ୍ଟର (ହ୍ୱାଇଟ୍ଫ୍ଲାଇ) କୁ ଧରିବା ପାଇଁ ହଳଦିଆ ଷ୍ଟିକି ଫାନ୍ଦ ଲଗାନ୍ତୁ। ଶ୍ୱେତ ମାଛି ନିୟନ୍ତ୍ରଣ ପାଇଁ ନିମ୍ବ ତେଲ ଗଠନ 1500 ପିପିଏମ @3 ମିଲି/ଲିଟର ପାଣି ଏବଂ ଫ୍ଲୋନିକାମିଡ 50 ଡବ୍ଲୁଜି @0.3 ଗ୍ରାମ୍/ଲିଟରର ବିକଳ୍ପ ସିଞ୍ଚନ।"
         ]
      },
      "flower": {
         "advisory": [
            "ମାରିଗୋଲ୍ଡ-ଥ୍ରୀପ୍, ଏଫିଡ୍, ମାଇଟ୍ ଏବଂ ଲିଫ୍ ମାଇନରର ସଂକ୍ରମଣକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ ମାରିଗୋଲ୍ଡ ଗଛରେ ଡାଇଫେନ୍ଥୁରିୟନ @1 ଗ୍ରାମ୍/ଲି ପାଣି କିମ୍ବା ଆବାମେକ୍ଟିନ୍ @0.75 ମିଲି/ଲି ପାଣି ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "cattle": {
         "advisory": [
            "ପଶୁମାନଙ୍କୁ ନିୟମିତ ଭାବରେ ଲୁଣ ସହିତ ଖଣିଜ ମିଶ୍ରଣ ଦିଆଯିବା ଉଚିତ ଏବଂ ପଶୁମାନଙ୍କ ଶକ୍ତି ଆବଶ୍ୟକତାକୁ ପୂରଣ କରିବା ପାଇଁ ଶୀତ ଋତୁରେ ଦୈନିକ ରାସନରେ ଗହମ ଶସ୍ୟ, ଗୁଡ଼ ଇତ୍ୟାଦି ଯୋଗାଇ ଦିଆଯାଇପାରେ |"
         ]
      }
   },
   "date": "07-02-2025"
}