{
   "weather_details": {
      "01/02/2025": {
         "rainfall": 0,
         "t_max": 33,
         "t_min": 19,
         "rh_max": 84,
         "rh_min": 32,
         "wind_speed": 4,
         "wind_direction": 90,
         "cloud_cover": 0
      },
      "08/02/2025": {
         "rainfall": 0,
         "t_max": 33,
         "t_min": 16,
         "rh_max": 84,
         "rh_min": 32,
         "wind_speed": 4,
         "wind_direction": 90,
         "cloud_cover": 0
      },
      "09/02/2025": {
         "rainfall": 0,
         "t_max": 33,
         "t_min": 16,
         "rh_max": 81,
         "rh_min": 27,
         "wind_speed": 8,
         "wind_direction": 247,
         "cloud_cover": 0
      }
   },
   "names_of_crops": [
      "ଧାନ।",
      "ଚିନାବାଦାମ",
      "ଆଖୁ",
      "କଳା ଚଣା",
      "ସବୁଜ ଚଣା",
      "ଲଙ୍କା",
      "କୋଇଲା ଫସଲ",
      "ରସୁଣ",
      "ଆମ୍ବ",
      "ଗୋଲାପ।",
      "ପଶୁପାଳନ",
      "କୁକୁଡ଼ା ମାଂସ"
   ],
   "general_advisory": "ସ୍ୱଚ୍ଛ ଆକାଶ ସହିତ ସର୍ବନିମ୍ନ ବର୍ଷା ହେବାର ସମ୍ଭାବନା ରହିଛି। କୀଟପତଙ୍ଗ ସଂଖ୍ୟା ଉପରେ ନଜର ରଖିବା, ଆବଶ୍ୟକତା ଅନୁଯାୟୀ ଜଳସେଚନ କରିବା ଏବଂ ନିର୍ଦ୍ଦିଷ୍ଟ ଫସଲ ପରିଚାଳନା ଅଭ୍ୟାସ ଅନୁସରଣ କରିବା ପାଇଁ କୃଷକମାନଙ୍କୁ ପରାମର୍ଶ ଦିଆଯାଇଛି।",
   "crops_data": {
      "paddy": {
         "advisory": [
            "ଘାସ, ସେଜ୍ ଏବଂ ବ୍ରଡ ଲିଫ୍ ଆଗାଛାକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ ରୋପଣ କରାଯାଇଥିବା ଧାନରେ କୃଷକମାନଙ୍କୁ 3 ରୁ 4 ପତ୍ର ପର୍ଯ୍ୟାୟରେ ବିସ୍ପିରିବାକ୍ ସୋଡିୟମ୍ 10 ପ୍ରତିଶତ ଇ. ସି. କିମ୍ବା ଇଥୋକ୍ସିସଲ୍ଫୁରନ୍ 15 ପ୍ରତିଶତ ଡବ୍ଲୁ. ଡି. ଜି. ସ୍ପ୍ରେ କରିବାକୁ ପରାମର୍ଶ ଦିଆଯାଇଛି।",
            "ଗ୍ରୀଷ୍ମକାଳୀନ ଧାନ ପାଇଁ ନର୍ସରୀ ଶଯ୍ୟା ବୃଦ୍ଧି କାର୍ଯ୍ୟ ଜାରି ରହିଛି।"
         ]
      },
      "groundnut": {
         "advisory": [
            "କୀଟ ସଂକ୍ରମଣର ପ୍ରାଥମିକ ପର୍ଯ୍ୟାୟରେ ବଡ ନେକ୍ରୋସିସ୍ ରୋଗ (ଥ୍ରିପ୍ସ) ର ବାହକକୁ ପରିଚାଳନା କରିବା ପାଇଁ ନିମ୍ବ-ଆଧାରିତ କୀଟନାଶକ କିମ୍ବା ରାସାୟନିକ ସ୍ପ୍ରେ ଯେପରିକି ଥାୟାମେଥୋକ୍ସାମ୍ 25 ପ୍ରତିଶତ ଡବ୍ଲୁ. ଜି. କିମ୍ବା ଏସିଟାମିପ୍ରିଡ୍ 20 ପ୍ରତିଶତ ଏସ. ପି. ସ୍ପ୍ରେ କରନ୍ତୁ।",
            "ସୋରିଷ ଏବଂ ଚିନାବାଦାମ ଫୁଲରୁ ଫଳି ଗଠନ ପର୍ଯ୍ୟାୟରେ ଅଛି |"
         ]
      },
      "sugarcane": {
         "advisory": [
            "କାର୍ବେନଡାଜିମ୍ 12 ପ୍ରତିଶତ + ମାନକୋଜେବ୍ 63 ପ୍ରତିଶତ ସହିତ ବେସାଲ୍ ଡ୍ରେଞ୍ଚିଂ କିମ୍ବା ମେଟାଲାକ୍ସିଲ୍ 8 ପ୍ରତିଶତ + ମାନକୋଜେବ୍ 64 ପ୍ରତିଶତ ଡବ୍ଲ୍ୟୁ. ପି. ସହିତ ପତ୍ର ସ୍ପ୍ରେ ରୋପଣ କରିବା ପରେ ରୋଗକୁ ପରିଚାଳନା କରିବା।",
            "ଆଖୁ ଅମଳ ଏବଂ ରୋପଣ କାର୍ଯ୍ୟ ଜାରି ରହିଛି।"
         ]
      },
      "black gram": {
         "advisory": [
            "କୀଟ ସଂକ୍ରମଣର ପ୍ରାଥମିକ ପର୍ଯ୍ୟାୟରେ ଏଫିଡ୍କୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ ନିମ୍ବ ଆଧାରିତ କୀଟନାଶକ କିମ୍ବା ରାସାୟନିକ ସ୍ପ୍ରେ ଯଥା ଥାୟାମେଥୋକ୍ସାମ 25 ପ୍ରତିଶତ ଡବ୍ଲୁ. ଜି. କିମ୍ବା ଏସିଟାମିପ୍ରିଡ୍ 20 ପ୍ରତିଶତ ଏସ. ପି. ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "green gram": {
         "advisory": [
            "କୀଟ ସଂକ୍ରମଣର ପ୍ରାଥମିକ ପର୍ଯ୍ୟାୟରେ ଏଫିଡ୍କୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ ନିମ୍ବ ଆଧାରିତ କୀଟନାଶକ କିମ୍ବା ରାସାୟନିକ ସ୍ପ୍ରେ ଯଥା ଥାୟାମେଥୋକ୍ସାମ 25 ପ୍ରତିଶତ ଡବ୍ଲୁ. ଜି. କିମ୍ବା ଏସିଟାମିପ୍ରିଡ୍ 20 ପ୍ରତିଶତ ଏସ. ପି. ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "chilli": {
         "advisory": [
            "ଲଙ୍କା ଫସଲରେ ଫଳ କ୍ଷୟ ଏବଂ ଡାଇ ବ୍ୟାକ୍ ରୋଗକୁ ପରିଚାଳନା କରିବା ପାଇଁ ପ୍ରୋପିନେବ୍ 70 ପ୍ରତିଶତ ଡବ୍ଲ୍ୟୁ. ପି. କିମ୍ବା ଡାଇଫେନୋକୋନାଜୋଲ୍ 25 ପ୍ରତିଶତ ଇ. ସି. କିମ୍ବା ଏଜୋକ୍ସିସ୍ଟ୍ରୋବିନ୍ 23 ପ୍ରତିଶତ ଏସ୍. ସି. ସ୍ପ୍ରେ କରନ୍ତୁ।",
            "ଲଙ୍କା ଫସଲରେ ଫଳ ସଡ଼ିବା ଏବଂ ଡାଇ ବ୍ୟାକ୍ ରୋଗ ହେବାର ସମ୍ଭାବନା ରହିଛି।"
         ]
      },
      "cole crops": {
         "advisory": [
            "ବର୍ତ୍ତମାନର ପାଣିପାଗ ପରିସ୍ଥିତି କାରଣରୁ କୋଲ୍ ଫସଲରେ ଅଲ୍ଟରନେରିଆ ଲିଫ୍ ସ୍ପଟ୍ ରୋଗ ହେବାର ସମ୍ଭାବନା ରହିଛି। ଏହି ରୋଗକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ ମାନକୋଜେବ୍ 75 ପ୍ରତିଶତ ଡବ୍ଲ୍ୟୁ. ପି. କିମ୍ବା କାର୍ବେଣ୍ଡାଜିମ୍ 12 ପ୍ରତିଶତ + ମାନକୋଜେବ୍ 63 ପ୍ରତିଶତ ଡବ୍ଲ୍ୟୁ. ପି. ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "onion": {
         "advisory": [
            "ପିଆଜରେ ବାଇଗଣୀ ଦାଗ ଏବଂ ଷ୍ଟେମଫିଲିଅମ୍ ପତ୍ର ବ୍ଲାଇଟ୍ ରୋଗକୁ ପରିଚାଳନା କରିବା ପାଇଁ ମାଙ୍କୋଜେବ୍ 75 ପ୍ରତିଶତ ଡବ୍ଲ୍ୟୁ. ପି. କିମ୍ବା ଡିଫେନୋକାନାଜୋଲ୍ 25 ପ୍ରତିଶତ ଇ. ସି. କିମ୍ବା ଟେବୁକୋନାଜୋଲ୍ 25.9% ଇ. ସି. ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "mango": {
         "advisory": [
            "ମେଘୁଆ ଏବଂ କୁହୁଡ଼ି ପାଗରେ ଆମ୍ବ ହପରଗୁଡ଼ିକର ଦ୍ରୁତ ଗତିରେ ବୃଦ୍ଧି ପରିଚାଳନା କରିବା ପାଇଁ ଇମିଡାକ୍ଲୋପ୍ରିଡ୍ 17.8% ଏସ୍. ଏଲ୍. କିମ୍ବା ଥାୟାମେଥୋକ୍ସାମ୍ 25 ପ୍ରତିଶତ ଡବ୍ଲୁ. ଜି. କିମ୍ବା ଏସିଟାମିପ୍ରିଡ୍ 20 ପ୍ରତିଶତ ଏସ୍. ପି. ସ୍ପ୍ରେ କରନ୍ତୁ।",
            "ମେଘୁଆ ଏବଂ କୁହୁଡ଼ି ପାଗରେ ଆମ୍ବ ହପର ଦ୍ରୁତ ଗତିରେ ବୃଦ୍ଧି ପାଇଥାଏ |"
         ]
      },
      "rose": {
         "advisory": [
            "ପ୍ରଚଳିତ ପାଣିପାଗ ସ୍ଥିତିରେ ଗୋଲାପ ଗଛରେ ପାଉଡର ଫଙ୍ଗୁର ସଂକ୍ରମଣ ଦେଖିବାକୁ ମିଳିପାରେ। ଏକ ପ୍ରତିଷେଧକ ପଦକ୍ଷେପ ଭାବେ କାର୍ବେନଡାଜିମ୍ 50 ପ୍ରତିଶତ ଡବ୍ଲ୍ୟୁ. ପି. ସ୍ପ୍ରେ କରନ୍ତୁ।",
            "ମେଘୁଆ ଏବଂ କୁହୁଡ଼ି ପାଗରେ ଆମ୍ବ ହପର ଦ୍ରୁତ ଗତିରେ ବୃଦ୍ଧି ପାଇଥାଏ |"
         ]
      },
      "animal husbandry": {
         "advisory": [
            "ଗୋରୁମାନଙ୍କର ପାଦ ଏବଂ ପାଟି ରୋଗର ମୁକାବିଲା ପାଇଁ, ବର୍ଷକୁ ଥରେ ଏଫ୍. ଏମ୍. ଡି. ଟୀକାକରଣ ପାଇଁ ଯତ୍ନ ନିଆଯିବା ଉଚିତ।"
         ]
      },
      "poultry": {
         "advisory": [
            "କୁକୁଡ଼ାଙ୍କ ନିଦ୍ରାଜନିତ ରୋଗ ଦେଖିବାକୁ ମିଳିଛି। ଲା ସୋଟା ସହିତ 7 ଦିନରେ ଏବଂ 13-15 ଦିନ ମଧ୍ୟରେ IBD ଟିକା ସହିତ ଛୁଆମାନଙ୍କୁ ଟୀକାକରଣ କରନ୍ତୁ।"
         ]
      }
   },
   "date": "07-02-2025"
}