{
   "weather_details": {
      "10-07-2024": {
         "rainfall": 10,
         "t_max": 34,
         "t_min": 25,
         "rh_max": 81,
         "rh_min": 47,
         "wind_speed": 9,
         "wind_direction": 198,
         "cloud_cover": 7
      },
      "11-07-2024": {
         "rainfall": 5,
         "t_max": 35,
         "t_min": 26,
         "rh_max": 82,
         "rh_min": 51,
         "wind_speed": 11,
         "wind_direction": 243,
         "cloud_cover": 6
      },
      "12-07-2024": {
         "rainfall": 4,
         "t_max": 36,
         "t_min": 26,
         "rh_max": 85,
         "rh_min": 55,
         "wind_speed": 11,
         "wind_direction": 248,
         "cloud_cover": 7
      },
      "13-07-2024": {
         "rainfall": 6,
         "t_max": 36,
         "t_min": 26,
         "rh_max": 82,
         "rh_min": 57,
         "wind_speed": 15,
         "wind_direction": 288,
         "cloud_cover": 7
      },
      "14-07-2024": {
         "rainfall": 10,
         "t_max": 36,
         "t_min": 25,
         "rh_max": 88,
         "rh_min": 57,
         "wind_speed": 15,
         "wind_direction": 257,
         "cloud_cover": 6
      }
   },
   "names_of_crops": [
      "ସିଧାସଳଖ ବିହନ ବୁଣାଯାଇଥିବା ଧାନ",
      "ରୋପଣ କରାଯାଇଥିବା ଧାନ",
      "କପା",
      "ଅରହର",
      "ସଂକର ମକା",
      "ବାଇଗଣ ଏବଂ ଲଙ୍କା",
      "ଓକ୍ରା",
      "ରସୁଣ",
      "କୁକୁଡ଼ା ମାଂସ",
      "ଛେଳି ଏବଂ ମେଣ୍ଢା"
   ],
   "general_advisory": "ଉପରୋକ୍ତ ପୂର୍ବାନୁମାନକୁ ବିଚାରକୁ ନେଲେ, ଆଗାମୀ ପାଞ୍ଚ ଦିନ ମଧ୍ଯ଼ରେ ପାଣିପାଗ ସ୍ଥିତି ବୁଣିବା ପାଇଁ ଅନୁକୂଳ ହେବାର ସମ୍ଭାବନା ରହିଛି, ଏବଂ କୃଷକମାନେ ସେମାନଙ୍କର ବୁଣିବା କାର୍ଯ୍ଯ଼ ସମ୍ପୂର୍ଣ୍ଣ କରିବା ପାଇଁ ଏହି ୱିଣ୍ଡୋର ଲାଭ ଉଠାଇବା ଉଚିତ। ପ୍ରଚଳିତ ପାଣିପାଗ ସ୍ଥିତି (ମେଘୁଆ ଆକାଶ ସହିତ ଉଚ୍ଚ ଆପେକ୍ଷିକ ଆର୍ଦ୍ରତା) ଶୋଷକ କୀଟପତଙ୍ଗ ଘଟଣା ସପକ୍ଷରେ | ସ୍ଥାଯ଼ୀ ଫସଲରେ କୀଟପତଙ୍ଗ ଉପରେ ନିଯ଼ମିତ ନଜର ରଖିବା ଉଚିତ। ଆବଶ୍ଯ଼କ ଉଦ୍ଭିଦ ସୁରକ୍ଷା ରାସାଯ଼ନିକ ପଦାର୍ଥକୁ ଷ୍ଟିକର ସହିତ ମିଶାଇ ପ୍ରଯ଼ୋଗ କରାଯାଇପାରେ। ପୂର୍ବାନୁମାନକୁ ଦୃଷ୍ଟିରେ ରଖି, କୃଷକମାନେ କୃଷି ସମ୍ବନ୍ଧୀଯ଼ ଅଭ୍ଯ଼ାସ ଏବଂ ସ୍ଥାଯ଼ୀ ଫସଲରେ ସାର ପ୍ରଯ଼ୋଗକୁ ପୁନଃ ଆରମ୍ଭ କରିପାରିବେ। ଉପଯୁକ୍ତ ଜଳ ନିଷ୍କାସନ ସହିତ ଉଠାଯାଇଥିବା ଶଯ୍ଯ଼ାରେ ଲଙ୍କା, ବାଇଗଣ ଏବଂ ଶୀଘ୍ର ଫୁଲକୋବି ଚାରା ରୋପଣ କରିବାର ଏହା ହେଉଛି ଉପଯୁକ୍ତ ସମଯ଼ | ମେଘୁଆ ପାଗରେ ପନିପରିବା ଚାରା ରକ୍ଷା କରିବା ପାଇଁ କାର୍ବେନଡାଜିମ୍ + ମାନକୋଜେବ୍ @2ଜି/ଏଲ ଏବଂ ସ୍ଟ୍ରେପ୍ଟୋସାଇକ୍ଲିନ୍ @1.5g/15lit ପାଣିର ପ୍ରତିଷେଧକ ସ୍ପ୍ରେ ପ୍ରଯ଼ୋଗ କରାଯିବା ଉଚିତ। ନର୍ସରୀ ଶଯ୍ଯ଼ା ଉପରେ ପ୍ଲାଷ୍ଟିକ୍ କିମ୍ବା ପଲିଥିନ୍ ଚାଦରରେ ଢାଙ୍କି ନର୍ସରୀରେ ଥିବା ପନିପରିବା ଚାରା ଗୁଡ଼ିକୁ ବର୍ଷାରୁ ରକ୍ଷା କରନ୍ତୁ | ଜମି ପ୍ରସ୍ତୁତ କରିବା ସମଯ଼ରେ ମାଟିରେ ଜୈବିକ ସାର ମିଶାଇବାକୁ କୃଷକମାନଙ୍କୁ ପରାମର୍ଶ ଦିଆଯାଇଛି କାରଣ ଏହା ମାଟିର ଉର୍ବରତା ଏବଂ ଜଳ ଧାରଣ କ୍ଷମତାକୁ ବୃଦ୍ଧି କରିଥାଏ।",
   "crops_data": {
      "direct seeded paddy": {
         "advisory": [
            "ଅନ୍ତିମ ଜମି ପ୍ରସ୍ତୁତି ସମଯ଼ରେ ଭଲ ଭାବେ ଅପଘଟିତ ଏଫ୍. ୱାଇ. ଏମ୍. @8 କ୍ଯ଼ୁ/ଏକରକୁ ସାମିଲ କରନ୍ତୁ।",
            "ବୀଜ ଉପଚାରଃ ବୀଜ ଏବଂ ମୃତ୍ତିକା ଜନିତ ରୋଗକୁ ନିଯ଼ନ୍ତ୍ରଣ କରିବା ପାଇଁ ଘଣ୍ଟାପ୍ରତି 10 ଗ୍ରାମ/କିଲୋଗ୍ରାମ ମଞ୍ଜି କିମ୍ବା କାର୍ବେନଡାଜିମ୍ 50 ପ୍ରତିଶତ ଡବ୍ଲ୍ଯ଼ୁ. ପି. @2 ଗ୍ରାମ/କିଲୋଗ୍ରାମ ମଞ୍ଜି ବ୍ଯ଼ବହାର କରି ଟ୍ରାଇକୋଡର୍ମା ପାଉଡର ପ୍ରସ୍ତୁତ କରି ମଞ୍ଜି ଚିକିତ୍ସା କରାଯିବା ଉଚିତ।",
            "ସାରର ସୁପାରିସ କରାଯାଇଥିବା ମାତ୍ରା-ଉଚ୍ଚଭୂମିରେ 26 କିଲୋଗ୍ରାମ ଡିଏପି + 10 କିଲୋଗ୍ରାମ ଏମଓପି + 10 କିଲୋଗ୍ରାମ ଜେଡଏନଏସଓ4 ଏବଂ ମଧ୍ଯ଼ମ ଏବଂ ନିମ୍ନ ଭୂମିରେ ଏକର ପିଛା 35 କିଲୋଗ୍ରାମ ଡିଏପି + 13 କିଲୋଗ୍ରାମ ଏମଓପି + 10 କିଲୋଗ୍ରାମ ଜେଡଏନଏସଓ4 ପ୍ରଯ଼ୋଗ କରନ୍ତୁ।",
            "ଆଗାଛା ପରିଚାଳନାଃ ବୁଣିବା ପରେ 2ରୁ 3 ଦିନ ମଧ୍ଯ଼ରେ 200 ଲିଟର ପାଣି ସହିତ ମିଶାଇ ପ୍ରି-ଇମର୍ଜେନ୍ସ୍ ହର୍ବିସାଇଡ୍ ପ୍ରିଟିଲାକ୍ଲୋର 30.7% ଇସି @800 ମିଲି/ଏକର କିମ୍ବା ଅକ୍ସିଫ୍ଲୋରଫେନ୍ 23.5% ଇସି @250 ମିଲି/ଏକର ଲଗାନ୍ତୁ। ଯଦି ପ୍ରାକ୍-ଆବିର୍ଭାବ ହର୍ବିସାଇଡ୍ ପ୍ରଯ଼ୋଗ କରାଯାଇନାହିଁ, ତେବେ ବିସ୍ଫିରିବାକ୍ ସୋଡ଼ିଅମ୍ 10% ଏସ୍. ସି. @120 ମିଲି/ଏକର ପ୍ରଯ଼ୋଗ କରନ୍ତୁ, 200 ଲିଟର ପାଣି ସହିତ ମିଶାନ୍ତୁ <ଆଇ. ଡି. 1> ଆବିର୍ଭାବ ପରବର୍ତ୍ତୀ ହର୍ବିସାଇଡ୍ ଭାବରେ ନିଡ଼ୁର ଆବିର୍ଭାବର କିଛି ଦିନ ପରେ।"
         ]
      },
      "transplanted paddy": {
         "advisory": [
            "ବିନା ବିଳମ୍ବରେ ଉଠାଯାଇଥିବା ଶଯ୍ଯ଼ା ସହିତ ନର୍ସରୀ ପ୍ରସ୍ତୁତି ସମ୍ପୂର୍ଣ୍ଣ କରନ୍ତୁ | ଏକ ଏକର ଅଞ୍ଚଳରେ ବୃକ୍ଷରୋପଣ ପାଇଁ ପ୍ରାଯ଼ 320 ବର୍ଗ ମିଟର (8 ସେଣ୍ଟ୍) ନର୍ସରୀ ଶଯ୍ଯ଼ା ଆବଶ୍ଯ଼କ। 10 ସେ. ମି. ଉଚ୍ଚ, <ଆଇ. ଡି. 1> ମି. ଚଉଡ଼ା ଏବଂ ସୁବିଧାଜନକ ଦୈର୍ଘ୍ଯ଼ର ଆର୍ଦ୍ର ନର୍ସରୀ ଉଠାଯାଇଥିବା ଶଯ୍ଯ଼ା ପ୍ରସ୍ତୁତ କରନ୍ତୁ। ଦୁଇଟି ଶଯ୍ଯ଼ା ମଧ୍ଯ଼ରେ <ଆଇ. ଡି. 1> ସେ. ମି. ଓସାର ବିଶିଷ୍ଟ ସୁନିର୍ଦ୍ଦିଷ୍ଟ ଜଳସେଚନ/ଜଳ ନିଷ୍କାସନ ଚ୍ଯ଼ାନେଲ ରଖିବା ଆବଶ୍ଯ଼କ। ନର୍ସରୀ ବୁଣିବା ପାଇଁ ଏଚ. ୱାଇ. ଭି. ର ଏକର ପିଛା 1 କି. ଗ୍ରା. ମଞ୍ଜି ଏବଂ ଏକର ପିଛା 5 ରୁ 6 କି. ଗ୍ରା. ହାଇବ୍ରିଡ୍ ବ୍ଯ଼ବହାର କରନ୍ତୁ।",
            "ବୀଜ ଉପଚାରଃ ବୀଜ ଏବଂ ମୃତ୍ତିକା ଜନିତ ରୋଗକୁ ନିଯ଼ନ୍ତ୍ରଣ କରିବା ପାଇଁ ନର୍ସରୀରେ ବୁଣିବା ପୂର୍ବରୁ ଘଣ୍ଟାପ୍ରତି 10 ଗ୍ରାମ୍/କିଲୋଗ୍ରାମ ମଞ୍ଜି କିମ୍ବା କାର୍ବେନଡାଜିମ୍ 50 ପ୍ରତିଶତ ଡବ୍ଲ୍ଯ଼ୁ. ପି. @2 ଗ୍ରାମ୍/କିଲୋଗ୍ରାମ କିମ୍ବା କ୍ଯ଼ାପଟେନ 50 ପ୍ରତିଶତ ଡବ୍ଲ୍ଯ଼ୁ. ପି. କିମ୍ବା ଥିରାମ 75 ପ୍ରତିଶତ ଡବ୍ଲ୍ଯ଼ୁ. ପି. @3 ଗ୍ରାମ୍/କିଲୋଗ୍ରାମ ମଞ୍ଜି ବ୍ଯ଼ବହାର କରିବା ଉଚିତ। ଅଧିକ ସୂଚନା ପାଇଁ, ଆଇଏମଡି, ଭୁବନେଶ୍ୱର, Tel.#0674-2596116 ସହିତ ଯୋଗାଯୋଗ କରନ୍ତୁ।"
         ]
      },
      "cotton": {
         "advisory": [
            "ଚାଷ କରିବା ପୂର୍ବରୁ ମାଟି ଉପରେ ଏଫ. ୱାଇ. ଏମ୍. କିମ୍ବା କମ୍ପୋଷ୍ଟ @2 ଟନ୍/ଏକର କିମ୍ବା ଭର୍ମିକମ୍ପୋଷ୍ଟ <ଆଇ. ଡି. 1> ଟନ୍/ଏକର ସମାନ ଭାବେ ଲଗାନ୍ତୁ।",
            "ପ୍ରତି ପିଟ୍ରେ 3ରୁ 5 ସେ. ମି. ଗଭୀରତାରେ ଗୋଟିଏ ଲେଖାଏଁ ବୀଜକୁ ଧାଡ଼ିରେ କାଟି ଦିଅନ୍ତୁ ଏବଂ ମଞ୍ଜିକୁ ମାଟିରେ ଢାଙ୍କି ଦିଅନ୍ତୁ। ସାଧାରଣ ରୋପଣରେ 90 ସେ. ମି. x 60 ସେ. ମି. ଏବଂ ଉଚ୍ଚ ଘନତ୍ୱ ରୋପଣ ପ୍ରଣାଳୀ ପାଇଁ 60 ସେ. ମି. x 10 ସେ. ମି. ବ୍ଯ଼ବଧାନ ପ୍ରଦାନ କରନ୍ତୁ।",
            "ବୀଜର ଚିକିତ୍ସାଃ ଶୋଷକ କୀଟପତଙ୍ଗରୁ ସୁରକ୍ଷା ପାଇଁ ବୀଜର ଚିକିତ୍ସା ଇମିଡାକ୍ଲୋପ୍ରିଡ୍ 70 ଡବ୍ଲୁଜି @7 ଗ୍ରାମ୍/କେଜି ମଞ୍ଜି ଦ୍ୱାରା କରାଯିବା ଉଚିତ।",
            "ସାଧାରଣ ରୋପଣ ପାଇଁ ବୀଜ ହାର-ଏକର ପିଛା 1 କି. ଗ୍ରା. ଏବଂ ଉଚ୍ଚ ଘନତ୍ୱ ରୋପଣ ବ୍ଯ଼ବସ୍ଥା ପାଇଁ ଏକର ପିଛା 5 କି. ଗ୍ରା.।",
            "ସାରର ସୁପାରିସ କରାଯାଇଥିବା ମାତ୍ରା-ଡି. ଏ. ପି. @120 କି. ଗ୍ରା./ଏସି. + ଏମଓ. ପି. @24 କି. ଗ୍ରା./ଏସି. ହାଇବ୍ରିଡ୍ କିସମର ଏବଂ ଡି. ଏ. ପି. @90 କି. ଗ୍ରା./ଏସି. + ଏମଓ. ପି. @18 କି. ଗ୍ରା./ଏସି. ଅଧିକ ଉତ୍ପାଦନକ୍ଷମ କିସମର କ୍ଷେତ୍ରରେ ବୁଣିବା ସମଯ଼ରେ ପ୍ରଯ଼ୋଗ କରନ୍ତୁ, କିନ୍ତୁ ମୃତ୍ତିକା ପରୀକ୍ଷା ରିପୋର୍ଟ ଅନୁଯାଯ଼ୀ ଆବଶ୍ଯ଼କ ପରିମାଣର ସାର ପ୍ରଯ଼ୋଗ କରନ୍ତୁ। ଜିଙ୍କ୍ ଏବଂ ବୋରନ୍ ଅଭାବ ଥିବା ମୃତ୍ତିକା ପ୍ରଯ଼ୋଗରେ ଜିଙ୍କ୍ ସୁଲ୍ପ୍ଲେଟ୍ @10kg ଏସି ଏବଂ ବୋରାକ୍ସ @2kg ଏସି ବୁଣିବା ସମଯ଼ରେ ସୁପାରିଶ କରାଯାଏ |",
            "ଆଗାଛା ପରିଚାଳନାଃ ବୁଣିବା ପରେ 3 ଦିନ ମଧ୍ଯ଼ରେ 200 ଲିଟର ପାଣି ସହିତ ମିଶାଇ ଏକର ପିଛା 1 ଲିଟର ପିଛା 30 ପ୍ରତିଶତ ଇ. ସି. ପେଣ୍ଡିମେଥାଲିନ୍ ଲଗାନ୍ତୁ ଏବଂ ମାଟିରେ ପର୍ଯ୍ଯ଼ାପ୍ତ ପରିମାଣର ଆର୍ଦ୍ରତା ରହିବା ଉଚିତ। କ୍ଷେତକୁ 60 ଡିଏଏସ୍ ପର୍ଯ୍ଯ଼ନ୍ତ ଆଗାଛା ମୁକ୍ତ ରଖିବା ଉଚିତ।"
         ]
      },
      "arhar": {
         "advisory": [
            "ଚୂଡ଼ାନ୍ତ ଜମି ପ୍ରସ୍ତୁତି ସମଯ଼ରେ ଏକର ପିଛା 2-4 ଟନ୍ ଏଫ୍. ୱାଇ. ଏମ୍. ପ୍ରଯ଼ୋଗ କରନ୍ତୁ।",
            "ଉଇପୋକା ସ୍ଥାନୀଯ଼ ଅଞ୍ଚଳରେ କ୍ଲୋରୋପାଇରିଫୋସ୍ ଧୂଳି ପ୍ରଯ଼ୋଗ ଭୂମି ପ୍ରସ୍ତୁତି ସମଯ଼ରେ 10 କି. ଗ୍ରା./ଏ. ସି. ରେ 1%",
            "ବୀଜ ଡ୍ରିଲ୍ କିମ୍ବା ଦେଶୀ ହଳ ଦ୍ୱାରା ଧାଡ଼ି ବୁଣିବା 60 ସେ. ମି. x 15 ସେ. ମି. ବ୍ଯ଼ବଧାନ ସହିତ ସୁପାରିଶ କରାଯାଏ |",
            "ଏହି ବୀଜକୁ ଥିରମ୍ (2 ଗ୍ରାମ୍) + କାର୍ବେନଡାଜିମ୍ (1 ଗ୍ରାମ୍) କିମ୍ବା ଥିରମ୍ @3 ଗ୍ରାମ୍ କିମ୍ବା ଟ୍ରାଇକୋଡର୍ମା ଭିର୍ଡି 5-7 ଗ୍ରାମ୍/କେଜି ମଞ୍ଜି ସହିତ ଉପଚାର କରନ୍ତୁ। ସଂସ୍କୃତିଃ ରାଇଜୋବିଯ଼ମ୍ ଏବଂ ପି. ଏସ୍. ବି. ସଂସ୍କୃତି <ଆଇ. ଡି. 1> ଗ୍ରାମ୍/କେଜି.",
            "ବିହନ ହାର-ଏକର ପିଛା 8 କିଲୋଗ୍ରାମ",
            "ସାରର ସୁପାରିସ କରାଯାଇଥିବା ମାତ୍ରା-ବୁଣିବା ସମଯ଼ରେ ଡିଏପି 35 କି. ଗ୍ରା./ଏସି + ଏମଓପି 13 କି. ଗ୍ରା./ଏସି + ଯ଼ୁରିଆ 5 କି. ଗ୍ରା./ଏସି + 60 କି. ଗ୍ରା. ଜିପ୍ସମ୍/ଫସଫୋ-ଜିପ୍ସମ୍ ପ୍ରଯ଼ୋଗ କରନ୍ତୁ, କିନ୍ତୁ ମୃତ୍ତିକା ପରୀକ୍ଷା ରିପୋର୍ଟ ଅନୁଯାଯ଼ୀ ଆବଶ୍ଯ଼କ ପରିମାଣର ସାର ପ୍ରଯ଼ୋଗ କରନ୍ତୁ।",
            "ଆଗାଛା ପରିଚାଳନାଃ ବୁଣିବା ପରେ 2 ଦିନ ମଧ୍ଯ଼ରେ 200 ଲିଟର ପାଣି ସହିତ ମିଶାଇ ଏକର ପିଛା 1 ଲିଟର ପିଛା 30 ପ୍ରତିଶତ ଇ. ସି. ପେଣ୍ଡିମେଥାଲିନ୍ ଲଗାନ୍ତୁ ଏବଂ ମାଟିରେ ପର୍ଯ୍ଯ଼ାପ୍ତ ପରିମାଣର ଆର୍ଦ୍ରତା ରହିବା ଉଚିତ।"
         ]
      },
      "hybrid maize": {
         "advisory": [
            "ଚୂଡ଼ାନ୍ତ ଜମି ପ୍ରସ୍ତୁତି ସମଯ଼ରେ ଏକର ପିଛା 2-4 ଟନ୍ ଏଫ୍. ୱାଇ. ଏମ୍. ପ୍ରଯ଼ୋଗ କରନ୍ତୁ।",
            "ଉଇପୋକା ସ୍ଥାନୀଯ଼ ଅଞ୍ଚଳରେ କ୍ଲୋରୋପାଇରିଫୋସ୍ ଧୂଳି ପ୍ରଯ଼ୋଗ ଭୂମି ପ୍ରସ୍ତୁତି ସମଯ଼ରେ 10 କି. ଗ୍ରା./ଏ. ସି. ରେ 1%",
            "ଜଳସେଚନ ସ୍ଥିତି ପାଇଁ 60 ସେ. ମି. x 25 ସେ. ମି. ଏବଂ ବର୍ଷା ଆଧାରିତ ସ୍ଥିତି ପାଇଁ 75 ସେ. ମି. x 25 ସେ. ମି. ବ୍ଯ଼ବଧାନ ସହିତ ବୀଜ ଡ୍ରିଲ୍ କିମ୍ବା ଦେଶୀ ହଳ ଦ୍ୱାରା ଧାଡ଼ି ବୁଣିବା ସୁପାରିଶ କରାଯାଏ |",
            "ମୃତ୍ତିକା ବାହିତ ରୋଗ ଏବଂ କୀଟପତଙ୍ଗ ଆକ୍ରମଣରୁ ଫସଲକୁ ରୋକିବା ପାଇଁ ଉପଯୁକ୍ତ କବକନାଶକ ଏବଂ କୀଟନାଶକ ସହିତ ବୀଜ ଚିକିତ୍ସା ଆବଶ୍ଯ଼କ | 1 କି. ଗ୍ରା. ମଞ୍ଜି 2 ଗ୍ରାମ୍ (ବାଭିଷ୍ଟିନ୍ + କ୍ଯ଼ାପଟେନ୍ 1:1 ଅନୁପାତରେ) ଏବଂ 4 ଗ୍ରାମ୍ ଇମିଡାକ୍ଲୋପ୍ରିଡ୍ ସହିତ ଉପଚାର କରନ୍ତୁ।",
            "ବିହନ ହାର-ଏକର ପିଛା 8 କିଲୋଗ୍ରାମ",
            "ସାରର ସୁପାରିସ କରାଯାଇଥିବା ମାତ୍ରା-ବୁଣିବା ସମଯ଼ରେ ଡିଏପି 65 କେଜି/ଏସି + ଏମଓପି 20 କେଜି/ଏସି ପ୍ରଯ଼ୋଗ କରନ୍ତୁ, କିନ୍ତୁ ମୃତ୍ତିକା ପରୀକ୍ଷା ରିପୋର୍ଟ ଅନୁଯାଯ଼ୀ ଆବଶ୍ଯ଼କ ପରିମାଣର ସାର ପ୍ରଯ଼ୋଗ କରନ୍ତୁ। ଯଦି ମାଟିରେ Zn କିମ୍ବା BO ର ଅଭାବ ଥାଏ, ତେବେ ଏକର ପିଛା 10 କିଲୋଗ୍ରାମ ଜିଙ୍କ୍ ସଲଫେଟ୍ @10kg ଏକର କିମ୍ବା ଏକର ପିଛା 2 କିଲୋଗ୍ରାମର 20 ପ୍ରତିଶତ ବୋରନକୁ ବେସାଲ୍ ଭାବରେ ଲଗାନ୍ତୁ।",
            "ନିଡ୍ ମ୍ଯ଼ାନେଜମେଣ୍ଟଃ ବୁଣିବା ପରେ 3 ଦିନ ମଧ୍ଯ଼ରେ 200 ଲିଟର ପାଣି ସହିତ ମିଶାଇ ଏକର ପିଛା 50 ପ୍ରତିଶତ ଡବ୍ଲ୍ଯ଼ୁ. ପି. @<ଆଇ. ଡି. 1> ଗ୍ରାମ୍ ଆଟ୍ରାଜିନ୍ ଲଗାନ୍ତୁ ଏବଂ ମାଟିରେ ପର୍ଯ୍ଯ଼ାପ୍ତ ପରିମାଣର ଆର୍ଦ୍ରତା ରହିବା ଉଚିତ।"
         ]
      },
      "brinjal & chilli": {
         "advisory": [
            "ସମଯ଼ୋଚିତ ରୋପଣ ପାଇଁ ବାଇଗଣ, ଲଙ୍କା ଇତ୍ଯ଼ାଦି ଖରିଫ ପନିପରିବା ପାଇଁ ଉଠାଯାଇଥିବା ଶଯ୍ଯ଼ା ନର୍ସରୀ ପ୍ରସ୍ତୁତ କରନ୍ତୁ |",
            "ଶୁଖିଲା ଏବଂ ଭିଜିବା ଭଳି ରୋଗକୁ ରୋକିବା ପାଇଁ ବୁଣିବା ପୂର୍ବରୁ ଟ୍ରାଇକୋଡର୍ମା ଭାଇରିଡ୍ 1 ପ୍ରତିଶତ @10 ଗ୍ରାମ୍/କେଜି କିମ୍ବା କ୍ଯ଼ାପଟାନ 75 ପ୍ରତିଶତ ଡବ୍ଲୁ. ଏସ୍. @2-3 ଗ୍ରାମ୍/କେଜି ମଞ୍ଜି ବ୍ଯ଼ବହାର କରନ୍ତୁ।",
            "ବିହନ ହାର-200-250 ଗ୍ରାମ୍/ଏକର।",
            "ମୁଖ୍ଯ଼ କ୍ଷେତରେ 30-35 ଦିନର ପୁରୁଣା ଚାରା ରୋପଣ କରନ୍ତୁ।"
         ]
      },
      "okra": {
         "advisory": [
            "ଅଧିକ ଉତ୍ପାଦନ ପାଇବା ପାଇଁ ଜୁଲାଇ ଶେଷ ସୁଦ୍ଧା ବୁଣିବା ଶେଷ ହେବା ଉଚିତ।",
            "ଜମି ପ୍ରସ୍ତୁତ କରିବା ସମଯ଼ରେ ଭଲ ଭାବେ ଅପଘଟିତ ଏଫ୍. ୱାଇ. ଏମ୍. @2t/ଏକର ଲଗାନ୍ତୁ।",
            "ବିହନ ହାର-ଏକର ପିଛା 4 କିଲୋଗ୍ରାମ। ଶୁଖିଲା ରୋଗରୁ ରକ୍ଷା ପାଇବା ପାଇଁ ବୁଣିବା ପୂର୍ବରୁ ବୀଜକୁ ବାଭିଷ୍ଟିନ୍ @2 ଗ୍ରାମ୍/କେଜି ସହିତ ଚିକିତ୍ସା କରାଯିବା ଉଚିତ୍।"
         ]
      },
      "onion": {
         "advisory": [
            "ଭୀମ ରାଜ, ଭୀମ ଡାର୍କ ରେଡ୍, ଭୀମ ସୁପର ଇତ୍ଯ଼ାଦି ଉପଯୁକ୍ତ କିସମର ଚଯ଼ନ କରାଯିବା ଉଚିତ।",
            "ଖରିଫ ପନିପରିବା ପାଇଁ ଏକ ଓଭରହେଡ୍-ସୁରକ୍ଷିତ ଢାଞ୍ଚା ଅଧୀନରେ ଉଠାଯାଇଥିବା ନର୍ସରୀ ଶଯ୍ଯ଼ା ପ୍ରସ୍ତୁତ କରାଯିବା ଉଚିତ୍ |",
            "ଭଲ ଚାରା ପାଇବା ପାଇଁ ବୀଜ ଉପଚାର, ବୁଣିବା, ଏବଂ ଧାନର ନଡ଼ିଆ ଘାସ ଲଗାଇବା ପରେ କ୍ଲୋରୋପାଇରିଫସ୍ 1 ମିଲି/ଲିଟର ପାଣି ସିଞ୍ଚନ କରିବାକୁ ପରାମର୍ଶ ଦିଆଯାଇଛି।"
         ]
      },
      "poultry": {
         "advisory": [
            "ବର୍ଷା ପାଣି ଭିତରକୁ ପ୍ରବେଶ କରିବାରୁ ରୋକିବା ପାଇଁ କୁକୁଡ଼ା ଘର ମରାମତି କରନ୍ତୁ | ଆବର୍ଜନା ସାମଗ୍ରୀକୁ ଓଦା ହେବାକୁ ଦିଅନ୍ତୁ ନାହିଁ।",
            "ଖାଦ୍ଯ଼ ସାମଗ୍ରୀକୁ ଓଦା ହେବାରୁ ରୋକନ୍ତୁ ଯାହା ଖାଦ୍ଯ଼ରେ ଫଙ୍ଗସ୍ ବୃଦ୍ଧି କରିପାରେ |"
         ]
      },
      "goat & sheep": {
         "advisory": [
            "ଆଭ୍ଯ଼ନ୍ତରୀଣ ପରଜୀବୀଗୁଡ଼ିକର ଭାର ହ୍ରାସ କରିବା ପାଇଁ ସେଗୁଡ଼ିକୁ ପତଳା କରନ୍ତୁ।",
            "ବାହ୍ଯ଼ ପରଜୀବୀ ବିରୁଦ୍ଧରେ ମେଣ୍ଢା କ୍ଷେତ୍ରରେ ଡିପିଂ କରାଯିବା ଉଚିତ୍ |",
            "ବର୍ଷା ସମଯ଼ରେ ପଶୁମାନଙ୍କୁ ଘର ଭିତରେ ରଖନ୍ତୁ ଏବଂ ସ୍ୱଚ୍ଛ ତଥା ସ୍ୱାସ୍ଥ୍ଯ଼କର ଜଳ ଯୋଗାଇ ଦିଅନ୍ତୁ।"
         ]
      }
   },
   "date": "09-07-2024"
}