{
   "weather_details": {
      "10-07-2024": {
         "rainfall": 3,
         "t_max": 35,
         "t_min": 25,
         "rh_max": 82,
         "rh_min": 50,
         "wind_speed": 8,
         "wind_direction": 193,
         "cloud_cover": 6
      },
      "11-07-2024": {
         "rainfall": 4,
         "t_max": 36,
         "t_min": 26,
         "rh_max": 82,
         "rh_min": 54,
         "wind_speed": 10,
         "wind_direction": 204,
         "cloud_cover": 7
      },
      "12-07-2024": {
         "rainfall": 4,
         "t_max": 36,
         "t_min": 26,
         "rh_max": 85,
         "rh_min": 54,
         "wind_speed": 10,
         "wind_direction": 212,
         "cloud_cover": 7
      },
      "13-07-2024": {
         "rainfall": 3,
         "t_max": 35,
         "t_min": 26,
         "rh_max": 86,
         "rh_min": 58,
         "wind_speed": 11,
         "wind_direction": 257,
         "cloud_cover": 6
      },
      "14-07-2024": {
         "rainfall": 4,
         "t_max": 34,
         "t_min": 25,
         "rh_max": 88,
         "rh_min": 57,
         "wind_speed": 12,
         "wind_direction": 257,
         "cloud_cover": 7
      }
   },
   "names_of_crops": [
      "ସିଧାସଳଖ ବିହନ ବୁଣାଯାଇଥିବା ଧାନ",
      "ରୋପଣ କରାଯାଇଥିବା ଧାନ",
      "କପା",
      "ଅରହର",
      "ସଂକର ମକା",
      "ବ୍ରିନିଜଲ୍ ଏବଂ ଲଙ୍କା",
      "ଓକ୍ରା",
      "ରସୁଣ",
      "କୁକୁଡ଼ା ମାଂସ",
      "ଛେଳି ଏବଂ ମେଣ୍ଢା"
   ],
   "general_advisory": "ଉପରୋକ୍ତ ପୂର୍ବାନୁମାନକୁ ବିଚାରକୁ ନେଲେ, ଆଗାମୀ ପାଞ୍ଚ ଦିନ ମଧ୍ଯ଼ରେ ପାଣିପାଗ ସ୍ଥିତି ବୁଣିବା ପାଇଁ ଅନୁକୂଳ ହେବାର ସମ୍ଭାବନା ରହିଛି। ପ୍ରଚଳିତ ପାଣିପାଗ ସ୍ଥିତି ଶୋଷକ କୀଟପତଙ୍ଗ ଘଟଣା ସପକ୍ଷରେ ଥାଏ | ଠିଆ ହୋଇଥିବା ଫସଲରେ କୀଟପତଙ୍ଗ ଉପରେ ନଜର ରଖିବା, ଆବଶ୍ଯ଼କ ଉଦ୍ଭିଦ ସୁରକ୍ଷା ରାସାଯ଼ନିକ ପ୍ରଯ଼ୋଗ କରିବା, କୃଷି ସମ୍ବନ୍ଧୀଯ଼ ଅଭ୍ଯ଼ାସ ଆରମ୍ଭ କରିବା ଏବଂ ଠିଆ ହୋଇଥିବା ଫସଲରେ ସାର ପ୍ରଯ଼ୋଗ କରିବା ପାଇଁ କୃଷକମାନଙ୍କୁ ପରାମର୍ଶ ଦିଆଯାଇଛି। ଉପଯୁକ୍ତ ଜଳ ନିଷ୍କାସନ ସହିତ ଉଠାଯାଇଥିବା ଶଯ୍ଯ଼ାରେ ଲଙ୍କା, ବାଇଗଣ ଏବଂ ଶୀଘ୍ର ଫୁଲକୋବି ଚାରା ରୋପଣ କରିବାର ଉପଯୁକ୍ତ ସମଯ଼। ଫସଲ ସୁରକ୍ଷା ଏବଂ ମୃତ୍ତିକା ବୃଦ୍ଧି ପାଇଁ ବିଭିନ୍ନ ପ୍ରତିଷେଧକ ପଦକ୍ଷେପ ନେବାକୁ ପରାମର୍ଶ ଦିଆଯାଇଛି।",
   "crops_data": {
      "direct seeded paddy": {
         "advisory": [
            "ଅନ୍ତିମ ଜମି ପ୍ରସ୍ତୁତି ସମଯ଼ରେ ଭଲ ଭାବେ ଅପଘଟିତ ଏଫ୍. ୱାଇ. ଏମ୍. @8 କ୍ଯ଼ୁ/ଏକରକୁ ସାମିଲ କରନ୍ତୁ।",
            "ବୀଜ ଉପଚାରଃ ବୀଜ ଏବଂ ମୃତ୍ତିକା ଜନିତ ରୋଗକୁ ନିଯ଼ନ୍ତ୍ରଣ କରିବା ପାଇଁ ଘଣ୍ଟାପ୍ରତି 10 ଗ୍ରାମ/କିଲୋଗ୍ରାମ ମଞ୍ଜି କିମ୍ବା କାର୍ବେନଡାଜିମ୍ 50 ପ୍ରତିଶତ ଡବ୍ଲ୍ଯ଼ୁ. ପି. @2 ଗ୍ରାମ/କିଲୋଗ୍ରାମ ମଞ୍ଜି ବ୍ଯ଼ବହାର କରି ଟ୍ରାଇକୋଡର୍ମା ପାଉଡର ପ୍ରସ୍ତୁତ କରି ମଞ୍ଜି ଚିକିତ୍ସା କରାଯିବା ଉଚିତ।",
            "ସାରର ସୁପାରିସ କରାଯାଇଥିବା ମାତ୍ରା-ଉଚ୍ଚଭୂମିରେ 26 କିଲୋଗ୍ରାମ ଡିଏପି + 10 କିଲୋଗ୍ରାମ ଏମଓପି + 10 କିଲୋଗ୍ରାମ ଜେଡଏନଏସଓ4 ଏବଂ ମଧ୍ଯ଼ମ ଏବଂ ନିମ୍ନ ଭୂମିରେ ଏକର ପିଛା 35 କିଲୋଗ୍ରାମ ଡିଏପି + 13 କିଲୋଗ୍ରାମ ଏମଓପି + 10 କିଲୋଗ୍ରାମ ଜେଡଏନଏସଓ4 ପ୍ରଯ଼ୋଗ କରନ୍ତୁ।",
            "ଆଗାଛା ପରିଚାଳନାଃ ବୁଣିବା ପରେ 2ରୁ 3 ଦିନ ମଧ୍ଯ଼ରେ 200 ଲିଟର ପାଣି ସହିତ ମିଶାଇ ପ୍ରାକ୍-ଉଦ୍ଭବ ହର୍ବିସାଇଡ୍ ପ୍ରିଟିଲାକ୍ଲୋର 30.7% ଇସି @800 ମିଲି/ଏକର କିମ୍ବା ଅକ୍ସିଫ୍ଲୋରଫେନ୍ 23.5% ଇସି @250 ମିଲି/ଏକର ଲଗାନ୍ତୁ।"
         ]
      },
      "transplanted paddy": {
         "advisory": [
            "ବିନା ବିଳମ୍ବରେ ଉଠାଯାଇଥିବା ଶଯ୍ଯ଼ା ସହିତ ନର୍ସରୀ ପ୍ରସ୍ତୁତି ସମ୍ପୂର୍ଣ୍ଣ କରନ୍ତୁ |",
            "ବୀଜ ଉପଚାରଃ ବୀଜ ଏବଂ ମୃତ୍ତିକା ଜନିତ ରୋଗକୁ ନିଯ଼ନ୍ତ୍ରଣ କରିବା ପାଇଁ ନର୍ସରୀରେ ବୁଣିବା ପୂର୍ବରୁ ଘଣ୍ଟାପ୍ରତି 10 ଗ୍ରାମ ପ୍ରତି କିଲୋଗ୍ରାମ ମଞ୍ଜି କିମ୍ବା କାର୍ବେନଡାଜିମ୍ 50 ପ୍ରତିଶତ ପ୍ରତି କିଲୋଗ୍ରାମ ମଞ୍ଜି କିମ୍ବା କ୍ଯ଼ାପଟେନ 50 ପ୍ରତିଶତ ପ୍ରତି କିଲୋଗ୍ରାମ ମଞ୍ଜି କିମ୍ବା ଥିରାମ 75 ପ୍ରତିଶତ ପ୍ରତି କିଲୋଗ୍ରାମ ମଞ୍ଜି ବ୍ଯ଼ବହାର କରି ମଞ୍ଜି ଚିକିତ୍ସା କରାଯିବା ଉଚିତ।"
         ]
      },
      "cotton": {
         "advisory": [
            "ଚାଷ କରିବା ପୂର୍ବରୁ ମାଟି ଉପରେ ଏଫ. ୱାଇ. ଏମ୍. କିମ୍ବା କମ୍ପୋଷ୍ଟ @2 ଟନ୍/ଏକର କିମ୍ବା ଭର୍ମିକମ୍ପୋଷ୍ଟ <ଆଇ. ଡି. 1> ଟନ୍/ଏକର ସମାନ ଭାବେ ଲଗାନ୍ତୁ।",
            "ପ୍ରତି ପିଟ୍ରେ 3ରୁ 5 ସେ. ମି. ଗଭୀରତାରେ ଗୋଟିଏ ଲେଖାଏଁ ବୀଜରେ ବୀଜକୁ ଧାଡ଼ି କରି କାଟି ଦିଅନ୍ତୁ ଏବଂ ବୀଜକୁ ମାଟିରେ ଢାଙ୍କି ଦିଅନ୍ତୁ।",
            "ବୀଜ ଉପଚାରଃ ଶୋଷକ କୀଟପତଙ୍ଗରୁ ସୁରକ୍ଷା ପାଇଁ ବୀଜକୁ ଇମିଡାକ୍ଲୋପ୍ରିଡ୍ 70 ଡବ୍ଲୁଜି @7 ଗ୍ରାମ୍/କେଜି ସହିତ ଚିକିତ୍ସା କରାଯିବା ଉଚିତ।"
         ]
      },
      "arhar": {
         "advisory": [
            "ଚୂଡ଼ାନ୍ତ ଜମି ପ୍ରସ୍ତୁତି ସମଯ଼ରେ ଏକର ପିଛା 2-4 ଟନ୍ ଏଫ୍. ୱାଇ. ଏମ୍. ପ୍ରଯ଼ୋଗ କରନ୍ତୁ।",
            "ଉଇପୋକା ସ୍ଥାନୀଯ଼ ଅଞ୍ଚଳରେ କ୍ଲୋରୋପାଇରିଫୋସ୍ ଧୂଳି ପ୍ରଯ଼ୋଗ ଭୂମି ପ୍ରସ୍ତୁତି ସମଯ଼ରେ 10 କି. ଗ୍ରା./ଏ. ସି. ରେ 1%",
            "60 ସେ. ମି. x 15 ସେ. ମି. ବ୍ଯ଼ବଧାନ ସହିତ ବୀଜ ଡ୍ରିଲ୍ କିମ୍ବା ଦେଶୀ ହଳ ଦ୍ୱାରା ଧାଡ଼ି ବୁଣିବା ସୁପାରିଶ କରାଯାଏ |"
         ]
      },
      "hybrid maize": {
         "advisory": [
            "ଚୂଡ଼ାନ୍ତ ଜମି ପ୍ରସ୍ତୁତି ସମଯ଼ରେ ଏକର ପିଛା 2-4 ଟନ୍ ଏଫ୍. ୱାଇ. ଏମ୍. ପ୍ରଯ଼ୋଗ କରନ୍ତୁ।",
            "ଉଇପୋକା ସ୍ଥାନୀଯ଼ ଅଞ୍ଚଳରେ କ୍ଲୋରୋପାଇରିଫୋସ୍ ଧୂଳି ପ୍ରଯ଼ୋଗ ଭୂମି ପ୍ରସ୍ତୁତି ସମଯ଼ରେ 10 କି. ଗ୍ରା./ଏ. ସି. ରେ 1%",
            "ଜଳସେଚନ ସ୍ଥିତି ପାଇଁ 60 ସେ. ମି. x 25 ସେ. ମି. ଏବଂ ବର୍ଷା ଜଳସେଚିତ ଅବସ୍ଥା ପାଇଁ 75 ସେ. ମି. x 25 ସେ. ମି. ବ୍ଯ଼ବଧାନ ସହିତ ବୀଜ ଡ୍ରିଲ୍ କିମ୍ବା ଦେଶୀ ହଳ ଦ୍ୱାରା ଧାଡ଼ି ବୁଣିବା ସୁପାରିଶ କରାଯାଏ |"
         ]
      },
      "brnijal & chilli": {
         "advisory": [
            "ସମଯ଼ୋଚିତ ରୋପଣ ପାଇଁ ବାଇଗଣ, ଲଙ୍କା ଇତ୍ଯ଼ାଦି ଖରିଫ ପନିପରିବା ପାଇଁ ଉଠାଯାଇଥିବା ଶଯ୍ଯ଼ା ନର୍ସରୀ ପ୍ରସ୍ତୁତ କରନ୍ତୁ।",
            "ଶୁଖିଲା ଏବଂ ଭିଜିବା ଭଳି ରୋଗକୁ ରୋକିବା ପାଇଁ ବୁଣିବା ପୂର୍ବରୁ ଟ୍ରାଇକୋଡର୍ମା ଭାଇରିଡ୍ 1 ପ୍ରତିଶତ @10 ଗ୍ରାମ୍/କେଜି କିମ୍ବା କ୍ଯ଼ାପଟାନ 75 ପ୍ରତିଶତ ଡବ୍ଲୁଏସ୍ @2-3 ଗ୍ରାମ୍/କେଜି ସହିତ ଚିକିତ୍ସା କରନ୍ତୁ।"
         ]
      },
      "okra": {
         "advisory": [
            "ଅଧିକ ଉତ୍ପାଦନ ପାଇବା ପାଇଁ ଜୁଲାଇ ଶେଷ ସୁଦ୍ଧା ବୁଣିବା ଶେଷ ହେବା ଉଚିତ।",
            "ଜମି ପ୍ରସ୍ତୁତ କରିବା ସମଯ଼ରେ ଭଲ ଭାବେ ଅପଘଟିତ ଏଫ୍. ୱାଇ. ଏମ୍. @2t/ଏକର ପ୍ରଯ଼ୋଗ କରନ୍ତୁ।",
            "ବିହନ ଦର-ଏକର ପିଛା 4 କିଲୋଗ୍ରାମ"
         ]
      },
      "onion": {
         "advisory": [
            "ଭୀମ ରାଜ, ଭୀମ ଡାର୍କ ରେଡ୍, ଭୀମ ସୁପର ଇତ୍ଯ଼ାଦି ଉପଯୁକ୍ତ କିସମର ଚଯ଼ନ କରାଯିବା ଉଚିତ।",
            "ଖରିଫ ପନିପରିବା ପାଇଁ ଏକ ଓଭରହେଡ୍-ସୁରକ୍ଷିତ ଢାଞ୍ଚା ଅଧୀନରେ ଉଠାଯାଇଥିବା ନର୍ସରୀ ଶଯ୍ଯ଼ା ପ୍ରସ୍ତୁତ କରାଯିବା ଉଚିତ।",
            "ଭଲ ଚାରା ପାଇବା ପାଇଁ ବୀଜ ଉପଚାର, ବୁଣିବା, ଏବଂ ଧାନର ନଡ଼ିଆ ମାଲ୍ଚିଙ୍ଗ ପ୍ରଯ଼ୋଗ କରିବା ପରେ କ୍ଲୋରୋପାଇରିଫସ୍ 1 ମିଲି/ଲିଟର ପାଣି ସିଞ୍ଚନ କରିବାକୁ ପରାମର୍ଶ ଦିଆଯାଇଛି।"
         ]
      },
      "poultry": {
         "advisory": [
            "ବର୍ଷା ପାଣି ଭିତରକୁ ପ୍ରବେଶ କରିବାରୁ ରୋକିବା ପାଇଁ କୁକୁଡ଼ା ଘର ମରାମତି କରନ୍ତୁ |",
            "ଖାଦ୍ଯ଼ ସାମଗ୍ରୀକୁ ଓଦା ହେବାରୁ ରୋକନ୍ତୁ ଯାହା ଖାଦ୍ଯ଼ରେ ଫଙ୍ଗସ୍ ବୃଦ୍ଧି କରିପାରେ |"
         ]
      },
      "goat & sheep": {
         "advisory": [
            "ଆଭ୍ଯ଼ନ୍ତରୀଣ ପରଜୀବୀଗୁଡ଼ିକର ଭାର ହ୍ରାସ କରିବା ପାଇଁ ସେଗୁଡ଼ିକୁ ପତଳା କରନ୍ତୁ।",
            "ବାହ୍ଯ଼ ପରଜୀବୀ ବିରୁଦ୍ଧରେ ମେଣ୍ଢା କ୍ଷେତ୍ରରେ ଡିପିଂ କରାଯିବା ଉଚିତ |",
            "ବର୍ଷା ସମଯ଼ରେ ପଶୁମାନଙ୍କୁ ଘର ଭିତରେ ରଖନ୍ତୁ ଏବଂ ସ୍ୱଚ୍ଛ ତଥା ସ୍ୱାସ୍ଥ୍ଯ଼କର ଜଳ ଯୋଗାଇ ଦିଅନ୍ତୁ।"
         ]
      }
   },
   "date": "09-07-2024"
}