{
   "weather_details": {
      "10.01.2025": {
         "rainfall": 0,
         "t_max": 25,
         "t_min": 15,
         "rh_max": 85,
         "rh_min": 55,
         "wind_speed": 10,
         "wind_direction": 180,
         "cloud_cover": 5
      }
   },
   "names_of_crops": [
      "ଚିନାବାଦାମ",
      "ଲଙ୍କା",
      "ଟମାଟୋ",
      "ବାଇଗଣ",
      "ରସୁଣ",
      "ଯକ୍ଷ୍ମା",
      "ପଶୁପାଳନ",
      "କୁକୁଡ଼ା ମାଂସ"
   ],
   "general_advisory": "ଚିନାବାଦାମରେ ଧଳା ଗ୍ରବ୍ ସଂକ୍ରମଣକୁ କମ୍ କରିବା, ଲଙ୍କାରେ ମାଇଟ୍ ପରିଚାଳନା କରିବା, ଟମାଟୋରେ ଏଫିଡ୍ ନିୟନ୍ତ୍ରଣ କରିବା, ବାଇଗଣରେ ଧଳା ମାଛିଙ୍କୁ ଆକର୍ଷିତ କରିବା ଏବଂ ମାରିବା, ପିଆଜର ଚାରା ସଠିକ୍ ଭାବରେ ରୋପଣ କରିବା ଏବଂ ଟ୍ୟୁବରୋଜରେ ପତ୍ର ବ୍ଲାଇଟ୍, ଷ୍ଟେମ ରଟ୍ ଏବଂ ରୁଟ ନଟ ନେମାଟୋଡକୁ ନିୟନ୍ତ୍ରଣ କରିବା ନିଶ୍ଚିତ କରନ୍ତୁ | ରୋଗ ବିରୁଦ୍ଧରେ ପଶୁମାନଙ୍କୁ ଟୀକାକରଣ କରନ୍ତୁ ଏବଂ ଶୀତ ମାସ ପାଇଁ ପଶୁଖାଦ୍ୟ ସଂରକ୍ଷଣ କରନ୍ତୁ | ଶୀତ ଋତୁରେ କୁକୁଡ଼ା ପାଳନ ଗୃହକୁ ପୃଥକ୍ ରଖନ୍ତୁ।",
   "crops_data": {
      "groundnut": {
         "advisory": [
            "ଶ୍ୱେତ ଗ୍ରବ୍ ସଂକ୍ରମଣକୁ କମ୍ କରିବା ପାଇଁ କ୍ଲୋରୋପାଇରିଫୋସ୍ କିମ୍ବା ଇମିଡାକ୍ଲୋପ୍ରିଡକୁ ଭିଜାଇଦେବା।"
         ]
      },
      "chilli": {
         "advisory": [
            "ଲଙ୍କାରେ ଥିବା ମାଇଟ୍କୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ ଇଥିଅନ୍, ସ୍ପାଇରୋମେସିଫେନ୍ କିମ୍ବା ପ୍ରୋପାର୍ଜାଇଟ୍ ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "tomato": {
         "advisory": [
            "ଟମାଟୋରେ ଏଫିଡ୍ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ ନିମ୍ବ ତେଲ କିମ୍ବା ଫ୍ଲୋନିକାମ୍ ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "brinjal": {
         "advisory": [
            "ବାଇଗଣରେ ଧଳା ମାଛିଙ୍କୁ ଆକର୍ଷିତ କରିବା ଏବଂ ମାରିବା ପାଇଁ ହଳଦିଆ ଚଟପଟା ଜାଲ ବ୍ୟବହାର କରନ୍ତୁ |",
            "କୀଟପତଙ୍ଗକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ ନିମ ଆଧାରିତ କୀଟନାଶକ କିମ୍ବା ରାସାୟନିକ କୀଟନାଶକ ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "onion": {
         "advisory": [
            "ମୁଖ୍ୟ କ୍ଷେତରେ କଞ୍ଚାଲଙ୍କା ଚାରା ଭଲ ଭାବେ ରୋପଣ କରନ୍ତୁ।"
         ]
      },
      "tuberose": {
         "advisory": [
            "ପତ୍ର ରୋଗକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ ଫେନାମିଡୋନ୍ + ମାନକୋଜେବ୍ କିମ୍ବା ସାଇମୋକ୍ସାନିଲ୍ + ମାନକୋଜେବ୍ ସ୍ପ୍ରେ କରନ୍ତୁ।",
            "କାଣ୍ଡ କ୍ଷୟକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ କାର୍ବେଣ୍ଡାଜିମ୍ + ମାଙ୍କୋଜେବ୍ ଲଗାନ୍ତୁ।",
            "ମୂଳ ଗଣ୍ଠି ସୂତ୍ରକୃମିକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ କାର୍ବୋଫୁରାନ ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "animal husbandry": {
         "advisory": [
            "ପଶୁମାନଙ୍କୁ ଏଫ୍. ଏମ୍. ଡି., ରକ୍ତସ୍ରାବଜନିତ ସେପ୍ଟିସେମିଆ, ବ୍ଲାକ୍ କ୍ୱାର୍ଟର୍, ଏଣ୍ଟେରୋଟକ୍ସିମିଆ ଇତ୍ୟାଦି ବିରୁଦ୍ଧରେ ଟୀକାକରଣ କରନ୍ତୁ।",
            "ଶୀତ ମାସ ପାଇଁ ଖାଦ୍ୟଶସ୍ୟ ସଂଗ୍ରହ/ସଂଗ୍ରହ କରନ୍ତୁ।",
            "ଏହି ସମୟରେ ବହୁବର୍ଷଜୀବୀ ଘାସ କାଟି ଦିଅନ୍ତୁ।"
         ]
      },
      "poultry": {
         "advisory": [
            "କୁକୁଡ଼ା ଘରକୁ ଥଣ୍ଡା ପବନରୁ ସୁରକ୍ଷିତ ରଖନ୍ତୁ।",
            "ଆମୋନିଆ ନିର୍ମାଣକୁ ଏଡ଼ାଇବା ପାଇଁ ଉପଯୁକ୍ତ ଭେଣ୍ଟିଲେସନ୍ ନିଶ୍ଚିତ କରନ୍ତୁ |",
            "ପକ୍ଷୀମାନଙ୍କୁ ଖଣିଜ ପଦାର୍ଥ ଏବଂ କ୍ୟାଲସିୟମ୍ ଖାଇବାକୁ ଦିଅନ୍ତୁ।"
         ]
      }
   },
   "date": "10-01-2025"
}