{
   "weather_details": {
      "11-09-2024": {
         "rainfall": 20,
         "t_max": 32,
         "t_min": 25,
         "rh_max": 90,
         "rh_min": 68,
         "wind_speed": 16,
         "wind_direction": 243,
         "cloud_cover": 8
      },
      "12-09-2024": {
         "rainfall": 5,
         "t_max": 32,
         "t_min": 25,
         "rh_max": 86,
         "rh_min": 67,
         "wind_speed": 15,
         "wind_direction": 249,
         "cloud_cover": 6
      },
      "13-09-2024": {
         "rainfall": 5,
         "t_max": 32,
         "t_min": 26,
         "rh_max": 90,
         "rh_min": 64,
         "wind_speed": 14,
         "wind_direction": 254,
         "cloud_cover": 6
      },
      "14-09-2024": {
         "rainfall": 2,
         "t_max": 33,
         "t_min": 26,
         "rh_max": 93,
         "rh_min": 77,
         "wind_speed": 16,
         "wind_direction": 247,
         "cloud_cover": 6
      },
      "15-09-2024": {
         "rainfall": 2,
         "t_max": 33,
         "t_min": 26,
         "rh_max": 89,
         "rh_min": 68,
         "wind_speed": 18,
         "wind_direction": 250,
         "cloud_cover": 6
      }
   },
   "names_of_crops": [
      "ସିଧାସଳଖ ବିହନ ବୁଣାଯାଇଥିବା ଧାନ",
      "କପା",
      "ଅରହର",
      "ସଂକର ମକା",
      "ବାଇଗଣ",
      "ଲଙ୍କା",
      "ଟମାଟୋ",
      "ଗାଈ ଏବଂ ମଇଁଷି",
      "ଛେଳି ଏବଂ ମେଣ୍ଢା",
      "କୁକୁଡ଼ା ମାଂସ"
   ],
   "general_advisory": "ଆଇଏମଡିରୁ ମିଳିଥିବା ପାଞ୍ଚ ଦିନିଆ ପାଣିପାଗ ପୂର୍ବାନୁମାନକୁ ଦୃଷ୍ଟିରେ ରଖି କୃଷକମାନେ କୃଷି ସମ୍ବନ୍ଧୀୟ ଅଭ୍ୟାସ ଏବଂ ସାର ପ୍ରୟୋଗକୁ ପୁଣି ଆରମ୍ଭ କରିପାରିବେ। ବାସ୍ତବ ସମୟର ପାଣିପାଗ ସ୍ଥିତିକୁ ଦୃଷ୍ଟିରେ ରଖି କୃଷକମାନଙ୍କୁ ଏକ ଷ୍ଟିକର ସହିତ କୀଟନାଶକ ପ୍ରୟୋଗ କରିବାକୁ ପରାମର୍ଶ ଦିଆଯାଇଛି। ଫସଲର ବୃଦ୍ଧି ପର୍ଯ୍ୟାୟ ଅନୁଯାୟୀ ସନ୍ତୁଳିତ ଏବଂ ଉପଯୁକ୍ତ ସାର ପ୍ରୟୋଗ କରନ୍ତୁ। ଅତ୍ୟଧିକ ନାଇଟ୍ରୋଜେନ୍ ଠାରୁ ଦୂରେଇ ରୁହନ୍ତୁ କାରଣ ଏହା ଅତ୍ୟଧିକ ଉଦ୍ଭିଦ ବୃଦ୍ଧିକୁ ପ୍ରୋତ୍ସାହିତ କରେ ଏବଂ ଜଳ ଚାହିଦା ବୃଦ୍ଧି କରେ | ଯଦି ଫସଲକୁ କୀଟପତଙ୍ଗରୁ ରକ୍ଷା କରିବା ପାଇଁ ଉପଲବ୍ଧ ଥାଏ, ତେବେ ଜୈବିକ ଚିକିତ୍ସା ସହିତ ସର୍ବଦା ପ୍ରତିଷେଧକ ପଦକ୍ଷେପଗୁଡ଼ିକର ଏକ ସମନ୍ୱିତ ଆଭିମୁଖ୍ୟ ଉପରେ ବିଚାର କରନ୍ତୁ।",
   "crops_data": {
      "direct seeded paddy": {
         "advisory": [
            "କୀଟପତଙ୍ଗ ଏବଂ ରୋଗର ପ୍ରକୋପକୁ ହ୍ରାସ କରିବା ପାଇଁ କୃଷକମାନଙ୍କୁ ଲିଟର ପିଛା ବେଲ୍, ତୁଳସୀ କିମ୍ବା ନିମ ପତ୍ରର ନିର୍ଯାସ ସ୍ପ୍ରେ କରିବାକୁ ପରାମର୍ଶ ଦିଆଯାଇଛି।",
            "ବର୍ତ୍ତମାନର ପାଣିପାଗ ବିସ୍ଫୋରଣ ସଂକ୍ରମଣ ପାଇଁ ଅନୁକୂଳ ଅଟେ। ଯଦି ଧାନ କ୍ଷେତରେ ପତ୍ର ବିସ୍ଫୋରଣ ଦେଖାଯାଏ, ତେବେ ଟେବୁକୋନାଜୋଲ୍ + ଟ୍ରାଇଫ୍ଲୋକ୍ସିସ୍ଟ୍ରୋବିନ୍ କିମ୍ବା ଆଇସୋପ୍ରୋଥିଓଲେନ୍ ସ୍ପ୍ରେ କରନ୍ତୁ |",
            "ଧାନରେ ଶୀଥ୍ ରଟ୍ ଏବଂ ଶୀଥ୍ ବ୍ଲାଇଟ୍ର ସଂକ୍ରମଣ ହେବାର ସମ୍ଭାବନା ରହିଛି। ଟେବୁକୋନାଜୋଲ + ଟ୍ରାଇଫ୍ଲୋକ୍ସିସ୍ଟ୍ରୋବିନ କିମ୍ବା ପ୍ରୋପିକୋନାଜୋଲକୁ ପାଣି ସହିତ ମିଶାଇ ସ୍ପ୍ରେ କରନ୍ତୁ।",
            "ବର୍ତ୍ତମାନ କେତେକ ସ୍ଥାନରେ ବିଏଲବି ସଂକ୍ରମଣ ପରିଲକ୍ଷିତ ହୋଇଛି। ବିଏଲବିକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ କପର ଅକ୍ସିକ୍ଲୋରାଇଡ + ସ୍ଟ୍ରେପ୍ଟୋସାଇକ୍ଲିନ ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "cotton": {
         "advisory": [
            "କପା ମଞ୍ଜି ଉତ୍ପାଦନରେ ଉନ୍ନତି ଆଣିବା ପାଇଁ 60-65 DAS ରେ ଉଦ୍ଭିଦ ହରମୋନ୍ ପ୍ଲାନୋଫିକ୍ସର ପ୍ରୟୋଗ କରିବା ଉଚିତ।",
            "ସମସ୍ତ ପ୍ରକାରର ଆଗାଛାକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ ଗ୍ଲାଇଫୋସେଟ୍ କିମ୍ବା ଗ୍ଲୁଫୋସିନେଟ୍ ଆମୋନିୟମ୍ ଲଗାନ୍ତୁ।",
            "60 ଡିଏଏସରେ ୟୁରିଆର ଦ୍ୱିତୀୟ ଉପର ଡ୍ରେସିଂ ଲଗାନ୍ତୁ।",
            "ପତ୍ର ଲାଲ ହେବା ହ୍ରାସ କରିବା ପାଇଁ ଜଳମଗ୍ନ ଅଞ୍ଚଳରେ ୟୁରିଆ ସହିତ ମିଶ୍ରିତ ମ୍ୟାଗ୍ନେସିୟମ୍ ସଲଫେଟ୍ ଲଗାନ୍ତୁ |",
            "ଏଫିଡ୍, ଜ୍ଯାସିଡ୍, ଥ୍ରିପ୍ ଏବଂ ହ୍ୱାଇଟ୍ଫ୍ଲାଇ ପରି ଶୋଷକ କୀଟ କମ୍ପ୍ଲେକ୍ସକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ ନିମ୍-ଆଧାରିତ କୀଟନାଶକ ପ୍ରୟୋଗ କରନ୍ତୁ |",
            "ମୃତ୍ତିକା-ବାହିତ ରୋଗ ପାଇଁ କାର୍ବେନଡାଜିମ୍ ସହିତ ମାଟିକୁ ଭିଜାଇ ଦିଅନ୍ତୁ |"
         ]
      },
      "arhar": {
         "advisory": [
            "ପତ୍ର ୱେବର୍ ସଂକ୍ରମଣକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ, ପ୍ରୋଫେନୋଫସ୍ କିମ୍ବା କ୍ଲୋରପାଇରିଫସ୍ ସ୍ପ୍ରେ କରନ୍ତୁ।",
            "କୀଟ ସଂକ୍ରମଣର ଲକ୍ଷଣଗୁଡ଼ିକ ପାଇଁ ନିୟମିତ ଭାବେ ନିଜ କ୍ଷେତ ଉପରେ ନଜର ରଖନ୍ତୁ। ଶୋଷକ କୀଟ ସଂକ୍ରମଣ ଦେଖାଯାଇପାରେ, ଏହାକୁ ରୋକିବା ପାଇଁ, ସଂକ୍ରମଣର ପ୍ରାରମ୍ଭିକ ପର୍ଯ୍ୟାୟରେ ନିମ୍ବ-ଆଧାରିତ କୀଟନାଶକ ସ୍ପ୍ରେ କରନ୍ତୁ |",
            "ଶୁଖିବାକୁ ରୋକିବା ପାଇଁ ଗଛର ମୂଳ ଅଞ୍ଚଳରେ ମେଟିରାମ୍ ଲଗାନ୍ତୁ |"
         ]
      },
      "hybrid maize": {
         "advisory": [
            "ଯଦି ଫସଲ ଟାସେଲିଂ ପର୍ଯ୍ୟାୟରେ ଅଛି ତେବେ ୟୁରିଆ ଲଗାନ୍ତୁ ଏବଂ ଯଦି ପାଣି ପର୍ଯ୍ୟାପ୍ତ ନୁହେଁ ତେବେ ଜଳସେଚନ କରନ୍ତୁ |",
            "ଷ୍ଟେମ ବୋରର, ଏଫ୍. ଏ. ଡବ୍ଲ୍ୟୁ, ଏବଂ ବ୍ୟାଣ୍ଡେଡ ଲିଫ୍ ଏବଂ ସିଥ୍ ବ୍ଲାଇଟ୍ ପାଇଁ ନିୟମିତ ଭାବରେ କ୍ଷେତ୍ର ଉପରେ ନଜର ରଖନ୍ତୁ | ସଂକ୍ରମିତ ଗଛର ଅଂଶଗୁଡ଼ିକୁ ବାହାର କରି ଉପଯୁକ୍ତ କୀଟନାଶକ ପ୍ରୟୋଗ କରନ୍ତୁ।",
            "ଏଫ. ଏ. ଡବ୍ଲ୍ୟୁ. ସଂକ୍ରମଣକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ ଇମାମେକ୍ଟିନ୍ ବେନ୍ଜୋଏଟ୍ ପ୍ରୟୋଗ କରନ୍ତୁ।",
            "ବି. ଏଲ୍. ଏସ୍. ବି. ପାଇଁ, ଏହାକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ ଭାଲିଡାମାଇସିନ୍ କିମ୍ବା ହେକ୍ସାକୋନାଜୋଲ୍ ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "brinjal": {
         "advisory": [
            "ଶୋଷକ କୀଟପତଙ୍ଗ ଉପରେ ନଜର ରଖିବା ପାଇଁ ହଳଦିଆ ଚଟପଟା ଜାଲ ଲଗାନ୍ତୁ।",
            "ଶୁଷ୍କତାକୁ ରୋକିବା ପାଇଁ, ମୂଳ ଅଞ୍ଚଳରେ ଟେବୁକୋନାଜୋଲ୍ ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "chilli": {
         "advisory": [
            "ଥ୍ରିପ୍ସ ସଂକ୍ରମଣ ଉପରେ ନଜର ରଖିବା ପାଇଁ ନୀଳ ଚଟପଟା ଜାଲ ଲଗାନ୍ତୁ।",
            "ଯଦି ଥ୍ରୀପ୍ସର ଲକ୍ଷଣ ଦେଖାଯାଏ, ତେବେ ସଂକ୍ରମଣର ପ୍ରାରମ୍ଭିକ ପର୍ଯ୍ୟାୟରେ ନିମ୍ବ-ଆଧାରିତ କୀଟନାଶକ ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "tomato": {
         "advisory": [
            "ଉଲ୍ଲେଖ କରାଯାଇଥିବା ନିର୍ଦ୍ଦିଷ୍ଟ କିସମ ଏବଂ ମଞ୍ଜି ଦର ସହିତ ଏହି ସମୟରେ ଟମାଟୋ ଚାରା ଲଗାଇବା ଉପଯୁକ୍ତ।"
         ]
      },
      "cow & buffalo": {
         "advisory": [
            "ଦୁଗ୍ଧ ପଶୁମାନଙ୍କୁ ଧ୍ୟାନ ଦିଅନ୍ତୁ କାରଣ ବର୍ଷା ଦିନରେ ଘାସରେ ଆର୍ଦ୍ରତା ଅଧିକ ହୋଇପାରେ |"
         ]
      },
      "goat & sheep": {
         "advisory": [
            "ବର୍ଷା ଋତୁରେ ମେଣ୍ଢା ଏବଂ ଛେଳି ପାଇଁ ଶୁଖିଲା ପଶୁଖାଦ୍ୟ ଏବଂ ନଡ଼ିଆ ପ୍ରସ୍ତୁତ ରଖନ୍ତୁ।",
            "ମେଣ୍ଢା ଏବଂ ଛେଳିଙ୍କ ପାଇଁ ମଜା କରିବା ଏବଂ ମେଷପାଳନ କରିବାର ଏକ ମାସ ପୂର୍ବରୁ ସନ୍ତୁଳିତ ଧ୍ୟାନ ସୁନିଶ୍ଚିତ କରନ୍ତୁ।"
         ]
      },
      "poultry": {
         "advisory": [
            "ପ୍ରତିଦିନ କୁକୁଡ଼ା ଘର ସଫା କରନ୍ତୁ ଏବଂ ବାରମ୍ବାର ଖାଦ୍ୟ ଏବଂ ପାଣି ବଦଳାନ୍ତୁ |",
            "ପ୍ରଭାବିତ ଅଞ୍ଚଳରୁ କୁକୁଡ଼ା ପକ୍ଷୀ କିମ୍ବା ଅଣ୍ଡା ଆଣନ୍ତୁ ନାହିଁ।"
         ]
      }
   },
   "date": "10-09-2024"
}