{
   "weather_details": {
      "06.09.2024": {
         "rainfall": 26,
         "t_max": 30,
         "t_min": 20,
         "rh_max": 0,
         "rh_min": 0,
         "wind_speed": 0,
         "wind_direction": 0,
         "cloud_cover": 0
      },
      "07.09.2024": {
         "rainfall": 26,
         "t_max": 30,
         "t_min": 19,
         "rh_max": 0,
         "rh_min": 0,
         "wind_speed": 0,
         "wind_direction": 0,
         "cloud_cover": 0
      },
      "08.09.2024": {
         "rainfall": 33,
         "t_max": 31,
         "t_min": 20,
         "rh_max": 0,
         "rh_min": 0,
         "wind_speed": 0,
         "wind_direction": 0,
         "cloud_cover": 0
      },
      "09.09.2024": {
         "rainfall": 68,
         "t_max": 31,
         "t_min": 19,
         "rh_max": 0,
         "rh_min": 0,
         "wind_speed": 0,
         "wind_direction": 0,
         "cloud_cover": 0
      },
      "11-09-2024": {
         "rainfall": 5,
         "t_max": 29,
         "t_min": 19,
         "rh_max": 78,
         "rh_min": 94,
         "wind_speed": 15,
         "wind_direction": 250,
         "cloud_cover": 6
      },
      "12-09-2024": {
         "rainfall": 2,
         "t_max": 30,
         "t_min": 19,
         "rh_max": 71,
         "rh_min": 92,
         "wind_speed": 15,
         "wind_direction": 249,
         "cloud_cover": 6
      },
      "13-09-2024": {
         "rainfall": 2,
         "t_max": 30,
         "t_min": 19,
         "rh_max": 70,
         "rh_min": 95,
         "wind_speed": 15,
         "wind_direction": 256,
         "cloud_cover": 6
      },
      "14-09-2024": {
         "rainfall": 2,
         "t_max": 31,
         "t_min": 20,
         "rh_max": 73,
         "rh_min": 93,
         "wind_speed": 17,
         "wind_direction": 262,
         "cloud_cover": 6
      },
      "15-09-2024": {
         "rainfall": 2,
         "t_max": 31,
         "t_min": 20,
         "rh_max": 63,
         "rh_min": 93,
         "wind_speed": 17,
         "wind_direction": 259,
         "cloud_cover": 4
      }
   },
   "names_of_crops": [
      "ଚାଉଳ",
      "ମକା",
      "ଖରିଫ ଚିନାବାଦାମ",
      "ରାଗି।",
      "ବାଇଗଣ",
      "ଆଳୁ",
      "ଅଦା।",
      "କଳା ଲଙ୍କା",
      "ହଳଦୀ",
      "କଫି",
      "ଛେଳି ଏବଂ ମେଣ୍ଢା",
      "କୁକୁଡ଼ା ମାଂସ"
   ],
   "general_advisory": "ଆଗାମୀ ପାଞ୍ଚ ଦିନ ମଧ୍ୟରେ ବର୍ଷା ହେବାର ସମ୍ଭାବନା ରହିଛି, କେବଳ ଆକାଶ ସଫା ହେବା ପରେ ସ୍ପ୍ରେ କରନ୍ତୁ ଏବଂ ସ୍ପ୍ରେ ଦ୍ରବଣରେ ଷ୍ଟିକର ବ୍ୟବହାର କରନ୍ତୁ। କ୍ଷେତର ଗୋଟିଏ ଅଂଶରେ ବର୍ଷା ଜଳ ସଂରକ୍ଷଣ ପାଇଁ ଉପଯୁକ୍ତ ବ୍ୟବସ୍ଥା କରିବାକୁ କୃଷକମାନଙ୍କୁ ପରାମର୍ଶ ଦିଆଯାଇଛି। ଏହି ଜଳକୁ ଶୁଖିଲା ଋତୁରେ ଫସଲରେ ଜଳସେଚନ ପାଇଁ ବ୍ୟବହାର କରାଯାଇପାରିବ। ଅଧିକ ଆର୍ଦ୍ରତା କାରଣରୁ, ପୂର୍ବରୁ ବୁଣାଯାଇଥିବା ଫସଲରେ କୀଟପତଙ୍ଗ ଏବଂ ରୋଗର ସମ୍ଭାବନା ସୃଷ୍ଟି ହୋଇଥାଏ। ଫସଲ ଏବଂ ପାଣିପାଗ ସ୍ଥିତି ଉପରେ ନିର୍ଭର କରି ଉଦ୍ଭିଦ ସୁରକ୍ଷା ପଦକ୍ଷେପ ନିଅନ୍ତୁ। ଅତିରିକ୍ତ ଜଳ ନିଷ୍କାସନ ପାଇଁ ଅଣ-ଧାନ ଫସଲ କ୍ଷେତରେ ଉପଯୁକ୍ତ ଜଳ ନିଷ୍କାସନ ବ୍ୟବସ୍ଥା କରନ୍ତୁ।",
   "crops_data": {
      "rice": {
         "advisory": [
            "ଅଧିକ ଉତ୍ପାଦନକ୍ଷମ କିସମ ପାଇଁ ଏକର ପିଛା 35 କି. ଗ୍ରା. ୟୁରିଆ ଏବଂ ହାଇବ୍ରିଡ୍ ପାଇଁ ଏକର ପିଛା 42 କି. ଗ୍ରା. ୟୁରିଆ ଚାଷ ପର୍ଯ୍ୟାୟରେ ପ୍ରୟୋଗ କରନ୍ତୁ।",
            "ବର୍ତ୍ତମାନର ପାଣିପାଗ ଧାନରେ ବିସ୍ଫୋରଣ ରୋଗ ଅନୁକୂଳ ହୋଇପାରେ | ଏହାକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ ଟେବୁକୋନାଜୋଲ 50 ପ୍ରତିଶତ + ଟ୍ରାଇଫ୍ଲୋକ୍ସିସ୍ଟ୍ରୋବିନ 25 ପ୍ରତିଶତ ଡବ୍ଲୁ. ଜି. @4 ଗ୍ରାମ/ଲିଟର ପାଣି କିମ୍ବା ଟ୍ରାଇସାଇକ୍ଲାଜୋଲ 45 ପ୍ରତିଶତ + ହେକ୍ସାକୋନାଜୋଲ 10 ପ୍ରତିଶତ ଡବ୍ଲୁ. ଜି. @1 ଗ୍ରାମ/ଲିଟର ପାଣି ସିଞ୍ଚନ କରନ୍ତୁ।",
            "କାଣ୍ଡ ଛେଦକ ଏବଂ ପତ୍ର ଫୋଲଡର ସଂକ୍ରମଣ ହେବାର ସମ୍ଭାବନା ରହିଛି। ଯଦି କ୍ଷେତରେ ମିଳେ ତେବେ କ୍ଲୋରାଣ୍ଟ୍ରାନିଲିପ୍ରୋଲ୍ 18.5% ଏସ୍ସି @0.3 ମିଲି/ଲିଟର ପାଣି କିମ୍ବା ଫ୍ଲୁବେଣ୍ଡିଆମାଇଡ୍ 20 ପ୍ରତିଶତ ଡବ୍ଲୁଜି @0.25 ଗ୍ରାମ୍/ଲିଟର ପାଣି ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "maize": {
         "advisory": [
            "ଅତ୍ୟଧିକ ବର୍ଷା କାରଣରୁ ଜଳମଗ୍ନ ଅବସ୍ଥାକୁ ଏଡ଼ାଇବା ପାଇଁ ଉନ୍ନତ ଜଳ ନିଷ୍କାସନ ବ୍ୟବସ୍ଥା ବିକଶିତ କରନ୍ତୁ।",
            "ଅଧିକ ଆର୍ଦ୍ରତା ଏବଂ ମେଘୁଆ ପରିସ୍ଥିତି ହେତୁ ମକା ରେ ଏଫିଡ୍ ଘଟଣା ହୋଇପାରେ | ଯଦି ନିରୀକ୍ଷଣ କରାଯାଏ, ତେବେ ଥାୟାମେଥୋକ୍ସାମ୍ 12.6% + ଲାମ୍ବଡା-ସାଇହାଲୋଥ୍ରିନ୍ 9.5% ଜେଡସି @0.25 ମିଲି/ଲିଟର ପାଣି କିମ୍ବା ଇମିଡାକ୍ଲୋପ୍ରିଡ୍ 17.8% ଏସଏଲ @0.3 ମିଲି/ଲିଟର ପାଣି ସିଞ୍ଚନ କରନ୍ତୁ।",
            "ମକା କ୍ଷେତରେ ମୂଳ ଏବଂ ଡାଳି ସଙ୍କୁଚିତ ହେବା ପରିଲକ୍ଷିତ ହୋଇପାରେ, ଏହାକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ ଭାଲିଡାମାଇସିନ୍ 3% L @2 ମିଲି/ଲିଟର ପାଣି କିମ୍ବା କାର୍ବେନଡାଜିମ୍ 50% WP @1.5 ଗ୍ରାମ/ଲିଟର ପାଣି ସ୍ପ୍ରେ କରନ୍ତୁ |",
            "ପଡ଼ୁଥିବା ଆର୍ମିୱର୍ମ କ୍ଷେତରେ ନିରୀକ୍ଷଣ କରିପାରେ, ଏହାକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ ଇମାମେକ୍ଟିନ୍ ବେନ୍ଜୋଏଟ୍ 5 ପ୍ରତିଶତ SG @0.4 ଗ୍ରାମ/ଲିଟର ପାଣି କିମ୍ବା କ୍ଲୋରାଣ୍ଟ୍ରାନିଲିପ୍ରୋଲ୍ 18.5% SC @0.4 ମିଲି/ଲିଟର ପାଣି ସ୍ପ୍ରେ କରେ |"
         ]
      },
      "kharif groundnut": {
         "advisory": [
            "କ୍ଷେତ ପ୍ରସ୍ତୁତ କରନ୍ତୁ ଏବଂ ଅଧିକ ଉତ୍ପାଦନକ୍ଷମ କିସମ ଖରିଫ ଚିନାବାଦାମ ଚାଷ କରନ୍ତୁ। ବୁଣିବା ପୂର୍ବରୁ ପ୍ରତି କିଲୋଗ୍ରାମ ମଞ୍ଜି ପିଛା ଟ୍ରାଇକୋଡର୍ମା ଭିରିଡି (10 ଗ୍ରାମ୍), ସିଉଡୋମୋନାସ୍ ଫ୍ଲୁରୋସେନ୍ସ (10 ଗ୍ରାମ୍) ଏବଂ ରାଇଜୋବିୟମ୍ କଲ୍ଚର (20 ଗ୍ରାମ୍) ଦେଇ ମଞ୍ଜିଗୁଡ଼ିକୁ ଚିକିତ୍ସା କରନ୍ତୁ।"
         ]
      },
      "ragi": {
         "advisory": [
            "ରାଗିରେ ବିସ୍ଫୋରଣ ଘଟଣା ପାଇଁ ପରିସ୍ଥିତି ଅନୁକୂଳ, ଯଦି ଆକାଶ ସ୍ୱଚ୍ଛ ହେବା ସମୟରେ 2 ଗ୍ରାମ୍/ଲିଟର ପାଣିରେ ଜିନେବ୍ ସ୍ପ୍ରେ 75 ପ୍ରତିଶତ ଡବ୍ଲ୍ୟୁ. ପି. କିମ୍ବା 1 ଗ୍ରାମ୍/ଲିଟର ପାଣିରେ ଟ୍ରାଇସାଇକ୍ଲାଜୋଲ୍ 75 ପ୍ରତିଶତ ଡବ୍ଲ୍ୟୁ. ପି. ସ୍ପ୍ରେ କରାଯାଏ।"
         ]
      },
      "brinjal": {
         "advisory": [
            "ମୁଖ୍ୟ କ୍ଷେତରେ 25-35 ଦିନର ପୁରୁଣା ଚାରା ରୋପଣ କରନ୍ତୁ।",
            "ଜଳମଗ୍ନ ଅବସ୍ଥାକୁ ରୋକିବା ପାଇଁ ଆବଶ୍ୟକ ଡ୍ରେନେଜ୍ ଚ୍ୟାନେଲ୍ ତିଆରି କରନ୍ତୁ |",
            "ଉଦ୍ଭିଦ ସଂଖ୍ୟାକୁ ବଜାୟ ରଖିବା ପାଇଁ ମୁଖ୍ୟ କ୍ଷେତରେ ଥିବା ଶୂନ୍ୟସ୍ଥାନଗୁଡ଼ିକୁ ଚିହ୍ନଟ କରନ୍ତୁ ଏବଂ ପୂରଣ କରନ୍ତୁ।",
            "1 ଗ୍ରାମ୍/ଲିଟର ଟାବୁକୋନାଜୋଲ୍ ସିଞ୍ଚନ ଦ୍ୱାରା ବାଇଗଣରେ ତରଳିବାର ନିୟନ୍ତ୍ରଣ କରାଯାଇପାରିବ।"
         ]
      },
      "potato": {
         "advisory": [
            "ଆଳୁ ଫସଲରେ, ଯଦି ବିଳମ୍ବରେ ବ୍ଲାଇଟ୍ ରୋଗ ଦେଖାଯାଏ, ତେବେ ରୋପଣର 45,60 ଏବଂ 75 ଦିନ ପରେ ମାଙ୍କୋଜେବ୍ @2 ଗ୍ରାମ୍/ଲି କିମ୍ବା କ୍ଲୋରୋଥାଲୋନିଲ୍ @2 ଗ୍ରାମ୍/ଲି ପ୍ରୟୋଗ କରି ଏହି ରୋଗକୁ ପରିଚାଳନା କରନ୍ତୁ |"
         ]
      },
      "ginger": {
         "advisory": [
            "ଆଗାଛା କାଟିବା ପାଇଁ ଯାଆନ୍ତୁ ଏବଂ ରୋପଣର 45 ଦିନ ପରେ ଏକର ପିଛା 54 କିଲୋଗ୍ରାମ ୟୁରିଆ ଲଗାନ୍ତୁ ଏବଂ ଏକର ପିଛା 2 ଟନ୍ର ହାରରେ ମଲ୍ଚିଙ୍ଗ ଲଗାନ୍ତୁ।",
            "ଆଦୁର ନରମ କ୍ଷୟ ରୋଗକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ 15 ଲିଟର ବ୍ୟାରେଲ ଟ୍ୟାଙ୍କ ସ୍ପ୍ରେୟର ପିଛା 1.5 ପ୍ୟାକେଟ୍ ଟାଗମାଇସିନ୍ କିମ୍ବା 75 ମିଲି ନିମ୍ ତେଲ ଲଗାନ୍ତୁ।",
            "ବ୍ୟାକ୍ଟେରିଆଲ୍ ୱିଲ୍ଟ ଥରେ କ୍ଷେତରେ ଦେଖାଗଲେ, ସମସ୍ତ ଶଯ୍ୟାକୁ ବୋର୍ଡୋ ମିଶ୍ରଣ 1 ପ୍ରତିଶତ କିମ୍ବା ତମ୍ବା ଅକ୍ସିକ୍ଲୋରାଇଡ୍ 0.2 ପ୍ରତିଶତରେ ଭିଜାଇଦେବା ଉଚିତ।"
         ]
      },
      "black pepper": {
         "advisory": [
            "ଯଦି ପତ୍ର ପିତ୍ତ ଏବଂ ଥ୍ରିପ୍ସ ହୁଏ, ମୋନୋକ୍ରୋଟୋଫସ୍ 36 ଡବ୍ଲୁ. ଏସ୍. ସି. 1.5 ମିଲି/ଲିଟର କିମ୍ବା ଡାଇମେଥୋଏଟ୍ 30 ଇସି @2 ମିଲି/ଲିଟର କିମ୍ବା କ୍ଲୋରପିରିଫସ୍ 2 ମିଲି/ଲିଟର କିମ୍ବା ନିମ୍ବ ତେଲ 3 ପ୍ରତିଶତ (30 ମିଲି/ଲିଟର) ନୂତନ ଫ୍ଲସ୍ ଗଠନରୁ ଆରମ୍ଭ କରି ମାସିକ ବ୍ୟବଧାନରେ ତିନି ରାଉଣ୍ଡ ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "turmeric": {
         "advisory": [
            "ଆଗାଛା କାଟିବା ପାଇଁ ଯାଆନ୍ତୁ ଏବଂ ରୋପଣର 45 ଦିନ ପରେ ଏକର ପିଛା 26 କିଲୋଗ୍ରାମ ୟୁରିଆ ଲଗାନ୍ତୁ ଏବଂ ଏକର ପିଛା 2 ଟନ୍ର ହାରରେ ମଲ୍ଚିଙ୍ଗ ଲଗାନ୍ତୁ।",
            "ହଳଦୀର ରାଇଜୋମ ରଟ୍ ରୋଗକୁ ପରିଚାଳନା କରିବା ପାଇଁ 15 ଲିଟର ବ୍ୟାରେଲ ଟ୍ୟାଙ୍କ ସ୍ପ୍ରେୟର ପିଛା 1.5 ପ୍ୟାକେଟ୍ ଟାଗମାଇସିନ୍ କିମ୍ବା 75 ମିଲି ନିମ୍ ତେଲ ଲଗାନ୍ତୁ।"
         ]
      },
      "coffee": {
         "advisory": [
            "ଷ୍ଟେମ ବୋରର ପରିଚାଳନା",
            "ସର୍ବୋତ୍ତମ ଛାୟା ବଜାୟ ରଖନ୍ତୁ/ସୃଷ୍ଟି କରନ୍ତୁ",
            "ପରବର୍ତ୍ତୀ ବର୍ଷଗୁଡ଼ିକରେ ଆର୍ଥିକ କ୍ଷତି ଏଡ଼ାଇବା ପାଇଁ ବୋରର ସଂକ୍ରମିତ ଗଛଗୁଡ଼ିକୁ ପୁଙ୍ଖାନୁପୁଙ୍ଖ ଭାବରେ ଚିହ୍ନଟ କରାଯିବା ଉଚିତ, ମୂଳୋତ୍ପାଟନ କରି ଜଳାଇଦେବା ଉଚିତ।",
            "ଯଦି ପ୍ରକୋପ ଅଧିକ ଥାଏ, ତେବେ ହେକ୍ଟର ପିଛା 25 ହାରରେ ଫେରୋମୋନ୍ ଫାନ୍ଦ ସ୍ଥାପନ କରାଯିବ।",
            "5 ସେ. ମି. x 5 ସେ. ମି. ରେ କାଣ୍ଡରେ ଏକ ଝରକା ତିଆରି କରି କ୍ଲୋରପାଇରିଫସ୍ 25 ପ୍ରତିଶତ ଇ. ସି. @5 ମିଲି ସହିତ ପ୍ୟାଡ୍ କରନ୍ତୁ ଏବଂ କୀଟନାଶକ ଦ୍ରବଣରେ ବୁଡ଼ାଯାଇଥିବା ଶୋଷକ କପା ସହିତ ଏହାକୁ ପୂରଣ କରନ୍ତୁ ଏବଂ ଏହାକୁ ବନ୍ଦ କରନ୍ତୁ |"
         ]
      },
      "goat & sheep": {
         "advisory": [
            "ବର୍ଷା ଋତୁରେ ମେଣ୍ଢା ଏବଂ ଛେଳି ପାଇଁ ଘରେ ଶୁଖିଲା ପଶୁଖାଦ୍ୟ ଏବଂ ନଡ଼ିଆ ପ୍ରସ୍ତୁତ ରଖନ୍ତୁ ଏବଂ ଛେଳି ଏବଂ ଛେଳିଙ୍କୁ ମଜା କରିବା ଏବଂ ଛେଳି ମାରିବାର ଏକ ମାସ ପୂର୍ବରୁ ସନ୍ତୁଳିତ ସାନ୍ଦ୍ରତା ଦେବା ପାଇଁ ଫ୍ଲାଶିଂ ଅଭ୍ୟାସ ନିଶ୍ଚିତ କରନ୍ତୁ |"
         ]
      },
      "poultry": {
         "advisory": [
            "ଦୟାକରି ବର୍ଷା ଦିନରେ କୁକୁଡ଼ା ଘରର ଛିଦ୍ର ଏବଂ ଫାଟକୁ ପୂରଣ କରିବା ନିଶ୍ଚିତ କରନ୍ତୁ ନଚେତ୍ ଏହା ସାପ ଏବଂ ସରୀସୃପ ପ୍ରବେଶକୁ ସହଜ କରିବ, ଯାହା ପକ୍ଷୀମାନଙ୍କୁ ମାରିପାରେ |"
         ]
      }
   },
   "date": "10-09-2024"
}