{
   "weather_details": {
      "11-12-2024": {
         "rainfall": 0,
         "t_max": 31,
         "t_min": 17,
         "rh_max": 85,
         "rh_min": 35,
         "wind_speed": 1,
         "wind_direction": 90,
         "cloud_cover": 4
      },
      "12-12-2024": {
         "rainfall": 0,
         "t_max": 31,
         "t_min": 16,
         "rh_max": 68,
         "rh_min": 31,
         "wind_speed": 1,
         "wind_direction": 45,
         "cloud_cover": 2
      },
      "13-12-2024": {
         "rainfall": 0,
         "t_max": 30,
         "t_min": 15,
         "rh_max": 68,
         "rh_min": 28,
         "wind_speed": 1,
         "wind_direction": 108,
         "cloud_cover": 1
      },
      "14-12-2024": {
         "rainfall": 0,
         "t_max": 29,
         "t_min": 15,
         "rh_max": 63,
         "rh_min": 25,
         "wind_speed": 1,
         "wind_direction": 0,
         "cloud_cover": 0
      },
      "15-12-2024": {
         "rainfall": 0,
         "t_max": 29,
         "t_min": 14,
         "rh_max": 63,
         "rh_min": 22,
         "wind_speed": 1,
         "wind_direction": 63,
         "cloud_cover": 0
      }
   },
   "names_of_crops": [
      "ଧାନ।",
      "କପା",
      "ଅରହର",
      "ଗ୍ରୀନଗ୍ରାମ",
      "କଳା ଗ୍ରାମ",
      "ଚିନାବାଦାମ",
      "ସୋରିଷ ଏବଂ ତୋରିଆ",
      "ସୂର୍ଯ୍ୟମୁଖୀ",
      "ରସୁଣ",
      "ଫୁଲକୋବି ଏବଂ ବନ୍ଧାକୋବି",
      "ଟମାଟୋ",
      "ଗୋଲାପ।",
      "ମେରିଗୋଲ୍ଡ",
      "ଗୋରୁ ଏବଂ ମଇଁଷି",
      "ଛେଳି।",
      "କୁକୁଡ଼ା ମାଂସ"
   ],
   "general_advisory": "ଆଗାମୀ ପାଞ୍ଚ ଦିନ ମଧ୍ୟରେ ଶୁଖିଲା ପାଗ ପୂର୍ବାନୁମାନକୁ ଦୃଷ୍ଟିରେ ରଖି କୃଷକମାନଙ୍କୁ ପରିପକ୍ୱ ଚାଉଳ ଅମଳ ପୁଣି ଆରମ୍ଭ କରିବାକୁ ପରାମର୍ଶ ଦିଆଯାଇଛି। ଖରିଫ ଧାନର ଅବଶିଷ୍ଟାଂଶକୁ କ୍ଷେତରେ ନ ଜଳାଇବାକୁ କୃଷକମାନଙ୍କୁ ପରାମର୍ଶ ଦିଆଯାଇଛି, ବରଂ ଏହାକୁ ହଳ କରି ମାଟିରେ ମିଶାଇବାକୁ ଚେଷ୍ଟା କରନ୍ତୁ। କୁହୁଡ଼ି, ନିମ୍ନ ତାପମାତ୍ରା ଏବଂ ଆର୍ଦ୍ରତା ଚାପରୁ କ୍ଷତିକୁ ରୋକିବା ପାଇଁ, ସକାଳେ ଠିଆ ହୋଇଥିବା ଫସଲ ଏବଂ ପନିପରିବାକୁ ହାଲୁକା ଜଳସେଚନ ପ୍ରଦାନ କରନ୍ତୁ | କମ୍ ତାପମାତ୍ରା କାରଣରୁ କମ୍ ଅଙ୍କୁରୋଦଗମ ଏଡ଼ାଇବା ପାଇଁ ପନିପରିବା ନର୍ସରୀକୁ ପଲିଥିନ୍ ଦ୍ୱାରା ଢାଙ୍କି ଦିଅନ୍ତୁ। ଏହି ଆଗାଛାକୁ ହଟାଇବା ପାଇଁ ପନିପରିବାରେ ଆନ୍ତଃସାଂସ୍କୃତିକ କାର୍ଯ୍ୟକଳାପ କରିବାକୁ କୃଷକମାନଙ୍କୁ ପରାମର୍ଶ ଦିଆଯାଇଛି। ସାରର ସର୍ବୋତ୍ତମ ମାତ୍ରା ପ୍ରୟୋଗ କରିବା ପରେ ଠିକ୍ ସମୟରେ ବୁଣାଯାଇଥିବା ପନିପରିବାରେ ଜଳସେଚନ କରିବା ପାଇଁ ପରାମର୍ଶ ଦିଆଯାଏ। ପଶୁମାନଙ୍କୁ ଏଫ୍. ଏମ୍. ଡି., ବି. କ୍ୟୁ., ଏଚ୍. ଏସ୍., ପିପିଆର୍ ଏବଂ ଛେଳି ପକ୍ସ ବିରୁଦ୍ଧରେ ଟୀକାକରଣ କରନ୍ତୁ।",
   "crops_data": {
      "paddy": {
         "advisory": [
            "ଖରିଫ ଧାନର ଅବଶିଷ୍ଟାଂଶ କ୍ଷେତରେ ନ ଜଳାଇବାକୁ କୃଷକମାନଙ୍କୁ ପରାମର୍ଶ ଦିଆଯାଇଛି କାରଣ ଏହା କେବଳ ପରିବେଶକୁ ପ୍ରଦୂଷିତ କରେ ନାହିଁ ବରଂ ଗୁରୁତର ସ୍ୱାସ୍ଥ୍ୟ (ଶ୍ୱାସକ୍ରିୟା) ସମସ୍ୟା ମଧ୍ୟ ସୃଷ୍ଟି କରେ। ଧାନ ଫସଲର ଅବଶିଷ୍ଟାଂଶକୁ ମାଟିରେ ମିଶାଇବାକୁ କୃଷକମାନଙ୍କୁ ପରାମର୍ଶ ଦିଆଯାଇଛି। ଏହା ମୃତ୍ତିକାର ଉର୍ବରତା ବୃଦ୍ଧି କରିଥାଏ। ମୃତ୍ତିକାର ବାଷ୍ପୀକରଣ ହ୍ରାସ କରିବା ଏବଂ ମୃତ୍ତିକାର ଆର୍ଦ୍ରତା ସଂରକ୍ଷଣ କରିବା ପାଇଁ ଏହାକୁ ମଲ୍ଚିଙ୍ଗ ଭାବେ ବ୍ୟବହାର କରାଯାଇପାରିବ।",
            "ଯଦି 'ମୂଷା/ମୂଷା' ସମସ୍ୟା ଦେଖାଯାଏ, ତେବେ ଫସଲ କ୍ଷେତ ଏବଂ ଆଖପାଖ ଅଞ୍ଚଳରେ ମୂଷା ଗର୍ତ୍ତକୁ ଚିହ୍ନଟ କରନ୍ତୁ | ଆଲୁମିନିୟମ୍ ଫସଫାଇଡ୍ 6 ପ୍ରତିଶତ ଟାବଲେଟ୍ ପ୍ରତି ଗର୍ତ୍ତରେ ଗୋଟିଏ ଟାବଲେଟ୍ (12 ଗ୍ରାମ୍) ରଖି ଗର୍ତ୍ତକୁ କାଦୁଅରେ ବନ୍ଦ କରିଦିଅନ୍ତୁ ଯାହା ମୂଷାଙ୍କୁ ମାରିଦେବ।"
         ]
      },
      "cotton": {
         "advisory": [
            "ଯେତେବେଳେ ବୋଲ୍ ଗୁଡ଼ିକ ସମ୍ପୂର୍ଣ୍ଣ ଭାବେ ଫୁଟିଯାଏ, ସେତେବେଳେ ଉଠାଇବା ଉଚିତ।",
            "ଆର୍ଦ୍ରତାକୁ 8-10% କୁ ହ୍ରାସ କରିବା ପାଇଁ କଂକ୍ରିଟ୍ ଚଟାଣ କିମ୍ବା ତିରପାଲ ଶୀଟ୍ ଉପରେ ବୀଜ କପା ଶୁଖାଇ ଦିଅନ୍ତୁ | ଭଲ ମୂଲ୍ୟ ପାଇବା ପାଇଁ ପ୍ରଥମ ଉଠାଣରୁ ମିଳିଥିବା ବିହନ କପଡ଼ାକୁ ଅଲଗା ଭାବେ ରଖନ୍ତୁ।",
            "ଉତ୍ତମ ଉଦ୍ଭିଦ ବୃଦ୍ଧି ଏବଂ ଶୁଣ୍ଢର ବିକାଶ ପାଇଁ ଏନ. ପି. କେ.-19-19-19 ପରି ତରଳ ସାରର ପତ୍ର ସ୍ପ୍ରେ 20 ଗ୍ରାମ୍/10 ଲିଟର ପାଣିରେ କରାଯିବା ଉଚିତ।",
            "କୌଣସି ନୂତନ କୀଟପତଙ୍ଗ ଏବଂ ରୋଗର ପ୍ରକୋପ ବିଷୟରେ ଜାଣିବା ପାଇଁ ଫସଲର ନିୟମିତ ତଦାରଖ। ଅଧିକ ସୂଚନା ପାଇଁ, ଆଇଏମଡି, ଭୁବନେଶ୍ୱର, Tel.#0674-2596116 ସହିତ ଯୋଗାଯୋଗ କରନ୍ତୁ।"
         ]
      },
      "arhar": {
         "advisory": [
            "ପ୍ରଚଳିତ ପାଣିପାଗ ସ୍ଥିତି ପରବର୍ତ୍ତୀ କୀଟ ଆକ୍ରମଣକୁ ସମର୍ଥନ କରେ | ତେଣୁ, ଆବଶ୍ୟକତା ଅନୁଯାୟୀ ସୁପାରିସ କରାଯାଇଥିବା ନିୟନ୍ତ୍ରଣ ପଦକ୍ଷେପ ଅନୁସରଣ କରାଯିବା ଉଚିତ।",
            "ପୋଡ୍ ବୋରର୍ଃ ନିୟନ୍ତ୍ରଣ ପାଇଁ, ବେନଫୁରାକାର୍ବ 40 ପ୍ରତିଶତ ଇସି @1ଲିଟ୍/ଏସି କିମ୍ବା ଡେଲ୍ଟାମେଥ୍ରିନ୍ 2.8 ପ୍ରତିଶତ ଇସି @200 ମିଲି/ଏସି କିମ୍ବା ସ୍ପିନୋସାଡ୍ 45 ପ୍ରତିଶତ ଏସସି @60 ମିଲି/ଏସି କିମ୍ବା ଫ୍ଲୁବେଣ୍ଡିଆମାଇଡ୍ 39.35% ଏସସି @40 ମିଲି/ଏସି ସହିତ 200 ଲିଟର ପାଣି ମିଶାଇ ଲଗାନ୍ତୁ।",
            "ପୋଡ୍ ସୁକିଙ୍ଗ୍ ବଗ୍ ଏବଂ ଏଫିଡ୍ଃ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ, ଥିୟାମେଥୋକ୍ସାମ୍ 25 ପ୍ରତିଶତ ଡବ୍ଲୁଜି @40 ଗ୍ରାମ୍/ଏସି କିମ୍ବା ଇମିଡାକ୍ଲୋପ୍ରିଡ୍ 17.8% ଏସ୍ଏଲ୍ @60 ମିଲି/ଏକରକୁ 200 ଲିଟର ପାଣି ସହିତ ମିଶାଇ ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "greengram": {
         "advisory": [
            "ଆଗାଛା ପରିଚାଳନାଃ 1-2 ଡିଏଏସରେ 200 ଲିଟର ପାଣି ସହିତ ପେଣ୍ଡିମିତାଲିନ୍ 30 ପ୍ରତିଶତ ଇସି @1.20 ଲିଟର/ଏକର ମିଶାନ୍ତୁ।"
         ]
      },
      "blackgram": {
         "advisory": [
            "ଆଗାଛା ପରିଚାଳନାଃ 1-2 ଡିଏଏସରେ 200 ଲିଟର ପାଣି ସହିତ ପେଣ୍ଡିମିତାଲିନ୍ 30 ପ୍ରତିଶତ ଇସି @1.20 ଲିଟର/ଏକର ମିଶାନ୍ତୁ।"
         ]
      },
      "groundnut": {
         "advisory": [
            "ଆଗାଛା ପରିଚାଳନାଃ 2-3 ଡିଏଏସରେ 200 ଲିଟର ପାଣି ସହିତ 80 ମିଲି/ଏକର ପିଛା ଅକ୍ସିଫ୍ଲୋରଫେନ୍ ଇ. ସି. ଲଗାନ୍ତୁ।",
            "ଇମାଜେଥାପାଇର୍ 10 ପ୍ରତିଶତ ଏସ୍. ଏଲ୍. @3 ମିଲି/ଲିଟର ପାଣି 15 ଡିଏଏସ୍ ମଧ୍ୟରେ ପ୍ରୟୋଗ କରନ୍ତୁ।"
         ]
      },
      "mustard & toria": {
         "advisory": [
            "ଆଗାଛା ପରିଚାଳନାଃ 15-20 ଡି. ଏ. ଏସ୍. ରେ 2 ମିଲି./ଲିଟର ଜଳ ଉଠିବା ପରେ କୁଇଜାଲୋଫପ୍-ଇଥାଇଲ 5 ପ୍ରତିଶତ ଇ. ସି. ଲଗାନ୍ତୁ।",
            "3-ସପ୍ତାହ ପର୍ଯ୍ୟାୟରେ ସାର ପ୍ରୟୋଗ (ୟୁରିଆ @35-40 କେଜି/ଏସି + ଏମଓପି @10 କେଜି/ଏସି) ଏବଂ ଜଳସେଚନ ଭଳି ଆନ୍ତଃସାଂସ୍କୃତିକ କାର୍ଯ୍ୟ ହାତକୁ ନିଅନ୍ତୁ।"
         ]
      },
      "sunflower": {
         "advisory": [
            "3-ସପ୍ତାହ ପର୍ଯ୍ୟାୟରେ ପ୍ରଥମ ଉପର ଡ୍ରେସିଂ (ୟୁରିଆ @6-10 କେଜି/ଏସି) ଏବଂ ଜଳସେଚନ ଭଳି ଆନ୍ତଃସାଂସ୍କୃତିକ କାର୍ଯ୍ୟକଳାପ ଆରମ୍ଭ କରନ୍ତୁ।",
            "ଶୋଷକ କୀଟ କମ୍ପ୍ଲେକ୍ସ (ଏଫିଡ୍, ହପର୍, ଥ୍ରିପ୍ସ ଏବଂ ହ୍ୱାଇଟ୍ଫ୍ଲାଇ): ପ୍ରଚଳିତ ପାଣିପାଗ ସ୍ଥିତି ଶୋଷକ କୀଟଗୁଡ଼ିକର ବିକାଶକୁ ସମର୍ଥନ କରେ | ଏସିଟାମିପ୍ରିଡ୍ 20 ପ୍ରତିଶତ ଏସ. ପି. @50 ଗ୍ରାମ/ଏକର କିମ୍ବା ଇମିଡାକ୍ଲୋପ୍ରିଡ୍ 17.8% ଏସ. ଏଲ. @60 ମିଲି/ଏକରକୁ 200 ଲିଟର ପାଣି ସହିତ ମିଶାଇ ଆବଶ୍ୟକ ଅନୁଯାୟୀ ସ୍ପ୍ରେ କରିବା ପାଇଁ ପରାମର୍ଶ ଦିଆଯାଇଛି।"
         ]
      },
      "onion": {
         "advisory": [
            "କୀଟ ପରିଚାଳନାଃ",
            "ଡେମ୍ପିଂ ଅଫ୍ଃ ଡେମ୍ପିଂ ଅଫ୍ କରିବାର ଏକ ପ୍ରତିଷେଧକ ପଦକ୍ଷେପ ଭାବରେ ପନ୍ଦର ଦିନ ବ୍ୟବଧାନରେ ବାଭିଷ୍ଟିନ୍ କିମ୍ବା ଥିରାମ୍ @2 ଗ୍ରାମ୍/ଲିଟର ପାଣି ପ୍ରୟୋଗ କରିବାକୁ ସୁପାରିଶ କରାଯାଏ |"
         ]
      },
      "cauliflower & cabbage": {
         "advisory": [
            "କୀଟ ପରିଚାଳନାଃ",
            "ଡିମଣ୍ଡ ବ୍ୟାକ୍ ମଥ୍ଃ ଜୈବ କୀଟନାଶକ ଆଜାଦିରାକ୍ଟିନ 0.03% (300 ପିପିଏମ୍) ଲିଟର ପିଛା 5 ମିଲି ପାଣି କିମ୍ବା ବିଉଭେରିଆ ବାସିଆନା 5 ପ୍ରତିଶତ ଡବ୍ଲ୍ୟୁ. ପି. ଲିଟର ପିଛା 800 ଗ୍ରାମ ପାଣି ସହିତ 200 ଲିଟର ପାଣି ମିଶାଇ ସ୍ପ୍ରେ କରନ୍ତୁ। ରାସାୟନିକ ନିୟନ୍ତ୍ରଣ ପାଇଁ, ଫାଇପ୍ରୋନିଲ୍ 5 ପ୍ରତିଶତ ଏସ୍. ସି. @2 ମିଲି/ଲିଟର କିମ୍ବା କ୍ଲୋରପାଇରିଫସ୍ 20 ପ୍ରତିଶତ ଇ. ସି. @4 ମିଲି/ଲିଟର ପାଣି ସିଞ୍ଚନ କରନ୍ତୁ।",
            "ତମାଖୁ ପତ୍ର ଖାଉଥିବା କ୍ୟାଟର୍ପିଲାର୍ଃ ସାଇଣ୍ଟ୍ରାନିଲିପ୍ରୋଲ୍ 10.26% ଓଡି @6 ମିଲି/5 ଲିଟର ପାଣି ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "tomato": {
         "advisory": [
            "ଉଚ୍ଚ ଆର୍ଦ୍ର ଅବସ୍ଥାକୁ ଦୃଷ୍ଟିରେ ରଖି ଏହି ପର୍ଯ୍ୟାୟରେ ଶୁଷ୍କତା ଘଟିପାରେ। ଯଦି ଲକ୍ଷଣ ଦେଖାଯାଏ, ତେବେ ମାନକୋଜେବ୍ 75 ପ୍ରତିଶତ ଡବ୍ଲ୍ୟୁ. ପି. @2 ଗ୍ରାମ/ଲିଟର ପାଣି ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "rose": {
         "advisory": [
            "ବ୍ଲାକ୍ ସ୍ପଟ୍ଃ ପ୍ରଚଳିତ ପାଣିପାଗ ସ୍ଥିତି ବ୍ଲାକ୍ ସ୍ପଟ୍ ରୋଗ ପାଇଁ ଅନୁକୂଳ | ନିୟନ୍ତ୍ରଣ ପାଇଁ, କପର୍ ଅକ୍ସିକ୍ଲୋରାଇଡ୍ 50 ପ୍ରତିଶତ ଡବ୍ଲ୍ୟୁ. ପି. @3 ଗ୍ରାମ୍/ଲିଟର ପାଣି ସିଞ୍ଚନ କରନ୍ତୁ।"
         ]
      },
      "merigold": {
         "advisory": [
            "ଫୁଲ ଏବଂ କଳ ସଙ୍କୁଚିତଃ ବର୍ତ୍ତମାନର ପାଣିପାଗ ସ୍ଥିତିରେ ଫୁଲ ଏବଂ କଳ ସଙ୍କୁଚିତ ହୋଇପାରେ। ନିୟନ୍ତ୍ରଣ ପଦକ୍ଷେପ ସ୍ୱରୂପ ମାନକୋଜେବ୍ 75 ପ୍ରତିଶତ ଡବ୍ଲ୍ୟୁ. ପି. @2 ଗ୍ରାମ/ଲିଟର ପାଣି ସିଞ୍ଚନ କରନ୍ତୁ।"
         ]
      },
      "cattle & buffalo": {
         "advisory": [
            "କୃଷକମାନଙ୍କୁ ଅନୁରୋଧ କରାଯାଇଛି ଯେ ସେମାନେ ଏନ୍. ଏ. ଡି. ସି. ପି. ଜରିଆରେ ସେମାନଙ୍କ ଗୋରୁ ଏବଂ ମଇଁଷିକୁ ଏଫ୍. ଏମ୍. ଡି. ଟିକା ଦିଅନ୍ତୁ। କୃଷକମାନେ ପାଦ ଏବଂ ମୁଖ ରୋଗ (ଏଫ୍. ଏମ୍. ଡି.) କୁ ନିୟନ୍ତ୍ରଣ ଏବଂ ପ୍ରତିରୋଧ କରି ଦୁଗ୍ଧ ଉତ୍ପାଦନ ବୃଦ୍ଧି କରିପାରିବେ।",
            "4-8 ମାସ ବୟସର ବାଛୁରୀମାନଙ୍କୁ ବ୍ରୁସେଲୋସିସ୍ ବିରୁଦ୍ଧରେ ଟୀକାକରଣ କରାଯିବା ଉଚିତ୍।"
         ]
      },
      "goat": {
         "advisory": [
            "ଥଣ୍ଡା ପବନ ଏବଂ ଆର୍ଦ୍ର ଚଟାଣରୁ ଛେଳିଙ୍କୁ ରକ୍ଷା କରନ୍ତୁ।"
         ]
      },
      "poultry": {
         "advisory": [
            "ମୃତ୍ୟୁ ହାର ହ୍ରାସ କରିବା ପାଇଁ ବିଶେଷ କରି ରାତି ସମୟରେ ଛୁଆମାନଙ୍କୁ ଉତ୍ତାପ ଯୋଗାଇବା ପାଇଁ ଆବଶ୍ୟକ ବ୍ୟବସ୍ଥା କରନ୍ତୁ। ଛୁଆମାନଙ୍କ ପାଇଁ ଉପଯୁକ୍ତ ପ୍ରଜନନ ବ୍ୟବସ୍ଥା କରନ୍ତୁ। କୁକୁଡ଼ା ଘରକୁ ସଫା ରଖନ୍ତୁ ଏବଂ କ୍ଲାମ୍ପ ମୁକ୍ତ ରଖନ୍ତୁ |"
         ]
      }
   },
   "date": "10-12-2024"
}