{
   "weather_details": {
      "2024-12-10": {
         "rainfall": 0,
         "t_max": 25,
         "t_min": 15,
         "rh_max": 86,
         "rh_min": 43,
         "wind_speed": 3,
         "wind_direction": 348,
         "cloud_cover": 3
      },
      "2024-12-12": {
         "rainfall": 0,
         "t_max": 24,
         "t_min": 13,
         "rh_max": 68,
         "rh_min": 33,
         "wind_speed": 4,
         "wind_direction": 349,
         "cloud_cover": 1
      },
      "2024-12-13": {
         "rainfall": 0,
         "t_max": 25,
         "t_min": 12,
         "rh_max": 63,
         "rh_min": 28,
         "wind_speed": 4,
         "wind_direction": 345,
         "cloud_cover": 0
      },
      "2024-12-14": {
         "rainfall": 0,
         "t_max": 25,
         "t_min": 12,
         "rh_max": 55,
         "rh_min": 25,
         "wind_speed": 5,
         "wind_direction": 352,
         "cloud_cover": 1
      },
      "2024-12-15": {
         "rainfall": 0,
         "t_max": 25,
         "t_min": 11,
         "rh_max": 55,
         "rh_min": 24,
         "wind_speed": 6,
         "wind_direction": 349,
         "cloud_cover": 0
      }
   },
   "names_of_crops": [
      "ଚାଉଳ",
      "ସୋରିଷ",
      "ସବୁଜ ଚଣା",
      "ଅମରନ୍ଥ",
      "ସୂର୍ଯ୍ୟମୁଖୀ",
      "ଫୁଲକୋବି",
      "ରସୁଣ",
      "ଟମାଟୋ",
      "ବାଇଗଣ",
      "ମାରିଗୋଲ୍ଡ",
      "ବଗିଚା ମଟର",
      "କଦଳୀ",
      "ଗାଈ।",
      "ମଧୁର ଜଳ।"
   ],
   "general_advisory": "ଯଦି ଧାନ ଅମଳ ଶେଷ ହୋଇଯାଏ, ତେବେ ଏହାକୁ ସଂଗ୍ରହ କରି ସୁରକ୍ଷିତ ସ୍ଥାନରେ ରଖିବା ଉଚିତ। କ୍ଷେତରେ ଜଳ ନିଷ୍କାସନ ପାଇଁ ସୁବିଧା କରନ୍ତୁ। ଯଦି ପ୍ରାରମ୍ଭିକ ପ୍ରତିରୋପଣ କରାଯାଇଥିବା ପନିପରିବା ଫସଲରେ ୱିଲ୍ଟ ରୋଗ ଦେଖାଯାଏ, ତେବେ ମାଟି ଏବଂ ମୂଳ ଅଞ୍ଚଳକୁ 1.5 ଗ୍ରାମ ଷ୍ଟ୍ରେପ୍ଟୋସାଇକ୍ଲିନ ଏବଂ 25 ଗ୍ରାମ କପର ଅକ୍ସିକ୍ଲୋରାଇଡର ମିଶ୍ରଣରେ 10 ଲିଟର ପାଣିରେ ମିଶାଇ ଭିଜାଇ ଦିଅନ୍ତୁ। ଭଲ ସଂରକ୍ଷଣ ପାଇଁ ବର୍ଷାଜନିତ ଅମଳ ହୋଇଥିବା ଧାନକୁ ସୂର୍ଯ୍ୟକିରଣ ତଳେ ଶୁଖାଇ ଦିଅନ୍ତୁ। ଫସଲ ଅମଳ କରିବାର 15 ଦିନ ପୂର୍ବରୁ ଧାନ କ୍ଷେତରୁ ପାଣି ବାହାର କରନ୍ତୁ। ଶାରୀରିକ ପରିପକ୍ୱତା ସମୟରେ ଧାନ ଫସଲ ଅମଳ କରନ୍ତୁ (85 ପ୍ରତିଶତ ଶସ୍ୟ ଏକ ଗଣ୍ଠିରେ ପରିପକ୍ୱ ହୋଇଥାଏ) ଏବଂ ଏହା ଫିକା ହଳଦିଆ ରଙ୍ଗର ଦେଖାଯାଏ। ଯଦି ଶସ୍ୟକୁ ବୀଜ ଉଦ୍ଦେଶ୍ୟରେ ରଖିବାକୁ ହେବ, ତେବେ ବନ୍ଧଠାରୁ ଏକ ମିଟର ଦୂରରେ ରଖି ଫସଲ ଅମଳ କରନ୍ତୁ। ଅମଳ ହୋଇଥିବା ସାମଗ୍ରୀକୁ ସୁରକ୍ଷିତ ସ୍ଥାନରେ ରଖନ୍ତୁ।",
   "crops_data": {
      "rice": {
         "advisory": [
            "85 ପ୍ରତିଶତ ଶସ୍ୟ ପରିପକ୍ୱ ହେଲେ ଧାନ ଅମଳ କରନ୍ତୁ। ଅମଳ ହୋଇଥିବା ସାମଗ୍ରୀକୁ ସୁରକ୍ଷିତ ସ୍ଥାନରେ ରଖନ୍ତୁ। ଛିଡ଼ା ହୋଇଥିବା ଧାନ ଫସଲରୁ ବର୍ଷାଜଳ ବାହାର କରିବା ପାଇଁ ଗଲି (ପାହି) ତିଆରି କରିବା ଏବଂ ନର୍ଦ୍ଦମାର ଶେଷ ଭାଗକୁ ଖୋଲା ରଖିବା ବ୍ୟବସ୍ଥା କରନ୍ତୁ। ଅମଳ ହୋଇଥିବା ଧାନକୁ କ୍ଷେତରେ ରଖନ୍ତୁ ନାହିଁ। ଯଦି ଧାନ ରଖାଯାଏ, ତେବେ ତାହାକୁ କ୍ଷେତରେ ଠିଆ ଅବସ୍ଥାରେ ଏକାଠି ବାନ୍ଧି ରଖିବା ଉଚିତ।"
         ]
      },
      "mustard": {
         "advisory": [
            "ରବି ସୋରିଷ ବୁଣିବା ପାଇଁ ସର୍ବୋତ୍ତମ ସମୟ ଆସିଛି, ଟି-9, ପିଟି-303, ନିର୍ମଳ କଳା ସୁନା, ଉତ୍ତ୍ରା ଏବଂ ଲାଇନ ବୁଣିବା ପାଇଁ 3 ରୁ 5 କିଲୋଗ୍ରାମ ମଞ୍ଜି ବ୍ୟବହାର କରନ୍ତୁ। 1 କିଲୋଗ୍ରାମ ମଞ୍ଜି ପିଛା 3 ଗ୍ରାମ କ୍ୟାପଟାନ କିମ୍ବା ଥିରାମ ବ୍ୟବହାର କରନ୍ତୁ। ବିଳମ୍ବରେ ବୁଣାଯାଇଥିବା କିସମର ମଧ୍ୟରେ 20 * 10 ସେ. ମି. ଏବଂ ଶୀଘ୍ର ବୁଣାଯାଇଥିବା କିସମର ମଧ୍ୟରେ 30 * 10 ସେ. ମି. ବ୍ୟବଧାନ ଦିଅନ୍ତୁ।"
         ]
      },
      "green gram": {
         "advisory": [
            "ବୁଣିବା ପୂର୍ବରୁ ଏକ ସପ୍ତାହ ପୂର୍ବରୁ ମଞ୍ଜିଗୁଡ଼ିକୁ କାର୍ବେନଡାଜିମ୍ 50 ପ୍ରତିଶତ ଡବ୍ଲ୍ୟୁ. ପି. @2-ଗ୍ରାମ୍/କି. ଗ୍ରା. ମଞ୍ଜି କିମ୍ବା କାର୍ବୋକ୍ସିନ୍ 37.5% + ଥିରମ୍ 37.5% ଡି. ଏସ୍. @3-ଗ୍ରାମ୍/କି. ଗ୍ରା. ମଞ୍ଜି ବ୍ୟବହାର କରନ୍ତୁ। ବୁଣିବା ପୂର୍ବରୁ, ପ୍ରତି କିଲୋଗ୍ରାମରେ 20 ଗ୍ରାମ୍ ମଞ୍ଜି ସହିତ ରାଇଜୋବିୟମ୍ ସଂସ୍କୃତି ସହିତ ମଞ୍ଜି ଉପଚାର କରନ୍ତୁ। ଶେଷ ହଳ କରିବା ସମୟରେ 2 ଟନ୍ ଏଫ୍. ୱାଇ. ଏମ୍. କିମ୍ବା କମ୍ପୋଷ୍ଟ ସହିତ ଏକର ପିଛା 35 କି. ଗ୍ରା. ଡିଏ. ପି., 13 କି. ଗ୍ରା. ଏମ୍. ଓ. ପି., 4 କି. ଗ୍ରା. ୟୁରିଆ ମୂଳ ସାର ଭାବେ ପ୍ରୟୋଗ କରନ୍ତୁ।"
         ]
      },
      "amaranth": {
         "advisory": [
            "ଅକ୍ଟୋବରରୁ ମାର୍ଚ୍ଚ ମାସ ସବୁଜିମା ଅମାରାନ୍ଥ ପାଇଁ ଉପଯୁକ୍ତ। ଅମରନ୍ଥ ଦୁଇ ପ୍ରକାରର-ଧଳା କିମ୍ବା ଲାଲ | ଏକର ପିଛା 3 କି. ଗ୍ରା. ମଞ୍ଜି ବ୍ୟବହାର କରନ୍ତୁ। 4 ଫୁଟ ଚଉଡ଼ା ବିଶିଷ୍ଟ 5 ଫୁଟ ଲମ୍ବ ଶଯ୍ୟାକୁ ବନ୍ଧ ସହିତ ବିଛାନ୍ତୁ। ଶଯ୍ୟାକୁ ଫୁଲାଇ ଦିଅନ୍ତୁ, ଆଗାଛା ବାହାର କରନ୍ତୁ ଏବଂ 1 ରୁ 2 ଝୁଡ଼ି ଏଫ୍. ଆଇ. ଏମ୍./ଶଯ୍ୟା ଲଗାନ୍ତୁ। ଛୋଟ ଆକାରର ମଞ୍ଜି ଥିବାରୁ, ସହଜ ଏବଂ ସମାନ ବୁଣିବା ପାଇଁ ମଞ୍ଜି ସହିତ କିଛି ମୋଟା ବାଲି ମିଶାନ୍ତୁ। ବୁଣିବା ପରେ ମଞ୍ଜିଗୁଡ଼ିକୁ ମାଟିର ପତଳା ସ୍ତର ଦ୍ୱାରା ଆଚ୍ଛାଦିତ କରନ୍ତୁ ଏବଂ ହାଲୁକା ଜଳସେଚନ ପରେ ଏହାକୁ ନଡ଼ିଆ ଦ୍ୱାରା ଆଚ୍ଛାଦିତ କରନ୍ତୁ। ନଡ଼ିଆ ବାହାରିବା ପରେ ତାକୁ ବାହାର କରିଦିଅନ୍ତୁ।"
         ]
      },
      "sunflower": {
         "advisory": [
            "ସୂର୍ଯ୍ୟମୁଖୀ ଏକ ଲାଭଜନକ ରବି ତୈଳବୀଜ ଫସଲ। ଏବେ ସୂର୍ଯ୍ୟମୁଖୀ ବୁଣିବା ପାଇଁ ସର୍ବୋତ୍ତମ ସମୟ। ମର୍ଡେନ୍, ସନ୍ରାଇଜ୍, ସୂର୍ଯ୍ୟ ଭଳି ଅଧିକ ଉତ୍ପାଦନକ୍ଷମ କିସମ ଏବଂ କେ. ବି. ଏସ୍. ଏଚ୍.-1, କେ. ବି. ଏସ୍. ଏଚ୍.-3 ଏବଂ ଏମ୍. ଏସ୍. ଏଫ୍. ଏଚ୍. ଭଳି ହାଇବ୍ରିଡ୍ କିସମ ଚାଷ କରନ୍ତୁ। ଅଧିକ ଉତ୍ପାଦନକ୍ଷମ କିସମ ପାଇଁ ଏକର ପିଛା 4 କି. ଗ୍ରା. ମଞ୍ଜି, ଜଳସେଚିତ ଅବସ୍ଥା ପାଇଁ 3 କି. ଗ୍ରା., ଜଳସେଚିତ ଅବସ୍ଥା ପାଇଁ ଏକର ପିଛା 1 କି. ଗ୍ରା. ମଞ୍ଜି, ଏବଂ ଜଳସେଚିତ ଅବସ୍ଥା ପାଇଁ ଏକର ପିଛା 2 କି. ଗ୍ରା. ମଞ୍ଜି ବ୍ୟବହାର କରନ୍ତୁ। ବୁଣିବା ପୂର୍ବରୁ ମଞ୍ଜିଗୁଡ଼ିକୁ 2 ଗ୍ରାମ୍ କାର୍ବେନଡାଜିମ୍/କି. ଗ୍ରା. ମଞ୍ଜି ସହିତ ଉପଚାର କରନ୍ତୁ। ଫସଲକୁ ଫଙ୍ଗାଲ୍ ୱିଲ୍ଟରୁ ରକ୍ଷା କରିବା ପାଇଁ, 4 ଗ୍ରାମ୍ ଟ୍ରାଇକୋଡର୍ମା/କେଜି ସହିତ ମଞ୍ଜି ଉପଚାର କରନ୍ତୁ | ଉତ୍ତମ ଅଙ୍କୁରୋଦଗମ ପାଇଁ ମଞ୍ଜିଗୁଡ଼ିକୁ 10-12 ଘଣ୍ଟା ପର୍ଯ୍ୟନ୍ତ ଭିଜାଇ ରଖନ୍ତୁ। ପାଣି ବାହାର କରିବା ପରେ ଏକର ପିଛା 600 ଗ୍ରାମ୍ ପି. ଏସ୍. ବି. ଚାଷ ବ୍ୟବହାର କରନ୍ତୁ। ଅଧିକ ଉତ୍ପାଦନକାରୀ କିସମ ପାଇଁ ଏକର ପିଛା 8:16:12 କେଜି NPK ସହିତ 2 ଟନ୍ FYM ପ୍ରୟୋଗ କରନ୍ତୁ ଏବଂ ବୁଣିବା ପୂର୍ବରୁ ହାଇବ୍ରିଡ୍ ଭାରିଆଣ୍ଟି ପାଇଁ ଏହାର ଦ୍ୱିଗୁଣିତ କରନ୍ତୁ। ଦୋଆଁଶ ମାଟି ପାଇଁ 45 ସେ. ମି. ଏବଂ ଦୋଆଁଶ ମାଟି ପାଇଁ 60 ସେ. ମି. ବ୍ୟବଧାନ ରଖି 30 ସେ. ମି. ବ୍ୟବଧାନରେ ମଞ୍ଜି ବୁଣନ୍ତୁ।"
         ]
      },
      "cauliflower": {
         "advisory": [
            "ଏକର ପିଛା 25 କିଲୋଗ୍ରାମ ୟୁରିଆ ପ୍ରୟୋଗ କରନ୍ତୁ ଏବଂ 15-20 DAT ରେ ହାତ କାଟିବା ଏବଂ ଏକର ପିଛା 25 କିଲୋଗ୍ରାମ ୟୁରିଆ ଏବଂ 25 କିଲୋଗ୍ରାମ ଏମଓପିକୁ 30-35 DAT ରେ ଶେଷ ଟପ୍ ଡ୍ରେସିଂ ସାର ଭାବରେ ପ୍ରୟୋଗ କରନ୍ତୁ। ଯଦି ଚାରା ରୋପଣ ସମୟରେ ବୋରାକ୍ସ ପ୍ରୟୋଗ କରାଯାଇନଥାଏ, ତେବେ ବୋରାକ୍ସ ସ୍ପ୍ରେ @4 କେଜି/ଏକର କିମ୍ବା ଫୋଲିବୋର/ସଲ୍ୟୁବର ସ୍ପ୍ରେ @1.5 ଗ୍ରାମ/ଲିଟର। ପ୍ରତିରୋପଣର ଦୁଇ ସପ୍ତାହ ପରେ ଏବଂ ଦହି ତିଆରି ହେବାର ଦୁଇ ସପ୍ତାହ ପୂର୍ବରୁ ବୋରନ ମାଇକ୍ରୋ ନ୍ୟୁଟ୍ରିଏଣ୍ଟ ସିଞ୍ଚନ କରାଯିବା ଉଚିତ।"
         ]
      },
      "onion": {
         "advisory": [
            "ଅଗ୍ରିଫାଉଣ୍ଡ୍ ଲାଇଟ୍ ରେଡ୍, ଅଗ୍ରିଫାଉଣ୍ଡ୍ ଡାର୍କ ରେଡ୍, ଭୀମ ଶକ୍ତି, ଭୀମ ସୁପର, ଅର୍କ ନିକେତନ୍ ଇତ୍ୟାଦି ଶୀତ ଋତୁରେ ଆମ ଓଡ଼ିଶା ସ୍ଥିତି ପାଇଁ ଉପଯୁକ୍ତ | ଏକ ଏକର ଜମିରେ ହେଉଥିବା ପିଆଜର ଚାଷ ପାଇଁ 4 କିଲୋଗ୍ରାମ ମଞ୍ଜି ଆବଶ୍ୟକ ହୋଇଥାଏ। ବୁଣିବା ପୂର୍ବରୁ, ପ୍ରତି କିଲୋଗ୍ରାମ ମଞ୍ଜି ପିଛା କାର୍ବେନଡାଜିମ୍ 50 ପ୍ରତିଶତ ଡବ୍ଲ୍ୟୁ. ପି. @2-ଗ୍ରାମ୍ କିମ୍ବା କାର୍ବୋକ୍ସିନ୍ 37.5% + ଥିରମ୍ 37.5% ଡି. ଏସ୍. @3-ଗ୍ରାମ୍/କିଲୋଗ୍ରାମ ମଞ୍ଜି ବ୍ୟବହାର କରି ମଞ୍ଜି ଚିକିତ୍ସା କରାଯିବା ଉଚିତ। ନର୍ସରୀରେ ଏଫ୍ ରୋଗକୁ ହ୍ରାସ କରିବା ରୋକିବା ପାଇଁ, ନର୍ସରୀ ଶଯ୍ୟାକୁ 15 ଦିନ ବ୍ୟବଧାନରେ କାର୍ବେନଡାଜିମ୍ @2-ଗ୍ରାମ୍/ଲିଟର ପାଣିରେ ଭିଜାଇ ଦିଅନ୍ତୁ। 8 ସପ୍ତାହ ପୁରୁଣା ଚାରା ମୁଖ୍ୟ କ୍ଷେତରେ ରୋପଣ କରାଯାଏ |"
         ]
      },
      "tomato": {
         "advisory": [
            "ଟମାଟୋ ପାଇଁ 30 କି. ଗ୍ରା. ୟୁରିଆ ଏବଂ 20 କି. ଗ୍ରା. ମ୍ୟୁରେଟ ଅଫ ପୋଟାଶକୁ ହୋଇଂ ପରେ ଲଗାନ୍ତୁ ଏବଂ 20-25 DAT ରେ ହାତ କାଟି ଦିଅନ୍ତୁ ଏବଂ ଅବଶିଷ୍ଟ 30 କି. ଗ୍ରା. ୟୁରିଆ 40-45 DAT ରେ ଲଗାନ୍ତୁ। ଉତ୍ତମ ଉତ୍ପାଦନ ପାଇଁ 45 ଡିଏଟି ପରେ 10-15 ଦିନ ବ୍ୟବଧାନରେ ମାଇକ୍ରୋ ନ୍ୟୁଟ୍ରିଏଣ୍ଟ @3-ଗ୍ରାମ୍/ଲିଟରର ମିଶ୍ରଣକୁ ଦୁଇରୁ ତିନି ଥର ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "brinjal": {
         "advisory": [
            "ବାଇଗଣରେ ଫୋମୋପ୍ସିସ୍ ବ୍ଲାଇଟ୍ ରୋଗକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ ମେଟାଲାକ୍ସିଲ୍ 8 ପ୍ରତିଶତ + ମାନକୋଜେବ୍ 64 ପ୍ରତିଶତ ଡବ୍ଲ୍ୟୁ. ପି. @400 ଗ୍ରାମ/ଏକର କିମ୍ବା ପ୍ରୋପିନେବ୍ 70 ପ୍ରତିଶତ ଡବ୍ଲ୍ୟୁ. ପି. @400 ଗ୍ରାମ/ଏକର ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "marigold": {
         "advisory": [
            "ମାରିଗୋଲ୍ଡ ଏବଂ ଗୋଲାପ ପରି ଫୁଲରେ ରେଡ୍ ସ୍ପାଇଡର ମାଇଟ୍କୁ ପରିଚାଳନା କରିବା ପାଇଁ 80 ପ୍ରତିଶତ ୱେଟେବଲ୍ ସଲଫର୍ (ସଲଫେକ୍ସ/ବଲୱାନ/ସଲଫାଡେକ୍ସ) @2 ଗ୍ରାମ/ଲିଟର ପାଣି କିମ୍ବା ପ୍ରୋପାର୍ଜାଇଟ୍ 57 ପ୍ରତିଶତ ଇସି (ଓମାଇଟ୍/ମାଇଟକିଲ/ସୁପର ଡାଇନାମାଇଟ୍) @2 ମିଲି/ଲିଟର ପାଣି କିମ୍ବା ଫେନପାଇରୋକ୍ସିମେଟ୍ 5 ପ୍ରତିଶତ ଇସି (ସିଗେଟ/ମିଟିଗେଟ/ଫର୍ମାଇଟ୍) @2 ମିଲି/ଲିଟର ପାଣି ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "garden pea": {
         "advisory": [
            "ଏବେ ଅନୁର୍ବର ଉଚ୍ଚଭୂମିରେ ସବୁଜ ମଟର ବୁଣିବା ପାଇଁ ଏହା ସର୍ବୋତ୍ତମ ସମୟ। ଓଡ଼ିଶା ପାଇଁ ଉପଯୁକ୍ତ ଉଚ୍ଚ ଉତ୍ପାଦନକାରୀ କିସମ ଯେପରିକି ରଚନା, ଆର୍କେଲ ଏବଂ ଟି-163 ଏକର ପିଛା 25-30 କିଲୋଗ୍ରାମ ମଞ୍ଜି ବ୍ୟବହାର କରନ୍ତୁ। ମଞ୍ଜି ବୁଣିବା ପୂର୍ବରୁ 2 ଗ୍ରାମ୍ କାର୍ବେନଡାଜିମ୍/କିଲୋଗ୍ରାମ ମଞ୍ଜି ବ୍ୟବହାର କରି ଚିକିତ୍ସା କରାଯାଏ। ଚୂଡ଼ାନ୍ତ ଜମି ପ୍ରସ୍ତୁତି ସମୟରେ ଏକର ପିଛା 10:16:10 କେଜି ଏନ. ପି. କେ. ଲଗାନ୍ତୁ। ଗଛ ଲଗାଇବା ପାଇଁ 10 ସେ. ମି. ଦୂରତା ସହିତ 30 ସେ. ମି. ବ୍ୟବଧାନରେ ମଞ୍ଜି ବୁଣନ୍ତୁ।"
         ]
      },
      "pumpkin": {
         "advisory": [
            "କାକୁଡ଼ିରେ ଫଳ ମାଛି ପରିଚାଳନା କରିବା ପାଇଁ, 4 ଲିଟର ପାଣିରେ 400-ଗ୍ରାମ ଗୁଡ଼ ଏବଂ 8-ମିଲି ମାଲାଥିଅନ୍ କିମ୍ବା ଡି. ଡି. ଭି. ପି. ମିଶାଇ ଏକ ବିଷାକ୍ତ ଚାରା ପ୍ରସ୍ତୁତ କରନ୍ତୁ। ଏହି ମିଶ୍ରଣକୁ ପ୍ଲାଷ୍ଟିକ୍ କପ୍ କିମ୍ବା ମାଟି ପାତ୍ରରେ ରଖନ୍ତୁ @80-ସଂଖ୍ୟା/ଏକର। ଫଳ ମାଛିମାନେ ଏହା ପ୍ରତି ଆକର୍ଷିତ ହେବେ ଏବଂ ଶେଷରେ ବିଷ ଜାଲରେ ପଡ଼ି ମୃତ୍ୟୁବରଣ କରିବେ।"
         ]
      },
      "cow": {
         "advisory": [
            "ପଶୁମାନଙ୍କୁ ନିୟମିତ ଭାବରେ ଲୁଣ ସହିତ ଖଣିଜ ମିଶ୍ରଣ ଦିଆଯିବା ଉଚିତ ଏବଂ ପଶୁମାନଙ୍କ ଶକ୍ତି ଆବଶ୍ୟକତାକୁ ପୂରଣ କରିବା ପାଇଁ ଶୀତ ଋତୁରେ ଦୈନିକ ରାସନରେ ଗହମ ଶସ୍ୟ, ଗୁଡ଼ ଇତ୍ୟାଦି ଯୋଗାଇ ଦିଆଯାଇପାରେ |"
         ]
      },
      "fresh water": {
         "advisory": [
            "ଶୀତ ଋତୁରେ, ମାଛରେ ବିଭିନ୍ନ ଫଙ୍ଗଲ୍, ବ୍ୟାକ୍ଟେରିଆ ଏବଂ ପରଜୀବୀ ରୋଗ ଦେଖାଯାଇପାରେ | ଶୀତ ଋତୁ ଆରମ୍ଭ ହେବାର ଠିକ୍ ପୂର୍ବରୁ ପୋଖରୀକୁ ସିଫାକ୍ସ @400 ମିଲି/ଏକରରେ ବ୍ୟବହାର କରନ୍ତୁ। ପୋଖରୀରେ ପୋଟାସିୟମ୍ ପର୍ମାଙ୍ଗାନେଟ୍ ପ୍ରତି ଏକର ପିଛା 1 ରୁ 2 କି. ଗ୍ରା. କିମ୍ବା ଚୂନପଥର ପ୍ରତି ଏକର ପିଛା 1 ରୁ 1 କି. ଗ୍ରା. ବ୍ୟବହାର କରନ୍ତୁ। ଏକର ପିଛା 100 କିଲୋଗ୍ରାମ ଲବଣ ପ୍ରୟୋଗ ମଧ୍ୟ ଶୀତ ଋତୁରେ ମାଛମାନଙ୍କୁ ରୋଗ ପ୍ରାଦୁର୍ଭାବରୁ ରକ୍ଷା କରିବାରେ ସାହାଯ୍ୟ କରିଥାଏ।"
         ]
      }
   },
   "date": "10-12-2024"
}