{
   "weather_details": {
      "11/12/2024": {
         "rainfall": 0,
         "t_max": 30,
         "t_min": 20,
         "rh_max": 81,
         "rh_min": 43,
         "wind_speed": 8,
         "wind_direction": 34,
         "cloud_cover": 4
      },
      "12/12/2024": {
         "rainfall": 0,
         "t_max": 30,
         "t_min": 19,
         "rh_max": 71,
         "rh_min": 31,
         "wind_speed": 9,
         "wind_direction": 22,
         "cloud_cover": 3
      }
   },
   "names_of_crops": [
      "ଧାନ।",
      "କଳା ଗ୍ରାମ",
      "ଗ୍ରୀନଗ୍ରାମ",
      "ଚିନାବାଦାମ",
      "ଆଳୁ",
      "ଟମାଟୋ",
      "ବାଇଗଣ",
      "ମାରିଗୋଲ୍ଡ",
      "ମତ୍ସ୍ୟଚାଷ"
   ],
   "general_advisory": "ଧାନଶସ୍ୟକୁ 3ରୁ 4 ଦିନ ପର୍ଯ୍ୟନ୍ତ ସୂର୍ଯ୍ୟକିରଣ ତଳେ ଶୁଖାଇବା ଆବଶ୍ୟକ, ବ୍ୟବହାର ପାଇଁ 14 ପ୍ରତିଶତ ଆର୍ଦ୍ରତା ଏବଂ ବୀଜ ଉଦ୍ଦେଶ୍ୟରେ 12 ପ୍ରତିଶତ ଆର୍ଦ୍ରତା ରହିବା ଆବଶ୍ୟକ। ରାତିର ତାପମାତ୍ରା କମ୍ ଥିବାରୁ ରବି ଫସଲ ଏବଂ ପନିପରିବାରେ ଶୋଷକ କୀଟପତଙ୍ଗ, ପତ୍ର ରୋଗ, ପାଉଡର ଫଙ୍ଗୁର ସଂକ୍ରମଣ ହେବାର ସମ୍ଭାବନା ରହିଛି। ଲକ୍ଷଣଗୁଡ଼ିକ ପାଇଁ ଫସଲ ଏବଂ ପନିପରିବା ଉପରେ ନଜର ରଖନ୍ତୁ ଏବଂ ଉପଯୁକ୍ତ ଉଦ୍ଭିଦ ସୁରକ୍ଷା ପଦକ୍ଷେପ ଗ୍ରହଣ କରନ୍ତୁ। ଶୀତକାଳୀନ ପନିପରିବା ଫସଲର ସମ୍ପୂର୍ଣ୍ଣ ରୋପଣ। କମ୍ ତାପମାତ୍ରା କାରଣରୁ କମ୍ ଅଙ୍କୁରୋଦଗମକୁ ଏଡ଼ାଇବା ପାଇଁ ପନିପରିବା ନର୍ସରୀ ଉପରେ କମ୍ ମୂଲ୍ୟର ପଲିଥିନ୍ କଭର ବ୍ୟବହାର କରନ୍ତୁ। ଏକ ସଫଳ ରାଟୁନ୍ ଫସଲ ପାଇଁ ମାଟି ସ୍ତରରୁ ଏକ ଇଞ୍ଚ ତଳେ ପରିପକ୍ୱ ଚିନି ଅମଳ କରନ୍ତୁ |",
   "crops_data": {
      "paddy": {
         "advisory": [
            "ଅମଳ ପରେ ପର୍ଯ୍ୟାୟଃ ମୂଷା ଅଞ୍ଚଳ-ମୂଷାଙ୍କୁ ମାରିବା ପାଇଁ କାଦୁଅ ସହିତ ଆଲୁମିନିୟମ୍ ଫସଫାଇଡ୍ ରଖନ୍ତୁ |"
         ]
      },
      "blackgram": {
         "advisory": [
            "ଉଦ୍ଭିଦଗତ ପର୍ଯ୍ୟାୟଃ ଏଫିଡ୍-ନିମ୍ବ ଆଧାରିତ କୀଟନାଶକ ସ୍ପ୍ରେ 1500 ପିପିଏମ। ଏହାପରେ ଥାୟାମେଥୋକ୍ସାମ୍ 25 ପ୍ରତିଶତ ଡବ୍ଲୁ. ଜି. କିମ୍ବା ଏସିଟାମିପ୍ରିଡ୍ 20 ପ୍ରତିଶତ ଏସ. ପି. ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "greengram": {
         "advisory": [
            "ଉଦ୍ଭିଦଗତ ପର୍ଯ୍ୟାୟଃ ଏଫିଡ୍-ନିମ୍ବ ଆଧାରିତ କୀଟନାଶକ ସ୍ପ୍ରେ 1500 ପିପିଏମ। ଏହାପରେ ଥାୟାମେଥୋକ୍ସାମ୍ 25 ପ୍ରତିଶତ ଡବ୍ଲୁ. ଜି. କିମ୍ବା ଏସିଟାମିପ୍ରିଡ୍ 20 ପ୍ରତିଶତ ଏସ. ପି. ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "groundnut": {
         "advisory": [
            "ଉଦ୍ଭିଦଗତ ପର୍ଯ୍ୟାୟଃ ତମାଖୁ କ୍ୟାଟରପିଲର-ଫେରୋମୋନ୍ ଫାନ୍ଦ ସ୍ଥାପନ କରନ୍ତୁ ଏବଂ କୀଟନାଶକ ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "potato": {
         "advisory": [
            "ଉଦ୍ଭିଜ୍ଜ ପର୍ଯ୍ୟାୟଃ ହଏଙ୍ଗ୍ ଏବଂ ହାତ ନିରାମୟ, ଉଚ୍ଚ ପାହାଚ, ଏବଂ ଉପଯୁକ୍ତ ଜଳସେଚନ।"
         ]
      },
      "tomato": {
         "advisory": [
            "ଉଦ୍ଭିଦଗତ ପର୍ଯ୍ୟାୟଃ ବିଳମ୍ବରେ ରୋଗ ହୁଏ-ମେଟାଲ୍ୟାକ୍ସିଲ + ମାନକୋଜେବ ସ୍ପ୍ରେ କରନ୍ତୁ। ଅତ୍ୟଧିକ ନାଇଟ୍ରୋଜେନ୍ ସାର ଠାରୁ ଦୂରେଇ ରୁହନ୍ତୁ।"
         ]
      },
      "brinjal": {
         "advisory": [
            "ଉଦ୍ଭିଦ-ଫଳ ଗଠନ ପର୍ଯ୍ୟାୟଃ ଫଳ ଏବଂ ଶୁଟ୍ ବୋରର୍-ନିମ୍ ଆଧାରିତ କୀଟନାଶକ ଏବଂ ବିକଳ୍ପ ସ୍ପ୍ରେ ସ୍ପ୍ରେ କରନ୍ତୁ |"
         ]
      },
      "marigold": {
         "advisory": [
            "ଫୁଲ ପାଇଁ ବନସ୍ପତିଃ ଥ୍ରୀପ୍ସ-ନୀଳ ଚଟପଟା ଜାଲ ଲଗାନ୍ତୁ। ଭୋଜନ ସମ୍ବନ୍ଧୀୟ ତ୍ରୁଟି-ପ୍ରୋଫେନୋଫସ୍ ପ୍ରୟୋଗ କରନ୍ତୁ।"
         ]
      },
      "fisheries": {
         "advisory": [
            "ଶୀତଦିନେ, ମାଛରେ 'ଇ. ୟୁ. ଏସ୍.' ରୋଗ ପାଇଁ ଏକ ପ୍ରତିଷେଧକ ପଦକ୍ଷେପ ଭାବରେ ସିଫ୍ୟାକ୍ସ ଲଗାନ୍ତୁ।"
         ]
      }
   },
   "date": "10-12-2024"
}