{
   "weather_details": {
      "11-12-2024": {
         "rainfall": 0,
         "t_max": 29,
         "t_min": 19,
         "rh_max": 80,
         "rh_min": 43,
         "wind_speed": 10,
         "wind_direction": 17,
         "cloud_cover": 4
      },
      "12-12-2024": {
         "rainfall": 0,
         "t_max": 29,
         "t_min": 18,
         "rh_max": 62,
         "rh_min": 30,
         "wind_speed": 12,
         "wind_direction": 17,
         "cloud_cover": 1
      },
      "13-12-2024": {
         "rainfall": 0,
         "t_max": 29,
         "t_min": 18,
         "rh_max": 59,
         "rh_min": 26,
         "wind_speed": 11,
         "wind_direction": 15,
         "cloud_cover": 0
      },
      "14-12-2024": {
         "rainfall": 0,
         "t_max": 28,
         "t_min": 17,
         "rh_max": 53,
         "rh_min": 24,
         "wind_speed": 12,
         "wind_direction": 18,
         "cloud_cover": 0
      },
      "15-12-2024": {
         "rainfall": 0,
         "t_max": 28,
         "t_min": 17,
         "rh_max": 50,
         "rh_min": 22,
         "wind_speed": 14,
         "wind_direction": 17,
         "cloud_cover": 0
      }
   },
   "names_of_crops": [
      "ଖରିଫ ଚାଉଳ",
      "ସୋରିଷ ଓ ସୋରିଷ",
      "ପନିପରିବା",
      "ଫଳ",
      "ମତ୍ସ୍ୟଚାଷ",
      "ପଶୁପାଳନ"
   ],
   "general_advisory": "ସର୍ବାଧିକ ଉତ୍ପାଦନ ପାଇବା ପାଇଁ ସୋରିଷ/ତୋରିଆ, ସୂର୍ଯ୍ୟମୁଖୀ ଭଳି ରବି ଫସଲ ବୁଣିବାରେ ବିଳମ୍ବ କରାଯିବା ଉଚିତ ନୁହେଁ। ମେଘୁଆ ଏବଂ କୁହୁଡ଼ି ପାଗ ହେତୁ ଫସଲ ଏବଂ ପନିପରିବାରେ କୌଣସି ରୋଗ ଏବଂ କୀଟ ଆକ୍ରମଣ ପାଇଁ ନିୟମିତ ଯାଞ୍ଚ କରନ୍ତୁ | ସ୍ଥାୟୀ ଫସଲ ଏବଂ ପନିପରିବା ପାଇଁ ଆବଶ୍ୟକ ଜଳସେଚନ ବ୍ୟବସ୍ଥା କରନ୍ତୁ।",
   "crops_data": {
      "kharif rice": {
         "advisory": [
            "ଅମଳ ଏବଂ ଅମଳ ପ୍ରକ୍ରିୟା ସମୟରେ ମିଥ୍ୟା ପ୍ରଭାବିତ ଧାନ ଫଳକଗୁଡ଼ିକୁ ବାହାର କରନ୍ତୁ।",
            "ମଳତ୍ୟାଗ ପାଇଁ ଥିବା ଚଟାଣ ଏବଂ ଭଣ୍ଡାରଣ ସ୍ଥାନକୁ ସଫା ରଖନ୍ତୁ ଏବଂ କୀଟାଣୁନାଶକକୁ ସମାନ କରନ୍ତୁ।",
            "ଖାଦ୍ୟଶସ୍ୟକୁ 3ରୁ 4 ଦିନ ସୂର୍ଯ୍ୟକିରଣ ତଳେ ଶୁଖାଇବା ଆବଶ୍ୟକ, ବ୍ୟବହାର ପାଇଁ 14 ପ୍ରତିଶତ ଆର୍ଦ୍ରତା ଏବଂ ବୀଜ ଉଦ୍ଦେଶ୍ୟରେ 12 ପ୍ରତିଶତ ଆର୍ଦ୍ରତା ରହିବା ଆବଶ୍ୟକ।",
            "ସଠିକ ଭାବେ ଷ୍ଟୋରେଜ୍ ସଫା କରନ୍ତୁ ଏବଂ ଲାମ୍ବଡା ସାୟାହାଲୋଥ୍ରିନ୍ 4.9CS @1.5ml/li ପାଣି ସ୍ପ୍ରେ କରନ୍ତୁ, ଯାହାଦ୍ୱାରା ଭବିଷ୍ୟତରେ ଷ୍ଟୋରେଜ୍ କୀଟ ସଂକ୍ରମଣର ସମ୍ଭାବନାକୁ କମ୍ କରାଯାଇପାରିବ।"
         ]
      },
      "rapeseed and mustard": {
         "advisory": [
            "କୁହୁଡ଼ି ପାଗ ହେତୁ ସୋରିଷରେ ରୋଗ ଏବଂ ଅନ୍ୟାନ୍ୟ କୀଟପତଙ୍ଗ ପାଇଁ ଯାଞ୍ଚ କରନ୍ତୁ |",
            "ଆବଶ୍ୟକ ପଡ଼ିଲେ ଫସଲକୁ ଜଳସେଚନ ବ୍ୟବସ୍ଥା କରନ୍ତୁ।",
            "50 ପ୍ରତିଶତ ଏନ୍ ଏବଂ ସମସ୍ତ ପି2ଓ5 ଏବଂ କେ2ଓ ସାରକୁ ମୂଳ ସାର ଭାବେ ପ୍ରୟୋଗ କରାଯିବା ଉଚିତ।",
            "ତୈଳ ପରିମାଣ ବୃଦ୍ଧି ପାଇଁ ବେଣ୍ଟୋନାଇଟ୍ ସଲଫର୍ @30kg ହେକ୍ଟରର ପ୍ରୟୋଗ। ଅନ୍ୟଥା ଗ୍ରୋମର୍ (20:20:0:13) ଏବଂ ଏମ୍. ଓ. ପି. କୁ ଏନ୍., ପି., କେ. ଓ. ଏସ୍. ର ଉତ୍ସ ଭାବେ ଚୟନ କରନ୍ତୁ।"
         ]
      },
      "vegetables": {
         "advisory": [
            "ଫ୍ରେଞ୍ଚ ବିନ୍ ଏବଂ କାଉପି ପରି ଡାଳିମ୍ବ ପନିପରିବାର ଉଚ୍ଚ ଉତ୍ପାଦନକାରୀ ଏବଂ ମୋଜାଇକ ରୋଗ ପ୍ରତିରୋଧକ କିସମ ଚୟନ କରନ୍ତୁ ଏବଂ ଯଥାଶୀଘ୍ର ସମ୍ପୂର୍ଣ୍ଣ ରୋପଣ କରନ୍ତୁ |",
            "କାକୁଡ଼ି ଫସଲରେ ତମାଖୁ କ୍ୟାଟର୍ପିଲର ଏବଂ ବନ୍ଧାକୋବି ୱେବର ସଂକ୍ରମଣ ହେବାର ସମ୍ଭାବନା ରହିଛି, ଏହାକୁ ରୋକିବା ପାଇଁ ଏକର ପିଛା 200 ଲିଟର ପାଣି ସହିତ ଫ୍ଲୁବେଣ୍ଡିଆମାଇଡ୍ @70ml ଲଗାନ୍ତୁ।"
         ]
      },
      "fruit": {
         "advisory": [
            "ପେପା-ପେପା ଲିଫ୍ କର୍ଲ ଭାଇରସର ଭେକ୍ଟର (ହ୍ୱାଇଟ୍ଫ୍ଲାଇ) କୁ ଧରିବା ପାଇଁ ହଳଦିଆ ଷ୍ଟିକି ଫାନ୍ଦ ଲଗାନ୍ତୁ।",
            "ଶ୍ୱେତ ମାଛି ନିୟନ୍ତ୍ରଣ ପାଇଁ ନିମ୍ବ ତେଲ ଗଠନ 1500 ପିପିଏମ @3ml ଲିଟର ପାଣି ଏବଂ ଫ୍ଲୋନିକାମିଡ 50 ଡବ୍ଲୁଜି @0.3g/litre ର ବିକଳ୍ପ ସ୍ପ୍ରେ।",
            "ପେପା ଫସଲର ନିକଟବର୍ତ୍ତୀ ଅଞ୍ଚଳରେ ଓକ୍ରା, କାଉପି ଭଳି ଫସଲ ଚାଷରୁ ଦୂରେଇ ରୁହନ୍ତୁ।"
         ]
      },
      "pisciculture": {
         "advisory": [
            "ଯେହେତୁ ଶୀତ ଆରମ୍ଭ ପର୍ଯ୍ୟାୟରେ ଅଛି, ମାଛରେ \"ଇ. ୟୁ. ଏସ୍\". ରୋଗ ହେବାର ସମ୍ଭାବନା ଅଛି। ପ୍ରତିଷେଧକ ପଦକ୍ଷେପ ସ୍ୱରୂପ କୃଷକମାନଙ୍କୁ ଏକ ଏକର ପୋଖରୀ ଅଞ୍ଚଳରେ 40 ଲିଟର ପାଣି ସହିତ \"ସିଫ୍ୟାକ୍ସ\" @400ml ମିଶାଇବାକୁ ପରାମର୍ଶ ଦିଆଯାଇଛି।"
         ]
      },
      "livestock": {
         "advisory": [
            "ପଶୁମାନଙ୍କୁ ନିୟମିତ ଭାବରେ ଲୁଣ ସହିତ ଖଣିଜ ମିଶ୍ରଣ ଦିଆଯିବା ଉଚିତ ଏବଂ ପଶୁମାନଙ୍କ ଶକ୍ତି ଆବଶ୍ୟକତାକୁ ପୂରଣ କରିବା ପାଇଁ ଶୀତ ଋତୁରେ ଦୈନିକ ରାସନରେ ଗହମ ଶସ୍ୟ, ଗୁଡ଼ ଇତ୍ୟାଦି ଯୋଗାଇ ଦିଆଯାଇପାରେ |"
         ]
      }
   },
   "date": "10-12-2024"
}