{
   "weather_details": {
      "14/08/2024": {
         "rainfall": 5,
         "t_max": 34,
         "t_min": 29,
         "rh_max": 82,
         "rh_min": 63,
         "wind_speed": 23,
         "wind_direction": 202,
         "cloud_cover": 6
      },
      "15/08/2024": {
         "rainfall": 6,
         "t_max": 35,
         "t_min": 29,
         "rh_max": 85,
         "rh_min": 76,
         "wind_speed": 21,
         "wind_direction": 207,
         "cloud_cover": 6
      },
      "16/08/2024": {
         "rainfall": 6,
         "t_max": 34,
         "t_min": 29,
         "rh_max": 85,
         "rh_min": 74,
         "wind_speed": 16,
         "wind_direction": 238,
         "cloud_cover": 7
      },
      "17/08/2024": {
         "rainfall": 7,
         "t_max": 34,
         "t_min": 28,
         "rh_max": 83,
         "rh_min": 59,
         "wind_speed": 20,
         "wind_direction": 225,
         "cloud_cover": 7
      },
      "18/08/2024": {
         "rainfall": 10,
         "t_max": 33,
         "t_min": 27,
         "rh_max": 81,
         "rh_min": 58,
         "wind_speed": 20,
         "wind_direction": 207,
         "cloud_cover": 7
      }
   },
   "names_of_crops": [
      "ଡାଲିଗୁଡ଼ିକ",
      "ମକା",
      "ପନିପରିବା",
      "ଧାନ।",
      "ଅରହର",
      "ଚିନାବାଦାମ",
      "ଲଙ୍କା",
      "କାକୁଡ଼ି",
      "ଟମାଟୋ"
   ],
   "general_advisory": "ଅଗଷ୍ଟ ମାସର ପ୍ରଥମ ପନ୍ଦର ଦିନ ମଧ୍ଯ଼ରେ ସମ୍ପୂର୍ଣ୍ଣ ଧାନ ରୋପଣ। କୀଟପତଙ୍ଗ ଏବଂ ରୋଗର ପ୍ରକୋପ ପାଇଁ ଫସଲର ନିଯ଼ମିତ ତଦାରଖ କରାଯିବା ଉଚିତ ଏବଂ ଉପଯୁକ୍ତ ଉଦ୍ଭିଦ ସୁରକ୍ଷା ପଦକ୍ଷେପ ନିଆଯିବା ଉଚିତ। ଡାଲି, ମକା, ଚିନାବାଦାମ ଏବଂ ପନିପରିବା କ୍ଷେତରୁ ଅତିରିକ୍ତ ଜଳ ନିଷ୍କାସନ ପାଇଁ ବ୍ଯ଼ବସ୍ଥା କରନ୍ତୁ। କ୍ଷେତରେ ବର୍ଷା ଜଳ ସଂରକ୍ଷଣ ପାଇଁ ବନ୍ଧ ତିଆରି କରିବାକୁ କୃଷକମାନଙ୍କୁ ପରାମର୍ଶ ଦିଆଯାଇଛି। ମକା, ଚିନାବାଦାମ ଏବଂ ଡାଲି ପରି ସ୍ଥାଯ଼ୀ ଫସଲରେ ଏଫିଡ୍, ଜ୍ଯାସିଡ୍, ଥ୍ରିପ୍ ଏବଂ ହ୍ୱାଇଟ୍ଫ୍ଲାଇ ପରି ଶୋଷକ କୀଟ କମ୍ପ୍ଲେକ୍ସକୁ ନିଯ଼ନ୍ତ୍ରଣ ଏବଂ ନିରୀକ୍ଷଣ କରିବାକୁ ହଳଦିଆ ଷ୍ଟିକ୍ ଟ୍ରାପ୍ @8 nos./acre ସ୍ଥାପନ କରନ୍ତୁ |",
   "crops_data": {
      "pulses": {
         "advisory": [
            "କ୍ଷେତରୁ ଅତିରିକ୍ତ ଜଳ ନିଷ୍କାସନ ପାଇଁ ବ୍ଯ଼ବସ୍ଥା କରନ୍ତୁ।"
         ]
      },
      "maize": {
         "advisory": [
            "ଏଫିଡ୍, ଜ୍ଯାସିଡ୍, ଥ୍ରିପ୍ ଏବଂ ହ୍ୱାଇଟ୍ଫ୍ଲାଇ ପରି ଶୋଷକ କୀଟ କମ୍ପ୍ଲେକ୍ସକୁ ନିଯ଼ନ୍ତ୍ରଣ ଏବଂ ନିରୀକ୍ଷଣ କରିବାକୁ ହଳଦିଆ ଷ୍ଟିକ୍ ଟ୍ରାପ୍ @8 nos./acre ସ୍ଥାପନ କରନ୍ତୁ |"
         ]
      },
      "vegetables": {
         "advisory": [
            "କ୍ଷେତରୁ ଅତିରିକ୍ତ ଜଳ ନିଷ୍କାସନ ପାଇଁ ବ୍ଯ଼ବସ୍ଥା କରନ୍ତୁ।"
         ]
      },
      "paddy": {
         "advisory": [
            "ଯଦି ଧାନ କ୍ଷେତରେ ପତ୍ରର ବିସ୍ଫୋରଣ ପରିଲକ୍ଷିତ ହୁଏ, ତେବେ 200 ଲିଟର ପାଣି ସହିତ ମିଶି ଏକର ପିଛା 80 ଗ୍ରାମ୍ର ଟେବୁକୋନାଜୋଲ୍ 50 ପ୍ରତିଶତ + ଟ୍ରାଇଫ୍ଲୋକ୍ସିସ୍ଟ୍ରୋବିନ୍ 25 ପ୍ରତିଶତ ଡବ୍ଲୁଜି (ନାଟିଭୋ) କିମ୍ବା ଆଇସୋପ୍ରୋଥିଓଲେନ୍ 40 ଇସି (ସୁଲତାନ/ଫୁଜିଟା/ଫୁଜିଓନ୍) 300 ମିଲିଲିଟର ସ୍ପ୍ରେ କରନ୍ତୁ। 7-10 ଦିନ ବ୍ଯ଼ବଧାନରେ ସ୍ପ୍ରେକୁ ପୁନରାବୃତ୍ତି କରନ୍ତୁ। ଧାନରେ ଶୀଥ୍ ରଟ୍ ଏବଂ ଶୀଥ୍ ବ୍ଲାଇଟ୍ର ସଂକ୍ରମଣ ହେବାର ସମ୍ଭାବନା ରହିଛି। ଏହି ରୋଗକୁ ନିଯ଼ନ୍ତ୍ରଣ କରିବା ପାଇଁ ଟେବୁକୋନାଜୋଲ 50 ପ୍ରତିଶତ + ଟ୍ରାଇଫ୍ଲୋକ୍ସିସ୍ଟ୍ରୋବିନ 25 ପ୍ରତିଶତ ଡବ୍ଲୁ. ଜି. (ନାଟିଭୋ) @80 ଗ୍ରାମ/ଏକର କିମ୍ବା ପ୍ରୋପିକୋନାଜୋଲ 25 ପ୍ରତିଶତ ଇ. ସି. (ଟିଲ୍ଟ/ଜେରକ୍ସ/ଧାନ/ବମ୍ପର) @200 ମିଲି/ଏକରକୁ 200 ଲିଟର ପାଣିରେ ମିଶାଇ ସ୍ପ୍ରେ କରନ୍ତୁ। ଯଦି ବିଏଲବି ପରିଲକ୍ଷିତ ହୁଏ, ତେବେ 200 ଲିଟର ପାଣି ସହିତ ମିଶ୍ରଣ କରି ଏକର ପିଛା 600 ଗ୍ରାମ ପିଛା 50 ପ୍ରତିଶତ ଡବ୍ଲ୍ଯ଼ୁ. ପି. ତମ୍ବା ଅକ୍ସିକ୍ଲୋରାଇଡ୍ ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "arhar": {
         "advisory": [
            "ଏହି ସପ୍ତାହ ଶେଷ ସୁଦ୍ଧା ଜମି ଖୋଳିବା, ଘାସ କାଟିବା ଏବଂ ତା 'ପରେ ମାଟି କାଟିବା କାର୍ଯ୍ଯ଼ ଶେଷ ହେବା ଉଚିତ। କୀଟ ସଂକ୍ରମଣର ଲକ୍ଷଣଗୁଡ଼ିକ ପାଇଁ ନିଯ଼ମିତ ଭାବେ ନିଜ କ୍ଷେତ ଉପରେ ନଜର ରଖନ୍ତୁ। ଏଫିଡ୍ ଏବଂ ଥ୍ରୀପ୍ ପରି ଶୋଷକ କୀଟକୁ ରୋକିବା ପାଇଁ, ନିମ୍ବ-ଆଧାରିତ କୀଟନାଶକ (1500 ପିପିଏମ୍) ଲିଟର ପିଛା 3 ମିଲିଲିଟରରେ ପାଣି ସିଞ୍ଚନ କରାଯାଇପାରେ।"
         ]
      },
      "groundnut": {
         "advisory": [
            "ଚିନାବାଦାମ ଫସଲରେ ହୋଇଂ 20-25 DAS ରେ କରାଯିବା ଉଚିତ୍ | ଟିକ୍କା ରୋଗର ପରିଚାଳନା ପାଇଁ, କ୍ଲୋରୋଥାଲୋନିଲ୍ 75 ପ୍ରତିଶତ ଡବ୍ଲ୍ଯ଼ୁ. ପି. @400 ଗ୍ରାମ୍/ଏକର କିମ୍ବା ମାନକୋଜେବ୍ 75 ପ୍ରତିଶତ ଡବ୍ଲ୍ଯ଼ୁ. ପି. @600 ଗ୍ରାମ୍/ଏକର କିମ୍ବା ହେକ୍ସାକୋନାଜୋଲ୍ 5 ପ୍ରତିଶତ ଇ. ସି. @300 ମିଲି/ଏକର ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "chilli": {
         "advisory": [
            "କ୍ଷେତକୁ ସଫା ରଖନ୍ତୁ। କୌଣସି ରୋଗ ଏବଂ କୀଟପତଙ୍ଗ ପାଇଁ ଫସଲ ଉପରେ ନଜର ରଖନ୍ତୁ। ଚିଲି ଥ୍ରିପ୍ସକୁ ନିଯ଼ନ୍ତ୍ରଣ କରିବା ପାଇଁ, ମାଲାଥିଅନ୍ କିମ୍ବା ଇମିଡାକ୍ଲୋପ୍ରିଡ୍ 17.8 SL @2 ମିଲି/ଲିଟର ସ୍ପ୍ରେ କରନ୍ତୁ। କାର୍ବେଣ୍ଡାଜିମ୍ କିମ୍ବା ମାଙ୍କୋଜେବ୍ ଫଙ୍ଗିସାଇଡ୍ @2-3 ଗ୍ରାମ୍/ଲିଟର ସିଞ୍ଚନ ଦ୍ୱାରା ଲଙ୍କା ପତ୍ରର ରୋଗକୁ ନିଯ଼ନ୍ତ୍ରଣ କରାଯାଇପାରିବ।"
         ]
      },
      "cucurbits": {
         "advisory": [
            "କାକୁଡ଼ିରେ ଫଳ ମାଛି ନିଯ଼ନ୍ତ୍ରଣ କରିବା ପାଇଁ, 4 ଲିଟର ପାଣିରେ 200 ଗ୍ରାମ୍ ଗୁଡ଼, 4 ପାକଳ କଦଳୀ ଏବଂ 2 ମିଲି ଇମିଡାକ୍ଲୋପ୍ରିଡ୍ ମିଶାଇ ଏକ ବିଷାକ୍ତ ଚାରା ପ୍ରସ୍ତୁତ କରନ୍ତୁ। ଏହି ମିଶ୍ରଣକୁ ପ୍ଲାଷ୍ଟିକ୍ କପ୍ କିମ୍ବା ମାଟି ପାତ୍ରରେ ଏକର ପିଛା 8 ନମ୍ବରରେ ରଖନ୍ତୁ। ଫଳ ମାଛିମାନେ ଏହା ପ୍ରତି ଆକର୍ଷିତ ହେବେ ଏବଂ ଶେଷରେ ବିଷ ଜାଲରେ ପଡ଼ି ମୃତ୍ଯ଼ୁବରଣ କରିବେ। ଚରମ କ୍ଷେତ୍ରରେ, ରାସାଯ଼ନିକ ନିଯ଼ନ୍ତ୍ରଣ ପାଇଁ ସ୍ପିନୋସାଦ୍ @2.5ml/10 ଲିଟ୍ ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "tomato": {
         "advisory": [
            "ଅଗଷ୍ଟ ଏବଂ ସେପ୍ଟେମ୍ବର ହେଉଛି ଟମାଟୋ ରୋପଣ ପାଇଁ ସର୍ବୋତ୍ତମ ସମଯ଼ | ଉତ୍କଳ କୁମାରୀ (ବି. ଟି.-10), ଉତ୍କଳ ଦୀପ୍ତି (ବି. ଟି.-2), ଉତ୍କଳ ରାଜା, ଉତ୍କଳ ପ୍ରଜ୍ଞାନ ଏବଂ ସ୍ୱର୍ଣ୍ଣ ସମ୍ପଦ ଭଳି ଟମାଟୋ କିସମ ଚାଷ କରନ୍ତୁ। ଏକ ଏକର ଜମିରେ ଲଗାଇବା ପାଇଁ 150ରୁ 200 ଗ୍ରାମ ମଞ୍ଜି ଆବଶ୍ଯ଼କ ହୋଇଥାଏ।"
         ]
      }
   },
   "date": "13-08-2024"
}