{
   "weather_details": {
      "14-09-2024": {
         "rainfall": 10,
         "t_max": 28,
         "t_min": 25,
         "rh_max": 87,
         "rh_min": 63,
         "wind_speed": 10,
         "wind_direction": 281,
         "cloud_cover": 8
      },
      "15-09-2024": {
         "rainfall": 10,
         "t_max": 29,
         "t_min": 24,
         "rh_max": 87,
         "rh_min": 80,
         "wind_speed": 13,
         "wind_direction": 269,
         "cloud_cover": 8
      },
      "16-09-2024": {
         "rainfall": 5,
         "t_max": 32,
         "t_min": 24,
         "rh_max": 93,
         "rh_min": 64,
         "wind_speed": 15,
         "wind_direction": 244,
         "cloud_cover": 6
      },
      "17-09-2024": {
         "rainfall": 5,
         "t_max": 28,
         "t_min": 24,
         "rh_max": 91,
         "rh_min": 81,
         "wind_speed": 13,
         "wind_direction": 235,
         "cloud_cover": 6
      },
      "18-09-2024": {
         "rainfall": 5,
         "t_max": 31,
         "t_min": 26,
         "rh_max": 91,
         "rh_min": 81,
         "wind_speed": 13,
         "wind_direction": 235,
         "cloud_cover": 6
      }
   },
   "names_of_crops": [
      "ଚାଉଳ",
      "ଲଙ୍କା",
      "ବାଇଗଣ"
   ],
   "general_advisory": "ବଲାଙ୍ଗିର ଜିଲ୍ଲାରେ ଆଗାମୀ 5 ଦିନ ଆକାଶ ସାଧାରଣତଃ ମେଘୁଆ ରହିବା ସହିତ ବହୁତ ହାଲୁକା ବର୍ଷା ହେବାର ସମ୍ଭାବନା ରହିଛି। ଆଗାମୀ 5 ଦିନ ପାଇଁ ସର୍ବାଧିକ ତାପମାତ୍ରା 29-33 °C ଏବଂ ସର୍ବନିମ୍ନ ତାପମାତ୍ରା 19-25 °C ରହିବ। ସର୍ବାଧିକ ଏବଂ ସର୍ବନିମ୍ନ ଆପେକ୍ଷିକ ଆର୍ଦ୍ରତା ଯଥାକ୍ରମେ 88-93% ଏବଂ 63-71% ହେବ। ଆଗାମୀ 5 ଦିନ ପର୍ଯ୍ଯ଼ନ୍ତ ପବନର ବେଗ ଘଣ୍ଟାପ୍ରତି 14 ରୁ 16 କିଲୋମିଟର ମଧ୍ଯ଼ରେ ରହିବ। କେତେକ ଫସଲରୁ ଅତିରିକ୍ତ ଜଳ ବାହାର କରନ୍ତୁ ଏବଂ ପନିପରିବା ଗଛଗୁଡ଼ିକୁ ଷ୍ଟାକିଂ ପ୍ରଦାନ କରନ୍ତୁ | ଆବଶ୍ଯ଼କ ଅନୁଯାଯ଼ୀ ଫସଲରେ କୀଟନାଶକ କିମ୍ବା କୀଟନାଶକ ସିଞ୍ଚନ କରନ୍ତୁ ଏବଂ ବର୍ଷା ଉପରେ ନଜର ରଖୁଥିବା ଷ୍ଟିକର ସହିତ ମିଶାନ୍ତୁ।",
   "crops_data": {
      "RICE": {
         "advisory": [
            "ଫସଲଟି ସକ୍ରିଯ଼ ଚାଷ ପର୍ଯ୍ଯ଼ାଯ଼ରେ ରହିଛି। ବର୍ଷା ଜଳ ହ୍ରାସ ପାଇବା ପରେ, 28 ଡିଗ୍ରୀ ସେଲସିଯ଼ସରୁ କମ୍ ତାପମାତ୍ରା ଏବଂ 70 ପ୍ରତିଶତରୁ ଅଧିକ ଆପେକ୍ଷିକ ଆର୍ଦ୍ରତା ଧାନରେ ହଳଦିଆ କାଣ୍ଡ ଛେଦକ ସଂକ୍ରମଣକୁ ପସନ୍ଦ କରେ | ଫସଲର ପ୍ରାରମ୍ଭିକ ପର୍ଯ୍ଯ଼ାଯ଼ରେ ଧାନରେ କାଣ୍ଡ ଛେଦକକୁ ପରିଚାଳନା କରିବା ପାଇଁ, କାର୍ଟାପ୍ ହାଇଡ୍ରୋକ୍ଲୋରାଇଡ୍ 4 ପ୍ରତିଶତ ଜି @8 କେଜି/ଏକର କିମ୍ବା କ୍ଲୋରାଣ୍ଟ୍ରାନିଲିପ୍ରୋଲ୍ 0.4 ପ୍ରତିଶତ ଜିଆର @4 କେଜି/ଏକର କିମ୍ବା ଇମିଡାକ୍ଲୋପ୍ରିଡ୍ 0.3 ପ୍ରତିଶତ ଜିଆର @6 କେଜି/ଏକର ବାଲିରେ 1:1 ଅନୁପାତରେ ମିଶ୍ରଣ କରି ପ୍ରଯ଼ୋଗ କରନ୍ତୁ।"
         ]
      },
      "CHILLI": {
         "advisory": [
            "ଲଙ୍କା ଫସଲ ଚାରା ରୋପଣ ପର୍ଯ୍ଯ଼ାଯ଼ରେ ରହିଛି। ଉଚ୍ଚ ମୃତ୍ତିକା ଆର୍ଦ୍ରତା ଏବଂ ମଧ୍ଯ଼ମ ମୃତ୍ତିକା ତାପମାତ୍ରା (<28 ଡିଗ୍ରୀ ସେଲସିଯ଼ସ୍), ଉଚ୍ଚ ଆର୍. ଏଚ୍., ଅଧିକ ବର୍ଷା, ଏବଂ ଏହି ବର୍ଷା ଋତୁରେ ଖରାପ ଜଳ ନିଷ୍କାସନ ରୋଗକୁ ହ୍ରାସ କରିପାରେ। ମାଙ୍କୋଜେବ୍ @3 ଗ୍ରାମ୍/ଲିଟର କିମ୍ବା ମେଟାଲାକ୍ସିଲ୍ @2 ଗ୍ରାମ୍/ଲିଟର କିମ୍ବା ମେଟାଲାକ୍ସିଲ୍ + ମାଙ୍କୋଜେବ୍ @3 ଗ୍ରାମ୍/ଲିଟର ସହିତ ପତ୍ର ସ୍ପ୍ରେ ସହିତ ମାଟିକୁ ଭିଜାଇ ଦିଅନ୍ତୁ |"
         ]
      },
      "BRINJAL": {
         "advisory": [
            "ବାଇଗଣ ଫୁଲ ଫୁଟାଇବା ଠାରୁ ଆରମ୍ଭ କରି ଫଳ ଧାରଣ କରିବା ପର୍ଯ୍ଯ଼ନ୍ତ ପର୍ଯ୍ଯ଼ାଯ଼ରେ ରହିଛି। ବର୍ଷା ହ୍ରାସ ପାଇବା ପରେ ଏବଂ ଦିନ ଓ ରାତିର ତାପମାତ୍ରା ବୃଦ୍ଧି ହେବାର ସମ୍ଭାବନା ରହିଛି ଏବଂ ସକାଳେ ଆପେକ୍ଷିକ ଆର୍ଦ୍ରତା 70 ପ୍ରତିଶତରୁ ଅଧିକ ବେଗୁନରେ ଶୁଟ୍ ଏବଂ ଫଳ ଛେଦକକୁ ପସନ୍ଦ କରେ | କୀଟକୁ ପରିଚାଳନା କରିବା ପାଇଁ, ଛିଦ୍ର ଏବଂ ପ୍ରଭାବିତ ଫଳ ଦେଖାଇଥିବା ପ୍ରଭାବିତ ଟର୍ମିନାଲ୍ ଶୁଟ୍ ଅପସାରଣ କରନ୍ତୁ | ଏହି କୀଟକୁ ନିଯ଼ନ୍ତ୍ରଣ କରିବା ପାଇଁ, ଏକର ପିଛା ଲିଉସିନ୍ ଲ୍ଯ଼ୁର୍ ଥିବା 8ଟି ଫେରୋମୋନ୍ ଫାନ୍ଦ ଲଗାନ୍ତୁ। ରାସାଯ଼ନିକ ନିଯ଼ନ୍ତ୍ରଣ ବ୍ଯ଼ବହାର କରନ୍ତୁ ଯଦି ଟର୍ମିନାଲ୍ ଶୁଟର 4 ପ୍ରତିଶତ ଶୁଖିଲା ଅଛି କିମ୍ବା 14 ପ୍ରତିଶତ ଫଳ ବୋରର ଦ୍ୱାରା ସଂକ୍ରମିତ | ରାସାଯ଼ନିକ ନିଯ଼ନ୍ତ୍ରଣ ପାଇଁ ଏମାମେକ୍ଟିନ୍ ବେନ୍ଜୋଏଟ୍ 5 ପ୍ରତିଶତ ଏସ୍ଜି @80 ଗ୍ରାମ/ଏକର କିମ୍ବା କ୍ଲୋରାଣ୍ଟ୍ରାନିଲିପ୍ରୋଲ୍ <ଆଇ. ଡି. 2> ଏସ୍. ସି. @80 ମିଲି/ଏକର କିମ୍ବା ସ୍ପିନେଟୋରାମ୍ <ଆଇ. ଡି. 1> ଏସ୍. ସି. @200 ମିଲି/ଏକର ସ୍ପ୍ରେ କରନ୍ତୁ। କୀଟନାଶକ ପ୍ରଯ଼ୋଗ ଏବଂ ଅମଳ ମଧ୍ଯ଼ରେ 7-10 ଦିନର ବ୍ଯ଼ବଧାନ ରହିବା ଉଚିତ୍। ଉପରୋକ୍ତ ଯେ କୌଣସି କୀଟନାଶକକୁ 15 ଦିନର ବ୍ଯ଼ବଧାନରେ ବିକଳ୍ପ ଭାବେ ବ୍ଯ଼ବହାର କରନ୍ତୁ।"
         ]
      }
   },
   "date": "13-09-2024"
}