{
   "weather_details": {
      "2024-08-14": {
         "rainfall": 6,
         "t_max": 34,
         "t_min": 26,
         "rh_max": 90,
         "rh_min": 59,
         "wind_speed": 6,
         "wind_direction": 207,
         "cloud_cover": 6
      },
      "2024-08-15": {
         "rainfall": 6,
         "t_max": 34,
         "t_min": 26,
         "rh_max": 89,
         "rh_min": 67,
         "wind_speed": 6,
         "wind_direction": 212,
         "cloud_cover": 6
      },
      "2024-08-16": {
         "rainfall": 7,
         "t_max": 35,
         "t_min": 27,
         "rh_max": 90,
         "rh_min": 66,
         "wind_speed": 5,
         "wind_direction": 212,
         "cloud_cover": 7
      },
      "2024-08-17": {
         "rainfall": 7,
         "t_max": 35,
         "t_min": 27,
         "rh_max": 89,
         "rh_min": 62,
         "wind_speed": 5,
         "wind_direction": 207,
         "cloud_cover": 7
      },
      "2024-08-18": {
         "rainfall": 7,
         "t_max": 34,
         "t_min": 26,
         "rh_max": 87,
         "rh_min": 56,
         "wind_speed": 5,
         "wind_direction": 207,
         "cloud_cover": 7
      }
   },
   "names_of_crops": [
      "ଚାଉଳ",
      "କପା",
      "କଦଳୀ",
      "ଛେଳି।"
   ],
   "general_advisory": "ଆଇଏମଡି ଦ୍ୱାରା ଜାରି କରାଯାଇଥିବା ବର୍ଦ୍ଧିତ ପରିସର ପୂର୍ବାନୁମାନ ଅନୁଯାଯ଼ୀ, ପ୍ରଥମ ସପ୍ତାହରେ (9 ରୁ 15 ଅଗଷ୍ଟ 2024) ଓଡ଼ିଶାର ଜିଲ୍ଲାଗୁଡ଼ିକରେ ସାମଗ୍ରିକ ବୃଷ୍ଟିପାତ ସ୍ୱାଭାବିକଠାରୁ କମ୍ ହେବାର ସମ୍ଭାବନା ରହିଛି ଏବଂ ପ୍ରଥମ ସପ୍ତାହରେ ଓଡ଼ିଶାର କେତେକ ଜିଲ୍ଲାରେ ପ୍ରବଳରୁ ଅତି ପ୍ରବଳ ବର୍ଷା ହେବାର ସମ୍ଭାବନା ରହିଛି। 2 ସପ୍ତାହ (16 ରୁ 22 ଅଗଷ୍ଟ 2024) ମଧ୍ଯ଼ରେ ସାମଗ୍ରିକ ବର୍ଷା କାର୍ଯ୍ଯ଼କଳାପ ସ୍ୱାଭାବିକଠାରୁ ଅଧିକ ହେବାର ସମ୍ଭାବନା ରହିଛି ଏବଂ ଦ୍ୱିତୀଯ଼ ସପ୍ତାହରେ ଓଡ଼ିଶାର ଜିଲ୍ଲାଗୁଡ଼ିକରେ ବିଚ୍ଛିନ୍ନ ଭାବରେ ପ୍ରବଳ ବର୍ଷା ହେବାର ସମ୍ଭାବନା ରହିଛି। ଅନୁଭୂତ ଏବଂ ପ୍ରତ୍ଯାଶିତ ବର୍ଷାକୁ ଦୃଷ୍ଟିରେ ରଖି କୃଷକମାନଙ୍କୁ ଧାନ ରୋପଣ ସମ୍ପୂର୍ଣ୍ଣ କରିବାକୁ ପରାମର୍ଶ ଦିଆଯାଇଛି, ଯେଉଁଠାରେ କ୍ଷେତ ପ୍ରସ୍ତୁତ ହୋଇସାରିଛି। ଡାଲି, ମକା, ଚିନାବାଦାମ ଏବଂ ପନିପରିବା କ୍ଷେତରୁ ଅତିରିକ୍ତ ଜଳ ନିଷ୍କାସନ ପାଇଁ ବ୍ଯ଼ବସ୍ଥା କରନ୍ତୁ। କ୍ଷେତ ଭିତରେ, ବିଶେଷ କରି ଉଚ୍ଚଭୂମି ସ୍ଥିତିରେ, ବର୍ଷା ଜଳ ସଂରକ୍ଷଣ ପାଇଁ ବନ୍ଧ ପ୍ରସ୍ତୁତ କରନ୍ତୁ। ଉଚ୍ଚ ଆର୍ଦ୍ରତା ସହିତ ଜଡିତ ପ୍ରଚଳିତ ମେଘୁଆ ପାଣିପାଗ ହେତୁ ଫସଲରେ କୀଟପତଙ୍ଗ ଏବଂ ରୋଗ ଘଟଣା ପାଇଁ ନିଯ଼ମିତ ତଦାରଖ କରିବାକୁ ପରାମର୍ଶ ଦିଆଯାଇଛି।",
   "crops_data": {
      "rice": {
         "advisory": [
            "ପ୍ରାକ୍-ଉଦ୍ଭବ ହର୍ବିସାଇଡ୍ ପ୍ରିଟିଲାକ୍ଲୋର 37 ପ୍ରତିଶତ ଇ. ଡବ୍ଲ୍ଯ଼ୁ. @600-ମିଲି/ଏକର କିମ୍ବା ଅକ୍ସାଡିଆର୍ଜିଲ 80 ପ୍ରତିଶତ ଡବ୍ଲ୍ଯ଼ୁ. ପି. @50-ଗ୍ରାମ/ଏକର କିମ୍ବା ପାଇରାଜୋସଲ୍ଫୁରନ ଇଥାଇଲ 10 ପ୍ରତିଶତ ଡବ୍ଲ୍ଯ଼ୁ. ପି. @80 ଗ୍ରାମ/ଏକର 1-3 ଡିଏ. ଟି. ରେ ବ୍ଯ଼ବହାର କରନ୍ତୁ। ତୃଣନାଶକକୁ ଏକର ପିଛା 200 ଲିଟର ପାଣିରେ ମିଶାଇ ସ୍ପ୍ରେ କରନ୍ତୁ କିମ୍ବା 20 କିଲୋଗ୍ରାମ ବାଲି ସହିତ ତୃଣନାଶକକୁ ମିଶାଇ ଏହାକୁ ସମାନ ଭାବରେ ପ୍ରସାରଣ କରନ୍ତୁ | ତୃଣନାଶକ ସିଞ୍ଚନ ପାଇଁ ସର୍ବଦା ଫ୍ଲାଟ୍-ଫ୍ଯ଼ାନ୍ କିମ୍ବା ଫ୍ଲଡ୍-ଜେଟ୍ ନୋଜଲ୍ ଏବଂ ସଫା ପାଣି ବ୍ଯ଼ବହାର କରନ୍ତୁ |"
         ]
      },
      "cotton": {
         "advisory": [
            "ଅତିରିକ୍ତ ବର୍ଷା ଜଳ ନିଷ୍କାସନ ପାଇଁ ଡ୍ରେନେଜ୍ ଚ୍ଯ଼ାନେଲ୍ ତିଆରି କରନ୍ତୁ। ତିନି-ସପ୍ତାହର ପର୍ଯ୍ଯ଼ାଯ଼ କପାର ପରେ ହୋଇଂ, ନିଡ଼ାଇ ଏବଂ ପ୍ରଥମ ଉପର ଡ୍ରେସିଂ ଗ୍ରହଣ କରନ୍ତୁ। 26 କି. ଗ୍ରା. ଯ଼ୁରିଆ ସହିତ 20 କି. ଗ୍ରା. ଏମ୍. ଓ. ପି. ହାଇବ୍ରିଡ୍ ଏବଂ 20 କି. ଗ୍ରା. ଯ଼ୁରିଆ ସହିତ 15 କି. ଗ୍ରା. ଏମ୍. ଓ. ପି. ଉଚ୍ଚ ଉତ୍ପାଦନକାରୀ କିସମର ପ୍ରଯ଼ୋଗ କରନ୍ତୁ। ଫୁଲ ଝଡ଼ିବା ଏବଂ ଉନ୍ନତ ବଲ୍ବ ବିକାଶକୁ ନିଯ଼ନ୍ତ୍ରଣ କରିବା ପାଇଁ ଫସଲ ପର୍ଯ୍ଯ଼ାଯ଼ର 30-45 ଦିନରେ ଉଦ୍ଭିଦ ହରମୋନ୍ ପ୍ଲାନୋଫିକ୍ସ @3.5 ମିଲି 15 ଲିଟର ପାଣି ସହିତ ମିଶ୍ରଣ କରିବା ପରାମର୍ଶ ଦିଆଯାଏ | ନିମ୍ବ ଆଧାରିତ କୀଟନାଶକ ଯଥା ନିମ୍ବ ତେଲ @600-800 ml + 200 ଗ୍ରାମ୍ ଡିଟର୍ଜେଣ୍ଟ ପାଉଡରକୁ ଏକର ପିଛା 200 ଲିଟର ପାଣିରେ ମିଶାଇ ପ୍ରଯ଼ୋଗ କରିବା, ଫସଲ ପର୍ଯ୍ଯ଼ାଯ଼ର 30-45 ଦିନରେ, ଏଫିଡ, ଜ୍ଯାସିଡ, ଥ୍ରିପ୍ସ ଏବଂ ହ୍ୱାଇଟଫ୍ଲାଇ ଭଳି ଶୋଷକ କୀଟ ସମୂହକୁ ନିଯ଼ନ୍ତ୍ରଣ କରିବା ପାଇଁ ପରାମର୍ଶ ଦିଆଯାଏ। ଏଫିଡ୍, ଜ୍ଯାସିଡ୍, ଥ୍ରିପ୍ ଏବଂ ହ୍ୱାଇଟ୍ଫ୍ଲାଇ ପରି ଶୋଷକ କୀଟ କମ୍ପ୍ଲେକ୍ସକୁ ନିଯ଼ନ୍ତ୍ରଣ ଏବଂ ନିରୀକ୍ଷଣ କରିବାକୁ ହଳଦିଆ ଷ୍ଟିକ୍ ଟ୍ରାପ୍ @8nos./acre ସ୍ଥାପନ କରନ୍ତୁ |"
         ]
      },
      "pumpkin": {
         "advisory": [
            "ପ୍ରବଳ ବର୍ଷା ପରେ, ରିଜ୍ ଲାଉ ଏବଂ ସ୍ନେକ୍ ଗାର୍ଡ ପରି କୁକୁର୍ବିଟ୍ ରେ ସେମିଲୋପର୍ କୀଟ ଘଟଣା ସାଧାରଣ | ନିମ୍ବ ଆଧାରିତ କୀଟନାଶକ (ନିମ୍ବ ତେଲ 15000 ପିପିଏମ) ଆଜାଦିରାକ୍ଟିନ ପ୍ରତି ଏକରରେ 600 ମିଲି କିମ୍ବା ବାସିଲସ ଥୁରିଙ୍ଗିଯ଼େନ୍ସିସ ପ୍ରତି ଏକରରେ 400 ଗ୍ରାମକୁ 200 ଲିଟର ପାଣିରେ ମିଶାଇ ସିଞ୍ଚନ କରନ୍ତୁ। ରାସାଯ଼ନିକ ଉପାଯ଼ରେ ଏହି କୀଟକୁ ନିଯ଼ନ୍ତ୍ରଣ କରିବା ପାଇଁ ମଧ୍ଯ଼ାହ୍ନ ସମଯ଼ରେ ଏକର ପିଛା 50-ମିଲି ଆଲ୍ଫା-ସାଇହାଲୋଥ୍ରିନ୍ କିମ୍ବା ଏକର ପିଛା 120-ମିଲି ଥାଇକ୍ଲୋପ୍ରିଡ୍ ସ୍ପ୍ରେ କରନ୍ତୁ ଏବଂ ଏଥିରେ 200 ଲିଟର ପାଣି ମିଶାନ୍ତୁ।"
         ]
      },
      "goat": {
         "advisory": [
            "ଆଭ୍ଯ଼ନ୍ତରୀଣ ପରଜୀବୀଗୁଡ଼ିକର ଭାର ହ୍ରାସ କରିବା ପାଇଁ ସେଗୁଡ଼ିକୁ ପତଳା କରନ୍ତୁ। ବାହ୍ଯ଼ ପରଜୀବୀ ବିରୁଦ୍ଧରେ ମେଣ୍ଢା କ୍ଷେତ୍ରରେ ଡିପିଂ କରାଯିବା ଉଚିତ୍ | ବର୍ଷା ସମଯ଼ରେ ପଶୁମାନଙ୍କୁ ଘର ଭିତରେ ରଖନ୍ତୁ ଏବଂ ସ୍ୱଚ୍ଛ ତଥା ସ୍ୱାସ୍ଥ୍ଯ଼କର ପାଣି ଯୋଗାଇ ଦିଅନ୍ତୁ ଏବଂ ବର୍ଷା ଋତୁରେ ମେଣ୍ଢା ଏବଂ ଛେଳି ପାଇଁ ଘରେ ଶୁଖିଲା ପଶୁଖାଦ୍ଯ଼ ଏବଂ ନଡ଼ିଆ ପ୍ରସ୍ତୁତ ରଖନ୍ତୁ | ଦଯ଼ା କରି ମଜା କରିବା ଏବଂ ଲାମ୍ବାଙ୍ଗ କରିବାର ଏକ ମାସ ପୂର୍ବରୁ ମେଣ୍ଢା ଏବଂ ଛେଳିଙ୍କୁ ସନ୍ତୁଳିତ ଏକାଗ୍ରତା ଦେବା ପାଇଁ ଫ୍ଲାଶିଂ ଅଭ୍ଯ଼ାସ ନିଶ୍ଚିତ କରନ୍ତୁ |"
         ]
      }
   },
   "date": "13-08-2024"
}