{
   "weather_details": {
      "2025-01-18": {
         "rainfall": 0,
         "t_max": 26,
         "t_min": 13,
         "rh_max": 73,
         "rh_min": 28,
         "wind_speed": 3,
         "wind_direction": 0,
         "cloud_cover": 3
      },
      "2025-01-19": {
         "rainfall": 0,
         "t_max": 26,
         "t_min": 13,
         "rh_max": 70,
         "rh_min": 29,
         "wind_speed": 4,
         "wind_direction": 334,
         "cloud_cover": 2
      },
      "2025-01-20": {
         "rainfall": 0,
         "t_max": 26,
         "t_min": 13,
         "rh_max": 67,
         "rh_min": 27,
         "wind_speed": 5,
         "wind_direction": 352,
         "cloud_cover": 2
      },
      "2025-01-21": {
         "rainfall": 0,
         "t_max": 27,
         "t_min": 14,
         "rh_max": 73,
         "rh_min": 28,
         "wind_speed": 3,
         "wind_direction": 0,
         "cloud_cover": 3
      },
      "2025-01-22": {
         "rainfall": 0,
         "t_max": 27,
         "t_min": 14,
         "rh_max": 70,
         "rh_min": 29,
         "wind_speed": 4,
         "wind_direction": 334,
         "cloud_cover": 3
      }
   },
   "names_of_crops": [
      "ଚାଉଳ",
      "ସୂର୍ଯ୍ୟମୁଖୀ",
      "କଳା ଗ୍ରାମ",
      "ଗ୍ରୀନଗ୍ରାମ",
      "ସୋରିଷ",
      "ଚିନାବାଦାମ",
      "ଲାଲ ଚଣା",
      "ଲଙ୍କା",
      "ଫୁଲକୋବି",
      "କଦଳୀ",
      "ବାଇଗଣ",
      "ଟମାଟୋ",
      "ରସୁଣ",
      "ଆଳୁ"
   ],
   "general_advisory": "ନିମ୍ନ ରାତି ତାପମାତ୍ରା ଏବଂ କୁହୁଡ଼ି ପରିସ୍ଥିତି ହେତୁ ରବି ଫସଲ ଏବଂ ପନିପରିବାରେ ଶୋଷକ କୀଟ, ପତ୍ର ରୋଗ, ପାଉଡର ଫଙ୍ଗୁର ସଂକ୍ରମଣ ହେବାର ସମ୍ଭାବନା ରହିବ। ଫସଲ ଏବଂ ପନିପରିବା ଉପରେ ନଜର ରଖନ୍ତୁ, ଯଦି ଲକ୍ଷଣ ଦେଖାଯାଏ, ଉପଯୁକ୍ତ ଉଦ୍ଭିଦ ସୁରକ୍ଷା ପଦକ୍ଷେପ ଗ୍ରହଣ କରନ୍ତୁ। ରବି ପନିପରିବାରେ ନିଡ଼ାଇ, ହୋଇଂ ଏବଂ ଅନ୍ୟାନ୍ୟ ଆନ୍ତଃସାଂସ୍କୃତିକ କାର୍ଯ୍ୟକଳାପ କରନ୍ତୁ | କୋଇଲା ଫସଲରେ ମାଟିର ଆର୍ଦ୍ରତା ଏବଂ ପାଣିପାଗ ସ୍ଥିତି ଉପରେ ନିର୍ଭର କରି 7ରୁ 8 ଦିନ ବ୍ୟବଧାନରେ ଜଳସେଚନ କରାଯିବା ଉଚିତ। ଶୀତଦିନେ କୃଷକମାନେ ଶୀତଳ ବାୟୁ ସହିତ ସିଧାସଳଖ ସମ୍ପର୍କକୁ ରୋକିବା ପାଇଁ ଗାଈଶାଳାର ଦ୍ୱାର, ଝରକା ଏବଂ ଖୋଲା ସ୍ଥାନକୁ ପଲିଥିନ୍ କିମ୍ବା ବ୍ୟାଗ ପର୍ଦ୍ଦା ଦ୍ୱାରା ଆଚ୍ଛାଦିତ ରଖିବା ଉଚିତ୍। ଶୀତ ଋତୁରେ କୁକୁଡ଼ା ପାଳିରେ ଉତ୍ତାପ ବଜାୟ ରଖିବା ପାଇଁ, ପାଳିରେ ହିଟର୍ ଲଗାନ୍ତୁ।",
   "crops_data": {
      "rice": {
         "advisory": [
            "ସତ୍ୟଭାମା, ସହଭାଗି ଧାନ, ମନ୍ଦାକିନୀ, ମାନସ୍ୱିନୀ, ଡି. ଆର୍. ଆର୍. 42, ଡି. ଆର୍. ଆର୍.-43, ଡି. ଆର୍. ଆର୍.-44, ବିନା 11, ଜି. ବି.-1, ଉନ୍ନତ ଲଲାଟ, ଏମ. ଟି. ୟୁ. 1010, ଏମ. ଟି. ୟୁ. 1001, ନବୀନ, ସ୍ୱର୍ଣ୍ଣ ଶ୍ରେୟା ଭଳି ଉନ୍ନତ ମାନର ଧାନ ମଞ୍ଜି ପ୍ରସ୍ତୁତ କରନ୍ତୁ, ଯାହା ଶୁଖିଲା ଋତୁରେ ଚାଷ କରାଯାଇପାରିବ। ଏକ ଏକର ଜମିରେ ଏହି କିସମର ବିହନ ମୂଲ୍ୟ 20 କିଲୋଗ୍ରାମ ରହିଛି। ନର୍ସରୀରେ ବୁଣିବା ପୂର୍ବରୁ ମଞ୍ଜିଗୁଡ଼ିକୁ କାର୍ବେନଡାଜିମ୍ 50 ପ୍ରତିଶତ ଡବ୍ଲୁ. ପି. @2-ଗ୍ରାମ/1-କିଲୋଗ୍ରାମ ମଞ୍ଜି କିମ୍ବା କାର୍ବୋକ୍ସିନ୍ 37.5% + ଥିରମ୍ 37.5% @3-ଗ୍ରାମ/1 କିଲୋଗ୍ରାମ ମଞ୍ଜି ସହିତ ଚିକିତ୍ସା କରନ୍ତୁ।"
         ]
      },
      "sunflower": {
         "advisory": [
            "ଦ୍ୱିତୀୟ ଜଳସେଚନ ସମୟରେ ୟୁରିଆର ଅଧା ମାତ୍ରା ଏବଂ ଏମ୍. ଓ. ପି. ର ଅଧା ମାତ୍ରା ଦ୍ୱିତୀୟ ଟପ୍ ଡ୍ରେସିଂ ଭାବେ ଲଗାନ୍ତୁ। ଏସିଟାମିପ୍ରିଡ୍ 20 ପ୍ରତିଶତ ଏସ୍. ପି. @50 ଗ୍ରାମ୍/ଏକର କିମ୍ବା ଇମିଡାକ୍ଲୋପ୍ରିଡ୍ 17.8% ଏସ୍. ଏଲ୍. @60 ମିଲି/ଏକରକୁ 200 ଲିଟର ପାଣି ସହିତ ମିଶାଇ ଆବଶ୍ୟକ ଅନୁଯାୟୀ ସ୍ପ୍ରେ କରିବା ପାଇଁ ପରାମର୍ଶ ଦିଆଯାଇଛି। ପାଉଡର ଫଙ୍ଗୁର ପାଇଁ 2 ଗ୍ରାମ/ଲିଟର ପାଣି ଦେଇ 0.20% ଓଦା ହେଉଥିବା ଗନ୍ଧକ ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "blackgram": {
         "advisory": [
            "ପି. ଡି. ଏମ୍. 139, ପି. ଡି. ଏମ୍. 11 ଭଳି ୱାଇ. ଏମ୍. ଭି. ରୋଗ ପ୍ରତିରୋଧକ ପ୍ରଜାତି ବାଛନ୍ତୁ। ଶ୍ୱେତ ମାଛି ସଂକ୍ରମଣକୁ ରୋକିବା ପାଇଁ ମଞ୍ଜି ବୁଣିବା ପୂର୍ବରୁ ଇମିଡାକ୍ଲୋପ୍ରିଡ୍ @7 ଗ୍ରାମ୍/କେଜି ମଞ୍ଜି ସହିତ ଚିକିତ୍ସା କରାଯିବା ଉଚିତ। ଫସଲର 2ରୁ 3ଟି ପତ୍ର ପର୍ଯ୍ୟାୟରୁ ଆରମ୍ଭ କରି ହଳଦିଆ ଚଟପଟା ଜାଲ ଲଗାନ୍ତୁ। ଏହି ରୋଗର ଅଧିକ ବିସ୍ତାରକୁ ରୋକିବା ପାଇଁ ରୋଗାକ୍ରାନ୍ତ ଗଛଗୁଡ଼ିକୁ ବାହାର କରିଦେବା ଉଚିତ।"
         ]
      },
      "greengram": {
         "advisory": [
            "ପି. ଡି. ଏମ୍. 139, ପି. ଡି. ଏମ୍. 11 ଭଳି ୱାଇ. ଏମ୍. ଭି. ରୋଗ ପ୍ରତିରୋଧକ ପ୍ରଜାତି ବାଛନ୍ତୁ। ଶ୍ୱେତ ମାଛି ସଂକ୍ରମଣକୁ ରୋକିବା ପାଇଁ ମଞ୍ଜି ବୁଣିବା ପୂର୍ବରୁ ଇମିଡାକ୍ଲୋପ୍ରିଡ୍ @7 ଗ୍ରାମ୍/କେଜି ମଞ୍ଜି ସହିତ ଚିକିତ୍ସା କରାଯିବା ଉଚିତ। ଫସଲର 2ରୁ 3ଟି ପତ୍ର ପର୍ଯ୍ୟାୟରୁ ଆରମ୍ଭ କରି ହଳଦିଆ ଚଟପଟା ଜାଲ ଲଗାନ୍ତୁ। ଏହି ରୋଗର ଅଧିକ ବିସ୍ତାରକୁ ରୋକିବା ପାଇଁ ରୋଗାକ୍ରାନ୍ତ ଗଛଗୁଡ଼ିକୁ ବାହାର କରିଦେବା ଉଚିତ।"
         ]
      },
      "mustard": {
         "advisory": [
            "ଶୀଘ୍ର ବୁଣାଯାଇଥିବା ସୋରିଷ ଫସଲରେ ଏଫିଡ୍ ସଂକ୍ରମଣ ହେବାର ସମ୍ଭାବନା ରହିଛି। ପ୍ରାରମ୍ଭିକ ପର୍ଯ୍ୟାୟରେ ଏଫିଡ୍ ପରିଚାଳନା କରିବା ପାଇଁ, ଏକର ପିଛା ହଳଦିଆ ଚଟପଟା ଫାନ୍ଦ ଲଗାନ୍ତୁ | 200 ଲିଟର ପାଣିରେ ମିଶ୍ରଣ କରି ନିମ୍ବ ଆଧାରିତ କୀଟନାଶକ 1500 ପିପିଏମ @600-ମିଲି/ଏକର ସ୍ପ୍ରେ କରନ୍ତୁ। ଯଦି ସଂକ୍ରମଣ ଗୁରୁତର ହୁଏ, ତା \"ହେଲେ ରାସାୟନିକ କୀଟନାଶକ ଥିୟାମେଥୋକ୍ସାମ୍ @40-ଗ୍ରାମ୍/ଏକର କିମ୍ବା ଏସିଟାମିପ୍ରିଡ୍ @50-ଗ୍ରାମ୍/ଏକରକୁ 200-ଲିଟର ପାଣିରେ ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "groundnut": {
         "advisory": [
            "ଏଫିଡ୍ ଏବଂ ଥ୍ରୀପ୍ସର ପରିଚାଳନା ପାଇଁ ସଂକ୍ରମଣର ପ୍ରାଥମିକ ପର୍ଯ୍ୟାୟରେ ଏକର ପିଛା 1 ଲିଟରରେ 300 ପିପିଏମ୍ ନିମ୍ ଆଧାରିତ କୀଟନାଶକ ସ୍ପ୍ରେ କରନ୍ତୁ। ଯଦି ସଂକ୍ରମଣ ଗୁରୁତର ହୋଇଥାଏ, ତେବେ 200 ଲିଟର ପାଣିରେ ମିଶାଇ ଥିୟାମେଥୋକ୍ସାମ୍ ସ୍ପ୍ରେ କରନ୍ତୁ, 25 ପ୍ରତିଶତ ଡବ୍ଲୁ. ଜି. @40-ଗ୍ରାମ୍/ଏକର କିମ୍ବା ଇମିଡାକ୍ଲୋପ୍ରିଡ୍ 17.8% ଏସ୍. ଏଲ୍. @50-ମିଲି/ଏକର। ପ୍ରାକ୍-ଆବିର୍ଭାବ ହର୍ବିସାଇଡ୍ ଅକ୍ସିଫ୍ଲୁଅର୍ଫେନ୍ ଇ. ସି. @80 ମିଲି/ଏକର କିମ୍ବା ପେଣ୍ଡିମେଥାଲିନ୍ 30 ପ୍ରତିଶତ ଇ. ସି. @1-ଲିଟର/ଏକର କିମ୍ବା 1-2 ଡିଏଏସ୍ରେ ଲଗାନ୍ତୁ।"
         ]
      },
      "red gram": {
         "advisory": [
            "ଯେତେବେଳେ 70-80% ଶୁଆଗୁଡ଼ିକ ବାଦାମୀ ହୋଇଯାଏ, ସେତେବେଳେ ରେଡ୍ ଗ୍ରାମ୍ ଫସଲ ଅମଳ କରନ୍ତୁ। ପରିପକ୍ୱତା ପରେ ମଞ୍ଜି ଭାଙ୍ଗିଯାଇପାରେ, ଯାହାର ଫଳ ସ୍ୱରୂପ କମ୍ ଉତ୍ପାଦନ ହୋଇଥାଏ। ଅମଳ ହୋଇଥିବା ଗଛଗୁଡ଼ିକୁ ଋତୁ ଅନୁସାରେ 3ରୁ 6 ଦିନ ପର୍ଯ୍ୟନ୍ତ ସୂର୍ଯ୍ୟାଲୋକରେ ଶୁଖାଇବା ପାଇଁ ମଳତ୍ୟାଗ ସ୍ଥାନରେ ରଖିବା ଉଚିତ। ତା 'ପରେ ଏକ ଲାଠିରେ ଶୁଣ୍ଢକୁ ପ୍ରହାର କରି ଅମଳ କରାଯିବା ଉଚିତ୍। ସୁରକ୍ଷିତ ସଂରକ୍ଷଣ ପାଇଁ ଆର୍ଦ୍ରତାର ପରିମାଣ 10-12% ତଳକୁ ଆଣିବା ପାଇଁ ଶୁଖିଲା ଅମଳ ହୋଇଥିବା ମଞ୍ଜି ସିଧାସଳଖ ସୂର୍ଯ୍ୟାଲୋକରେ ଶୁଖାଇବା ଉଚିତ୍ | ଡାଲି ପ୍ରକ୍ରିୟାକରଣ ମିଶ୍ରିତ କ୍ଷୁଦ୍ର ଡାଲି କାରଖାନାରେ କରାଯିବା ଉଚିତ।"
         ]
      },
      "chilli": {
         "advisory": [
            "କୀଟ ସଂକ୍ରମଣର ପ୍ରାଥମିକ ପର୍ଯ୍ୟାୟରେ ଲଙ୍କାରେ ଏଫିଡ୍ ଏବଂ ଥ୍ରିପ୍ସକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ 200 ଲିଟର ପାଣିରେ ମିଶ୍ରଣ କରି ନିମ୍ବ-ଆଧାରିତ କୀଟନାଶକ 1500 ପିପିଏମ @600-ମିଲି/ଏକର ସ୍ପ୍ରେ କରନ୍ତୁ। ଥିୟାମେଥୋକ୍ସାମ୍ 25 ପ୍ରତିଶତ ଡବ୍ଲୁ. ଜି. @40 ଗ୍ରାମ୍/ଏକର କିମ୍ବା ଏସିଟାମିପ୍ରିଡ୍ 20 ପ୍ରତିଶତ ଏସ୍. ପି. @50 ଗ୍ରାମ୍/ଏକର କିମ୍ବା ପ୍ରୋଫେନୋଫସ୍ 40 ପ୍ରତିଶତ + ଫେନପାଇରୋକ୍ସିମେଟ୍ 2.5 ପ୍ରତିଶତ ଇ. ସି. @400-ମିଲି/ଏକର ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "cauliflower": {
         "advisory": [
            "ବ୍ରାଉନ୍ ରଟ୍ କୁ ରୋକିବା ପାଇଁ କୋଲ୍ ଫସଲରେ ରୋପଣ ସମୟରେ ମାଟି ପ୍ରୟୋଗ ଭାବରେ ବୋରାକ୍ସ ପ୍ରୟୋଗ କରନ୍ତୁ | ଯଦି ଚାରା ରୋପଣ ସମୟରେ ବୋରାକ୍ସ ପ୍ରୟୋଗ କରାଯାଇନଥାଏ, ତେବେ ବୋରାକ୍ସ ସ୍ପ୍ରେ କରନ୍ତୁ। ପ୍ରତିରୋପଣର ଦୁଇ ସପ୍ତାହ ପରେ ଏବଂ ଦହି ତିଆରି ହେବାର ଦୁଇ ସପ୍ତାହ ପୂର୍ବରୁ ବୋରନ ମାଇକ୍ରୋ ନ୍ୟୁଟ୍ରିଏଣ୍ଟ ସିଞ୍ଚନ କରାଯିବା ଉଚିତ।"
         ]
      },
      "cabbage": {
         "advisory": [
            "ଶୀଘ୍ର ରୋପଣ କରାଯାଇଥିବା କୋଲ୍ ଫସଲରେ ଡିମଣ୍ଡ ବ୍ୟାକ୍ ମଥ୍ର ସଂକ୍ରମଣ ହେବାର ସମ୍ଭାବନା ରହିଛି। ଏହି କୀଟକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ, ଏକର ପିଛା ହାଲୁକା ଫାନ୍ଦ ଲଗାନ୍ତୁ। କୀଟ ସଂକ୍ରମଣର ପ୍ରାଥମିକ ପର୍ଯ୍ୟାୟରେ 200 ଲିଟର ପାଣିରେ ମିଶାଇ ଏକର ପିଛା 1 ଲିଟର ହାରରେ ନିମ ଆଧାରିତ କୀଟନାଶକ ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "brinjal": {
         "advisory": [
            "ବାଇଗଣ ଏବଂ ଟମାଟୋ ଫସଲରେ ଧଳା ମାଛି ପରିଚାଳନା କରିବା ପାଇଁ, କୀଟପତଙ୍ଗମାନଙ୍କୁ ଆକର୍ଷିତ କରିବା ଏବଂ ମାରିବା ପାଇଁ ଏକର ପିଛା ହଳଦିଆ ଚଟପଟା ଜାଲ ବ୍ୟବହାର କରନ୍ତୁ | କୀଟ ସଂକ୍ରମଣର ପ୍ରାଥମିକ ପର୍ଯ୍ୟାୟରେ 200 ଲିଟର ପାଣିରେ ମିଶ୍ରଣ କରି ନିମ୍ବ-ଆଧାରିତ କୀଟନାଶକ 1500 ପିପିଏମ @600-ମିଲି/ଏକର ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "tomato": {
         "advisory": [
            "ଟମାଟୋରେ ଫଳ ଛେଦକକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ, ପ୍ରଥମେ ପ୍ରଭାବିତ ଫଳ ଏବଂ ବୟସ୍କ ଲାର୍ଭା ସଂଗ୍ରହ କରି ନଷ୍ଟ କରନ୍ତୁ। ଏକର ପିଛା ଫେରୋମୋନ୍ ଫାନ୍ଦ ସ୍ଥାପନ କରନ୍ତୁ। ଯଦି 10 ପ୍ରତିଶତ ଫଳ ଛେଦକ ଦ୍ୱାରା ସଂକ୍ରମିତ ହୋଇଥାଏ, ତେବେ କୀଟନାଶକ ସିଞ୍ଚନ କରନ୍ତୁ।"
         ]
      },
      "onion": {
         "advisory": [
            "ନର୍ସରୀରେ ରୋଗକୁ ହ୍ରାସ କରିବା ରୋକିବା ପାଇଁ, 15 ଦିନର ବ୍ୟବଧାନରେ ଲିଟର ପିଛା 2 ଗ୍ରାମ୍ କାର୍ବେନଡାଜିମ୍ ଦ୍ୱାରା ନର୍ସରୀ ଶଯ୍ୟାକୁ ଭିଜାଇ ଦିଅନ୍ତୁ। 8 ସପ୍ତାହ ପୁରୁଣା ଚାରା ମୁଖ୍ୟ କ୍ଷେତରେ ରୋପଣ କରାଯାଏ |"
         ]
      },
      "potato": {
         "advisory": [
            "ଶୀଘ୍ର ରୋପଣ କରାଯାଇଥିବା ଆଳୁ ଫସଲ 3 ସପ୍ତାହର ପର୍ଯ୍ୟାୟରେ ରହିଛି। ହୋଇଂ ଏବଂ ନିରାମୟ ପାଇଁ ଯାଆନ୍ତୁ ଏବଂ ଅବଶିଷ୍ଟ 30-45 Kg N/ଏକର ଲଗାନ୍ତୁ। ଆଲୁର ଉନ୍ନତ କନ୍ଦ ବୃଦ୍ଧି ପାଇଁ, ମାଟିର ତାପମାତ୍ରା 30 ଡିଗ୍ରୀ ସେଲସିୟସରୁ କମ୍ ରଖିବା ଉଚିତ। ତେଣୁ କୃଷକମାନଙ୍କୁ କ୍ଷେତକୁ ଜଳସେଚନ କରିବାକୁ ପରାମର୍ଶ ଦିଆଯାଇଛି। ଆଳୁ ଫସଲରେ ଲିଫ୍ ବ୍ଲାଇଟ୍ ରୋଗ ହେବାର ସମ୍ଭାବନା ରହିଛି। ଆଳୁରେ ଶୀଘ୍ର ପତ୍ରର ରୋଗକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ, ଏକର ପିଛା ମାନକୋଜେବ୍ 75 ପ୍ରତିଶତ ଡବ୍ଲ୍ୟୁ. ପି. @600 ଗ୍ରାମ୍ କିମ୍ବା କାର୍ବେଣ୍ଡାଜିମ୍ 12 ପ୍ରତିଶତ + ମାନକୋଜେବ୍ 63 ପ୍ରତିଶତ ଡବ୍ଲ୍ୟୁ. ପି. @400 ଗ୍ରାମ୍/ଏକର ସ୍ପ୍ରେ କରନ୍ତୁ। ଆଳୁରେ ବିଳମ୍ବରେ ହେଉଥିବା ରୋଗକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ 10 ଦିନର ବ୍ୟବଧାନରେ ମେଟାଲ୍ୟାକ୍ସିଲ 8 ପ୍ରତିଶତ + ମାନକୋଜେବ 64 ପ୍ରତିଶତ ୱୁପି @40 = ଗ୍ରାମ/ଏକର ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      }
   },
   "date": "17-01-2025"
}