{
   "weather_details": {
      "18-01-2025": {
         "rainfall": 0,
         "t_max": 27,
         "t_min": 15,
         "rh_max": 87,
         "rh_min": 31,
         "wind_speed": 2,
         "wind_direction": 315,
         "cloud_cover": 3
      },
      "19-01-2025": {
         "rainfall": 0,
         "t_max": 28,
         "t_min": 15,
         "rh_max": 81,
         "rh_min": 29,
         "wind_speed": 3,
         "wind_direction": 325,
         "cloud_cover": 3
      },
      "20-01-2025": {
         "rainfall": 0,
         "t_max": 28,
         "t_min": 15,
         "rh_max": 76,
         "rh_min": 29,
         "wind_speed": 2,
         "wind_direction": 351,
         "cloud_cover": 2
      },
      "21-01-2025": {
         "rainfall": 0,
         "t_max": 28,
         "t_min": 15,
         "rh_max": 81,
         "rh_min": 29,
         "wind_speed": 3,
         "wind_direction": 325,
         "cloud_cover": 3
      },
      "22-01-2025": {
         "rainfall": 0,
         "t_max": 27,
         "t_min": 16,
         "rh_max": 81,
         "rh_min": 29,
         "wind_speed": 3,
         "wind_direction": 325,
         "cloud_cover": 2
      }
   },
   "names_of_crops": [
      "ଧାନ।",
      "କଳା ଗ୍ରାମ",
      "ସୋରିଷ",
      "ଚିନାବାଦାମ",
      "କୋଇଲା ଫସଲ",
      "ଟମାଟୋ",
      "ଆଳୁ",
      "ବାଇଗଣ",
      "ରସୁଣ",
      "ଆମ୍ବ"
   ],
   "general_advisory": "ସର୍ବନିମ୍ନ ତାପମାତ୍ରା ହ୍ରାସକୁ ଦୃଷ୍ଟିରେ ରଖି, ବିଭିନ୍ନ ସ୍ଥାୟୀ ଫସଲ ପାଇଁ ହାଲୁକା ଜଳସେଚନ ପ୍ରୟୋଗ କରନ୍ତୁ। କମ୍ ତାପମାତ୍ରା କାରଣରୁ କମ୍ ଅଙ୍କୁରୋଦଗମକୁ ଏଡ଼ାଇବା ପାଇଁ ପନିପରିବା ନର୍ସରୀ ଉପରେ କମ୍ ମୂଲ୍ୟର ପଲିଥିନ୍ କଭର ବ୍ୟବହାର କରନ୍ତୁ। ଦିନ ପୁରୁଣା ଧାନ ଚାରା ରୋପଣ 20x15 ସେ. ମି. ବ୍ୟବଧାନରେ କରାଯିବା ଉଚିତ, ଅଧିକ ଉତ୍ପାଦନକ୍ଷମ ପ୍ରଜାତି ପାଇଁ ପ୍ରତି ପାହାଡ଼ରେ 2ଟି ଚାରା ଲଗାଇବା ଉଚିତ। ଧାନରେ ଜୀବାଣୁଜନିତ ରୋଗକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ, 30 ମିନିଟ୍ ପାଇଁ ରୋପଣ କରିବା ପୂର୍ବରୁ 0.1% ପ୍ଲାଣ୍ଟୋମାଇସିନ୍ ଦ୍ରବଣରେ ଚାରା ମୂଳକୁ ବୁଡ଼ାନ୍ତୁ |",
   "crops_data": {
      "paddy": {
         "advisory": [
            "20x15 ସେ. ମି. ବ୍ୟବଧାନରେ ଦିନ ପୁରୁଣା ଧାନ ଚାରା ରୋପଣ କରନ୍ତୁ, ଅଧିକ ଉତ୍ପାଦନକ୍ଷମ କିସମ ପାଇଁ ପ୍ରତି ପାହାଡ଼ରେ 2 ଚାରା ରୋପଣ କରନ୍ତୁ।",
            "30 ମିନିଟ୍ ପାଇଁ ରୋପଣ କରିବା ପୂର୍ବରୁ 0.1% ପ୍ଲାଣ୍ଟୋମାଇସିନ୍ ଦ୍ରବଣରେ ଚାରା ମୂଳକୁ ବୁଡ଼ାଇ ଧାନରେ ଜୀବାଣୁଜନିତ ରୋଗକୁ ନିୟନ୍ତ୍ରଣ କରନ୍ତୁ |"
         ]
      },
      "blackgram": {
         "advisory": [
            "ପାଉଡର ଫଙ୍ଗୁର ରୋଗକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ, ସଲଫର୍ 80 ପ୍ରତିଶତ ଡବ୍ଲ୍ୟୁ. ପି. କିମ୍ବା ହେକ୍ସାକୋନାଜୋଲ୍ 5 ପ୍ରତିଶତ ଇ. ସି. ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "mustard": {
         "advisory": [
            "ଶ୍ୱେତ ରଷ୍ଟ୍ ରୋଗକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ ମେଟାଲାକ୍ସିଲ୍ @2g ଲିଟର ପାଣି ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "groundnut": {
         "advisory": [
            "ଉଦ୍ଭିଦ ତଳେ କ୍ଲୋରୋପାଇରିଫସ୍ କିମ୍ବା ଇମିଡାକ୍ଲୋପ୍ରିଡ୍ ବୁଡ଼ାଇ ଧଳା ଗ୍ରବ୍ ସଂକ୍ରମଣକୁ କମ୍ କରନ୍ତୁ |"
         ]
      },
      "cole crops": {
         "advisory": [
            "ଫେରୋମନ୍ ଟ୍ରାପ୍ ବ୍ୟବହାର କରି ଜୈବିକ ଭାବରେ ତମାଖୁ କ୍ୟାଟର୍ପିଲର ପରିଚାଳନା କରନ୍ତୁ କିମ୍ବା ହାଲୁକା ଟ୍ରାପ୍ ସ୍ଥାପନ କରନ୍ତୁ",
            "ରାସାୟନିକ ନିୟନ୍ତ୍ରଣଃ ମଧ୍ୟାହ୍ନ ସମୟରେ କ୍ଲୋରପାଇରିଫୋସ୍ + ସାଇପର୍ମେଥ୍ରିନ୍ କିମ୍ବା ଲାମ୍ବଡା ସାଇହାଲୋଥ୍ରିନ୍ ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "tomato": {
         "advisory": [
            "ଏଫିଡକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ, ନିମ୍ବ ତେଲ କିମ୍ବା ଫ୍ଲୋନିକାମ ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "potato": {
         "advisory": [
            "କୀଟ ସଂକ୍ରମଣର ପ୍ରାଥମିକ ପର୍ଯ୍ୟାୟରେ ଏଫିଡ୍ ନିୟନ୍ତ୍ରଣ ପାଇଁ ନିମ୍ବ ଆଧାରିତ କୀଟନାଶକ କିମ୍ବା ଥାୟାମେଥୋକ୍ସାମ୍ କିମ୍ବା ଏସିଟାମିପ୍ରିଡ୍ କିମ୍ବା ଇମିଡାକ୍ଲୋପ୍ରିଡ୍ ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "brinjal": {
         "advisory": [
            "ଧଳା ମାଛିଙ୍କୁ ଆକର୍ଷିତ କରିବା ଏବଂ ମାରିବା ପାଇଁ ହଳଦିଆ ଚଟପଟା ଜାଲ ବ୍ୟବହାର କରନ୍ତୁ, ନିମ୍ବ-ଆଧାରିତ କୀଟନାଶକ ସ୍ପ୍ରେ କରନ୍ତୁ କିମ୍ବା ଥାୟାମେଥୋକ୍ସାମ୍, ପାଇରିପ୍ରୋକ୍ସିଫେନ୍, କିମ୍ବା ସ୍ପାଇରୋମେସିଫେନ୍ ସହିତ ରାସାୟନିକ ନିୟନ୍ତ୍ରଣ କରନ୍ତୁ |"
         ]
      },
      "onion": {
         "advisory": [
            "ରୋପଣ ପୂର୍ବରୁ 8 ସପ୍ତାହ ପୁରୁଣା ପିଆଜର ଚାରା ରୋପଣ କରନ୍ତୁ, କମ୍ପୋଷ୍ଟ, ଡିଏପି, ମ୍ୟୁରେଟ ଅଫ ପୋଟାଶ, ୟୁରିଆ ଏବଂ ସଲଫର ଲଗାନ୍ତୁ।"
         ]
      },
      "mango": {
         "advisory": [
            "ଆମ୍ବ ହପରକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ ଇମିଡାକ୍ଲୋପ୍ରିଡ୍ କିମ୍ବା କାର୍ବେଣ୍ଡାଜିମ୍ ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      }
   },
   "date": "17-01-2025"
}