{
   "weather_details": {
      "11/01/2025": {
         "rainfall": 0,
         "t_max": 14,
         "t_min": 4,
         "rh_max": 87,
         "rh_min": 36,
         "wind_speed": 4,
         "wind_direction": 280,
         "cloud_cover": 0
      },
      "18/01/2025": {
         "rainfall": 0,
         "t_max": 25,
         "t_min": 11,
         "rh_max": 87,
         "rh_min": 37,
         "wind_speed": 4,
         "wind_direction": 280,
         "cloud_cover": 0
      },
      "19/01/2025": {
         "rainfall": 0,
         "t_max": 25,
         "t_min": 11,
         "rh_max": 87,
         "rh_min": 36,
         "wind_speed": 5,
         "wind_direction": 330,
         "cloud_cover": 0
      },
      "20/01/2025": {
         "rainfall": 0,
         "t_max": 26,
         "t_min": 11,
         "rh_max": 81,
         "rh_min": 34,
         "wind_speed": 4,
         "wind_direction": 330,
         "cloud_cover": 0
      },
      "21/01/2025": {
         "rainfall": 0,
         "t_max": 25,
         "t_min": 11,
         "rh_max": 87,
         "rh_min": 37,
         "wind_speed": 4,
         "wind_direction": 280,
         "cloud_cover": 0
      },
      "22/01/2025": {
         "rainfall": 0,
         "t_max": 25,
         "t_min": 11,
         "rh_max": 87,
         "rh_min": 36,
         "wind_speed": 5,
         "wind_direction": 330,
         "cloud_cover": 0
      }
   },
   "names_of_crops": [
      "ଧାନ।",
      "ଚିନାବାଦାମ",
      "ଆଖୁ",
      "କଦଳୀ",
      "କୋଇଲା ଫସଲ",
      "ନଡ଼ିଆ",
      "କଦଳୀ",
      "ମତ୍ସ୍ୟଚାଷ"
   ],
   "general_advisory": "କୃଷକମାନଙ୍କୁ ନର୍ସରୀ ଶଯ୍ୟା ପ୍ରସ୍ତୁତ କରିବାକୁ ଏବଂ ନର୍ସରୀରେ ବୁଣିବା ପୂର୍ବରୁ କାର୍ବେନଡାଜିମ୍ 50 ପ୍ରତିଶତ ଡବ୍ଲ୍ୟୁ. ପି. 1.5 ଗ୍ରାମ/1 କେଜି ମଞ୍ଜି କିମ୍ବା କାର୍ବୋକ୍ସିନ୍ 37.5% + ଥିରମ୍ 37.5% @3 ଗ୍ରାମ/1 କେଜି ମଞ୍ଜି ସହିତ ଚିକିତ୍ସା କରିବାକୁ ପରାମର୍ଶ ଦିଆଯାଇଛି। ଥଣ୍ଡା ଆଘାତକୁ ଏଡ଼ାଇବା ପାଇଁ ଘାସ କିମ୍ବା ଅନ୍ୟାନ୍ୟ ମଲ୍ଚିଙ୍ଗ ସାମଗ୍ରୀ ସହିତ ପନିପରିବା ଚାରା ମାଲ୍ଚ କରନ୍ତୁ | ପ୍ରଚଳିତ ନିମ୍ନ ତାପମାତ୍ରାକୁ ଦୃଷ୍ଟିରେ ରଖି, ଠିଆ ହୋଇଥିବା ପନିପରିବା ଏବଂ ଫସଲକୁ ହାଲୁକା ଜଳସେଚନ ପ୍ରଦାନ କରନ୍ତୁ। ଧାନ ଚାରା ଗୁଡ଼ିକର ଉପଯୁକ୍ତ ପ୍ରତିଷ୍ଠା ଏବଂ ଶୀଘ୍ର ବୃଦ୍ଧି ପାଇଁ, ଗର୍ତ୍ତରେ ଜଳସେଚନ ପ୍ରୟୋଗ କରି ନର୍ସରୀ ଶଯ୍ୟାର ପୃଷ୍ଠ ମାଟିରେ ପରିପୂର୍ଣ୍ଣ ଅବସ୍ଥାକୁ ବଜାୟ ରଖନ୍ତୁ | ଆଖୁରେ ଆଗାଛାକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ ରୋପଣର 3 ଦିନ ମଧ୍ୟରେ ଏକର ପିଛା 800 ଗ୍ରାମ ପିଛା ଆଟ୍ରାଜିନ୍ 50 ପ୍ରତିଶତ ଡବ୍ଲ୍ୟୁ. ପି. ଭଳି ପ୍ରାକ୍-ଉଦ୍ଭବ ତୃଣନାଶକ ବ୍ୟବହାର କରନ୍ତୁ। ସୂର୍ଯ୍ୟମୁଖୀ ଫସଲ 25-30 ଦିନର ପର୍ଯ୍ୟାୟରେ ରହିଛି। ହଏଙ୍ଗ୍ ଏବଂ ଆଗାଛା କାଟିବା ଏବଂ ପତଳା କରିବା ପାଇଁ ଯାଆନ୍ତୁ ଏବଂ ଏନ୍-ସାର ଲଗାନ୍ତୁ।",
   "crops_data": {
      "paddy": {
         "advisory": [
            "ବାସଲ ସାର ପ୍ରୟୋଗଃ ଯେଉଁ କୃଷକମାନେ ରୋପଣ କରିବାକୁ ଯାଉଛନ୍ତି, ସେମାନେ ଏକର ପିଛା 35 କିଲୋଗ୍ରାମ ଡିଏପି, 30 କିଲୋଗ୍ରାମ ଏମଓପି ଏବଂ 8 କିଲୋଗ୍ରାମ ୟୁରିଆ ପ୍ରୟୋଗ କରିବା ଉଚିତ। ବାଲୁକାମୟ ମୃତ୍ତିକା ପାଇଁ ଏକର ପିଛା 35 କିଲୋଗ୍ରାମ ଡିଏପି, 15 କିଲୋଗ୍ରାମ ଏମଓପି ଏବଂ 8 କିଲୋଗ୍ରାମ ୟୁରିଆ ଲଗାନ୍ତୁ। ଜିଙ୍କ ଅଭାବ ଥିବା ମାଟିରେ ଜିଙ୍କ ସଲ୍ଫେଟ୍ (21 ପ୍ରତିଶତ) ପ୍ରତି ତିନି ବର୍ଷରେ ଏକର ପିଛା 10 କିଲୋଗ୍ରାମ ଲେଖାଏଁ ଲଗାନ୍ତୁ। 20 x 15 ସେ. ମି. ବ୍ୟବଧାନରେ 25-30 ଦିନ ପୁରୁଣା ଚାରା ରୋପଣ କରାଯିବା ଉଚିତ, ଅଧିକ ଉତ୍ପାଦନକ୍ଷମ ପ୍ରଜାତି ପାଇଁ ପ୍ରତି ପାହାଡ଼ରେ 2ରୁ 3 ଚାରା ରୋପଣ କରାଯିବା ଉଚିତ।"
         ]
      },
      "groundnut": {
         "advisory": [
            "କ୍ଲୋରୋପାଇରିଫସ୍ @6 ମିଲି/ଲିଟର ଜଳ କିମ୍ବା ଇମିଡାକ୍ଲୋପ୍ରିଡ୍ 30.5 sc@1ml ଲିଟର ଜଳକୁ ଉଦ୍ଭିଦ ତଳେ ବୁଡ଼ାଇ ଚିନାବାଦାମରେ ଧଳା ଗ୍ରାବ୍ ସଂକ୍ରମଣକୁ ହ୍ରାସ କରାଯାଇପାରିବ |",
            "ବାଲିଡାମାଇସିନ୍ 3 ପ୍ରତିଶତ ଏଲ @400-ମିଲି/ଏକର କିମ୍ବା କ୍ୟାପଟାନ 70 ପ୍ରତିଶତ + ହେକ୍ସାକୋନାଜୋଲ 5 ପ୍ରତିଶତ ଡବ୍ଲ୍ୟୁ. ପି. @300-ଗ୍ରାମ/ଏକର ସହିତ ଚିନାବାଦାମ ଗର୍ତ୍ତ ମାଟିରେ କାଣ୍ଡ ପଚାକୁ ନିୟନ୍ତ୍ରଣ କରିବା।"
         ]
      },
      "sugarcane": {
         "advisory": [
            "ଆଖୁ ଫସଲ ଏକ ଭାରୀ ପୋଷକ। ଗର୍ତ୍ତରେ ରୋପଣ କରିବା ସମୟରେ 87 କିଲୋଗ୍ରାମ ଡିଏପି, 20 କିଲୋଗ୍ରାମ ଏମଓପି ଏବଂ 4 ଟନ ଏଫ୍. ଆଇ. ଏମ୍. ପ୍ରୟୋଗ କରନ୍ତୁ। ରୋପଣର 45,75 ଏବଂ 105 ଦିନ ପରେ ଏକର ପିଛା 60 କିଲୋଗ୍ରାମ ୟୁରିଆ ସହିତ ଉପର ଡ୍ରେସିଂ କରାଯିବା ଉଚିତ୍ | ୟୁରିଆ ସହିତ ତୃତୀୟ ଶୀର୍ଷ ଡ୍ରେସିଂ ସମୟରେ ଅବଶିଷ୍ଟ 20 କିଲୋଗ୍ରାମ ଏମଓପି ପ୍ରୟୋଗ କରନ୍ତୁ | ରୋପଣର 120 ଦିନ ପରେ ୟୁରିଆ ଲଗାନ୍ତୁ ନାହିଁ କାରଣ ବିଳମ୍ବରେ ପ୍ରୟୋଗ ପରିପକ୍ୱତାରେ ବିଳମ୍ବ କରେ, ସୁକ୍ରୋଜ୍ ପରିମାଣ ଏବଂ ମୋଟ ଆଖୁ ଉତ୍ପାଦନ ହ୍ରାସ କରେ |"
         ]
      },
      "cowpea": {
         "advisory": [
            "ଲୋମଯୁକ୍ତ କ୍ୟାଟର୍ପିଲରକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ ଫ୍ଲୁବେଣ୍ଡିଆମାଇଡ୍ 39.35% ଏସ୍ସି @80 ମିଲି/200 ଲିଟର ପାଣି ସ୍ପ୍ରେ କରନ୍ତୁ। ଯଦି ସେରକୋସ୍ପୋରା ପତ୍ର ଦାଗ ଦେଖାଯାଏ, ତେବେ ଏକର ପିଛା ଡିଫିନୋକୋନାଜୋଲ୍ 25 ପ୍ରତିଶତ ଇସି @200 ମିଲି କିମ୍ବା କାର୍ବେଣ୍ଡାଜିମ୍ 12 ପ୍ରତିଶତ + ମାଙ୍କୋଜେବ୍ 63 ପ୍ରତିଶତ ଡବ୍ଲ୍ୟୁ. ପି. 400 ଗ୍ରାମ/200 ଲିଟର ପାଣି ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "cole crops": {
         "advisory": [
            "ଫୁଲକୋବି ଏବଂ ବନ୍ଧାକୋବି ଫସଲରେ ଡିମଣ୍ଡ ବ୍ୟାକ୍ ମଥ୍ ଏବଂ ହେଡ୍ ବୋରର୍ ସଂକ୍ରମଣ ହେବାର ସମ୍ଭାବନା ରହିଛି। କୀଟ ଆକ୍ରମଣର ପ୍ରାରମ୍ଭିକ ପର୍ଯ୍ୟାୟରେ କ୍ୟାଟର୍ପିଲର ଏବଂ ଅଣ୍ଡା ପିଣ୍ଡକୁ ସଂଗ୍ରହ ଏବଂ ନଷ୍ଟ କରନ୍ତୁ | 200 ଲିଟର ପାଣିରେ ମିଶ୍ରଣ କରି ନିମ୍ବ ଆଧାରିତ କୀଟନାଶକ (ଆଜାଦିରାକ୍ଟିନ) 300 ପିପିଏମ ପ୍ରତି ଏକର ପିଛା 1 ଲିଟରରେ ସ୍ପ୍ରେ କରନ୍ତୁ। ଏହି କୀଟପତଙ୍ଗକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ ରାସାୟନିକ ଉପାୟରେ ଟଲ୍ଫେନ୍ପାଇରାଡ୍ 15 ପ୍ରତିଶତ ଇସି @400-ମିଲି/ଏକର କିମ୍ବା ଫ୍ଲୁବେଣ୍ଡିଆମାଇଡ୍ 20 ପ୍ରତିଶତ ଡବ୍ଲୁଜି @20-ଗ୍ରାମ୍/ଏକର କିମ୍ବା କ୍ଲୋର୍ଫେନାପାଇର୍ 10 ପ୍ରତିଶତ ଏସ୍ସି @400-ମିଲି/ଏକର କିମ୍ବା ସ୍ପିନୋସାଡ୍ 45 ପ୍ରତିଶତ ଏସ୍ସି @75-ମିଲି/ଏକରକୁ 200 ଲିଟର ପାଣିରେ ମିଶାଇ ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "coconut": {
         "advisory": [
            "ଲାଲ ପାମ୍ ୱିଭିଲର ସଂକ୍ରମଣରୁ ନିୟନ୍ତ୍ରଣ ପାଇଁ, କାଣ୍ଡର ଗର୍ତ୍ତରେ 3 ପ୍ରତିଶତ ଜି + ବାଲି 1:1 ଅନୁପାତରେ କାର୍ବେନଡାଜିମ୍ ଲଗାନ୍ତୁ ଏବଂ ଗର୍ତ୍ତକୁ ପ୍ଲଗ୍ କରନ୍ତୁ | ଗଣ୍ଡା ଭୃଣକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ ନଡ଼ିଆ ବଗିଚାର ନିକଟସ୍ଥ କମ୍ପୋଷ୍ଟ ପ୍ରାଙ୍ଗଣକୁ ସଫା କରନ୍ତୁ ଏବଂ 1.5 ପ୍ରତିଶତ କ୍ଲୋରପାଇରିଫୋସ୍ ଧୂଳି ଲଗାଇ ଏହାକୁ ବିଶୋଧନ କରନ୍ତୁ।"
         ]
      },
      "banana": {
         "advisory": [
            "ସିଗାଟୋକା ପତ୍ର ସ୍ପଟକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ ଲିଟର ପିଛା 2 ଗ୍ରାମ କାର୍ବେଣ୍ଡାଜିମ୍ 12 ପ୍ରତିଶତ + ମାଙ୍କୋଜେବ୍ 63 ପ୍ରତିଶତ ଡବ୍ଲ୍ୟୁ. ପି. କିମ୍ବା କ୍ଲୋରୋଥାଲୋନିଲ୍ 75 ପ୍ରତିଶତ ଡବ୍ଲ୍ୟୁ. ପି. ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "pisciculture": {
         "advisory": [
            "ଶୀତଦିନେ \"ଇ. ୟୁ. ଏସ୍\". (ଏପିଜୁଟିକ୍ ଅଲ୍ସରେଟିଭ୍ ସିଣ୍ଡ୍ରୋମ୍) ହେବାର ସମ୍ଭାବନା ରହିଛି। ପ୍ରତିଷେଧକ ପଦକ୍ଷେପ ସ୍ୱରୂପ କୃଷକମାନଙ୍କୁ ଏକ ଏକର ପୋଖରୀ ଅଞ୍ଚଳରେ 40 ଲିଟର ପାଣି ସହିତ 400 ମିଲି 'ସିଫ୍ୟାକ୍ସ \"ଲଗାଇବାକୁ ପରାମର୍ଶ ଦିଆଯାଇଛି। ମାଛମାନଙ୍କୁ ସେମାନଙ୍କର ଜୈବବସ୍ତୁର ତୈଳ କେକ୍ ବ୍ରାନ୍ ମିଶ୍ରଣ @2-3% ଦୈନିକ ଖୁଆଇବା ଉଚିତ୍।"
         ]
      }
   },
   "date": "17-01-2025"
}