{
   "weather_details": {
      "2024-12-18": {
         "rainfall": 0.9,
         "t_max": 30,
         "t_min": 15,
         "rh_max": 78,
         "rh_min": 42,
         "wind_speed": 4,
         "wind_direction": 17,
         "cloud_cover": 7
      },
      "2024-12-19": {
         "rainfall": 6.0,
         "t_max": 29,
         "t_min": 16,
         "rh_max": 92,
         "rh_min": 58,
         "wind_speed": 5,
         "wind_direction": 45,
         "cloud_cover": 8
      },
      "2024-12-20": {
         "rainfall": 8.4,
         "t_max": 30,
         "t_min": 17,
         "rh_max": 90,
         "rh_min": 67,
         "wind_speed": 5,
         "wind_direction": 51,
         "cloud_cover": 8
      },
      "2024-12-21": {
         "rainfall": 11.6,
         "t_max": 29,
         "t_min": 17,
         "rh_max": 96,
         "rh_min": 67,
         "wind_speed": 3,
         "wind_direction": 27,
         "cloud_cover": 7
      },
      "2024-12-22": {
         "rainfall": 5.3,
         "t_max": 29,
         "t_min": 17,
         "rh_max": 92,
         "rh_min": 52,
         "wind_speed": 4,
         "wind_direction": 20,
         "cloud_cover": 5
      }
   },
   "names_of_crops": [
      "ଚାଉଳ",
      "କପା",
      "ସୋରିଷ",
      "ମେନାସିନାକାହି",
      "ଲଙ୍କା",
      "ଟମାଟୋ",
      "ରସୁଣ",
      "ଗାଈ।",
      "ଛେଳି।",
      "ସାଧାରଣ ମାଛ"
   ],
   "general_advisory": "ଗତ ସପ୍ତାହରେ ଗଜପତି ଜିଲ୍ଲାର ହାରାହାରି ସର୍ବାଧିକ ଦୈନିକ ତାପମାତ୍ରା 30.7 ଡିଗ୍ରୀ ସେଲସିୟସ୍ ଏବଂ ହାରାହାରି ସର୍ବନିମ୍ନ ଦୈନିକ ତାପମାତ୍ରା 16.3 ଡିଗ୍ରୀ ସେଲସିୟସ୍ ଥିଲା। ଗତ ସପ୍ତାହରେ ଜିଲ୍ଲାରେ 0.8 ମିଲିମିଟର ବର୍ଷା ହୋଇଥିଲା। ନିମ୍ନ ରାତି ତାପମାତ୍ରା ଏବଂ କୁହୁଡ଼ି ପରିସ୍ଥିତି ହେତୁ ରବି ଫସଲ ଏବଂ ପନିପରିବାରେ ଶୋଷକ କୀଟ, ପତ୍ର ରୋଗ, ପାଉଡର ଫଙ୍ଗୁର ସଂକ୍ରମଣ ହେବାର ସମ୍ଭାବନା ରହିବ। ଫସଲ ଏବଂ ପନିପରିବା ଉପରେ ନଜର ରଖନ୍ତୁ, ଯଦି ଲକ୍ଷଣ ଦେଖାଯାଏ, ଉପଯୁକ୍ତ ଉଦ୍ଭିଦ ସୁରକ୍ଷା ପଦକ୍ଷେପ ଗ୍ରହଣ କରନ୍ତୁ। ରବି ପନିପରିବାରେ ନିଡ଼ାଇ, ହୋଇଂ ଏବଂ ଅନ୍ୟାନ୍ୟ ଆନ୍ତଃସାଂସ୍କୃତିକ କାର୍ଯ୍ୟକଳାପ କରନ୍ତୁ | କୋଇଲା ଫସଲରେ ମାଟିର ଆର୍ଦ୍ରତା ଏବଂ ପାଣିପାଗ ସ୍ଥିତି ଉପରେ ନିର୍ଭର କରି 7ରୁ 8 ଦିନ ବ୍ୟବଧାନରେ ଜଳସେଚନ କରାଯିବା ଉଚିତ। ଶୀତଦିନେ କୃଷକମାନେ ଦ୍ୱାର ରଖିବା ଉଚିତ, ଜିତିବା ଉଚିତ।",
   "crops_data": {
      "rice": {
         "advisory": [
            "ଗଚ୍ଛିତ ଶସ୍ୟ କୀଟପତଙ୍ଗର ସଂକ୍ରମଣକୁ ଲକ୍ଷ୍ୟ କରିବାର ତୁରନ୍ତ ପରେ, ଆଲୁମିନିୟମ୍ ଫସଫାଇଡ୍ ଟାବଲେଟ୍ ବ୍ୟବହାର କରି (ଘରେ ବ୍ୟବହାର କରନ୍ତୁ ନାହିଁ) 3 ଟାବଲେଟ୍/ଟନ୍ ଶସ୍ୟ (ମୋଟ 9 ଗ୍ରାମ୍ ଟାବଲେଟ୍) ମୋଟାମୋଟି ବାୟୁ ଟାଇଟ କଣ୍ଟେନରରେ କିମ୍ବା ମୋଟା ତିରପାଲ ସହିତ ଆଚ୍ଛାଦନ କରି କୌଣସି ବ୍ୟବଧାନ ଛାଡି ବ୍ୟବହାର କରନ୍ତୁ | ଟାବଲେଟ୍ଗୁଡ଼ିକୁ ଷ୍ଟାକ୍ରେ ରଖିବା ପୂର୍ବରୁ ସେଗୁଡ଼ିକୁ ସୂତା ପାଉଚରେ ବାନ୍ଧି ରଖିବା ଉଚିତ। ଗ୍ୟାସ୍ ଲିକ୍ ରୋକିବା ପାଇଁ ପ୍ଲାଷ୍ଟିକ୍ କଭର୍ର ସମସ୍ତ କୋଣକୁ 6 ଇଞ୍ଚ ମୋଟା ସ୍ତର କାଦୁଅ/ଆଡ଼େସିଭ୍ ଟେପ୍ ଦ୍ୱାରା ପ୍ଲାଷ୍ଟର କରାଯିବା ଉଚିତ। ସର୍ବନିମ୍ନ ଏକ୍ସପୋଜର ଅବଧି ପ୍ରାୟ 7-10 ଦିନ ପାଇଁ | ସତ୍ୟଭାମା, ସହଭାଗି ଧାନ, ମନ୍ଦାକିନୀ, ମାନସ୍ୱିନୀ, ଡି. ଆର୍. ଆର୍. 42, ଡି. ଆର୍. ଆର୍.-43, ଡି. ଆର୍. ଆର୍.-44, ବିନା 1, ଜି. ବି.-1, ଉନ୍ନତ ଲଲାଟ, ଏମ. ଟି. ୟୁ. 1010, ଏମ. ଟି. ୟୁ. 1001, ନବୀନ, ସ୍ୱର୍ଣ୍ଣ ଶ୍ରେୟା ଭଳି ଉନ୍ନତ ମାନର ଧାନ ମଞ୍ଜି ପ୍ରସ୍ତୁତ କରନ୍ତୁ, ଯାହା ଶୁଖିଲା ଋତୁରେ ଚାଷ କରାଯାଇପାରିବ। ଏହି କିସମଗୁଡ଼ିକ ପାଇଁ ଏକ ଏକର ଜମି ପାଇଁ ବୀଜ ହାର ହେଉଛି 20 କିଲୋଗ୍ରାମ। ମଞ୍ଜି ଗୁଡ଼ିକୁ କାର୍ବେନଡାଜିମ୍ 50 ପ୍ରତିଶତ ଡବ୍ଲୁ. ପି. @2-ଗ୍ରାମ୍/1-କିଲୋଗ୍ରାମ୍ ମଞ୍ଜି କିମ୍ବା କାର୍ବୋକ୍ସିନ୍ 37.5% + ଥିରମ୍ 37.5% @3-ଗ୍ରାମ୍/1 ସହିତ ଉପଚାର କରନ୍ତୁ।"
         ]
      },
      "cotton": {
         "advisory": [
            "କୃଷକମାନଙ୍କୁ ସକାଳ 9ଟା ପରେ କିମ୍ବା ଫସଲ ପୃଷ୍ଠରୁ ଶିଶିର ଶୁଖିଗଲା ପରେ ସୂର୍ଯ୍ୟକିରଣ ଦିନଗୁଡ଼ିକରେ କପା ଉଠାଇବା ପାଇଁ ପରାମର୍ଶ ଦିଆଯାଇଛି। କପଡ଼ା ବ୍ୟାଗ କିମ୍ବା ପ୍ଲାଷ୍ଟିକ୍ ବାସ୍କେଟରେ ଥିବା ସୂତା ବୀଜକୁ ଉଠାନ୍ତୁ। କପା ମଞ୍ଜିରୁ ଶୁଖିଲା ପତ୍ର ଏବଂ ଗଛର ଅନ୍ୟ ଅଂଶକୁ ବାହାର କରିଦିଅନ୍ତୁ। ପ୍ରଥମେ ବୁଣିବା, ଦ୍ୱିତୀୟରେ ବୁଣିବା ଏବଂ ତୃତୀୟରେ ବୁଣିବା କପା। ଯଦି କପାର ଏକାଧିକ କିସମ କିମ୍ବା ହାଇବ୍ରିଡ୍ ଚାଷ କରାଯାଏ, ତେବେ ସେଗୁଡ଼ିକୁ ଅଲଗା ରଖନ୍ତୁ | ବୀଜ କପଡ଼ାକୁ କଂକ୍ରିଟ୍ ଚଟାଣ କିମ୍ବା ତିରପାଲରେ ସିଧାସଳଖ ସୂର୍ଯ୍ୟାଲୋକରେ 2 ରୁ 3 ଘଣ୍ଟା ଶୁଖାଇ ସଫା କପଡା ବ୍ୟାଗରେ ରଖନ୍ତୁ |"
         ]
      },
      "mustard": {
         "advisory": [
            "ଶୀଘ୍ର ବୁଣାଯାଇଥିବା ସୋରିଷ ଫସଲରେ ଏଫିଡ୍ ସଂକ୍ରମଣ ହେବାର ସମ୍ଭାବନା ରହିଛି। ପ୍ରାରମ୍ଭିକ ପର୍ଯ୍ୟାୟରେ ଏଫିଡ୍ ପରିଚାଳନା କରିବାକୁ, ଏକର ପିଛା 8 ଟି ହଳଦିଆ ଷ୍ଟିକ୍ ଟ୍ରାପ୍ ଲଗାନ୍ତୁ | 200 ଲିଟର ପାଣିରେ ମିଶ୍ରଣ କରି ନିମ୍ବ ଆଧାରିତ କୀଟନାଶକ 1500 ପିପିଏମ @600-ମିଲି/ଏକର ସ୍ପ୍ରେ କରନ୍ତୁ। ଯଦି ସଂକ୍ରମଣ ଗୁରୁତର ହୁଏ, ତା \"ହେଲେ ରାସାୟନିକ କୀଟନାଶକ 'ଥାୟାମେଥୋକ୍ସାମ୍\" ସ୍ପ୍ରେ କରନ୍ତୁ, 25 ପ୍ରତିଶତ ଡବ୍ଲୁ. ଜି. @40 ଗ୍ରାମ୍/ଏକର କିମ୍ବା ଏସିଟାମିପ୍ରିଡ୍ 20 ପ୍ରତିଶତ ଏସ୍. ପି. @50 ଗ୍ରାମ୍/ଏକର, 200 ଲିଟର ପାଣିରେ ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "menacinakahi": {
         "advisory": [
            "କୀଟ ସଂକ୍ରମଣର ପ୍ରାଥମିକ ପର୍ଯ୍ୟାୟରେ ଲଙ୍କାରେ ଏଫିଡ୍ ଏବଂ ଥ୍ରିପ୍ସକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ 200 ଲିଟର ପାଣିରେ ମିଶାଇ ଏକର ପିଛା 600-ମିଲି ପିଛା ନିମ୍ବ ଆଧାରିତ କୀଟନାଶକ 1500 ପିପିଏମ ସ୍ପ୍ରେ କରନ୍ତୁ। ଥିୟାମେଥୋକ୍ସାମ୍ 25 ପ୍ରତିଶତ ଡବ୍ଲୁ. ଜି. @40 ଗ୍ରାମ୍/ଏକର କିମ୍ବା ଏସିଟାମିପ୍ରିଡ୍ 20 ପ୍ରତିଶତ ଏସ. ପି. @50 ଗ୍ରାମ୍/ଏକର କିମ୍ବା ପ୍ରୋଫେନୋଫସ୍ 40 ପ୍ରତିଶତ + ଫେନପାଇରୋକ୍ସିମେଟ୍ 2.5 ପ୍ରତିଶତ ଇ. ସି. @400-ମିଲି/ଏକର ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "chilli": {
         "advisory": [
            "କୀଟ ସଂକ୍ରମଣର ପ୍ରାଥମିକ ପର୍ଯ୍ୟାୟରେ ଲଙ୍କାରେ ଏଫିଡ୍ ଏବଂ ଥ୍ରିପ୍ସକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ 200 ଲିଟର ପାଣିରେ ମିଶାଇ ଏକର ପିଛା 600-ମିଲି ପିଛା ନିମ୍ବ ଆଧାରିତ କୀଟନାଶକ 1500 ପିପିଏମ ସ୍ପ୍ରେ କରନ୍ତୁ। ଥିୟାମେଥୋକ୍ସାମ୍ 25 ପ୍ରତିଶତ ଡବ୍ଲୁ. ଜି. @40 ଗ୍ରାମ୍/ଏକର କିମ୍ବା ଏସିଟାମିପ୍ରିଡ୍ 20 ପ୍ରତିଶତ ଏସ. ପି. @50 ଗ୍ରାମ୍/ଏକର କିମ୍ବା ପ୍ରୋଫେନୋଫସ୍ 40 ପ୍ରତିଶତ + ଫେନପାଇରୋକ୍ସିମେଟ୍ 2.5 ପ୍ରତିଶତ ଇ. ସି. @400-ମିଲି/ଏକର ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "tomato": {
         "advisory": [
            "ଟମାଟୋରେ ଫଳ ଛେଦକକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ, ପ୍ରଥମେ ପ୍ରଭାବିତ ଫଳ ଏବଂ ବିକଶିତ ଲାର୍ଭା ସଂଗ୍ରହ କରି ନଷ୍ଟ କରନ୍ତୁ। ଏକର ପିଛା ହେଲିଲ୍ୟୁର ବିଶିଷ୍ଟ 20ଟି ଫେରୋମୋନ୍ ଫାନ୍ଦ ସ୍ଥାପନ କରନ୍ତୁ। ଯଦି 10 ପ୍ରତିଶତ ଫଳ ଛେଦକ ଦ୍ୱାରା ସଂକ୍ରମିତ, ତେବେ କୀଟନାଶକ ସିଞ୍ଚନ କରନ୍ତୁ। କ୍ଲୋରାଣ୍ଟ୍ରାନିଲିପ୍ରୋଲ 18.5% ଏସସି @80 ମିଲି/ଏକର କିମ୍ବା ଫ୍ଲୁବେଣ୍ଡିଆମାଇଡ୍ 39.5% ଏମ/ଏମଏସସି @40 ମିଲି/ଏକର କିମ୍ବା ଇଣ୍ଡୋକ୍ସାକାର୍ବ 14.5% ଏସସି @200 ମିଲି/ଏକର ସ୍ପ୍ରେ କରନ୍ତୁ। ଉପରୋକ୍ତ ଯେ କୌଣସି କୀଟନାଶକକୁ 15 ଦିନର ବ୍ୟବଧାନରେ ବିକଳ୍ପ ଭାବେ ବ୍ୟବହାର କରନ୍ତୁ।"
         ]
      },
      "onion": {
         "advisory": [
            "ନର୍ସରୀରେ ଏଫ୍ ରୋଗକୁ ହ୍ରାସ କରିବା ରୋକିବା ପାଇଁ, ନର୍ସରୀ ଶଯ୍ୟାକୁ 15 ଦିନ ବ୍ୟବଧାନରେ କାର୍ବେନଡାଜିମ୍ @2 ଗ୍ରାମ୍/ଲିଟର ପାଣିରେ ଭିଜାଇ ଦିଅନ୍ତୁ। 8 ସପ୍ତାହ ପୁରୁଣା ଚାରା ମୁଖ୍ୟ କ୍ଷେତରେ ରୋପଣ କରାଯାଏ |"
         ]
      },
      "cow": {
         "advisory": [
            "ଉପଯୁକ୍ତ ଭେଣ୍ଟିଲେସନ୍ ସୁବିଧା ସହିତ ପଶୁମାନଙ୍କୁ ଉପଯୁକ୍ତ ଆଶ୍ରୟ ପ୍ରଦାନ କରନ୍ତୁ | ଚଟାଣ ସଫା, ଶୁଖିଲା ଏବଂ ଘାସ ସହିତ ବିଛଣା ହେବା ଉଚିତ ଯାହା ଉତ୍ତାପ ହ୍ରାସକୁ ପ୍ରତିରୋଧ ଏବଂ ପ୍ରତିରୋଧ ଭାବରେ କାର୍ଯ୍ୟ କରେ | ଶୀତ ଋତୁରେ ତାପମାତ୍ରା ହ୍ରାସ ପାଇବା କାରଣରୁ ପଶୁମାନଙ୍କୁ ଅଧିକ ପରିମାଣର ଖାଦ୍ୟ ଆବଶ୍ୟକ ହୋଇଥାଏ। ଦୁଗ୍ଧ ଉତ୍ପାଦନ ବଜାୟ ରଖିବା ପାଇଁ ଅଧିକ ପରିମାଣର ରଫେଜ୍ ଦିଆଯିବା ଉଚିତ। ମଇଁଷି ପରି ବଡ଼ ପଶୁମାନଙ୍କୁ ମକା, ଗହମ ଏବଂ ଘନୀଭୂତ ତୈଳ କେକ୍ @3 କେଜି ଏବଂ ପଶୁମାନଙ୍କୁ ଖୁଆଇବା ପଶୁମାନଙ୍କ ଶରୀରର ଉତ୍ତାପ ବଜାୟ ରଖିବାରେ ସାହାଯ୍ୟ କରେ |"
         ]
      },
      "goat": {
         "advisory": [
            "ପିପିଆର ରୋଗ, ଯାହାକୁ 'ଛେଳି ପ୍ଲେଗ୍' ମଧ୍ୟ କୁହାଯାଏ, ଶୀତ ଋତୁରେ ସାଧାରଣ ହୋଇଥାଏ। ଏହି ଭାଇରାଲ ରୋଗ ଯାହା ଛେଳି ଏବଂ ମେଣ୍ଢାଙ୍କୁ ପ୍ରଭାବିତ କରେ ଯାହା ହଠାତ୍ ଜ୍ୱର, ନିମୋନିଆ ଏବଂ କାଶ ସୃଷ୍ଟି କରେ | ପ୍ରଭାବିତ ପ୍ରାଣୀମାନେ ଅସ୍ଥିର ଦେଖାଯାଆନ୍ତି, ଏକ ନିସ୍ତେଜ କୋଟ, ଶୁଖିଲା ଥଣ୍ଡ ଏବଂ ଅବସାଦଗ୍ରସ୍ତ କ୍ଷୁଧା | ଗର୍ଭବତୀ ପଶୁମାନଙ୍କର ଗର୍ଭପାତ ହୋଇପାରେ। ପଶୁମାନଙ୍କୁ ଟିକା ଦିଅନ୍ତୁ।"
         ]
      },
      "common fish": {
         "advisory": [
            "ଶୀତ ଋତୁରେ, ମାଛରେ \"ଇ. ୟୁ. ଏସ୍\". ରୋଗ ହେବାର ସମ୍ଭାବନା ଥାଏ। ପ୍ରତିଷେଧକ ପଦକ୍ଷେପ ସ୍ୱରୂପ କୃଷକମାନଙ୍କୁ ଏକ ଏକର ପୋଖରୀ ଅଞ୍ଚଳରେ 40 ଲିଟର ପାଣି ସହିତ 400 ମିଲିଲିଟର ସିଫ୍ୟାକ୍ସ ଲଗାଇବାକୁ ପରାମର୍ଶ ଦିଆଯାଇଛି। ମାଛମାନଙ୍କୁ ସେମାନଙ୍କର ମୋଟ ଜୈବବସ୍ତୁର 2-3% ହାରରେ ପ୍ରତିଦିନ ତୈଳ କେକ୍ ବ୍ରାନ୍ ମିଶ୍ରଣ ସହିତ ଖୁଆଇବା ଉଚିତ୍ |"
         ]
      }
   },
   "date": "17-12-2024"
}