{
   "weather_details": {
      "2024-10-19": {
         "rainfall": 0,
         "t_max": 36,
         "t_min": 23,
         "rh_max": 96,
         "rh_min": 57,
         "wind_speed": 3,
         "wind_direction": 0,
         "cloud_cover": 4
      },
      "2024-10-20": {
         "rainfall": 2,
         "t_max": 36,
         "t_min": 22,
         "rh_max": 94,
         "rh_min": 58,
         "wind_speed": 3,
         "wind_direction": 56,
         "cloud_cover": 6
      },
      "2024-10-21": {
         "rainfall": 0,
         "t_max": 35,
         "t_min": 22,
         "rh_max": 92,
         "rh_min": 51,
         "wind_speed": 2,
         "wind_direction": 27,
         "cloud_cover": 4
      },
      "2024-10-22": {
         "rainfall": 0,
         "t_max": 35,
         "t_min": 22,
         "rh_max": 88,
         "rh_min": 43,
         "wind_speed": 2,
         "wind_direction": 9,
         "cloud_cover": 4
      },
      "2024-10-23": {
         "rainfall": 5,
         "t_max": 35,
         "t_min": 21,
         "rh_max": 80,
         "rh_min": 43,
         "wind_speed": 3,
         "wind_direction": 90,
         "cloud_cover": 8
      }
   },
   "names_of_crops": [
      "ଚାଉଳ",
      "ମେରୁଦଣ୍ଡ ସୋରିଷ",
      "ଫୁଲକୋବି"
   ],
   "general_advisory": "ତାପମାତ୍ରା ହ୍ରାସ ପାଇବା ଦ୍ୱାରା ଫୁଲ ଫୁଟିବା ପରେ ଫାଲ୍ସ୍ ସ୍ମଟ୍ ଭଳି ରୋଗର ଘଟଣା ଘଟିପାରେ। ତେଣୁ, କୃଷକମାନଙ୍କୁ ସତର୍କ ରହିବାକୁ ଏବଂ ଆବଶ୍ଯ଼କତା ଆଧାରିତ ନିଯ଼ନ୍ତ୍ରଣ ପଦକ୍ଷେପ ନେବାକୁ ଅନୁରୋଧ କରାଯାଇଛି। ଗୋଲାପକୁ କାଟିବା ଏବଂ ସାର ଦେବା ପାଇଁ ଯାଆନ୍ତୁ। ଉଚ୍ଚଭୂମି ଏବଂ ଶୀଘ୍ର ବୁଣାଯାଇଥିବା ମଧ୍ଯ଼ମ ଜମି କ୍ଷେତ୍ରରେ ଧାନ ଅମଳ ହୁଏ ଯଦି 85 ପ୍ରତିଶତରୁ ଅଧିକ ପେନିକଲ୍ ପରିପକ୍ୱ ହୁଏ |",
   "crops_data": {
      "rice": {
         "advisory": [
            "ପ୍ରତିରୋପଣ କରାଯାଇଥିବା ଚାଉଳ ପି. ଆଇ. ରୁ ଫୁଲର ପର୍ଯ୍ଯ଼ାଯ଼ ମଧ୍ଯ଼ରେ ରହିଥାଏ। ଆଗାମୀ ନିମ୍ନ ଚାପ, ତାପମାତ୍ରା ହ୍ରାସ ସହିତ ମଧ୍ଯ଼ବର୍ତ୍ତୀ ବର୍ଷା ଫୁଲ ଫୁଟିବା ପରେ ମିଥ୍ଯ଼ା ଘଟଣା ପାଇଁ ଅନୁକୂଳ ହୋଇପାରେ. ବୁଟ ଲିଫ୍ ପର୍ଯ୍ଯ଼ାଯ଼ରେ ଏକର ପିଛା 400 ଗ୍ରାମ ପିଛା 77 ପ୍ରତିଶତ କପର୍ ହାଇଡ୍ରୋକ୍ସାଇଡ୍ ପ୍ରଯ଼ୋଗ ପାଇଁ ଯାଆନ୍ତୁ | ଫାଲ୍ସ୍ ସ୍ମଟ୍ର ପ୍ରଭାବଶାଳୀ ନିଯ଼ନ୍ତ୍ରଣ ପାଇଁ ସାତ ଦିନ ବ୍ଯ଼ବଧାନରେ ଏହି ସ୍ପ୍ରେକୁ ପୁନରାବୃତ୍ତି କରନ୍ତୁ।",
            "ଜିଲ୍ଲାର କେତେକ ଅଞ୍ଚଳରେ ବିପିଏଚ ସଂକ୍ରମଣ ଦେଖିବାକୁ ମିଳିଛି, ଏହି ସ୍ପ୍ରେ ଫ୍ଲୋନିକାମିଡକୁ ପରିଚାଳନା କରିବା ପାଇଁ ଏକର ପିଛା 50 ୱି. ଜି. 60 ଗ୍ରାମ। ବର୍ତ୍ତମାନ ପାଇଁ ନାଇଟ୍ରୋଜେନ ସାର ପ୍ରଯ଼ୋଗ ବନ୍ଦ କରନ୍ତୁ।"
         ]
      },
      "spine gourd": {
         "advisory": [
            "ଆଗାମୀ ବର୍ଷା କାର୍ଯ୍ଯ଼କଳାପକୁ ଦୃଷ୍ଟିରେ ରଖି ଲତା ଗଛରେ ଷ୍ଟକ୍ କରିବା ପାଇଁ ବ୍ଯ଼ବସ୍ଥା କରନ୍ତୁ |"
         ]
      },
      "cauliflower": {
         "advisory": [
            "ନର୍ସରୀରେ ଥିବା ଫୁଲକୋବି ଚାରା ହେଉଛି ଅଙ୍କୁରୋଦଗମ ପର୍ଯ୍ଯ଼ାଯ଼। ଫୁଲକୋବି ବୁଣିବା ପାଇଁ ନର୍ସରୀ ପ୍ରସ୍ତୁତି ଆରମ୍ଭ କରନ୍ତୁ ଏବଂ ନର୍ସରୀରେ ସମ୍ପୂର୍ଣ୍ଣ ବୀଜ ବୁଣିବା ଆରମ୍ଭ କରନ୍ତୁ। ଫୁଲକୋବି ପାଇଁ ଉପଯୁକ୍ତ କିସମଗୁଡ଼ିକ ହେଉଛି କେ-1, ପୁସା ଅର୍ଲି ସିନ୍ଥେଟିକ୍ ଏବଂ ପୁସା ଅର୍ଲି କୁଆନ୍ରି ଏବଂ ଏହାର ବିହନ ହାର ଏକର ପିଛା 200 ଗ୍ରାମ। 1 ଏକର ଫସଲ ପାଇଁ ନର୍ସରୀ କ୍ଷେତ୍ର 50 ବର୍ଗ ମିଟର (ଆକାର 3 ମି. x1 ମି. x 0.15 ମି.) ହେବା ଉଚିତ। ନର୍ସରୀରେ ବୁଣିବା ପୂର୍ବରୁ ପ୍ରତି କିଲୋଗ୍ରାମ ମଞ୍ଜି ପିଛା ବାଭିଷ୍ଟିନ୍ 1 ଗ୍ରାମ୍ + ଥ୍ରିଯ଼ମ୍ 2 ଗ୍ରାମ୍ ସହିତ ମଞ୍ଜି ଚିକିତ୍ସା କରାଯିବା ଉଚିତ। ଚାରା ଗୁଡ଼ିକୁ ଭିଜି ଯିବାରୁ ରକ୍ଷା କରିବା ପାଇଁ ଗୋଟିଏ ଲିଟର ପାଣିରେ କାର୍ବେନଡାଜିମ୍ 1 ଗ୍ରାମ୍ ମିଶାଇ ଷ୍ଟ୍ରେପ୍ଟୋସାଇକ୍ଲିନ୍ 0.1 ଗ୍ରାମ୍ ସହିତ ବୀଜ ଶଯ୍ଯ଼ାକୁ ଭିଜାଇ ଦିଅନ୍ତୁ |"
         ]
      }
   },
   "date": "18-10-2024"
}