{
   "weather_details": {
      "19/10/2024": {
         "rainfall": 5,
         "t_max": 36,
         "t_min": 26,
         "rh_max": 95,
         "rh_min": 65,
         "wind_speed": 2,
         "wind_direction": 9,
         "cloud_cover": 4
      },
      "20/10/2024": {
         "rainfall": 5,
         "t_max": 35,
         "t_min": 24,
         "rh_max": 94,
         "rh_min": 63,
         "wind_speed": 2,
         "wind_direction": 321,
         "cloud_cover": 7
      },
      "21/10/2024": {
         "rainfall": 5,
         "t_max": 35,
         "t_min": 24,
         "rh_max": 94,
         "rh_min": 63,
         "wind_speed": 5,
         "wind_direction": 356,
         "cloud_cover": 7
      },
      "22/10/2024": {
         "rainfall": 5,
         "t_max": 35,
         "t_min": 24,
         "rh_max": 92,
         "rh_min": 59,
         "wind_speed": 5,
         "wind_direction": 357,
         "cloud_cover": 7
      }
   },
   "names_of_crops": [
      "ଧାନ।",
      "କଳା ଚଣା ଏବଂ ସବୁଜ ଚଣା",
      "ରସୁଣ",
      "କଦଳୀ ଗୁଣ୍ଡ",
      "ବାଇଗଣ",
      "ମେଣ୍ଢା ଏବଂ ଛେଳି"
   ],
   "general_advisory": "ସାରର ଟପ୍ ଡ୍ରେସିଂ ଚାଲିଛି। ମକା ଫସଲ ଅମଳ ଆରମ୍ଭ ହୋଇଛି। ଆଖୁ ବ୍ୟାପକ ଅଭିବୃଦ୍ଧି ପର୍ଯ୍ୟାୟରେ ରହିଛି। କପା। ମୋଟାମୋଟି ଭାବେ ଫସଲର ସ୍ଥିତି ସ୍ୱାଭାବିକ ରହିଛି।",
   "crops_data": {
      "paddy": {
         "advisory": [
            "ମିଥ୍ଯ଼ା ରୋଗଃ ଧାନ କ୍ଷେତରେ ମିଥ୍ଯ଼ା ରୋଗ ଦେଖାଯାଇପାରେ। ଏହାକୁ ପରିଚାଳନା କରିବା ପାଇଁ, ଏକର ପିଛା 200 ଲିଟର ପାଣିରେ ପ୍ରୋପିକୋନାଜୋଲ୍ କିମ୍ବା ହେକ୍ସାକୋନାଜୋଲ୍ @100 ମିଲି କିମ୍ବା କପର ଅକ୍ସିକ୍ଲୋରାଇଡ୍ @250 ଗ୍ରାମ୍ ସ୍ପ୍ରେ କରନ୍ତୁ।",
            "ନେକ୍ ବ୍ଲାଷ୍ଟଃ ନେକ୍ ବ୍ଲାଷ୍ଟ ରୋଗକୁ ନିଯ଼ନ୍ତ୍ରଣ କରିବା ପାଇଁ ପ୍ରଥମେ ଧାନ କ୍ଷେତରୁ ଅତିରିକ୍ତ ପାଣି ବାହାର କରନ୍ତୁ। ହେକ୍ଟର ପିଛା ହେକ୍ସାକୋନାଜୋଲ ମିଲି କିମ୍ବା ଏଜୋକ୍ସିସ୍ଟ୍ରୋବିନ + ଡିଫେନୋକାନାଜୋଲ @200 ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "black gram and green gram": {
         "advisory": [
            "ପୋଡ୍ ବୋରର୍ ପରିଚାଳନାଃ କଳା ଚଣା ଏବଂ ସବୁଜ ଚଣା ଫସଲରେ ପୋଡ୍ ବୋରର୍ ସଂକ୍ରମଣ ହେବାର ସମ୍ଭାବନା ରହିଛି। ସବୁଜ ଚଣା ଏବଂ କଳା ଚଣା ଫସଲରେ ବିହାରର ଲୋମଯୁକ୍ତ କ୍ଯ଼ାଟର୍ପିଲର ପରିଚାଳନା ପାଇଁ ଇମାମେକ୍ଟିନ୍ ବେନ୍ଜୋଏଟ୍ ସ୍ପ୍ରେ କରନ୍ତୁ 5 ପ୍ରତିଶତ SG @80 18.5% SC @80"
         ]
      },
      "onion": {
         "advisory": [
            "ବୁଣିବା ପୂର୍ବର ପର୍ଯ୍ଯ଼ାଯ଼ଃ ମଞ୍ଜି ବୁଣିବା ପୂର୍ବରୁ କାର୍ବେଣ୍ଡାଜିମ୍ 50 ପ୍ରତିଶତ ଡବ୍ଲ୍ଯ଼ୁ. ପି. @2 କାରବକ୍ସିନ୍ <ଆଇ. ଡି. 1> + ଥିରମ୍ ବ୍ଯ଼ବହାର କରି ମଞ୍ଜି ଚିକିତ୍ସା କରାଯିବା ଉଚିତ।"
         ]
      },
      "bitter gourd": {
         "advisory": [
            "ଫଳ ଏବଂ ଅମଳଃ ଫଳ ମାଛିଙ୍କ ସଂକ୍ରମଣକୁ ପରିଚାଳନା କରିବା ପାଇଁ, ମାଲାଥିଅନ୍ @1 ମିଲି/ଲିଟର ସ୍ପ୍ରେ କରନ୍ତୁ।",
            "ଫସଲରେ ପାଉଡର୍ ଫଙ୍ଗୁର ରୋଗକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ, ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "brinjal": {
         "advisory": [
            "ଫୁଲ ଉଠିବା/ଫଳ ବାହାରିବାଃ ମରିଯିବା ଲକ୍ଷଣ ଥିବା ଗଛଗୁଡ଼ିକୁ କ୍ଷେତ ବାହାରେ ଉପୁଡ଼ାଯାଇ ନଷ୍ଟ କରାଯାଇପାରିବ।",
            "ଫୋମୋପ୍ସିସ୍ ବ୍ଲାଇଟ୍ଃ ବାଇଗଣରେ ଫୋମୋପ୍ସିସ୍ ବ୍ଲାଇଟ୍ ରୋଗକୁ ହ୍ରାସ କରିବା ପାଇଁ, 200 ଲିଟର ପାଣିରେ ମେଟାଲାକ୍ସିଲ୍ + ମାନକୋଜେବ୍ ଜିନେବ୍ 75 ପ୍ରତିଶତ ଡବ୍ଲ୍ଯ଼ୁ. ପି. @500 ଗ୍ରାମ୍/ଏକର ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "sheep and goats": {
         "advisory": [
            "ମେଣ୍ଢା ଏବଂ ଛେଳିମାନଙ୍କଠାରେ ଲିଭର ଫ୍ଲୁକ୍ ସଂକ୍ରମଣଃ ଲିଭର ଫ୍ଲୁକ୍ ମେଣ୍ଢା ଏବଂ ଛେଳିମାନଙ୍କର ଏକ ବଡ଼ ଶତ୍ରୁ। ଏହି କୃମିଗୁଡ଼ିକ ସେମାନଙ୍କ ଯକୃତରେ ବାସ କରନ୍ତି ଏବଂ ଯକୃତକୁ କ୍ଷତି ପହଞ୍ଚାନ୍ତି। 4 ମାସ ବଯ଼ସର ପଶୁମାନେ ମୁଖ୍ଯ଼ତଃ ପ୍ରଭାବିତ ହୋଇଥାନ୍ତି। ଲୁଚାଇ ରଖାଯାଇଥିବା ଶୋଥ ନିମ୍ନ ଜବଡାରେ ଦେଖାଯାଏ ଏବଂ ଶେଷରେ ସେଗୁଡ଼ିକ ମରିଯାଏ |"
         ]
      }
   },
   "date": "18-10-2024"
}