{
   "weather_details": {
      "19-10-2024": {
         "rainfall": 2,
         "t_max": 34,
         "t_min": 23,
         "rh_max": 93,
         "rh_min": 54,
         "wind_speed": 3,
         "wind_direction": 150,
         "cloud_cover": 4
      },
      "20-10-2024": {
         "rainfall": 2,
         "t_max": 34,
         "t_min": 23,
         "rh_max": 93,
         "rh_min": 60,
         "wind_speed": 3,
         "wind_direction": 146,
         "cloud_cover": 6
      },
      "21-10-2024": {
         "rainfall": 2,
         "t_max": 33,
         "t_min": 22,
         "rh_max": 93,
         "rh_min": 58,
         "wind_speed": 1,
         "wind_direction": 0,
         "cloud_cover": 6
      },
      "22-10-2024": {
         "rainfall": 0,
         "t_max": 33,
         "t_min": 22,
         "rh_max": 91,
         "rh_min": 46,
         "wind_speed": 2,
         "wind_direction": 117,
         "cloud_cover": 5
      },
      "23-10-2024": {
         "rainfall": 0,
         "t_max": 33,
         "t_min": 22,
         "rh_max": 82,
         "rh_min": 45,
         "wind_speed": 2,
         "wind_direction": 31,
         "cloud_cover": 5
      }
   },
   "names_of_crops": [
      "ଧାନ।",
      "କପା",
      "ଅରହର",
      "ସଂକର ମକା",
      "ଟମାଟୋ",
      "କୋଇଲା ଫସଲ",
      "ରସୁଣ",
      "ମାରିଗୋଲ୍ଡ",
      "ଗୋଲାପ।",
      "ଗୋରୁ ଏବଂ ମଇଁଷି",
      "ଛେଳି ଏବଂ ମେଣ୍ଢା",
      "କୁକୁଡ଼ା ମାଂସ"
   ],
   "general_advisory": "ଆଗାମୀ ସପ୍ତାହରେ ଓଡ଼ିଶାରେ ହାଲୁକା ରୁ ମଧ୍ଯ଼ମ ବର୍ଷା/ବଜ୍ରପାତ ହେବାର ସମ୍ଭାବନା ରହିଛି। ବିଭିନ୍ନ ସ୍ଥାନରେ ସର୍ବାଧିକ ତାପମାତ୍ରା 30-34 °C ମଧ୍ଯ଼ରେ ରହିବ ବୋଲି ଆଶା କରାଯାଉଛି। ଆବଶ୍ଯ଼କତା ଅନୁଯାଯ଼ୀ ଆନ୍ତଃସାଂସ୍କୃତିକ କାର୍ଯ୍ଯ଼, ଅମଳ ଏବଂ କୀଟନାଶକ ପ୍ରଯ଼ୋଗ ଜାରି ରଖିବାକୁ କୃଷକମାନଙ୍କୁ ପରାମର୍ଶ ଦିଆଯାଇଛି।",
   "crops_data": {
      "paddy": {
         "advisory": [
            "ପ୍ରଚଳିତ ପାଣିପାଗ ବ୍ଯ଼ାକ୍ଟେରିଆଲ୍ ବ୍ଲାଇଟ୍, ବ୍ଯ଼ାକ୍ଟେରିଆଲ୍ ଲିଫ୍ ଷ୍ଟ୍ରିକ୍ ଏବଂ ଲିଫ୍ ବ୍ଲାଷ୍ଟ ପରି ରୋଗକୁ ପସନ୍ଦ କରେ |",
            "ମାଲାଥିଅନ୍ କିମ୍ବା ଇମିଡାକ୍ଲୋପ୍ରିଡ୍ ସ୍ପ୍ରେ ଦ୍ୱାରା ଗୁଣ୍ଡି ବଗ୍ ସଂକ୍ରମଣକୁ ନିଯ଼ନ୍ତ୍ରଣ କରନ୍ତୁ।",
            "କାନ କାଟିବା କ୍ଯ଼ାଟର୍ପିଲର ନିଯ଼ନ୍ତ୍ରଣ ପାଇଁ, କ୍ୱିନାଲଫସ୍ କିମ୍ବା କ୍ଲୋରପାଇରିଫସ୍ ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "cotton": {
         "advisory": [
            "ଆମେରିକୀଯ଼ ବୋଲୱର୍ମ ନିଯ଼ନ୍ତ୍ରଣ ପାଇଁ ଇମାମେକ୍ଟିନ୍ ବେନ୍ଜୋଏଟ୍ କିମ୍ବା ପ୍ରୋଫେନୋଫସ୍ ପ୍ରଯ଼ୋଗ କରନ୍ତୁ।",
            "ବ୍ଯ଼ାକ୍ଟେରିଆଲ୍ ଲିଫ୍ ବ୍ଲାଇଟ୍ କୁ ନିଯ଼ନ୍ତ୍ରଣ କରିବା ପାଇଁ ସ୍ଟ୍ରେପ୍ଟୋସାଇକ୍ଲିନ୍ + କପର ଅକ୍ସିକ୍ଲୋରାଇଡ୍ ବ୍ଯ଼ବହାର କରନ୍ତୁ |"
         ]
      },
      "arhar": {
         "advisory": [
            "ପ୍ରୋଫେନୋଫସ୍ କିମ୍ବା କ୍ଲୋରପାଇରିଫସ୍ ସ୍ପ୍ରେ ଦ୍ୱାରା ଲିଫ୍ ୱେବର୍/ଲିଫ୍ ଫୋଲ୍ଡର୍/ଡିଫୋଲିଏଟର୍କୁ ନିଯ଼ନ୍ତ୍ରଣ କରନ୍ତୁ।",
            "ପୋଡ୍ ବୋରର୍ ନିୟନ୍ତ୍ରଣ ପାଇଁ, ଆଜାଦିରାକ୍ଟିନ୍ ପରି ନିମ-ଆଧାରିତ କୀଟନାଶକ ବ୍ୟବହାର କରନ୍ତୁ |"
         ]
      },
      "hybrid maize": {
         "advisory": [
            "ଆମେରିକୀଯ଼ କୋବ୍ ବୋରର୍ ନିଯ଼ନ୍ତ୍ରଣ ପାଇଁ ଫ୍ଲୁବେଣ୍ଡିଆମାଇଡ୍ ପ୍ରଯ଼ୋଗ କରନ୍ତୁ।",
            "ବି. ଏଲ୍. ଏସ୍. ବି. ନିଯ଼ନ୍ତ୍ରଣ ପାଇଁ ଭାଲିଡାମାଇସିନ୍ କିମ୍ବା ହେକ୍ସାକୋନାଜୋଲ୍ ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "tomato": {
         "advisory": [
            "ଭଲ ଭାବରେ ପ୍ରସ୍ତୁତ ନର୍ସରୀ ଶଯ୍ଯ଼ା ଏବଂ କ୍ଲୋରପାଇରିଫୋସ୍ ଧୂଳି ପ୍ରଯ଼ୋଗ ସହିତ ଚାରା ୱିଲ୍ଟ ପ୍ରତିରୋଧ ପଦକ୍ଷେପ |",
            "ପ୍ରସ୍ତାବିତ କିସମଗୁଡ଼ିକ ମଧ୍ଯ଼ରେ ଉତ୍କଳ ପ୍ରଜ୍ଞାନ, ଉତ୍କଳ ରାଜା ଏବଂ ଅନ୍ଯ଼ାନ୍ଯ଼ ଅନ୍ତର୍ଭୁକ୍ତ |"
         ]
      },
      "cole crops": {
         "advisory": [
            "ନିର୍ଦ୍ଦିଷ୍ଟ ବିହନ ଆବଶ୍ଯ଼କତା ସହିତ ଫୁଲକୋବି, ବନ୍ଧାକୋବି ଏବଂ ବ୍ରୋକୋଲି ପାଇଁ ନର୍ସରୀ ଶଯ୍ଯ଼ା ପ୍ରସ୍ତୁତ କରନ୍ତୁ।",
            "ଫୁଲକୋବି ଏବଂ ବନ୍ଧାକୋବି ପାଇଁ ତାଲିକାଭୁକ୍ତ ହୋଇଥିବା ସୁପାରିସ କରାଯାଇଥିବା କିସମ।"
         ]
      },
      "onion": {
         "advisory": [
            "ନର୍ସରୀ ଶଯ୍ଯ଼ା ପ୍ରସ୍ତୁତି ନିର୍ଦ୍ଦେଶାବଳୀ ଏବଂ ପିଆଜର ଉପଯୁକ୍ତ କିସମ ସୁପାରିଶ।"
         ]
      },
      "marigold": {
         "advisory": [
            "ପ୍ରୋଫେନୋଫସ୍ କିମ୍ବା ବୁପ୍ରୋଫେଜିନ୍ ସ୍ପ୍ରେ ଦ୍ୱାରା କ୍ଷୁଦ୍ର କୀଟ ସଂକ୍ରମଣକୁ ନିୟନ୍ତ୍ରଣ କରନ୍ତୁ।"
         ]
      },
      "rose": {
         "advisory": [
            "ଗୋଲାପ ଚାଷ ପାଇଁ ପ୍ରଶିକ୍ଷଣ, ଛାଣିବା ଏବଂ ଆନ୍ତଃସାଂସ୍କୃତିକ କାର୍ଯ୍ଯ଼କଳାପ ପରାମର୍ଶ।",
            "କପର୍ ଅକ୍ସିକ୍ଲୋରାଇଡ୍ ସ୍ପ୍ରେ ଦ୍ୱାରା କଳା ଦାଗକୁ ନିଯ଼ନ୍ତ୍ରଣ କରନ୍ତୁ।"
         ]
      },
      "cattle & buffalo": {
         "advisory": [
            "ନିୟମିତ ଭାବରେ ଗୋରୁ ଏବଂ ମଇଁଷିକୁ କୀଟ ଦୂର କରିବା ଏବଂ ଟୀକାକରଣ କରିବା।",
            "ନିର୍ଦ୍ଦିଷ୍ଟ ସମସ୍ଯ଼ା ପାଇଁ ପଶୁ ଚିକିତ୍ସକଙ୍କ ସହ ପରାମର୍ଶ କରନ୍ତୁ।"
         ]
      },
      "goat & sheep": {
         "advisory": [
            "ନିର୍ଜଲୀକରଣ, ଉତ୍ତାପ ଚାପ ଏବଂ ପରଜୀବୀ ସଂକ୍ରମଣ ପାଇଁ ପଶୁମାନଙ୍କୁ ଯାଞ୍ଚ କରନ୍ତୁ।",
            "ଆବଶ୍ୟକ ଅନୁଯାୟୀ ପଶୁମାନଙ୍କୁ କୃମି ମୁକ୍ତ ଏବଂ ଟୀକାକରଣ କରନ୍ତୁ।"
         ]
      },
      "poultry": {
         "advisory": [
            "ଉଚ୍ଚ ପ୍ଲାଟଫର୍ମ ଏବଂ ଗଭୀର ଆବର୍ଜନା ବ୍ଯ଼ବସ୍ଥା ସହିତ କୁକୁଡ଼ା ଘରେ ସ୍ୱଚ୍ଛତା ବଜାଯ଼ ରଖନ୍ତୁ |",
            "ରୋଗ ଜୀବାଣୁ ନିର୍ମାଣକୁ ରୋକିବା ପାଇଁ ନିୟମିତ ଭାବରେ ସଫା ଏବଂ ଜୀବାଣୁହୀନ କରନ୍ତୁ |"
         ]
      }
   },
   "date": "18-10-2024"
}