{
   "weather_details": {
      "2024-10-19": {
         "rainfall": 5,
         "t_max": 35,
         "t_min": 25,
         "rh_max": 95,
         "rh_min": 66,
         "wind_speed": 2,
         "wind_direction": 0,
         "cloud_cover": 5
      },
      "2024-10-20": {
         "rainfall": 2,
         "t_max": 35,
         "t_min": 25,
         "rh_max": 92,
         "rh_min": 63,
         "wind_speed": 3,
         "wind_direction": 342,
         "cloud_cover": 6
      },
      "2024-10-21": {
         "rainfall": 2,
         "t_max": 35,
         "t_min": 24,
         "rh_max": 88,
         "rh_min": 54,
         "wind_speed": 4,
         "wind_direction": 349,
         "cloud_cover": 4
      },
      "2024-10-22": {
         "rainfall": 0,
         "t_max": 34,
         "t_min": 24,
         "rh_max": 83,
         "rh_min": 50,
         "wind_speed": 4,
         "wind_direction": 350,
         "cloud_cover": 4
      },
      "2024-10-23": {
         "rainfall": 0,
         "t_max": 34,
         "t_min": 24,
         "rh_max": 83,
         "rh_min": 51,
         "wind_speed": 5,
         "wind_direction": 352,
         "cloud_cover": 5
      }
   },
   "names_of_crops": [
      "ଚାଉଳ",
      "ମକା",
      "ଫିଙ୍ଗର ମିଲେଟ୍",
      "କଦଳୀ",
      "ଫୁଲକୋବି",
      "କାକୁଡ଼ି",
      "ଟମାଟୋ",
      "ରସୁଣ",
      "ପେଁପେ",
      "ଗାଈ।",
      "ସାଧାରଣ ମାଛ",
      "ଚିକେନ୍"
   ],
   "general_advisory": "ଉଚ୍ଚଭୂମି/ମଧ୍ୟମ ଜମିରେ ଚିନାବାଦାମ, ଚଣା, ସବୁଜ ଚଣା, କଳା ଚଣା, କାଉପି, ମିଠା ଆଳୁ ଏବଂ ତିଲ ଭଳି ରବି ଫସଲ ବୁଣିବା ପାଇଁ ମୃତ୍ତିକାର ଆର୍ଦ୍ରତା ଯଥେଷ୍ଟ। କୋଲ ଫସଲ (ବନ୍ଧାକୋବି, ବିଳମ୍ବିତ ଫୁଲକୋବି ଏବଂ ବ୍ରୋକୋଲି), ସୋଲାନାସିୟସ୍ ପନିପରିବା (ବାଇଗଣ, ଟମାଟୋ, ଲଙ୍କା ଏବଂ କ୍ୟାପ୍ସିକମ୍) ଭଳି ପନିପରିବା ବୁଣିବା ପାଇଁ ଏହା ସର୍ବୋତ୍ତମ ସମୟ।",
   "crops_data": {
      "rice": {
         "advisory": [
            "ରୋପଣ କରାଯାଇଥିବା ଧାନ ପାନିକଲ ଇନିସିଏସନରୁ ଆରମ୍ଭ କରି ମୁଖ୍ଯ଼ କ୍ଷେତରେ ଫୁଲର ପର୍ଯ୍ଯ଼ାଯ଼ ପର୍ଯ୍ଯ଼ନ୍ତ ହୋଇଥାଏ।",
            "ବର୍ତ୍ତମାନର ଉଚ୍ଚ ଆର୍ଦ୍ର ପାଣିପାଗ ସ୍ଥିତି ଏବଂ ବର୍ଷା ପରେ ସ୍ୱଚ୍ଛ ଆକାଶ ଧାନରେ ବ୍ରାଉନ୍ ପ୍ଲାଣ୍ଟ ହପର୍ (ବିପିଏଚ) ଏବଂ ହ୍ୱାଇଟ୍ ବ୍ଯ଼ାକ୍ଡ୍ ପ୍ଲାଣ୍ଟ ହପର୍ (ଡବ୍ଲୁବିପିଏଚ) ସଂକ୍ରମଣ ପାଇଁ ଅନୁକୂଳ |"
         ]
      },
      "maize": {
         "advisory": [
            "ଏହି ଫସଲ ହେଉଛି କୋବ ବିକାଶର ପର୍ଯ୍ୟାୟ।",
            "କେତେକ ସ୍ଥାନରେ ଶୀଘ୍ର ବୁଣାଯାଇଥିବା ମକା ଫସଲରେ ଫଲ୍ ଆର୍ମି କୃମିର ସଂକ୍ରମଣ ହୋଇଥିବା ସୂଚନା ମିଳିଛି।"
         ]
      },
      "finger millet": {
         "advisory": [
            "ଲିଫ୍ ସ୍ପାଟ୍ ଏବଂ ଲିଫ୍ ବ୍ଲାଇଟ୍ ରୋଗକୁ ରୋକିବା ପାଇଁ ଏକର ପିଛା ମାନକୋଜେବ୍ 63 ପ୍ରତିଶତ ଡବ୍ଲ୍ଯ଼ୁ. ପି. + କାର୍ବେନଡାଜିମ୍ 12 ପ୍ରତିଶତ <ଆଇ. ଡି. 1> ଗ୍ରାମ୍ ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "cabbage": {
         "advisory": [
            "ନର୍ସରୀରେ ଥିବା ବନ୍ଧାକୋବି ଚାରା ହେଉଛି ଅଙ୍କୁରୋଦଗମ ପର୍ଯ୍ୟାୟ।",
            "ନର୍ସରୀ ପ୍ରସ୍ତୁତି ଏବଂ ବନ୍ଧାକୋବି ମଞ୍ଜି ବୁଣିବା ଆରମ୍ଭ କରନ୍ତୁ।"
         ]
      },
      "cauliflower": {
         "advisory": [
            "ନର୍ସରୀରେ ଥିବା ଫୁଲକୋବି ଚାରା ହେଉଛି ଅଙ୍କୁରୋଦଗମ ପର୍ଯ୍ଯ଼ାଯ଼।",
            "ଫୁଲକୋବି ବୁଣିବା ପାଇଁ ନର୍ସରୀ ପ୍ରସ୍ତୁତି ଆରମ୍ଭ କରନ୍ତୁ ଏବଂ ନର୍ସରୀରେ ସମ୍ପୂର୍ଣ୍ଣ ବୀଜ ବୁଣିବା ଆରମ୍ଭ କରନ୍ତୁ।"
         ]
      },
      "cucumber": {
         "advisory": [
            "କାକୁଡ଼ିରେ ଫଳ ମାଛି ପରିଚାଳନା କରିବା ପାଇଁ, 4 ଲିଟର ପାଣିରେ 400-ଗ୍ରାମ ଗୁଡ଼ ଏବଂ 8-ମିଲି ମାଲାଥିଅନ୍ କିମ୍ବା ଡି. ଡି. ଭି. ପି. ମିଶାଇ ଏକ ବିଷାକ୍ତ ଚାରା ପ୍ରସ୍ତୁତ କରନ୍ତୁ।"
         ]
      },
      "tomato": {
         "advisory": [
            "ନର୍ସରୀରେ ଥିବା ଟମାଟୋ ଚାରା ଏକ ସପ୍ତାହ ପର୍ଯ୍ୟାୟ ପର୍ଯ୍ୟନ୍ତ ଅଙ୍କୁରିତ ହୋଇଥାଏ।",
            "ନର୍ସରୀ ପ୍ରସ୍ତୁତି ଆରମ୍ଭ କରନ୍ତୁ ଏବଂ ନର୍ସରୀରେ ଟମାଟୋ ମଞ୍ଜି ବୁଣିବା ସମ୍ପୂର୍ଣ୍ଣ କରନ୍ତୁ।"
         ]
      },
      "onion": {
         "advisory": [
            "ନର୍ସରୀରେ ଥିବା ପିଆଜର ଚାରା ଏକ ସପ୍ତାହ ପର୍ଯ୍ୟାୟ ପର୍ଯ୍ୟନ୍ତ ଅଙ୍କୁରିତ ହୋଇଥାଏ।",
            "ନର୍ସରୀରେ ଆଳୁ ବୁଣିବା ଏବଂ ମଞ୍ଜି ବୁଣିବା ପାଇଁ ସମ୍ପୂର୍ଣ୍ଣ ନର୍ସରୀ ପ୍ରସ୍ତୁତି।"
         ]
      },
      "papaya": {
         "advisory": [
            "ସଂକ୍ରମଣର ପ୍ରାରମ୍ଭିକ ପର୍ଯ୍ୟାୟରେ କ୍ଷୁଦ୍ର କୀଟକୁ ପରିଚାଳନା କରିବା ପାଇଁ ନିମ୍ବ-ଆଧାରିତ କୀଟନାଶକ (ନିମ୍ବ ତେଲ 1500 ପିପିଏମ @30-ମିଲି/10 ଲିଟର ପାଣି) ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "cow": {
         "advisory": [
            "ଯଦି ଆପଣଙ୍କ ଗୃହପାଳିତ ପଶୁ ଖାଦ୍ଯ଼ରେ ପରିଣତ ହେଉଛି, ଦୁର୍ବଳ, ଦୁର୍ବଳ, ତରଳ ଝାଡ଼ା, ଦୁଗ୍ଧ ଉତ୍ପାଦନ କମ୍, ଆଖିରେ ଶୁଷ୍କତା ଏବଂ ପ୍ରତିବନ୍ଧକ ଅବସ୍ଥା ଦେଖାଯାଏ |"
         ]
      },
      "common fish": {
         "advisory": [
            "ଫିଙ୍ଗରଲିଙ୍ଗ ଷ୍ଟକ୍ କରିବା ପରେ, ଚିନାବାଦାମ ତେଲ କେକ୍ ଏବଂ ଚାଉଳ ଚୋପା 1:1 ଅନୁପାତରେ ଦିନକୁ ଦୁଇଥର ସେମାନଙ୍କ ଶରୀରର ଓଜନର 5 ପ୍ରତିଶତ ଖାଦ୍ଯ଼ ଭାବରେ ଦିଆଯାଏ |"
         ]
      },
      "chicken": {
         "advisory": [
            "ଯଦି କୁକୁଡ଼ା ପକ୍ଷୀର ବୟସ 3ରୁ 4 ସପ୍ତାହ ହୋଇଥାଏ, ତେବେ ରାଣୀଖେତ୍ ରୋଗ ବିରୁଦ୍ଧରେ ଟୀକାକରଣ ପାଇଁ ଯାଆନ୍ତୁ।"
         ]
      }
   },
   "date": "18-10-2024"
}