{
   "weather_details": {
      "19-10-2024": {
         "rainfall": 5,
         "t_max": 33,
         "t_min": 23,
         "rh_max": 96,
         "rh_min": 64,
         "wind_speed": 1,
         "wind_direction": 334,
         "cloud_cover": 4
      },
      "20-10-2024": {
         "rainfall": 5,
         "t_max": 32,
         "t_min": 23,
         "rh_max": 93,
         "rh_min": 60,
         "wind_speed": 4,
         "wind_direction": 90,
         "cloud_cover": 6
      },
      "21-10-2024": {
         "rainfall": 0,
         "t_max": 31,
         "t_min": 22,
         "rh_max": 90,
         "rh_min": 51,
         "wind_speed": 4,
         "wind_direction": 354,
         "cloud_cover": 5
      },
      "22-10-2024": {
         "rainfall": 0,
         "t_max": 31,
         "t_min": 22,
         "rh_max": 84,
         "rh_min": 47,
         "wind_speed": 5,
         "wind_direction": 356,
         "cloud_cover": 4
      },
      "23-10-2024": {
         "rainfall": 0,
         "t_max": 30,
         "t_min": 22,
         "rh_max": 80,
         "rh_min": 49,
         "wind_speed": 7,
         "wind_direction": 3,
         "cloud_cover": 5
      }
   },
   "names_of_crops": [
      "ଧାନ।",
      "ଗ୍ରୀନଗ୍ରାମ",
      "କଦଳୀ",
      "କଦଳୀ ଗୁଣ୍ଡ",
      "ଓକ୍ରା",
      "ଆଇଭି ଲାଉ",
      "ପେଯ଼ାରା",
      "କଦଳୀ"
   ],
   "general_advisory": "ପରିପକ୍ୱ ଫସଲଗୁଡ଼ିକୁ ଅମଳ କରନ୍ତୁ। ଅମଳ ପରେ, ରବି ଫସଲ ଉତ୍ପାଦନ ପାଇଁ ଜମି ପ୍ରସ୍ତୁତି କରାଯାଇପାରିବ। ଫସଲର ଭଲ ପ୍ରତିଷ୍ଠା ପାଇଁ ମାଟିକୁ ଭଙ୍ଗୁର କରିବା ପାଇଁ ଜମି ହଳ କରନ୍ତୁ | ଉତ୍ପାଦଗୁଡ଼ିକର ସଂରକ୍ଷଣ ସମଯ଼ରେ, ଗଚ୍ଛିତ କୀଟପତଙ୍ଗମାନଙ୍କୁ ଦୂରେଇ ରଖିବା ପାଇଁ ସେଲ୍ଫୋସ୍ ଟାବଲେଟ୍ (ଫୁମିଗାଣ୍ଟସ୍) ବ୍ଯ଼ବହାର କରିବା ସୁନିଶ୍ଚିତ କରନ୍ତୁ। ଗଛଗୁଡିକ ଶୁଖିଯିବା କିମ୍ବା ଶୁଖିଯିବା ଏଡ଼ାଇବା ପାଇଁ ଫସଲକୁ ଜଳସେଚନ ଠିକ୍ ସମଯ଼ରେ ହେବା ଉଚିତ।",
   "crops_data": {
      "paddy": {
         "advisory": [
            "କ୍ଷେତରୁ ଘାସ ବାହାର କରନ୍ତୁ।",
            "କୀଟପତଙ୍ଗ ଏବଂ ରୋଗ ଉପରେ ନିଯ଼ମିତ ନଜର ରଖନ୍ତୁ।",
            "ଧାନରେ କ୍ଷୀର ଦୋଇବା ପର୍ଯ୍ୟାୟ ଜଳସେଚନ ପାଇଁ ଏକ ଗୁରୁତ୍ୱପୂର୍ଣ୍ଣ ପର୍ଯ୍ୟାୟ। କ୍ଷେତରେ ସର୍ବୋତ୍ତମ ଜଳ ସ୍ତର ରଖନ୍ତୁ।",
            "ଧାନ କ୍ଷେତରେ ମିଥ୍ଯ଼ା ରୋଗ ଦେଖିବାକୁ ମିଳିପାରେ। ଏହାକୁ ପରିଚାଳନା କରିବା ପାଇଁ, ପ୍ରୋପିକୋନାଜୋଲ କିମ୍ବା ହେକ୍ସାକୋନାଜୋଲ ସ୍ପ୍ରେ କରନ୍ତୁ।",
            "ମିଥ୍ଯ଼ା ରୋଗକୁ ନିଯ଼ନ୍ତ୍ରଣ କରିବା ପାଇଁ କପର ଅକ୍ସିକ୍ଲୋରାଇଡ୍ ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "greengram": {
         "advisory": [
            "ରବି ଋତୁ ପାଇଁ ଡାଲି ଫସଲକୁ ବିଚାରକୁ ନିଆଯାଇପାରେ।",
            "ସମ୍ପୃକ୍ତ ଫସଲ କ୍ଷେତରୁ ଘାସ ଏବଂ ଅନ୍ଯ଼ାନ୍ଯ଼ ଅନାବଶ୍ଯ଼କ ଗଛଗୁଡ଼ିକୁ ବାହାର କରନ୍ତୁ।",
            "ଜମି ପ୍ରସ୍ତୁତ ହେବା ପରେ, କେନ୍ଦୁଝର ଜିଲ୍ଲାରେ ସବୁଜ ଘାସ ବୁଣା ଯାଇପାରିବ।",
            "ମଞ୍ଜି ଗୁଡ଼ିକୁ ବୁଣିବା ପୂର୍ବରୁ ଥିରମ୍, କ୍ଯ଼ାପ୍ଟନ୍ ଭଳି କବକନାଶକ ଦ୍ୱାରା ଚିକିତ୍ସା କରନ୍ତୁ।",
            "ବୁଣିବା ପରେ ବାଧ୍ୟତାମୂଳକ ଜଳସେଚନ ଆବଶ୍ୟକ।"
         ]
      },
      "pumpkin": {
         "advisory": [
            "କୀଟ ଆକ୍ରମଣକୁ କମ୍ କରିବା ପାଇଁ ସକାଳେ କୀଟନାଶକ ସ୍ପ୍ରେ କରନ୍ତୁ।",
            "କାର୍ବେନଡାଜିମ୍ କିମ୍ବା ମାନକୋଜେବ୍ ସିଞ୍ଚନ କରି ପତ୍ରର ବ୍ଲାଇଟ୍ ପରିଚାଳନା କରନ୍ତୁ।",
            "ଲାଲ କଦଳୀ ଭୃଣ ସଂକ୍ରମଣକୁ ନିଯ଼ନ୍ତ୍ରଣ କରିବା ପାଇଁ ମାଲାଥିଅନ୍ ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "bitter gourd": {
         "advisory": [
            "ପାଉଡର ଫଙ୍ଗୁର ରୋଗକୁ ନିଯ଼ନ୍ତ୍ରଣ କରିବା ପାଇଁ ଡିନୋକାପ୍ କିମ୍ବା କାର୍ବେଣ୍ଡାଜିମ୍ ସ୍ପ୍ରେ କରନ୍ତୁ।",
            "ରୋଗ ଏବଂ କୀଟପତଙ୍ଗ ଦ୍ୱାରା ହେଉଥିବା କ୍ଷତିକୁ ହ୍ରାସ କରିବା ପାଇଁ ପଦକ୍ଷେପ ନିଅନ୍ତୁ।"
         ]
      },
      "okra": {
         "advisory": [
            "ନିଯ଼ମିତ ଭାବେ ଫସଲକୁ ଜଳସେଚନ କରନ୍ତୁ।",
            "ଫଳଗୁଡ଼ିକୁ କାଟି ସୁରକ୍ଷିତ ସ୍ଥାନରେ ରଖନ୍ତୁ।",
            "ବଜାରରେ ଭଲ ଦରରେ ଫଳ ବିକ୍ରି କରନ୍ତୁ।"
         ]
      },
      "ivy gourd": {
         "advisory": [
            "ଫଳଗୁଡ଼ିକୁ ଅମଳ କରନ୍ତୁ ଏବଂ ଅଧିକ ବ୍ଯ଼ବହାର ପାଇଁ ସେଗୁଡ଼ିକୁ ସୁରକ୍ଷିତ ସ୍ଥାନରେ ରଖନ୍ତୁ।",
            "ମାଲାଥିଅନ୍ 50 ଇ. ସି. କିମ୍ବା ଡାଇମେଥୋଏଟ୍ 30 ଇ. ସି. ସି. ସିଞ୍ଚନ କରି ଶୋଷକ କୀଟକୁ ନିଯ଼ନ୍ତ୍ରଣ କରନ୍ତୁ।"
         ]
      },
      "guava": {
         "advisory": [
            "ଅଧିକ ଶାଖାପ୍ରଶାଖା ପାଇଁ ପେୟାରେ ଶାଖାଗୁଡ଼ିକୁ ବଙ୍କା କରନ୍ତୁ।",
            "ପାଉଡର ଫଙ୍ଗୁରକୁ ସଲଫର୍ ପାଉଡରରେ ଚିକିତ୍ସା କରନ୍ତୁ।",
            "ମୃତ୍ତିକାର ଆର୍ଦ୍ରତା ସ୍ତର ଅନୁସାରେ ଜଳସେଚନ ବ୍ଯ଼ବସ୍ଥା କରନ୍ତୁ।"
         ]
      },
      "banana": {
         "advisory": [
            "ଗଛ ଏବଂ ଗୁଚ୍ଛକୁ ସହାଯ଼ତା ପ୍ରଦାନ କରନ୍ତୁ।",
            "ମାତୃ ଗଛରୁ ଅତିରିକ୍ତ ଶୋଷକକୁ କାଟି ଦିଅନ୍ତୁ।",
            "ଅଧିକ ବୃଦ୍ଧି ପାଇଁ କେବଳ ଗୋଟିଏରୁ ଦୁଇଟି ଶୋଷକ ରଖନ୍ତୁ |"
         ]
      }
   },
   "date": "18-10-2024"
}