{
   "weather_details": {
      "2024-07-20": {
         "rainfall": 30,
         "t_max": 29,
         "t_min": 23,
         "rh_max": 91,
         "rh_min": 69,
         "wind_speed": 7,
         "wind_direction": 252,
         "cloud_cover": 8
      },
      "2024-07-21": {
         "rainfall": 25,
         "t_max": 30,
         "t_min": 24,
         "rh_max": 92,
         "rh_min": 73,
         "wind_speed": 9,
         "wind_direction": 248,
         "cloud_cover": 8
      },
      "2024-07-22": {
         "rainfall": 10,
         "t_max": 32,
         "t_min": 24,
         "rh_max": 91,
         "rh_min": 79,
         "wind_speed": 11,
         "wind_direction": 238,
         "cloud_cover": 7
      },
      "2024-07-23": {
         "rainfall": 5,
         "t_max": 32,
         "t_min": 25,
         "rh_max": 86,
         "rh_min": 71,
         "wind_speed": 18,
         "wind_direction": 248,
         "cloud_cover": 6
      },
      "2024-07-24": {
         "rainfall": 5,
         "t_max": 33,
         "t_min": 25,
         "rh_max": 85,
         "rh_min": 66,
         "wind_speed": 17,
         "wind_direction": 248,
         "cloud_cover": 6
      }
   },
   "names_of_crops": [
      "ଚାଉଳ",
      "ମକା",
      "ଆମ୍ବ",
      "ଛେଳି।"
   ],
   "general_advisory": "ଠିକ୍ ସମଯ଼ରେ ପାଣି ନିଷ୍କାସନ ଏବଂ ରୋପଣ ପାଇଁ ମୁଖ୍ଯ଼ ଧାନ କ୍ଷେତରେ ବର୍ଷା ଜଳକୁ ବାନ୍ଧି ରଖନ୍ତୁ। ଧାନ ଏବଂ ରାଗି ରୋପଣ ସେତେବେଳେ ଆରମ୍ଭ ହେବ ଯେତେବେଳେ ଚାରା 20-25 ଦିନ ପୁରୁଣା ହୋଇଯିବ। କପା ଏବଂ ମକା ପରି ଉଚ୍ଚଭୂମି ଫସଲରେ ଆଗାଛା କାଟିବା ଏବଂ ମୃତ୍ତିକା।",
   "crops_data": {
      "rice": {
         "advisory": [
            "ଆଗାମୀ ପାଞ୍ଚ ଦିନ ମଧ୍ଯ଼ରେ ଉଚିତ ପରିମାଣର ବର୍ଷା ହେବାର ସମ୍ଭାବନା ଥିବାରୁ ବିଳମ୍ବ ନକରି ଓଦା ଶଯ୍ଯ଼ା ଧାନ ନର୍ସରୀକୁ ସମ୍ପୂର୍ଣ୍ଣ ଭାବେ ବୃଦ୍ଧି କରାଯିବ। ହାଇବ୍ରିଡ୍ ଧାନ ରୋପଣ କରିବାକୁ ଯାଉଥିବା କୃଷକମାନେ ଶେଷ ପୋଖରୀ ସମଯ଼ରେ ଏକର ପିଛା 52 କେଜି ଡିଏପି ଏବଂ 40 କେଜି ଏମଓପି ପ୍ରଯ଼ୋଗ କରିବା ଉଚିତ୍। ବାଲୁକାମଯ଼ ମୃତ୍ତିକା ପାଇଁ ଏକର ପିଛା 52 କିଲୋଗ୍ରାମ ଡିଏପି ଏବଂ 20 କିଲୋଗ୍ରାମ ପୋଟାଶ ଲଗାନ୍ତୁ। ମୃତ୍ତିକା ପରୀକ୍ଷଣ ରିପୋର୍ଟ ଅନୁଯାଯ଼ୀ ଯଦି ମୃତ୍ତିକାରେ ଜିଙ୍କ ଅଭାବ ଥାଏ, ତେବେ ପ୍ରତି ତିନି ବର୍ଷରେ ଏକର ପିଛା 10 କିଲୋଗ୍ରାମ ଲେଖାଏଁ ଜିଙ୍କ ସଲଫେଟ୍ (21 ପ୍ରତିଶତ) ଲଗାନ୍ତୁ।",
            "20-25 ଦିନର ପୁରୁଣା ଚାରା ରୋପଣ 20x15 ସେ. ମି. ବ୍ଯ଼ବଧାନରେ କରାଯିବା ଉଚିତ, ହାଇବ୍ରିଡ୍ ପାଇଁ ପ୍ରତି ପାହାଡ଼ରେ \"1\" ଚାରା ଲଗାଇବା ଉଚିତ।"
         ]
      },
      "maize": {
         "advisory": [
            "ମକା ଭିତରେ ଷ୍ଟେମ ବୋରର ସଂକ୍ରମଣ ଦେଖିବାକୁ ମିଳିଛି। 10 ଦିନର ବ୍ଯ଼ବଧାନରେ ଦୁଇଥର ଟ୍ରାଇକୋଗ୍ରାମାକିଲୋନିସର 2000 ଅଣ୍ଡା ଛାଡ଼ନ୍ତୁ। ଯଦି ଉପରୋକ୍ତ ପଦ୍ଧତି ଦ୍ୱାରା ନିଯ଼ନ୍ତ୍ରିତ ନହୁଏ, ତେବେ 1 ଲିଟର ପାଣିରେ 2 ମିଲି ଫିପ୍ରୋନିଲ ସିଞ୍ଚନ କରନ୍ତୁ।"
         ]
      },
      "mango": {
         "advisory": [
            "ଜୁଲାଇ ଏବଂ ଅଗଷ୍ଟ ହେଉଛି ଆମ୍ବ ରୋପଣ ପାଇଁ ସର୍ବୋତ୍ତମ। ବୈଗାନପଲ୍ଲୀ, ତୋତାପୁରୀ, ବମ୍ବେ ସବୁଜ, ସୁବର୍ଣ୍ଣରେଖା, ନୀଲମ, ହିମସାଗର, ଲାଙ୍ଗ୍ରା, ଦଶେରୀ, ଆମ୍ରପାଲି, ମଲ୍ଲିକା, ରତ୍ନା, ରୁମ୍ମାନୀ, ସିନ୍ଧୁ, ଅଲ୍ଫାନ୍ସୋ ଏବଂ କେଶର ଇତ୍ଯ଼ାଦି ଚାଷ କରନ୍ତୁ | ସୁସ୍ଥ ଶାଖାବିହୀନ ଗ୍ରାଫ୍ଟେଡ ଚାରା ବ୍ଯ଼ବହାର କରନ୍ତୁ। 05x05 ମିଟର ଦୂରତାରେ 1x1x1 ମିଟର ଗର୍ତ୍ତରେ ଚାରା ରୋପଣ କରନ୍ତୁ। ରୋପଣ ପୂର୍ବରୁ ଏନ. ପି. କେ. ର <ଆଇ. ଡି. 1> ଗ୍ରାମ୍ ଏବଂ ଦୁଇଟି ବାସ୍କେଟ କମ୍ପୋଷ୍ଟ/ଗର୍ତ୍ତ ଲଗାନ୍ତୁ।"
         ]
      },
      "goat": {
         "advisory": [
            "ଚଟାଣ ଉପରେ ବାଲି ବ୍ଯ଼ବହାର କରି ଆମେ ଚଟାଣକୁ ଶୁଖିଲା ରଖିପାରିବା ଯାହା ଦ୍ୱାରା ପଶୁମାନଙ୍କୁ ବିଭିନ୍ନ ରୋଗରୁ ମୁକ୍ତ ରଖାଯାଇପାରିବ। ଏହି ସେଡର ବିଶେଷତ୍ୱ ହେଉଛି ଚଟାଣଟି ଇଟା ଏବଂ ସିମେଣ୍ଟରେ ନିର୍ମିତ ଏବଂ ନଦୀର ବାଲି ଏହା ଉପରେ 4 ରୁ 6 ଇଞ୍ଚ ମୋଟା ହୋଇଥାଏ। ବାଲି ପରିସ୍ରାକୁ ଭିଜାଇ ରଖେ, ଯାହାଦ୍ୱାରା ପଶୁମାନେ ତା 'ଉପରେ ଆରାମରେ ଶୋଇପାରିବେ। ବାଲିର ଚଟାଣ ଉପରେ ସାମଗ୍ରୀ ସଫା କରିବା ମଧ୍ଯ଼ ସହଜ। ବାଲିକୁ ଶୁଖିଲା ରଖିବା ପାଇଁ ଏହାକୁ 15-20 ଦିନ ବ୍ଯ଼ବଧାନରେ ଓଲଟପାଲଟ କରି ଦିଆଯାଏ। ପିଲାମାନଙ୍କ ପାଇଁ ଚଟାଣ ସ୍ଥାନର ଆବଶ୍ଯ଼କତା 0.5, ବଯ଼ସ୍କମାନଙ୍କ ପାଇଁ 1.2, ବକ୍ ଏବଂ ଗର୍ଭବତୀ ମହିଳାଙ୍କ ପାଇଁ 2 ବର୍ଗ ମିଟର ଚଟାଣ ସ୍ଥାନ ଆବଶ୍ଯ଼କ ଯାହା ପ୍ରତ୍ଯ଼େକ ପ୍ରକାରର ସେଡ୍ ପାଇଁ ଉପଯୁକ୍ତ |"
         ]
      }
   },
   "date": "19-07-2024"
}