{
   "weather_details": {
      "20-07-2024": {
         "rainfall": 10,
         "t_max": 31,
         "t_min": 24,
         "rh_max": 87,
         "rh_min": 46,
         "wind_speed": 10,
         "wind_direction": 63,
         "cloud_cover": 7
      },
      "21-07-2024": {
         "rainfall": 15,
         "t_max": 31,
         "t_min": 24,
         "rh_max": 83,
         "rh_min": 49,
         "wind_speed": 11,
         "wind_direction": 202,
         "cloud_cover": 7
      },
      "22-07-2024": {
         "rainfall": 10,
         "t_max": 32,
         "t_min": 25,
         "rh_max": 81,
         "rh_min": 57,
         "wind_speed": 17,
         "wind_direction": 238,
         "cloud_cover": 7
      },
      "23-07-2024": {
         "rainfall": 5,
         "t_max": 32,
         "t_min": 25,
         "rh_max": 80,
         "rh_min": 63,
         "wind_speed": 22,
         "wind_direction": 248,
         "cloud_cover": 6
      },
      "24-07-2024": {
         "rainfall": 5,
         "t_max": 33,
         "t_min": 26,
         "rh_max": 78,
         "rh_min": 55,
         "wind_speed": 23,
         "wind_direction": 248,
         "cloud_cover": 6
      }
   },
   "names_of_crops": [
      "ଚାଉଳ",
      "ମକା",
      "ପନିପରିବା ଫସଲ",
      "ପଶୁପାଳନ"
   ],
   "general_advisory": "ଆଗାମୀ ଦିନରେ ଗୋଟିଏ କିମ୍ବା ଦୁଇଟି ସ୍ଥାନରେ ପ୍ରବଳ ବର୍ଷା ସହିତ ହାଲୁକା ରୁ ମଧ୍ଯ଼ମ ବର୍ଷା ହେବାର ସମ୍ଭାବନା ଥିବାରୁ କୃଷକମାନଙ୍କୁ ସେହି ସମଯ଼ରେ ଜଳସେଚନ ତଥା ସିଞ୍ଚନ କାର୍ଯ୍ଯ଼ ଏଡ଼ାଇବାକୁ ପରାମର୍ଶ ଦିଆଯାଇଛି ଏବଂ ଧାନ ରୋପଣ ତଥା ଫଳ ଓ ପନିପରିବା ଚାଷ ପାଇଁ କିଛି ଦିନ ଅପେକ୍ଷା କରିବାକୁ ପରାମର୍ଶ ଦିଆଯାଇଛି। ଉଚ୍ଚ ପବନର ବେଗକୁ ଦେଖି ଫସଲକୁ ସମର୍ଥନ କରିବା ପାଇଁ ବ୍ଯ଼ବସ୍ଥା କରନ୍ତୁ।",
   "crops_data": {
      "rice": {
         "advisory": [
            "ଜୁଲାଇର ଦ୍ୱିତୀଯ଼ ପନ୍ଦର ଦିନ ଶେଷ ସୁଦ୍ଧା ନର୍ସରୀ ବୁଣିବା ଶେଷ ହେବା ଉଚିତ।",
            "ଦିନ ବ୍ଯ଼ବଧାନରେ 7-10 ଦୁଇଥର କ୍ଷେତକୁ କାଦୁଅ କରି ଏବଂ ସମାନ ଫସଲ ଷ୍ଟାଣ୍ଡ ପାଇଁ ଜମି ସମତଳ କରି ମୁଖ୍ଯ଼ କ୍ଷେତ୍ର ଜମି ପ୍ରସ୍ତୁତି କରାଯିବା ଉଚିତ।",
            "ଅଧିକ ଉତ୍ପାଦନକ୍ଷମ କିସମଗୁଡ଼ିକ ପାଇଁ ସାରର ଉପଯୁକ୍ତ ମୂଳ ମାତ୍ରା ପ୍ରଯ଼ୋଗ କରନ୍ତୁ।",
            "ଚାରା ରୋପଣ ନିର୍ଦ୍ଧାରିତ ବ୍ଯ଼ବଧାନରେ କରାଯିବା ଉଚିତ।",
            "ଶୁଖିଲା ଋତୁରେ ବ୍ଯ଼ବହୃତ ହେବାକୁ ଥିବା ବର୍ଷା ଜଳକୁ ଗଚ୍ଛିତ ରଖନ୍ତୁ।"
         ]
      },
      "maize": {
         "advisory": [
            "ଖରିଫ ମକା ପାଇଁ ଆଦର୍ଶ ବୁଣିବା ସମଯ଼ ହେଉଛି ଜୁନ୍ 20 ରୁ ଜୁଲାଇ ଶେଷ ପର୍ଯ୍ଯ଼ନ୍ତ |",
            "ଫଙ୍ଗିସାଇଡ୍ ଏବଂ କୀଟନାଶକ ସହିତ ପ୍ରାକ୍-ବୁଣିବା ମଞ୍ଜି ଚିକିତ୍ସା ସୁପାରିଶ କରାଯାଏ |",
            "ହସ୍ତଚାଳିତ ହୋଇଂ ଏବଂ ତୃଣନାଶକ ପ୍ରଯ଼ୋଗ ସହିତ ଆଗାଛା ବୃଦ୍ଧି ଉପରେ ନଜର ରଖନ୍ତୁ |",
            "ଆଗାମୀ ବର୍ଷା ପୂର୍ବାନୁମାନ କାରଣରୁ କୌଣସି ବି ସିଞ୍ଚନ କାର୍ଯ୍ଯ଼ରେ ବିଳମ୍ବ କରନ୍ତୁ।"
         ]
      },
      "vegetable crops": {
         "advisory": [
            "ଖରିଫ ପନିପରିବା ଫସଲ ପାଇଁ ଉପଯୁକ୍ତ ଜଳ ନିଷ୍କାସନ ବ୍ଯ଼ବସ୍ଥା ସହିତ ଉଠାଯାଇଥିବା ଶଯ୍ଯ଼ା ନର୍ସରୀ ପ୍ରସ୍ତୁତି ଆରମ୍ଭ କରନ୍ତୁ।",
            "ପ୍ରବଳ ବର୍ଷା ସମଯ଼ରେ ରୋପଣ ଏବଂ ଆନ୍ତଃସାଂସ୍କୃତିକ କାର୍ଯ୍ଯ଼କଳାପରୁ ଦୂରେଇ ରୁହନ୍ତୁ।",
            "ଜଳାବଦ୍ଧତା ଏଡ଼ାଇବା ପାଇଁ ଉପଯୁକ୍ତ ଜଳ ନିଷ୍କାସନ ସୁନିଶ୍ଚିତ କରନ୍ତୁ।"
         ]
      },
      "animal husbandry": {
         "advisory": [
            "ବର୍ଷା ଋତୁରେ ସଂକ୍ରାମକ ରୋଗ ବିରୁଦ୍ଧରେ ପଶୁମାନଙ୍କର କୃମି ନିରାକରଣ ଏବଂ ଟୀକାକରଣ ଗୁରୁତ୍ୱପୂର୍ଣ୍ଣ |",
            "ପଶୁମାନଙ୍କୁ ସ୍ୱଚ୍ଛ ପାନୀଯ଼ ଜଳ ଯୋଗାଇ ଦିଅନ୍ତୁ ଏବଂ ପ୍ରବାହିତ ବର୍ଷା ଜଳ ସଂସ୍ପର୍ଶରେ ଆସିବାକୁ ଦିଅନ୍ତୁ ନାହିଁ।",
            "ପ୍ରତିକୂଳ ପାଗ ସମଯ଼ରେ ପଶୁମାନଙ୍କୁ ସୁରକ୍ଷିତ ସ୍ଥାନରେ ରଖିବା ସୁନିଶ୍ଚିତ କରନ୍ତୁ।"
         ]
      }
   },
   "date": "19-07-2024"
}