{
   "weather_details": {
      "20-07-2024": {
         "rainfall": 25,
         "t_max": 30,
         "t_min": 24,
         "rh_max": 92,
         "rh_min": 63,
         "wind_speed": 14,
         "wind_direction": 68,
         "cloud_cover": 8
      },
      "21-07-2024": {
         "rainfall": 15,
         "t_max": 31,
         "t_min": 24,
         "rh_max": 90,
         "rh_min": 58,
         "wind_speed": 11,
         "wind_direction": 90,
         "cloud_cover": 7
      },
      "22-07-2024": {
         "rainfall": 10,
         "t_max": 32,
         "t_min": 25,
         "rh_max": 87,
         "rh_min": 58,
         "wind_speed": 10,
         "wind_direction": 255,
         "cloud_cover": 7
      },
      "23-07-2024": {
         "rainfall": 10,
         "t_max": 33,
         "t_min": 25,
         "rh_max": 84,
         "rh_min": 64,
         "wind_speed": 17,
         "wind_direction": 252,
         "cloud_cover": 7
      },
      "24-07-2024": {
         "rainfall": 5,
         "t_max": 33,
         "t_min": 25,
         "rh_max": 83,
         "rh_min": 57,
         "wind_speed": 19,
         "wind_direction": 249,
         "cloud_cover": 6
      }
   },
   "names_of_crops": [
      "ଧାନ।",
      "ଆଖୁ",
      "ବାଇଗଣ",
      "ଓକ୍ରା",
      "କଦଳୀ",
      "ଗୋରୁମାନେ।",
      "ଛେଳି।",
      "ମତ୍ସ୍ଯ଼ଚାଷ"
   ],
   "general_advisory": "ପ୍ରବଳ ବର୍ଷାର ପୂର୍ବାନୁମାନକୁ ଦୃଷ୍ଟିରେ ରଖି, ମଞ୍ଜି ବୁଣିବା ଏବଂ ସାର ଉପରେ ସାର ଲଗାଇବା ବନ୍ଦ କରନ୍ତୁ। ଯେଉଁଠାରେ ଖରିଫ ମକା କିମ୍ବା ଡାଲି ଇତ୍ଯ଼ାଦି ରୋପଣ କରାଯାଇଛି, ସେଠାରେ ଜଳ ନିଷ୍କାସନ ବ୍ଯ଼ବସ୍ଥା କରନ୍ତୁ। ପ୍ରବଳ ବର୍ଷାରୁ ରକ୍ଷା ପାଇବା ପାଇଁ ପନିପରିବା ନର୍ସରୀକୁ ପଲିଥିନ୍ ଦ୍ୱାରା ଢାଙ୍କି ଦିଅନ୍ତୁ। ବିଦ୍ଯ଼ମାନ ମେଘୁଆ ପାଗ ଏବଂ ଉଚ୍ଚ ଆପେକ୍ଷିକ ଆର୍ଦ୍ରତା ସ୍ଥିତି ସ୍ଥାଯ଼ୀ ଫସଲରେ କୀଟ ଆକ୍ରମଣ ପାଇଁ ଅନୁକୂଳ | ତେଣୁ ନିଯ଼ମିତ ନିରୀକ୍ଷଣ ଏବଂ ଉପଯୁକ୍ତ ଉଦ୍ଭିଦ ସୁରକ୍ଷା ପଦକ୍ଷେପ ଗ୍ରହଣ କରାଯିବା ଉଚିତ।",
   "crops_data": {
      "paddy": {
         "advisory": [
            "20-25 ଦିନର ପୁରୁଣା ଚାରା ରୋପଣରେ 20x15 ସେ. ମି. ବ୍ଯ଼ବଧାନ ରହିବା ଉଚିତ, ଅଧିକ ଉତ୍ପାଦନକ୍ଷମ ପ୍ରଜାତି ପାଇଁ ପ୍ରତି ପାହାଡ଼ରେ 2-3 ଚାରା ଲଗାଇବା ଉଚିତ।",
            "ଧାନ କ୍ଷେତରେ ଆଗାଛା ସଂକ୍ରମଣକୁ ନିଯ଼ନ୍ତ୍ରଣ କରିବା ପାଇଁ ହର୍ବିସାଇଡ୍ ପ୍ରିଟିଲାକ୍ଲୋର 37 ପ୍ରତିଶତ EW @600 ମିଲି/ଏକର କିମ୍ବା ଅକ୍ସାଡିଆର୍ଜିଲ 80 ପ୍ରତିଶତ W. P @50 ଗ୍ରାମ/ଏକର 1-3 DAT ରେ ବ୍ଯ଼ବହାର କରନ୍ତୁ।",
            "ଏକର ପିଛା 200 ଲିଟର ପାଣିରେ ହର୍ବିସାଇଡ୍ ମିଶାଇ ସ୍ପ୍ରେ କରନ୍ତୁ କିମ୍ବା 20 କେଜି ବାଲି ସହିତ ହର୍ବିସାଇଡ୍ ମିଶାନ୍ତୁ ଏବଂ ଏହାକୁ ସମାନ ଭାବରେ ପ୍ରସାରଣ କରନ୍ତୁ |"
         ]
      },
      "sugarcane": {
         "advisory": [
            "ମଧ୍ଯ଼ମ ଏବଂ ଦୀର୍ଘକାଳୀନ ଆଖୁ କିସମରେ, ଆଖୁକୁ ସିଧା ରଖିବା ପାଇଁ 4-5 ମାସ ପୁରୁଣା ଫସଲରେ ରାପିଙ୍ଗ୍ ଏବଂ ପ୍ରୋପିଙ୍ଗ୍ କରାଯିବା ଉଚିତ୍ |",
            "ଆଖୁ ଫସଲରେ ମିଳି ବଗ୍ ପରିଚାଳନା କରିବା ପାଇଁ ଇମିଡାକ୍ଲୋପ୍ରିଡ୍ <ଆଇ. ଡି. 1> ଏସ୍. ଏଲ୍. @60 ମି. ଲି./ଏକର କିମ୍ବା ଥିଯ଼ାମେଥୋକ୍ସାମ୍ 25 ପ୍ରତିଶତ ଡବ୍ଲୁ. ଜି. @40 ଗ୍ରାମ୍/ଏକର କିମ୍ବା ପ୍ରୋଫେନୋଫସ୍ 50 ପ୍ରତିଶତ ଇ. ସି. @400 ମି. ଲି./ଏକର ମିଶ୍ରଣ କରି ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "brinjal": {
         "advisory": [
            "ନର୍ସରୀରେ ବାଇଗଣ ଗଛର ରୋଗକୁ ନିଯ଼ନ୍ତ୍ରଣ କରିବା ପାଇଁ ଏକ ଉପଯୁକ୍ତ ଜଳ ନିଷ୍କାସନ ବ୍ଯ଼ବସ୍ଥା ରହିବା ଉଚିତ।",
            "ମଞ୍ଜି ବୁଣିବା 24 ଘଣ୍ଟା ପୂର୍ବରୁ ଟ୍ରାଇକୋଡର୍ମାସ୍ପେରେଲମ୍ @4 ଗ୍ରାମ୍ ପ୍ରତି କିଲୋଗ୍ରାମ୍ ମଞ୍ଜି କିମ୍ବା ସିଉଡୋମୋନାସ୍ ଫ୍ଲୁରୋସେନ୍ସ୍ @10 ଗ୍ରାମ୍/କିଲୋଗ୍ରାମ୍ ମଞ୍ଜି ସହିତ ମଞ୍ଜି ଚିକିତ୍ସା କରାଯିବା ଉଚିତ।",
            "20 ଗ୍ରାମ୍ ମେଟାଲାକ୍ସିଲ୍ ଏବଂ ମାନକୋଜେବ୍ ର ଦ୍ରବଣ ସହିତ ଶଯ୍ଯ଼ା ମାଟିକୁ 10 ଲିଟର ପାଣିରେ ଭିଜାଇ ଦିଅନ୍ତୁ |"
         ]
      },
      "okra": {
         "advisory": [
            "ବର୍ତ୍ତମାନର ପାଣିପାଗ କାରଣରୁ ଓକ୍ରାରେ ଏଫିଡ୍, ଜ୍ଯାସିଡ୍, ଥ୍ରିପ୍ ଏବଂ ହ୍ୱାଇଟ୍ଫ୍ଲାଇ ଭଳି କୀଟ ଶୋଷିବାର ସମ୍ଭାବନା ରହିଛି।",
            "ବର୍ଷା ବନ୍ଦ ହେବା ପରେ ଏହି ଶୋଷକ କୀଟକୁ ନିଯ଼ନ୍ତ୍ରଣ କରିବା ପାଇଁ ଥିଯ଼ାମେଥୋକ୍ସାମ୍କୁ ଏକର ପିଛା 40 ଗ୍ରାମ୍ରେ 25 ପ୍ରତିଶତ ଡବ୍ଲୁ. ଜି. କିମ୍ବା ଏସିଟାମିପ୍ରିଡ୍କୁ ଏକର ପିଛା 50 ଗ୍ରାମ୍ରେ 20 ପ୍ରତିଶତ ଏସ. ପି. କିମ୍ବା ଟଲ୍ଫେନପାଇରାଡ୍କୁ ଏକର ପିଛା 400 ମିଲି. ରେ 15 ପ୍ରତିଶତ ଇ. ସି. 200 ଲିଟର ପାଣିରେ ମିଶାଇ ସିଞ୍ଚନ କରନ୍ତୁ।"
         ]
      },
      "banana": {
         "advisory": [
            "ଷ୍ଟାକିଂ ପ୍ରଦାନ କରନ୍ତୁ ଏବଂ ଡ୍ରେନେଜ୍ ପାଇଁ ବ୍ଯ଼ବସ୍ଥା କରନ୍ତୁ |",
            "ପାନାମା ୱିଲ୍ଟକୁ ପରିଚାଳନା କରିବା ପାଇଁ, ରୋଗ ମୁକ୍ତ ରୋପଣ ସାମଗ୍ରୀ ଏବଂ ବାଣ୍ଟାଲ, ରୋବଷ୍ଟା, ଚମ୍ପା, କାବୁଲି ଇତ୍ଯ଼ାଦି ପ୍ରତିରୋଧକ ଚାଷ ଚଯ଼ନ କରନ୍ତୁ |",
            "କଦଳୀ ଶୋଷକମାନଙ୍କୁ ରୋପଣ ପୂର୍ବରୁ 10-ଗ୍ରାମ୍/10-ଲିଟର ପାଣିରେ କାର୍ବେନଡାଜିମ୍ ଦ୍ରବଣରେ ବୁଡ଼ାଇବା ଉଚିତ ଏବଂ ରୋପଣର 5 ମାସ ପରେ ସିଉଡୋଷ୍ଟେମ୍ ଚାରିପାଖରେ ମାଟି ଦ୍ୱିମାସିକ ଭାବରେ ଭିଜାଇଦେବା ଉଚିତ୍ |"
         ]
      },
      "cattles": {
         "advisory": [
            "ବର୍ଷା ଋତୁରେ ପଶୁମାନଙ୍କୁ ଘର ଭିତରେ ରଖନ୍ତୁ।",
            "ବର୍ଷା ସମଯ଼ରେ ପଶୁମାନଙ୍କୁ ଭଲ ଗୁଣବତ୍ତା ଏବଂ ପରିମାଣର ସବୁଜ, ଶୁଖିଲା ପଶୁଖାଦ୍ଯ଼ ଏବଂ ଘନୀଭୂତ ଖାଦ୍ଯ଼ ଦିଆଯାଏ |",
            "ଖାଦ୍ଯ଼ ଏବଂ ଖୁଆଇବା ସାମଗ୍ରୀଗୁଡିକ ଏକ ଶୁଖିଲା ସ୍ଥାନରେ ଏକ ଉପଯୁକ୍ତ ପ୍ଲାଟଫର୍ମ ସହିତ ଏବଂ ବର୍ଷା ଏବଂ ଆର୍ଦ୍ରତାରୁ ମୁକ୍ତ ଭାବରେ ସଂରକ୍ଷଣ କରିବାକୁ ପଡିବ |"
         ]
      },
      "goat": {
         "advisory": [
            "ଆରମ୍ଭ ହେବା ପରେ, ବର୍ଷା ଋତୁର ମଧ୍ଯ଼ଭାଗରେ ଏବଂ ଶେଷରେ କୃମି ଦୂରୀକରଣ କରିବାକୁ ହେବ।",
            "ଛେଳିଙ୍କୁ ପେଷ୍ଟ ଡେସ ପେଟିଟ୍ସ ରୁମିନାଣ୍ଟସ୍ (ପିପିଆର) ରୋଗ ବିରୁଦ୍ଧରେ ଟୀକାକରଣ କରନ୍ତୁ ଏବଂ 1 ମାସ ପରେ ଏଣ୍ଟେରୋଟକ୍ସିମିଆ (ଇଟି) ରୋଗ ବିରୁଦ୍ଧରେ ଟୀକାକରଣ କରନ୍ତୁ।",
            "ବର୍ଷା ଋତୁରେ ଛେଳିମାନେ ଖୁର ସମସ୍ଯ଼ାରେ ପଡ଼ନ୍ତି। ସପ୍ତାହରେ ଦୁଇଥର ଚୂନ ଦ୍ୱାରା ଖୁର ସଫା କରିବା ଦ୍ୱାରା ଖୁର ଘା 'ସମସ୍ଯ଼ା ହ୍ରାସ ପାଇପାରେ।"
         ]
      },
      "fishery": {
         "advisory": [
            "ପ୍ରବଳ ବର୍ଷା ଫଳରେ ପୋଖରୀରେ ଥିବା ଜଳର ଲବଣାକ୍ତତା ହ୍ରାସ ପାଇପାରେ। ବର୍ଷା ବନ୍ଦ ହେବା ପରେ ଆଲ୍କି-ଡାଇମିଥାଇଲ-ବେଞ୍ଜାଇଲ ଆମୋନିଯ଼ମ କ୍ଲୋରାଇଡ (3 ପିପିଏମ) କୁ କୀଟାଣୁନାଶକ ଭାବରେ ପ୍ରଯ଼ୋଗ କରିବାକୁ କୃଷକମାନଙ୍କୁ ପରାମର୍ଶ ଦିଆଯାଇଛି।",
            "ଅନାବଶ୍ଯ଼କ ମାଛର କ୍ଷତି ଏବଂ ପ୍ରବେଶକୁ ରୋକିବା ପାଇଁ ଇନଲେଟ୍ ଏବଂ ଆଉଟ୍ଲେଟ୍ ରେ ବାଉଁଶ କିମ୍ବା ନାଇଲନ୍ ଜାଲ ସ୍କ୍ରିନ୍ ସ୍ଥାପନ କରାଯିବା ଉଚିତ୍ |",
            "ଓଭରଫ୍ଲୋ ହେଉଥିବା ପାଣିରେ ମାଛର କ୍ଷଯ଼କୁ ରୋକିବା ପାଇଁ ବନ୍ଧ ଉପରେ ନାଇଲନ୍ ଜାଲ ଲଗାଯାଇପାରେ |"
         ]
      }
   },
   "date": "19-07-2024"
}