{
   "weather_details": {
      "20-07-2024": {
         "rainfall": 15,
         "t_max": 30,
         "t_min": 21,
         "rh_max": 90,
         "rh_min": 55,
         "wind_speed": 8,
         "wind_direction": 63,
         "cloud_cover": 8
      },
      "21-07-2024": {
         "rainfall": 15,
         "t_max": 32,
         "t_min": 21,
         "rh_max": 87,
         "rh_min": 58,
         "wind_speed": 9,
         "wind_direction": 243,
         "cloud_cover": 6
      },
      "22-07-2024": {
         "rainfall": 10,
         "t_max": 33,
         "t_min": 23,
         "rh_max": 84,
         "rh_min": 63,
         "wind_speed": 14,
         "wind_direction": 243,
         "cloud_cover": 7
      },
      "23-07-2024": {
         "rainfall": 5,
         "t_max": 33,
         "t_min": 24,
         "rh_max": 81,
         "rh_min": 62,
         "wind_speed": 21,
         "wind_direction": 248,
         "cloud_cover": 7
      },
      "24-07-2024": {
         "rainfall": 5,
         "t_max": 33,
         "t_min": 24,
         "rh_max": 78,
         "rh_min": 55,
         "wind_speed": 22,
         "wind_direction": 248,
         "cloud_cover": 7
      }
   },
   "names_of_crops": [
      "ଚାଉଳ",
      "ମକା",
      "ପନିପରିବା ଫସଲ",
      "ପଶୁପାଳନ"
   ],
   "general_advisory": "ହାଲୁକା ରୁ ମଧ୍ଯ଼ମ ବର୍ଷା ହେବାର ସମ୍ଭାବନା ଥିବାରୁ କୃଷକମାନଙ୍କୁ ଜଳସେଚନ ଏବଂ ସିଞ୍ଚନ କାର୍ଯ୍ଯ଼କୁ ଏଡ଼ାଇବାକୁ ପରାମର୍ଶ ଦିଆଯାଇଛି, ଏବଂ ଧାନ ରୋପଣ ତଥା ଫଳ ଏବଂ ପନିପରିବା ଫସଲ ରୋପଣ ପାଇଁ କିଛି ଦିନ ଅପେକ୍ଷା କରିବାକୁ ପରାମର୍ଶ ଦିଆଯାଇଛି। ଅତ୍ଯ଼ଧିକ ପବନର ବେଗ ବିରୁଦ୍ଧରେ ଫସଲକୁ ସମର୍ଥନ କରିବା ପାଇଁ ପ୍ରସ୍ତୁତ ହୁଅନ୍ତୁ।",
   "crops_data": {
      "rice": {
         "advisory": [
            "ଜୁଲାଇର ଦ୍ୱିତୀଯ଼ ପନ୍ଦର ଦିନ ଶେଷ ସୁଦ୍ଧା ନର୍ସରୀ ବୁଣିବା ଶେଷ ହେବା ଉଚିତ।",
            "ଦିନ ବ୍ଯ଼ବଧାନରେ 7-10 ଦୁଇଥର କ୍ଷେତକୁ କାଦୁଅ କରି ଏବଂ ସମାନ ଫସଲ ଷ୍ଟାଣ୍ଡ ପାଇଁ ଜମି ସମତଳ କରି ମୁଖ୍ଯ଼ କ୍ଷେତ୍ର ଜମି ପ୍ରସ୍ତୁତି କରାଯିବା ଉଚିତ।",
            "25-30 ଦିନର ପୁରୁଣା ଚାରା ଗୁଡ଼ିକର ପ୍ରତିରୋପଣ ଅଗଭୀର ଗଭୀରତାରେ 20 x 15 ସେ. ମି. ବ୍ଯ଼ବଧାନରେ କରାଯିବା ଉଚିତ।",
            "କୃଷକମାନଙ୍କୁ ପ୍ରଶସ୍ତ ଏବଂ ଉନ୍ନତ ବନ୍ଧ ତିଆରି କରି ବର୍ଷା ଜଳ ସଞ୍ଚଯ଼ କରିବାକୁ ପରାମର୍ଶ ଦିଆଯାଇଛି।"
         ]
      },
      "maize": {
         "advisory": [
            "ଖରିଫ ମକା ପାଇଁ ଆଦର୍ଶ ବୁଣିବା ସମଯ଼ ହେଉଛି ଜୁନ୍ 20 ରୁ ଜୁଲାଇ ଶେଷ ପର୍ଯ୍ଯ଼ନ୍ତ |",
            "ବୁଣିବା ପୂର୍ବରୁ, ରୋଗ ଏବଂ କୀଟପତଙ୍ଗରୁ ରକ୍ଷା ପାଇବା ପାଇଁ କବକନାଶକ ଏବଂ କୀଟନାଶକ ଦ୍ୱାରା ମଞ୍ଜି ଚିକିତ୍ସା କରନ୍ତୁ।",
            "ଭଲ ଆଗାଛା ନିଯ଼ନ୍ତ୍ରଣ ପାଇଁ 15 ଏବଂ 30 ଡିଏଏସରେ ହସ୍ତଚାଳିତ ହୋଇଂ।",
            "ଆଗାମୀ ବର୍ଷା ପୂର୍ବାନୁମାନ କାରଣରୁ ସିଞ୍ଚନ ଏବଂ ଆନ୍ତଃସାଂସ୍କୃତିକ କାର୍ଯ୍ଯ଼କଳାପ କରିବା ପୂର୍ବରୁ ଅପେକ୍ଷା କରନ୍ତୁ।"
         ]
      },
      "vegetable crops": {
         "advisory": [
            "ଉପଯୁକ୍ତ ଜଳ ନିଷ୍କାସନ ବ୍ଯ଼ବସ୍ଥା ସହିତ ଖରିଫ ପନିପରିବା ଫସଲ ପାଇଁ ଉଠାଯାଇଥିବା ଶଯ୍ଯ଼ା ନର୍ସରୀ ପ୍ରସ୍ତୁତି ଆରମ୍ଭ କରନ୍ତୁ।",
            "ପ୍ରବଳ ବର୍ଷା ସମଯ଼ରେ ରୋପଣ ଏବଂ ଆନ୍ତଃସାଂସ୍କୃତିକ କାର୍ଯ୍ଯ଼କଳାପରୁ ଦୂରେଇ ରୁହନ୍ତୁ।",
            "କ୍ଷେତରୁ ଅତିରିକ୍ତ ପାଣି ବାହାର କରିବା ପାଇଁ ବ୍ଯ଼ବସ୍ଥା କରନ୍ତୁ।"
         ]
      },
      "animal husbandry": {
         "advisory": [
            "ବର୍ଷା ଋତୁରେ ଆର୍ଦ୍ରତା ବୃଦ୍ଧି ହେତୁ ସଂକ୍ରାମକ ରୋଗ ବିରୁଦ୍ଧରେ କୀଟପତଙ୍ଗ ଏବଂ ଟୀକାକରଣ ପଶୁମାନଙ୍କୁ _",
            "ପଶୁମାନଙ୍କୁ ସେଡରେ ସୁରକ୍ଷିତ ସ୍ଥାନରେ ରଖନ୍ତୁ ଏବଂ ଚେତାବନୀ ସମଯ଼ରେ ଖୋଲା ସ୍ଥାନରେ ଚରାଇବା ଠାରୁ ଦୂରେଇ ରୁହନ୍ତୁ।",
            "ପଶୁମାନଙ୍କୁ ସ୍ୱଚ୍ଛ ପାନୀଯ଼ ଜଳ ଯୋଗାଇଦେବା ଏବଂ ଜଳ ଉତ୍ସରେ ପ୍ରବାହିତ ବର୍ଷା ଜଳର ମିଶ୍ରଣକୁ ରୋକିବା।",
            "ବର୍ଷା ଜଳର ସିଧାସଳଖ ପ୍ରବେଶକୁ ଏଡ଼ାଇ ଯାଆନ୍ତୁ।"
         ]
      }
   },
   "date": "19-07-2024"
}