{
   "weather_details": {
      "20-07-2024": {
         "rainfall": 25,
         "t_max": 29,
         "t_min": 23,
         "rh_max": 93,
         "rh_min": 64,
         "wind_speed": 14,
         "wind_direction": 68,
         "cloud_cover": 8
      },
      "21-07-2024": {
         "rainfall": 15,
         "t_max": 30,
         "t_min": 23,
         "rh_max": 93,
         "rh_min": 60,
         "wind_speed": 10,
         "wind_direction": 103,
         "cloud_cover": 8
      },
      "22-07-2024": {
         "rainfall": 10,
         "t_max": 31,
         "t_min": 24,
         "rh_max": 89,
         "rh_min": 59,
         "wind_speed": 8,
         "wind_direction": 120,
         "cloud_cover": 7
      },
      "23-07-2024": {
         "rainfall": 15,
         "t_max": 31,
         "t_min": 24,
         "rh_max": 87,
         "rh_min": 68,
         "wind_speed": 17,
         "wind_direction": 249,
         "cloud_cover": 7
      },
      "24-07-2024": {
         "rainfall": 15,
         "t_max": 31,
         "t_min": 25,
         "rh_max": 88,
         "rh_min": 67,
         "wind_speed": 21,
         "wind_direction": 248,
         "cloud_cover": 8
      }
   },
   "names_of_crops": [
      "ଧାନ।",
      "ମକା",
      "ମହିଳା ଆଙ୍ଗୁଠି",
      "କଦଳୀ ଗୁଣ୍ଡ",
      "ବାଇଗଣ",
      "କଦଳୀ",
      "କଦଳୀ",
      "ପେଯ଼ାରା",
      "ପେଁପେ"
   ],
   "general_advisory": "ଭଲ ବର୍ଷା ହେବାର ସମ୍ଭାବନା ଥିବାରୁ କୃଷକମାନଙ୍କୁ ସେମାନଙ୍କର ରୋପଣ କାର୍ଯ୍ଯ଼ ଜାରି ରଖିବାକୁ ପରାମର୍ଶ ଦିଆଯାଇଛି। ବର୍ଷା ଜଳ ସଞ୍ଚଯ଼ କରିବା ପାଇଁ ବନ୍ଧ ତିଆରି କରନ୍ତୁ। ଧାନ ରୋପଣ ପାଇଁ କ୍ଷେତକୁ ପ୍ରସ୍ତୁତ କରନ୍ତୁ। ଆଗାମୀ 4ରୁ 5 ଦିନ ପାଇଁ ସାର ଏବଂ କୀଟନାଶକ ସିଞ୍ଚନ ସ୍ଥଗିତ ରଖନ୍ତୁ। କୀଟନାଶକ ଏବଂ କୀଟନାଶକ ସିଞ୍ଚନ ସକାଳେ କିମ୍ବା ସନ୍ଧ୍ଯ଼ାରେ କରାଯିବା ଉଚିତ।",
   "crops_data": {
      "paddy": {
         "advisory": [
            "ଅତ୍ଯ଼ଧିକ ସାର ବ୍ଯ଼ବହାର କରନ୍ତୁ ନାହିଁ।",
            "ମୃତ୍ତିକା ପରୀକ୍ଷା ରିପୋର୍ଟ ଅନୁଯାଯ଼ୀ ସାରର ସୁପାରିସ କରାଯାଇଥିବା ମାତ୍ରା ବ୍ଯ଼ବହାର କରନ୍ତୁ।",
            "ଅତିରିକ୍ତ ଜଳ ନିଷ୍କାସନ ପାଇଁ ଡ୍ରେନେଜ୍ ଚ୍ଯ଼ାନେଲ୍ର ବ୍ଯ଼ବସ୍ଥା କରନ୍ତୁ।",
            "ସାହାବାଗୀ ଧନ, ମନ୍ଦାକିନୀ, ବିନା-11, ଜୋଗେଶ, ସିଦ୍ଧାନ୍ତ ଇତ୍ଯ଼ାଦି ସ୍ୱଳ୍ପକାଳୀନ କିସମ ନେବାକୁ ପରାମର୍ଶ ଦିଆଯାଇଛି।",
            "ଧାନ ରୋପଣ ପୂର୍ବରୁ ନିଶ୍ଚିତ କରନ୍ତୁ ଯେ ମାଟି ଭଲ ଭାବରେ କାଦୁଅ ହୋଇଛି।",
            "କ୍ଷେତରୁ ଅତିରିକ୍ତ ଜଳ ବାହାର କରିବା ପାଇଁ ଉପଯୁକ୍ତ ଜଳ ନିଷ୍କାସନ କରନ୍ତୁ।",
            "କୌଣସି ରୋଗ ଏବଂ କୀଟପତଙ୍ଗ ପାଇଁ କ୍ଷେତ ଉପରେ ନଜର ରଖନ୍ତୁ |",
            "କ୍ଷେତରେ ବର୍ଷା ଜଳ ସଞ୍ଚଯ଼ କରିବା ପାଇଁ ବନ୍ଧ ତିଆରି କରନ୍ତୁ।",
            "ବାରମ୍ବାର ବର୍ଷା ଏବଂ ଅଧିକ ଆର୍ଦ୍ରତା ଥିବା ଅଞ୍ଚଳରେ ବିସ୍ଫୋରଣ ରୋଗ (ଧୂସର କେନ୍ଦ୍ର ଏବଂ ବାଦାମୀ ମାର୍ଜିନ୍ ସହିତ ସ୍ପିଣ୍ଡଲ୍ ଆକୃତିର ଦାଗ) ଦେଖାଯାଇପାରେ |",
            "ଏହି ରୋଗକୁ ନିଯ଼ନ୍ତ୍ରଣ କରିବା ପାଇଁ, 15 ଲିଟର ପାଣି ପିଛା 30 ମିଲିଲିଟର ହାରରେ 5 ପ୍ରତିଶତ ଇ. ସି. ହେକ୍ସାକୋନାଜୋଲ ସ୍ପ୍ରେ କରନ୍ତୁ।",
            "ଷ୍ଟେମ ରଟ୍ଃ ଚାଉଳରେ ଷ୍ଟେମ ରଟ୍ ପରିଚାଳନା ପାଇଁ, କାର୍ବେନଡାଜିମ୍ 50% ଡବ୍ଲ୍ଯ଼ୁ. ପି. @2 ଗ୍ରାମ୍/ଲିଟର ସ୍ପ୍ରେ କରନ୍ତୁ।",
            "ଧାନ କାଣ୍ଡ ଛେଦକଃ କାଣ୍ଡ ଛେଦକ ଆକ୍ରମଣ ପାଇଁ ଅନୁକୂଳ ଅବସ୍ଥା-ଉଚ୍ଚ ନାଇଟ୍ରୋଜେନ ସାର, ବିଳମ୍ବରେ ରୋପଣ।",
            "ଥ୍ରିପ୍ସ ପତ୍ର ଗୁଡ଼ିକର ଅନ୍ତିମ ଘୂର୍ଣ୍ଣନ, ବିବର୍ଣତା ଏବଂ ଶୁଖିବାର କାରଣ ହୋଇଥାଏ।",
            "ଥ୍ରିପ୍ସ ସଂକ୍ରମଣକୁ ପରିଚାଳନା କରିବା ପାଇଁ, ଆଜାଦିରାକ୍ଟିନ 0.15% @600-1000 ମିଲି/ଏକର କିମ୍ବା ଥିଓମେଥୋକ୍ସାମ 25 ଡବ୍ଲୁଜି @40 ଗ୍ରାମ/ଏକର ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "maize": {
         "advisory": [
            "25 ପ୍ରତିଶତ ନାଇଟ୍ରୋଜେନ୍ (ଯ଼ୁରିଆ ଆକାରରେ) ଆଣ୍ଠୁ ଉଚ୍ଚତା ପର୍ଯ୍ଯ଼ାଯ଼ରେ କିମ୍ବା ବୁଣିବା ପରେ 25 ଦିନ ପରେ ପ୍ରଯ଼ୋଗ କରାଯିବା ଉଚିତ।",
            "ଆଗାଛା ବାହାର କରିବା ପରେ, ଉପରୋକ୍ତ ମାତ୍ରା ଅନୁଯାଯ଼ୀ ଯ଼ୁରିଆ ଲଗାନ୍ତୁ ଏବଂ ମୂଳ ଅଞ୍ଚଳକୁ ମାଟି (ରିଜ୍ ଏବଂ ଫୁରୋ) ଦ୍ୱାରା ଆଚ୍ଛାଦିତ କରନ୍ତୁ।",
            "ଟର୍କିକମ୍ ଲିଫ୍ ବ୍ଲାଇଟ୍ଃ ମକା ପତ୍ରର ରୋଗକୁ ହ୍ରାସ କରିବା ପାଇଁ, ପ୍ରୋପିକୋନାଜୋଲ୍ 25 ପ୍ରତିଶତ ଇସି 1 ମିଲି/ଲିଟର କିମ୍ବା ମାନକୋଜେବ୍ 2-4 ଗ୍ରାମ/ଲିଟର ସ୍ପ୍ରେ କରନ୍ତୁ।",
            "ପତନ ସେନା କୃମି-ଲକ୍ଷଣ-ଛୋଟ ଲାର୍ଭା ଦ୍ୱାରା ପତ୍ରର ସ୍କ୍ରାପିଂ | ଲାର୍ଭା କେନ୍ଦ୍ରୀଯ଼ ଚକ୍ରକୁ ଖାଇଥାଏ ଯାହା ଅତ୍ଯ଼ଧିକ ଡିଫୋଲିଏସନ୍ ସୃଷ୍ଟି କରେ | ଫଲ୍ ଆର୍ମି କୃମିର ଆକ୍ରମଣକୁ ନିଯ଼ନ୍ତ୍ରଣ କରିବା ପାଇଁ, ଇମାମେକ୍ଟିନ୍ ବେନ୍ଜୋଏଟ୍ 5 ପ୍ରତିଶତ ଏସ୍ଜି @4 ଗ୍ରାମ୍/10ଲିଟ୍ ପାଣି ସ୍ପ୍ରେ କରନ୍ତୁ।",
            "ଏଫିଡ୍ଃ ଏଫିଡ୍ ସଂକ୍ରମଣ କ୍ଷେତ୍ରରେ, ଇମିଡାକ୍ଲୋପ୍ରିଡ୍ @2 ମିଲି/ଲିଟର ପାଣି ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "lady finger": {
         "advisory": [
            "ଫଙ୍ଗିସାଇଡ୍ ଚିକିତ୍ସା କରାଯାଇଥିବା ମଞ୍ଜି କେବଳ ବୁଣନ୍ତୁ।",
            "ଫୁସାରିଯ଼ମ୍ ୱିଲ୍ଟକୁ ପରିଚାଳନା କରିବା ପାଇଁ ମାଙ୍କୋଜେବ୍ କିମ୍ବା ଥିରାମ୍ @3 ଗ୍ରାମ୍/କେଜି ମଞ୍ଜି ଲଗାନ୍ତୁ |",
            "ଓକ୍ରାରେ ସେରକୋସ୍ପୋରା ପତ୍ର ଦାଗକୁ ପରିଚାଳନା କରିବା ପାଇଁ କପର୍ ଅକ୍ସିକ୍ଲୋରାଇଡ୍ @3 ମିଲି/ଲିଟର ସ୍ପ୍ରେ କରନ୍ତୁ।",
            "ଉପଯୁକ୍ତ ଡ୍ରେନେଜ୍ ଚ୍ଯ଼ାନେଲ୍ ମାଧ୍ଯ଼ମରେ ଅତିରିକ୍ତ ଜଳ ଅପସାରଣ କରିବାକୁ ନିଶ୍ଚିତ କରନ୍ତୁ |"
         ]
      },
      "bitter gourd": {
         "advisory": [
            "ହରମୋନ୍ ସିଞ୍ଚନ କରିବା ଦ୍ୱାରା ତରଭୁଜରେ ଫୁଲ ଆସିଥାଏ।",
            "ଗଛ ଗୁଡ଼ିକର ଉନ୍ନତ ବୃଦ୍ଧି ପାଇଁ ଜାଲ ଲଗାନ୍ତୁ କିମ୍ବା ଚାରା ଲଗାନ୍ତୁ।"
         ]
      },
      "brinjal": {
         "advisory": [
            "ପାଣି ଜମାଟ ବାନ୍ଧିବାରୁ ଦୂରେଇ ରୁହନ୍ତୁ, କାରଣ ଏହାଦ୍ୱାରା କ୍ଷଯ଼ ହୋଇଥାଏ।",
            "ନର୍ସରୀ ଚାଷରେ ଭିଜା ପରିଚାଳନା ପାଇଁ ଏଗ୍ରୋସନ୍ କିମ୍ବା ସେରସିନ୍ @2 ଗ୍ରାମ୍/କେଜି ମଞ୍ଜି ସହିତ ବୀଜ ଚିକିତ୍ସା ଆବଶ୍ଯ଼କ |",
            "ବାଇଗଣରେ ଫଳ ଏବଂ ଶୁଟ୍ ବୋରରର ପରିଚାଳନା ପାଇଁ, ବୋରହୋଲ୍ ଦର୍ଶାଇଥିବା ପ୍ରଭାବିତ ଟର୍ମିନାଲ୍ ଅଙ୍କୁରଗୁଡ଼ିକୁ ଅପସାରଣ କରନ୍ତୁ |",
            "ଗୁରୁତର କ୍ଷେତ୍ରରେ, ଇମାମେକ୍ଟିନ୍ ବେନ୍ଜୋଏଟ୍ @4 ଗ୍ରାମ୍/10ଲିଟ୍ ପାଣି ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "cowpea": {
         "advisory": [
            "ଥ୍ରୀପ୍, ପିମ୍ପୁଡ଼ି ଏବଂ ଅନ୍ଯ଼ାନ୍ଯ଼ ଶୋଷକ କୀଟକୁ ପରିଚାଳନା କରିବା ପାଇଁ ଇମିଡାକ୍ଲୋପ୍ରିଡ୍ 17.8% ଏସ୍. ଏଲ୍. @2.5 ମିଲି/ଲିଟର ପାଣି ସ୍ପ୍ରେ କରନ୍ତୁ।",
            "ରୋଗ ଏବଂ କୀଟପତଙ୍ଗ ପାଇଁ ନିଯ଼ମିତ ଭାବରେ କ୍ଷେତ ଉପରେ ନଜର ରଖନ୍ତୁ |",
            "ପତ୍ର ବ୍ଲାଇଟ୍ ରୋଗକୁ ନିଯ଼ନ୍ତ୍ରଣ କରିବା ପାଇଁ କାର୍ବେନଡାଜିମ୍ କିମ୍ବା ମାନକୋଜେବ୍ @3 ଗ୍ରାମ୍/ଲିଟର ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "banana": {
         "advisory": [
            "ଏଫ. ୱାଇ. ଏମ. ଏବଂ ଭର୍ମିକମ୍ପୋଷ୍ଟର ପ୍ରଯ଼ୋଗ ଉଦ୍ଭିଦର ଉନ୍ନତ ଅଭିବୃଦ୍ଧିରେ ସହାଯ଼କ ହେବ।",
            "କ୍ଲୋରୋପାଇରିଫୋସ୍ କିମ୍ବା କାର୍ବୋଫୁରାନ୍ 3ଜି ର ବ୍ଯ଼ବହାର କୀଟପତଙ୍ଗର ପିମ୍ପୁଡ଼ି ଏବଂ ଲାର୍ଭା ମାରିବାରେ ସାହାଯ୍ଯ଼ କରିବ |",
            "କଦଳୀରେ ହଳଦିଆ ସିଗାଟୋକା ରୋଗ ପରିଚାଳନା ପାଇଁ ପତ୍ରରେ ପ୍ରୋପିକୋନାଜୋଲ୍ @0.1% ସ୍ପ୍ରେ କରନ୍ତୁ।",
            "ଫଳ ଆସିଲେ ଗଛଗୁଡ଼ିକୁ ସହାଯ଼ତା ପ୍ରଦାନ କରନ୍ତୁ।",
            "ଗଛ ପାଖରେ ପାଣି ରଖିବା ପାଇଁ ଘଣ୍ଟି ତିଆରି କରନ୍ତୁ।"
         ]
      },
      "guava": {
         "advisory": [
            "ମୂଳ କ୍ଷେତ୍ରରୁ ଘାସ ବାହାର କରନ୍ତୁ, ନଚେତ୍ ଏହା ଗଛର ବୃଦ୍ଧିରେ ବାଧା ସୃଷ୍ଟି କରିପାରେ।",
            "ସାର ପ୍ରଯ଼ୋଗ ମୂଳ ଅଞ୍ଚଳଠାରୁ 20-25 ସେ. ମି. ଦୂରରେ କରାଯାଇପାରିବ।"
         ]
      },
      "papaya": {
         "advisory": [
            "ପାଣି ଜମା ହେବାକୁ ଦିଅନ୍ତୁ ନାହିଁ କାରଣ ଆଳୁ ଗଛ ପାଣି ଜମା ହେବା ପ୍ରତି ଅତ୍ଯ଼ନ୍ତ ସମ୍ବେଦନଶୀଳ।",
            "ମଞ୍ଜି ବୁଣିବା ପରେ ମଞ୍ଜି ବୁଣି ଦିଅନ୍ତୁ।",
            "କୌଣସି ପ୍ରକାରର ଫଙ୍ଗସ୍ ରୋଗରୁ ରକ୍ଷା ପାଇବା ପାଇଁ କାର୍ବେନଡାଜିମ୍ କିମ୍ବା ମାନକୋଜେବ୍ @2 ଗ୍ରାମ୍/ଲିଟର ପାଣି ମୂଳ ଅଞ୍ଚଳ ନିକଟରେ ଭିଜାଇ ଦିଅନ୍ତୁ।"
         ]
      }
   },
   "date": "19-07-2024"
}