{
   "weather_details": {
      "20-07-2024": {
         "rainfall": 10,
         "t_max": 31,
         "t_min": 24,
         "rh_max": 87,
         "rh_min": 46,
         "wind_speed": 10,
         "wind_direction": 63,
         "cloud_cover": 7
      },
      "21-07-2024": {
         "rainfall": 15,
         "t_max": 31,
         "t_min": 24,
         "rh_max": 83,
         "rh_min": 49,
         "wind_speed": 11,
         "wind_direction": 202,
         "cloud_cover": 7
      },
      "22-07-2024": {
         "rainfall": 10,
         "t_max": 32,
         "t_min": 25,
         "rh_max": 81,
         "rh_min": 57,
         "wind_speed": 17,
         "wind_direction": 238,
         "cloud_cover": 7
      },
      "23-07-2024": {
         "rainfall": 5,
         "t_max": 32,
         "t_min": 25,
         "rh_max": 80,
         "rh_min": 63,
         "wind_speed": 22,
         "wind_direction": 248,
         "cloud_cover": 6
      },
      "24-07-2024": {
         "rainfall": 5,
         "t_max": 33,
         "t_min": 26,
         "rh_max": 78,
         "rh_min": 55,
         "wind_speed": 23,
         "wind_direction": 248,
         "cloud_cover": 6
      }
   },
   "names_of_crops": [
      "ଚାଉଳ",
      "ମକା",
      "ପନିପରିବା ଫସଲ",
      "ପଶୁପାଳନ"
   ],
   "general_advisory": "ଆଗାମୀ ଦିନରେ ଗୋଟିଏ କିମ୍ବା ଦୁଇଟି ସ୍ଥାନରେ ପ୍ରବଳ ବର୍ଷା ସହିତ ହାଲୁକା ରୁ ମଧ୍ଯ଼ମ ବର୍ଷା ହେବାର ସମ୍ଭାବନା ଥିବାରୁ କୃଷକମାନଙ୍କୁ ସେହି ସମଯ଼ରେ ଜଳସେଚନ ଏବଂ ସ୍ପ୍ରେ କାର୍ଯ୍ଯ଼ ଏଡ଼ାଇବାକୁ ପରାମର୍ଶ ଦିଆଯାଇଛି ଏବଂ ଧାନ ରୋପଣ ତଥା ଫଳ ଏବଂ ପନିପରିବା ଚାଷ ପାଇଁ କିଛି ଦିନ ଅପେକ୍ଷା କରିବାକୁ ପରାମର୍ଶ ଦିଆଯାଇଛି। ପବନର ଦ୍ରୁତ ବେଗକୁ ଦୃଷ୍ଟିରେ ରଖି, ଫସଲକୁ ସମର୍ଥନ କରିବା ପାଇଁ ବ୍ଯ଼ବସ୍ଥା କରନ୍ତୁ।",
   "crops_data": {
      "rice": {
         "advisory": [
            "ଜୁଲାଇର ଦ୍ୱିତୀଯ଼ ପନ୍ଦର ଦିନ ଶେଷ ସୁଦ୍ଧା ନର୍ସରୀ ବୁଣିବା ଶେଷ ହେବା ଉଚିତ।",
            "କାଣ୍ଡ ଛେଦକ ଏବଂ ପତ୍ର ଫୋଲଡର ସଂକ୍ରମଣ ଉପରେ ନଜର ରଖିବା ପାଇଁ ଏକର ପିଛା 3ଟି ଫେରୋମୋନ୍ ଫାନ୍ଦ ଧାନ ନର୍ସରୀ ରଖନ୍ତୁ।",
            "ଦିନ ବ୍ଯ଼ବଧାନରେ 7-10 ଦୁଇଥର କ୍ଷେତକୁ କାଦୁଅ କରି ଏବଂ ସମାନ ଫସଲ ଷ୍ଟାଣ୍ଡ ପାଇଁ ଜମି ସମତଳ କରି ମୁଖ୍ଯ଼ କ୍ଷେତ୍ର ଜମି ପ୍ରସ୍ତୁତି କରାଯିବା ଉଚିତ।"
         ]
      },
      "maize": {
         "advisory": [
            "ଖରିଫ ମକା ପାଇଁ ଆଦର୍ଶ ବୁଣିବା ସମଯ଼ ହେଉଛି ଜୁନ୍ 20 ରୁ ଜୁଲାଇ ଶେଷ ପର୍ଯ୍ଯ଼ନ୍ତ |",
            "ଖରିଫ ଋତୁ ଫସଲରେ, ଫସଲକୁ ଜଳମଗ୍ନରୁ ରକ୍ଷା କରିବା ପାଇଁ ଉଠାଯାଇଥିବା ଶଯ୍ଯ଼ା ରୋପଣ କରିବା ସର୍ବଦା ବାଞ୍ଛନୀଯ଼।",
            "ଆଗାମୀ ବର୍ଷାର ପୂର୍ବାନୁମାନକୁ ଦୃଷ୍ଟିରେ ରଖି, ମକା କ୍ଷେତରେ ଯେକୌଣସି ପ୍ରକାରର ସିଞ୍ଚନ ତଥା ଆନ୍ତଃସାଂସ୍କୃତିକ କାର୍ଯ୍ଯ଼ କରିବା ପାଇଁ କୃଷକମାନେ କିଛି ଦିନ ଅପେକ୍ଷା କରିବା ଉଚିତ।"
         ]
      },
      "vegetable crops": {
         "advisory": [
            "କୃଷକମାନେ ଖରିଫ ପନିପରିବା ଫସଲ ପାଇଁ ଉପଯୁକ୍ତ ଜଳ ନିଷ୍କାସନ ବ୍ଯ଼ବସ୍ଥା ସହିତ ଉଠାଯାଇଥିବା ଶଯ୍ଯ଼ା ନର୍ସରୀ ପ୍ରସ୍ତୁତି ଆରମ୍ଭ କରିବା ଉଚିତ।",
            "ଆଗାମୀ ବର୍ଷାର ସ୍ଥିତିକୁ ଦୃଷ୍ଟିରେ ରଖି, କୃଷକମାନେ ସେହି ସମଯ଼ରେ ରୋପଣ ଏବଂ କୌଣସି ଆନ୍ତଃସାଂସ୍କୃତିକ କାର୍ଯ୍ଯ଼କଳାପରୁ ଦୂରେଇ ରହିବା ଉଚିତ ଏବଂ କ୍ଷେତରୁ ଅତିରିକ୍ତ ଜଳ ନିଷ୍କାସନ କରିବାର ବ୍ଯ଼ବସ୍ଥା କରିବା ଉଚିତ।"
         ]
      },
      "animal husbandry": {
         "advisory": [
            "କେତେକ ସଂକ୍ରାମକ ରୋଗ ବିରୁଦ୍ଧରେ ପଶୁମାନଙ୍କର କୃମି ଦୂରୀକରଣ ଏବଂ ଟୀକାକରଣ ସୁନିଶ୍ଚିତ କରାଯିବା ଉଚିତ।",
            "ପଶୁମାନଙ୍କୁ ସେଡର ସୁରକ୍ଷିତ ସ୍ଥାନରେ ରଖିବା ଉଚିତ ଏବଂ ଚେତାବନୀ ସମଯ଼ରେ ଖୋଲା ସ୍ଥାନରେ ଚରାଇବାକୁ ଅନୁମତି ଦିଆଯିବ ନାହିଁ।"
         ]
      }
   },
   "date": "19-07-2024"
}