{
   "weather_details": {
      "2024-07-20": {
         "rainfall": 40,
         "t_max": 29,
         "t_min": 24,
         "rh_max": 91,
         "rh_min": 73,
         "wind_speed": 4,
         "wind_direction": 242,
         "cloud_cover": 8
      },
      "2024-07-21": {
         "rainfall": 20,
         "t_max": 30,
         "t_min": 24,
         "rh_max": 92,
         "rh_min": 72,
         "wind_speed": 6,
         "wind_direction": 244,
         "cloud_cover": 8
      },
      "2024-07-22": {
         "rainfall": 10,
         "t_max": 31,
         "t_min": 25,
         "rh_max": 92,
         "rh_min": 78,
         "wind_speed": 9,
         "wind_direction": 249,
         "cloud_cover": 7
      },
      "2024-07-23": {
         "rainfall": 5,
         "t_max": 32,
         "t_min": 25,
         "rh_max": 87,
         "rh_min": 69,
         "wind_speed": 14,
         "wind_direction": 249,
         "cloud_cover": 7
      },
      "2024-07-24": {
         "rainfall": 5,
         "t_max": 33,
         "t_min": 25,
         "rh_max": 87,
         "rh_min": 64,
         "wind_speed": 14,
         "wind_direction": 248,
         "cloud_cover": 6
      }
   },
   "names_of_crops": [
      "ଚାଉଳ",
      "ଉଦ୍ଯ଼ାନ କୃଷି",
      "ସାଧାରଣ ମାଛ",
      "କୁକୁଡ଼ା ମାଂସ"
   ],
   "general_advisory": "ଅନ୍ତିମ ମୁଖ୍ଯ଼ କ୍ଷେତ ପ୍ରସ୍ତୁତି ସମଯ଼ରେ ପ୍ରତିରୋପଣ କରାଯାଇଥିବା ଚାଉଳରେ, 0.8 ଟନ୍/ଏକର ଭଲ ଭାବେ କ୍ଷଯ଼ ହୋଇଥିବା ଏଫ୍. ଆଇ. ଏମ୍. ଲଗାନ୍ତୁ। ଅଧିକ ଉତ୍ପାଦନକ୍ଷମ କିସମ ପାଇଁ 44 କିଲୋଗ୍ରାମ ଡିଏପି + 33 କିଲୋଗ୍ରାମ ଏମଓପି କିମ୍ବା 22 କିଲୋଗ୍ରାମ ଯ଼ୁରିଆ + 125 କିଲୋଗ୍ରାମ ଏସ୍. ଏସ୍. ପି. + 33 କିଲୋଗ୍ରାମ ଏମଓ. ପି. ଶେଷ ପୁଡଲିଂ ସମଯ଼ରେ ବେସାଲ୍ ମାତ୍ରା ଭାବରେ ପ୍ରଯ଼ୋଗ କରନ୍ତୁ, ବୁଟାକ୍ଲୋର 1 କିଲୋଗ୍ରାମ/ହେକ୍ଟର ପରି ପ୍ରି-ଇମର୍ଜେନ୍ସ୍ ୱେଡିସାଇଡ୍ ପ୍ରଯ଼ୋଗ କରନ୍ତୁ | ବର୍ଷାର ପୂର୍ବାନୁମାନକୁ ଧ୍ଯ଼ାନରେ ରଖି କୃଷକମାନଙ୍କୁ କୌଣସି ପ୍ରକାରର ସ୍ପ୍ରେ ନକରିବାକୁ ଏବଂ ଫସଲ ଏବଂ ପନିପରିବା ନର୍ସରୀରେ ଉପଯୁକ୍ତ ପରିଚାଳନା କରିବାକୁ ପରାମର୍ଶ ଦିଆଯାଇଛି। ଆଗାମୀ ପାଞ୍ଚ ଦିନ ମଧ୍ଯ଼ରେ ଜିଲ୍ଲାରେ ହାଲୁକା ରୁ ମଧ୍ଯ଼ମ ବର୍ଷା ହେବାକୁ ଯାଉଛି, ପରିପକ୍ୱ ପନିପରିବା ଅମଳ ଏବଂ ବିକ୍ରଯ଼ ପାଇଁ ବ୍ଯ଼ବସ୍ଥା କରନ୍ତୁ କାରଣ ଗୁଣବତ୍ତା ପ୍ରଭାବିତ ହୋଇପାରେ | କଦଳୀ କ୍ଷେତରେ ଜଳ ନିଷ୍କାସନ ପାଇଁ ବ୍ଯ଼ବସ୍ଥା କରନ୍ତୁ, ଯାହାଦ୍ୱାରା ରାଇଜୋମ କ୍ଷଯ଼ ହେବ ନାହିଁ।",
   "crops_data": {
      "rice": {
         "advisory": [
            "ଗତ ମାସରେ ଜିଲ୍ଲାରେ ସ୍ୱାଭାବିକ ବର୍ଷା ହୋଇଥିଲା। ସିଧାସଳଖ ବିହନ ବୁଣାଯାଇଥିବା ଧାନ 3ରୁ 4 ସପ୍ତାହ ପର୍ଯ୍ଯ଼ାଯ଼ରେ ରହିଛି, ଆଗାମୀ ପାଞ୍ଚ ଦିନ ମଧ୍ଯ଼ରେ ଜିଲ୍ଲାରେ ହାଲୁକା ରୁ ମଧ୍ଯ଼ମ ବର୍ଷା ହେବାକୁ ଯାଉଛି। ବେଉଶାନିଙ୍ଗ ପାଇଁ ଯାଆନ୍ତୁ କାରଣ ପର୍ଯ୍ଯ଼ାପ୍ତ ସ୍ଥାଯ଼ୀ ଜଳ (7-10 ସେ. ମି.) ଉପଲବ୍ଧ ହେବ। ଟପ୍ ଡ୍ରେସିଂ ଭାବେ ଏକର ପିଛା 36 କିଲୋଗ୍ରାମ ଯ଼ୁରିଆର ଟପ୍ ଡ୍ରେସିଂ କରନ୍ତୁ।"
         ]
      },
      "horticulture": {
         "advisory": [
            "ପେଯ଼ାରା ଫଳ ସଡ଼ିବା ଦ୍ୱାରା ସଂକ୍ରମିତ ହେବାର ସମ୍ଭାବନା ରହିଛି। ବର୍ଷା କିମ୍ବା ଜଳସେଚନ ଜଳ ଗଛର ଅବବାହିକା ନିକଟରେ ଛିଡ଼ା ହେବାକୁ ଦେବା ଉଚିତ ନୁହେଁ। ସଂକ୍ରମିତ ଗଛର ଅଂଶକୁ କାଟି ଦିଅନ୍ତୁ ଏବଂ ବ୍ଲିଟାକ୍ସ 3 ଗ୍ରାମ/1 ଲିଟର ପାଣି ସ୍ପ୍ରେ କରନ୍ତୁ, ଫଳ ସେଟ୍ ହେବାର 20 ଦିନ ପରେ ଏହାକୁ ପୁନରାବୃତ୍ତି କରନ୍ତୁ ଏବଂ ପରିପକ୍ୱତା ପର୍ଯ୍ଯ଼ନ୍ତ ଜାରି ରଖନ୍ତୁ | ସଡି ଯାଇଥିବା ଏବଂ ମମି କରାଯାଇଥିବା ପେଯ଼ାରା ସଂଗ୍ରହ କରି ପୋତିଦେବା ଆବଶ୍ଯ଼କ। (ପାଣିପାଗ ସ୍ୱଚ୍ଛ ଥିବାବେଳେ ଆବେଦନ ପାଇଁ ଯାଆନ୍ତୁ)"
         ]
      },
      "common fish": {
         "advisory": [
            "ପୋଖରୀରେ ଫିଙ୍ଗରଲିଂ ଯୋଗ କରିବା ପୂର୍ବରୁ ଆଗାଛାକୁ କାଟିବା ଏବଂ ସମସ୍ତ ଶିକାରୀ ମାଛକୁ ମାରିବା ନିଶ୍ଚିତ କରନ୍ତୁ | ଫିଙ୍ଗରଲିଙ୍ଗ ଯୋଗ କରିବାର 7-8 ଦିନ ପୂର୍ବରୁ, 1 ଏକର ପୋଖରୀରେ 120-140 k. g ବ୍ଲିଚିଂ ପାଉଡର ମିଶାନ୍ତୁ।"
         ]
      },
      "poultry": {
         "advisory": [
            "ବର୍ଷା ଋତୁରେ ଚିକେନ୍ କୋକ୍ସିଡିଓସିସ୍ ଅନୁଭବ କରିପାରେ, ନିକଟତମ ପଶୁ ଚିକିତ୍ସା ବିଶେଷଜ୍ଞଙ୍କ ସୁପାରିଶ ସହିତ ଚିକେନ୍ ଫିଡରେ କୋକ୍ସିଡିଓଷ୍ଟାଟ ଦିଅନ୍ତୁ |"
         ]
      }
   },
   "date": "19-07-2024"
}