{
   "weather_details": {
      "20-07-2024": {
         "rainfall": 10,
         "t_max": 31,
         "t_min": 24,
         "rh_max": 87,
         "rh_min": 46,
         "wind_speed": 10,
         "wind_direction": 63,
         "cloud_cover": 7
      },
      "21-07-2024": {
         "rainfall": 15,
         "t_max": 31,
         "t_min": 24,
         "rh_max": 83,
         "rh_min": 49,
         "wind_speed": 11,
         "wind_direction": 202,
         "cloud_cover": 7
      },
      "22-07-2024": {
         "rainfall": 10,
         "t_max": 32,
         "t_min": 25,
         "rh_max": 81,
         "rh_min": 57,
         "wind_speed": 17,
         "wind_direction": 238,
         "cloud_cover": 7
      },
      "23-07-2024": {
         "rainfall": 5,
         "t_max": 32,
         "t_min": 25,
         "rh_max": 80,
         "rh_min": 63,
         "wind_speed": 22,
         "wind_direction": 248,
         "cloud_cover": 6
      },
      "24-07-2024": {
         "rainfall": 5,
         "t_max": 33,
         "t_min": 26,
         "rh_max": 78,
         "rh_min": 55,
         "wind_speed": 23,
         "wind_direction": 248,
         "cloud_cover": 6
      }
   },
   "names_of_crops": [
      "ଚାଉଳ",
      "ମକା",
      "ପନିପରିବା ଫସଲ",
      "ପଶୁପାଳନ"
   ],
   "general_advisory": "ଆଗାମୀ ଦିନରେ ଗୋଟିଏ କିମ୍ବା ଦୁଇଟି ସ୍ଥାନରେ ପ୍ରବଳ ବର୍ଷା ସହିତ ହାଲୁକା ରୁ ମଧ୍ଯ଼ମ ବର୍ଷା ହେବାର ସମ୍ଭାବନା ଥିବାରୁ କୃଷକମାନଙ୍କୁ ସେହି ସମଯ଼ରେ ଜଳସେଚନ ତଥା ସିଞ୍ଚନ କାର୍ଯ୍ଯ଼ ଏଡ଼ାଇବାକୁ ପରାମର୍ଶ ଦିଆଯାଇଛି ଏବଂ ଧାନ ରୋପଣ ତଥା ଫଳ ଓ ପନିପରିବା ଚାଷ ପାଇଁ କିଛି ଦିନ ଅପେକ୍ଷା କରିବାକୁ ପରାମର୍ଶ ଦିଆଯାଇଛି। ଉଚ୍ଚ ପବନର ବେଗକୁ ଦେଖି ଫସଲକୁ ସମର୍ଥନ କରିବା ପାଇଁ ବ୍ଯ଼ବସ୍ଥା କରନ୍ତୁ।",
   "crops_data": {
      "rice": {
         "advisory": [
            "ଜୁଲାଇର ଦ୍ୱିତୀଯ଼ ପନ୍ଦର ଦିନ ଶେଷ ସୁଦ୍ଧା ନର୍ସରୀ ବୁଣିବା ଶେଷ ହେବା ଉଚିତ।",
            "ଦିନ ବ୍ଯ଼ବଧାନରେ 7-10 ଦୁଇଥର କ୍ଷେତକୁ କାଦୁଅ କରି ଏବଂ ସମାନ ଫସଲ ଷ୍ଟାଣ୍ଡ ପାଇଁ ଜମି ସମତଳ କରି ମୁଖ୍ଯ଼ କ୍ଷେତ୍ର ଜମି ପ୍ରସ୍ତୁତି କରାଯିବା ଉଚିତ।"
         ]
      },
      "maize": {
         "advisory": [
            "ଖରିଫ ମକା ପାଇଁ ଆଦର୍ଶ ବୁଣିବା ସମଯ଼ ହେଉଛି ଜୁନ୍ 20 ରୁ ଜୁଲାଇ ଶେଷ ପର୍ଯ୍ଯ଼ନ୍ତ |",
            "ଏକର ପିଛା ପାଖାପାଖି 8 କିଲୋଗ୍ରାମ ମଞ୍ଜି ବ୍ଯ଼ବହାର କରାଯିବା ଉଚିତ। ମଞ୍ଜି ବୁଣିବା ପୂର୍ବରୁ, ମଞ୍ଜି ଏବଂ ମୃତ୍ତିକା ବାହିତ ରୋଗ ଏବଂ କେତେକ କୀଟ-କୀଟରୁ ରକ୍ଷା ପାଇବା ପାଇଁ ମଞ୍ଜି ବୁଣିବା ପୂର୍ବରୁ ଫଙ୍ଗିସାଇଡ ଏବଂ କୀଟନାଶକ ଦ୍ୱାରା ଚିକିତ୍ସା କରାଯିବା ଉଚିତ।"
         ]
      },
      "vegetable crops": {
         "advisory": [
            "ଖରିଫ ପନିପରିବା ଫସଲ ପାଇଁ କୃଷକମାନେ ଉପଯୁକ୍ତ ଜଳ ନିଷ୍କାସନ ବ୍ଯ଼ବସ୍ଥା ସହିତ ଉଠାଯାଇଥିବା ଶଯ୍ଯ଼ା ନର୍ସରୀ ପ୍ରସ୍ତୁତି ଆରମ୍ଭ କରିବା ଉଚିତ।"
         ]
      },
      "animal husbandry": {
         "advisory": [
            "କେତେକ ସଂକ୍ରାମକ ରୋଗ ବିରୁଦ୍ଧରେ ପଶୁମାନଙ୍କର କୃମି ଦୂରୀକରଣ ଏବଂ ଟୀକାକରଣ ସୁନିଶ୍ଚିତ କରାଯିବା ଉଚିତ କାରଣ ବର୍ଷା ଋତୁରେ ତାପମାତ୍ରା ହ୍ରାସ ଏବଂ ଆର୍ଦ୍ରତା ବୃଦ୍ଧି ସହିତ ମଶା, ମାଛି ଏବଂ ବିଭିନ୍ନ ଅଣୁଜୀବର ସଂଖ୍ଯ଼ାରେ ବୃଦ୍ଧି ଘଟିଥାଏ।"
         ]
      }
   },
   "date": "19-07-2024"
}