{
   "weather_details": {
      "20/07/2024": {
         "rainfall": 20,
         "t_max": 32,
         "t_min": 27,
         "rh_max": 84,
         "rh_min": 70,
         "wind_speed": 13,
         "wind_direction": 152,
         "cloud_cover": 8
      },
      "21/07/2024": {
         "rainfall": 15,
         "t_max": 33,
         "t_min": 26,
         "rh_max": 84,
         "rh_min": 69,
         "wind_speed": 17,
         "wind_direction": 180,
         "cloud_cover": 8
      },
      "22/07/2024": {
         "rainfall": 10,
         "t_max": 34,
         "t_min": 27,
         "rh_max": 81,
         "rh_min": 73,
         "wind_speed": 23,
         "wind_direction": 225,
         "cloud_cover": 7
      },
      "23/07/2024": {
         "rainfall": 5,
         "t_max": 34,
         "t_min": 28,
         "rh_max": 77,
         "rh_min": 71,
         "wind_speed": 28,
         "wind_direction": 248,
         "cloud_cover": 6
      },
      "24/07/2024": {
         "rainfall": 5,
         "t_max": 33,
         "t_min": 28,
         "rh_max": 76,
         "rh_min": 65,
         "wind_speed": 30,
         "wind_direction": 246,
         "cloud_cover": 6
      }
   },
   "names_of_crops": [
      "ଧାନ।",
      "ଆଖୁ",
      "କଳା ଚଣା",
      "ବାଇଗଣ",
      "ପେଁପେ",
      "ନଡ଼ିଆ"
   ],
   "general_advisory": "ନିମ୍ନ ଭୂମିରେ, ମୁଖ୍ଯ଼ କ୍ଷେତରେ 21 ଦିନ ପାଇଁ ଧାନ ଚାରା ରୋପଣ କରନ୍ତୁ। ଠିକ୍ ସମଯ଼ରେ ପାଣି ନିଷ୍କାସନ ଏବଂ ରୋପଣ ପାଇଁ ମୁଖ୍ଯ଼ ଧାନ କ୍ଷେତରେ ବର୍ଷା ଜଳକୁ ବନ୍ଧ କରି ରଖନ୍ତୁ। ବର୍ତ୍ତମାନ ଯେଉଁଠାରେ ପର୍ଯ୍ଯ଼ାପ୍ତ ବର୍ଷା ହୋଇଥିଲା, ସେଠାରେ ବିଉଶନିଂ କରାଯାଇପାରିବ। ପ୍ରବଳ ବର୍ଷା ହେଉଥିବା ଅଞ୍ଚଳରେ, କିଛି ସମଯ଼ ପାଇଁ ମଞ୍ଜି ବୁଣିବା ଏବଂ ସାର କିମ୍ବା ତୃଣନାଶକ ପଦାର୍ଥ ଉପରେ ଲଗାଇବା ବନ୍ଦ କରନ୍ତୁ। ଜୁଲାଇର ଦ୍ୱିତୀଯ଼ ପନ୍ଦର ଦିନ ଶେଷ ସୁଦ୍ଧା ନର୍ସରୀ ବୁଣିବା ଶେଷ ହେବା ଉଚିତ। ଯଦି ଧାନ ନର୍ସରୀରେ ଥ୍ରୀପ୍ସର ସଂକ୍ରମଣ ଦେଖାଯାଏ, ତେବେ ଏନ୍. ଏସ୍. କେ. ଇ. (ଆଜାଦିରାକ୍ଟିନ) @ଏକର ପିଛା 800 ମିଲି କିମ୍ବା ଲାମ୍ବଡା-ସାଇଯ଼ାଲୋଥ୍ରିନ 5 ପ୍ରତିଶତ ଇ. ସି. @ଏକର ପିଛା 100 ମିଲି କିମ୍ବା ଥିଯ଼ାମେଥୋକ୍ସାମ 25 ପ୍ରତିଶତ ଡବ୍ଲୁ. ଜି. @ଏକର ପିଛା 40 ଗ୍ରାମ୍ ସ୍ପ୍ରେ କରନ୍ତୁ। ଯଦି ଚାରା ରୋଗ ଦେଖାଯାଏ, ତେବେ ପ୍ରୋପିକୋନାଜୋଲ୍ @1 ମିଲି/ଲିଟର ପାଣି ଲଗାନ୍ତୁ। ଯେଉଁଠାରେ ମକା କିମ୍ବା ଡାଲି ଇତ୍ଯ଼ାଦି ରୋପଣ କରାଯାଇଛି, ସେଠାରେ ଜଳ ନିଷ୍କାସନ ବ୍ଯ଼ବସ୍ଥା କରନ୍ତୁ। ପ୍ରବଳ ବର୍ଷାରୁ ରକ୍ଷା ପାଇବା ପାଇଁ ପନିପରିବା ନର୍ସରୀକୁ ପଲିଥିନ୍ ଦ୍ୱାରା ଢାଙ୍କି ଦିଅନ୍ତୁ ଏବଂ ଜଳ ନିଷ୍କାସନ ବ୍ଯ଼ବସ୍ଥା କରନ୍ତୁ।",
   "crops_data": {
      "paddy": {
         "advisory": [
            "ଶେଷ ପୁଡଲିଂ ସମଯ଼ରେ ଏକର ପିଛା 35 କିଲୋଗ୍ରାମ ଡିଏପି, 27 କିଲୋଗ୍ରାମ ପୋଟାଶ ଏବଂ 8 କିଲୋଗ୍ରାମ ଯ଼ୁରିଆ ଲଗାନ୍ତୁ।",
            "ବାଲୁକାମଯ଼ ମୃତ୍ତିକା ପାଇଁ ଏକର ପିଛା 35 କିଲୋଗ୍ରାମ ଡିଏପି, 15 କିଲୋଗ୍ରାମ ପୋଟାଶ ଏବଂ 8 କିଲୋଗ୍ରାମ ଯ଼ୁରିଆ ଲଗାନ୍ତୁ।",
            "20x15 ସେ. ମି. ବ୍ଯ଼ବଧାନରେ <ଆଇ. ଡି. 1> ଦିନ ପୁରୁଣା ଚାରା ରୋପଣ କରାଯିବା ଉଚିତ, ଅଧିକ ଉତ୍ପାଦନକ୍ଷମ ପ୍ରଜାତି ପାଇଁ ପ୍ରତି ପାହାଡ଼ରେ 2ରୁ 3 ଚାରା ଲଗାଇବା ଉଚିତ।"
         ]
      },
      "sugarcane": {
         "advisory": [
            "ଆଖୁ ଫସଲରେ ମିଳି ବଗ୍ ପରିଚାଳନା କରିବା ପାଇଁ ଇମିଡାକ୍ଲୋପ୍ରିଡ୍ <ଆଇ. ଡି. 1> ଏସ୍. ଏଲ୍. @60-ମିଲି/ଏକର କିମ୍ବା ଥିଯ଼ାମେଥୋକ୍ସାମ୍ 25% ଡବ୍ଲୁ. ଜି. @40-ଗ୍ରାମ୍/ଏକର କିମ୍ବା ପ୍ରୋଫେନୋଫସ୍ 50% ଇ. ସି. @400-ମିଲି/ଏକରକୁ 200 ଲିଟର ପାଣିରେ ମିଶାଇ ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "black gram": {
         "advisory": [
            "କଳା ଚଣା ଏବଂ ସବୁଜ ଚଣା ପାଇଁ ବିହନ ହାର ଏକର ପିଛା 10 କିଲୋଗ୍ରାମ ରଖନ୍ତୁ |",
            "ବୁଣିବା ପୂର୍ବରୁ ମଞ୍ଜି ଚିକିତ୍ସା କରନ୍ତୁ। ବୁଣିବା ପୂର୍ବରୁ ଏକ ସପ୍ତାହ ପୂର୍ବରୁ ମଞ୍ଜିଗୁଡ଼ିକୁ କାର୍ବେନଡାଜିମ୍ 50 ପ୍ରତିଶତ ଡବ୍ଲ୍ଯ଼ୁ. ପି. @2-ଗ୍ରାମ୍/କେଜି ମଞ୍ଜି କିମ୍ବା କାର୍ବୋକ୍ସିନ୍ <ଆଇ. ଡି. 1> + ଥିରମ୍ <ଆଇ. ଡି. 1> ଡି. ଏସ୍. @3-ଗ୍ରାମ୍/କେ. ଜି. ମଞ୍ଜି ଦେଇ ଚିକିତ୍ସା କରନ୍ତୁ।"
         ]
      },
      "brinjal": {
         "advisory": [
            "ଯେଉଁ କୃଷକମାନେ ପୂର୍ବରୁ ମୁଖ୍ଯ଼ କ୍ଷେତରେ ବାଇଗଣ ରୋପଣ କରିସାରିଛନ୍ତି, ସେମାନେ ଏକର ପିଛା 30 କିଲୋଗ୍ରାମ ଯ଼ୁରିଆ ଏବଂ 20 କିଲୋଗ୍ରାମ ଏମଓପି ଲଗାଇବା ଉଚିତ।",
            "ଅବଶିଷ୍ଟ 30-କିଲୋଗ୍ରାମ ଯ଼ୁରିଆ 45 ଡିଏଟି ରେ ଶେଷ ଟପ୍ ଡ୍ରେସିଙ୍ଗ୍ ସାର ଭାବରେ ପ୍ରଯ଼ୋଗ କରାଯିବା ଉଚିତ୍ |"
         ]
      },
      "papaya": {
         "advisory": [
            "ଏବେ ପାଗ ପିଆଜର ରୋପଣ ପାଇଁ ଅନୁକୂଳ ଅଟେ।",
            "ପେଁପେ ପାଇଁ ଏଚୱାଇଭି ହେଉଛି ହନିଡିଉ, କୁର୍ଗ ମହୁ ଶିଶିର, ସିଓ-1, ସିଓ-2, ପୁସା ସୁସ୍ୱାଦୁ, ପୁସା ମହିମା, ଏବଂ ପୁସା ଜଏଣ୍ଟ |"
         ]
      },
      "coconut": {
         "advisory": [
            "ରୁଗୋଜ୍ ସର୍ପିଲିଂ ହ୍ୱାଇଟ୍ଫ୍ଲାଇକୁ ନିଯ଼ନ୍ତ୍ରଣ କରିବା ପାଇଁ, ସଂକ୍ରମିତ ଗଛର ପତ୍ରରେ ଭାରୀ ସୁଟି ଛାଞ୍ଚ ଜମା ହଟାଇବା ପାଇଁ ସ୍ଟାର୍ଚ ଦ୍ରବଣ @100-ଗ୍ରାମ୍/10-ଲିଟର ପାଣି ସ୍ପ୍ରେ କରନ୍ତୁ |",
            "ବଯ଼ସ୍କ ଧଳା ମାଛିମାନଙ୍କୁ ଧରିବା ପାଇଁ ହଳଦିଆ ଚଟପଟା ଜାଲ ବ୍ଯ଼ବହାର କରନ୍ତୁ।",
            "କୀଟ ସଂକ୍ରମଣର ପ୍ରାଥମିକ ପର୍ଯ୍ଯ଼ାଯ଼ରେ, ନିମ ଆଧାରିତ କୀଟନାଶକ (ଆଜାଦିରାକ୍ଟିନ) 1500 ପିପିଏମ @30 ମିଲି/10 ଲିଟର ପାଣି ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      }
   },
   "date": "19-07-2024"
}