{
   "weather_details": {
      "20-11-2024": {
         "rainfall": 0,
         "t_max": 28,
         "t_min": 12,
         "rh_max": 71,
         "rh_min": 31,
         "wind_speed": 2,
         "wind_direction": 154,
         "cloud_cover": 0
      },
      "21-11-2024": {
         "rainfall": 0,
         "t_max": 28,
         "t_min": 11,
         "rh_max": 71,
         "rh_min": 30,
         "wind_speed": 2,
         "wind_direction": 154,
         "cloud_cover": 0
      },
      "22-11-2024": {
         "rainfall": 0,
         "t_max": 28,
         "t_min": 11,
         "rh_max": 69,
         "rh_min": 30,
         "wind_speed": 2,
         "wind_direction": 154,
         "cloud_cover": 0
      },
      "23-11-2024": {
         "rainfall": 0,
         "t_max": 28,
         "t_min": 11,
         "rh_max": 68,
         "rh_min": 29,
         "wind_speed": 3,
         "wind_direction": 157,
         "cloud_cover": 0
      },
      "24-11-2024": {
         "rainfall": 0,
         "t_max": 27,
         "t_min": 11,
         "rh_max": 66,
         "rh_min": 29,
         "wind_speed": 2,
         "wind_direction": 149,
         "cloud_cover": 1
      }
   },
   "names_of_crops": [
      "ଧାନ।",
      "କପା",
      "ଗ୍ରୀନଗ୍ରାମ",
      "କଳା ଗ୍ରାମ",
      "ଚିନାବାଦାମ",
      "ସୋରିଷ",
      "ତୋରିଆ",
      "ସୂର୍ଯ୍ୟମୁଖୀ",
      "ଫୁଲକୋବି",
      "କଦଳୀ",
      "ବ୍ରୋକୋଲି",
      "ରସୁଣ",
      "ଟମାଟୋ",
      "ଗୋଲାପ।",
      "ମାରିଗୋଲ୍ଡ",
      "ଗୋରୁ।",
      "ମଇଁଷି।",
      "ଛେଳି।",
      "ମେଣ୍ଢା",
      "କୁକୁଡ଼ା ମାଂସ",
      "ଡକରି।"
   ],
   "general_advisory": "ଆଇଏମଡିର ପାଞ୍ଚ ଦିନିଆ ପାଣିପାଗ ପୂର୍ବାନୁମାନ ଆଧାରରେ, କୃଷକମାନଙ୍କୁ ଆବଶ୍ଯ଼କ କୃଷି କାର୍ଯ୍ଯ଼କଳାପ ଜାରି ରଖିବାକୁ ପରାମର୍ଶ ଦିଆଯାଇଛି, ଯେଉଁଥିରେ ଆଗାଛା କାଟିବା, ସାର ପ୍ରଯ଼ୋଗ, ଜଳସେଚନ, ଅମଳ ଏବଂ କୀଟନାଶକ ପ୍ରଯ଼ୋଗ ଅନ୍ତର୍ଭୁକ୍ତ | କ୍ଷେତରେ ଉପଲବ୍ଧ ମୃତ୍ତିକା ଆର୍ଦ୍ରତାକୁ ଉପଯୋଗ କରିବା ପାଇଁ ମଧ୍ଯ଼ମ କିମ୍ବା ଅଗଭୀର ନିମ୍ନ ଜମିରେ ସବୁଜ ଚଣା, କଳା ଚଣା, ତୋରିଆ, ଚଣା, ଡାଲି, ସୂର୍ଯ୍ଯ଼ମୁଖୀ, ଚିନାବାଦାମ, କାଉପି, ଫିଲ୍ଡ ମଟର ଇତ୍ଯ଼ାଦି ରବି ଫସଲ ବୁଣିବା ଆରମ୍ଭ କରନ୍ତୁ। ଡାଲି, କଳା ଚଣା, ସବୁଜ ଚଣା ଭଳି ଡାଲି ଗୁଡ଼ିକୁ ଅମଳ କରିବାର କିଛି ଦିନ ପୂର୍ବରୁ ସ୍ଥାଯ଼ୀ ପରିପକ୍ୱ ଫସଲ (ଧାନ) 7-10 ରେ ଯୋଡ଼ା ଫସଲ ଭାବେ ପ୍ରସାରଣ କରାଯାଇପାରିବ, ଅବଶିଷ୍ଟ mois.Crop (ପର୍ଯ୍ଯ଼ାଯ଼) ପରାମର୍ଶଦାତା କ୍ଷେତ୍ର ଫସଲ ଧାନ (ପରିପକ୍ୱତା ପର୍ଯ୍ଯ଼ନ୍ତ ଶସ୍ଯ଼ ପୂରଣ/125-145 ଦିନ)-ଶୀଘ୍ର ପରିପକ୍ୱ ହେଉଥିବା କିସମଗୁଡ଼ିକରେ, ଯେତେବେଳେ ଶସ୍ଯ଼ର 80-85% ହାତ ଦ୍ୱାରା କିମ୍ବା କମ୍ବାଇନ୍ ହାରଭେଷ୍ଟର୍ କିମ୍ବା ରିପ୍ପର୍ ବ୍ଯ଼ବହାର କରି ପରିପକ୍ୱ ହୋଇଥାଏ, ସେତେବେଳେ ଫସଲ ଅମଳ କରନ୍ତୁ। ବ୍ଯ଼ବହାର ଉଦ୍ଦେଶ୍ଯ଼ରେ ଧାନ ଶସ୍ଯ଼କୁ 14 ପ୍ରତିଶତ ଆର୍ଦ୍ରତା ପର୍ଯ୍ଯ଼ନ୍ତ ସୂର୍ଯ୍ଯ଼ାଲୋକରେ ଶୁଖାଇବା ଆବଶ୍ଯ଼କ ଏବଂ ଉନ୍ନତ ସ୍ୱଯ଼ଂ-ଜୀବନ ପାଇଁ ବୀଜ ଉଦ୍ଦେଶ୍ଯ଼ରେ ଏହାକୁ 12 ପ୍ରତିଶତ ଆର୍ଦ୍ରତା ପର୍ଯ୍ଯ଼ନ୍ତ ଶୁଖାଇବା ଆବଶ୍ଯ଼କ। ଫସଲ ଅମଳ କରିବାର 15 ଦିନ ପୂର୍ବରୁ ଧାନ କ୍ଷେତରୁ ପାଣି ବାହାର କରନ୍ତୁ। ଅମଳ ହୋଇଥିବା ଧାନକୁ ସୁପର ଗ୍ରେନ୍ ବ୍ଯ଼ାଗ୍ରେ ଗଚ୍ଛିତ ରଖନ୍ତୁ, ଯାହାଦ୍ୱାରା ସାମଗ୍ରୀର ଗୁଣବତ୍ତା, ରଙ୍ଗ, ସୁଗନ୍ଧ, ସୁଗନ୍ଧ ଏବଂ ସ୍ୱାଦ ଦୀର୍ଘ ସମଯ଼ ପର୍ଯ୍ଯ଼ନ୍ତ ସୁରକ୍ଷିତ ସ୍ଥାନରେ (ଉପଯୁକ୍ତ ଆଚ୍ଛାଦନ ସହିତ ସଠିକ୍ ଭାବରେ ଷ୍ଟ୍ଯ଼ାକ୍ ହୋଇଛି) କ୍ଷତି ଏଡ଼ାଇବା ପାଇଁ | କୀଟ ପରିଚାଳନାଃ ଅଧିକ ସୂଚନା ପାଇଁ, ଆଇଏମଡି, ଭୁବନେଶ୍ୱର ସହିତ ଯୋଗାଯୋଗ କରନ୍ତୁ, Tel.#0674-2596116-ନେକ ବ୍ଲାସ୍ଟଃ ବର୍ତ୍ତମାନର ପାଣିପାଗ ସ୍ଥିତି, ଅର୍ଥାତ୍, ନିମ୍ନ ରାତ୍ରିକାଲୀନ ତାପମାତ୍ରା, ଉଚ୍ଚ ଆର୍ଦ୍ରତା ସହିତ ମିଶି, ନେକ୍ ବ୍ଲାସ୍ଟ୍ ରୋଗର ବିକାଶ ପାଇଁ ଅନୁକୂଳ ପରିସ୍ଥିତି ସୃଷ୍ଟି କରିଥାଏ। ଯଦି ନେକ୍ ବ୍ଲାଷ୍ଟ ରୋଗର ସଂକ୍ରମଣ ଦେଖାଯାଏ, ତେବେ ଟ୍ରାଇକୋଡର୍ମା ଭାଇରିଡ୍ ପରି ବାଯ଼ୋକଣ୍ଟ୍ରୋଲ ଏଜେଣ୍ଟ 1 ପ୍ରତିଶତ ଡବ୍ଲ୍ଯ଼ୁ. ପି. (ସର୍ବନିମ୍ନ 106 ସି. ଏଫ୍. ଯ଼ୁ.) @2 କେଜି/ଏକର ସହିତ 200 ଲିଟର ପାଣି ମିଶାଇ ଲଗାନ୍ତୁ। ରାସାଯ଼ନିକ ଉପାଯ଼ରେ ଟେବୁକୋନାଜୋଲ୍ 50 ପ୍ରତିଶତ + ଟ୍ରାଇଫ୍ଲୋକ୍ସିସ୍ଟ୍ରୋବିନ୍ 25 ପ୍ରତିଶତ ଡବ୍ଲୁ. ଜି. @80 ଗ୍ରାମ/ଏକର କିମ୍ବା କାର୍ବେନଡାଜିମ୍ 50 ପ୍ରତିଶତ ଡବ୍ଲ୍ଯ଼ୁ. ପି. @400 ଗ୍ରାମ/ଏକର ସହିତ 200 ଲିଟର ପାଣି ମିଶାଇ ସ୍ପ୍ରେ କରନ୍ତୁ।",
   "crops_data": {
      "paddy": {
         "advisory": [
            "ଶୀଘ୍ର ପରିପକ୍ୱ ହେଉଥିବା କିସମଗୁଡ଼ିକରେ, ଫସଲ ଅମଳ କରନ୍ତୁ ଯେତେବେଳେ 80 -85% ଶସ୍ଯ଼ ହାତ ଦ୍ୱାରା ହାତୁଡ଼ି ଦ୍ୱାରା କିମ୍ବା କମ୍ବାଇନ୍ ହାରଭେଷ୍ଟର କିମ୍ବା ରିପ୍ପର୍ ବ୍ଯ଼ବହାର କରି ପରିପକ୍ୱ ହୁଏ | ଧାନ ଶସ୍ଯ଼କୁ ଉପଭୋଗ ଉଦ୍ଦେଶ୍ଯ଼ରେ 14 ପ୍ରତିଶତ ଆର୍ଦ୍ରତା ପର୍ଯ୍ଯ଼ନ୍ତ ସୂର୍ଯ୍ଯ଼ାଲୋକରେ ଶୁଖାଇବା ଆବଶ୍ଯ଼କ ଏବଂ ଉନ୍ନତ ସ୍ୱଯ଼ଂ-ଜୀବନ ପାଇଁ ବୀଜ ଉଦ୍ଦେଶ୍ଯ଼ରେ ଏହାକୁ 12 ପ୍ରତିଶତ ଆର୍ଦ୍ରତା ପର୍ଯ୍ଯ଼ନ୍ତ ଶୁଖାଇବା ଆବଶ୍ଯ଼କ। ଫସଲ ଅମଳ କରିବାର 15 ଦିନ ପୂର୍ବରୁ ଧାନ କ୍ଷେତରୁ ପାଣି ବାହାର କରନ୍ତୁ। ଅମଳ ହୋଇଥିବା ଧାନକୁ ସୁପର ଗ୍ରେନ୍ ବ୍ଯ଼ାଗ୍ରେ ଗଚ୍ଛିତ ରଖନ୍ତୁ, ଯାହାଦ୍ୱାରା ସାମଗ୍ରୀର ଗୁଣବତ୍ତା, ରଙ୍ଗ, ସୁଗନ୍ଧ, ସୁଗନ୍ଧ ଏବଂ ସ୍ୱାଦ ଦୀର୍ଘ ସମଯ଼ ପର୍ଯ୍ଯ଼ନ୍ତ ସୁରକ୍ଷିତ ସ୍ଥାନରେ (ଉପଯୁକ୍ତ ଆଚ୍ଛାଦନ ସହିତ ସଠିକ୍ ଭାବରେ ଷ୍ଟ୍ଯ଼ାକ୍ ହୋଇଛି) କ୍ଷତି ଏଡ଼ାଇବା ପାଇଁ |",
            "କୀଟ ପରିଚାଳନାଃ ଅଧିକ ସୂଚନା ପାଇଁ, ଆଇଏମଡି, ଭୁବନେଶ୍ୱର, Tel.#0674-2596116 ସହିତ ଯୋଗାଯୋଗ କରନ୍ତୁ।",
            "ନେକ୍ ବ୍ଲାସ୍ଟ୍ଃ ବର୍ତ୍ତମାନର ପାଣିପାଗ ସ୍ଥିତି ଅର୍ଥାତ୍, ନିମ୍ନ ରାତି ତାପମାତ୍ରା ସହିତ ଉଚ୍ଚ ଆର୍ଦ୍ରତା ନେକ୍ ବ୍ଲାସ୍ଟ୍ ରୋଗର ବିକାଶ ପାଇଁ ଅନୁକୂଳ ପରିସ୍ଥିତି ସୃଷ୍ଟି କରେ | ଯଦି ନେକ୍ ବ୍ଲାଷ୍ଟ ରୋଗର ସଂକ୍ରମଣ ଦେଖାଯାଏ, ତେବେ ଟ୍ରାଇକୋଡର୍ମା ଭାଇରିଡ୍ ପରି ବାଯ଼ୋକଣ୍ଟ୍ରୋଲ ଏଜେଣ୍ଟ 1 ପ୍ରତିଶତ ଡବ୍ଲ୍ଯ଼ୁ. ପି. (ସର୍ବନିମ୍ନ 106 ସି. ଏଫ୍. ଯ଼ୁ.) @2 କେଜି/ଏକର ସହିତ 200 ଲିଟର ପାଣି ମିଶାଇ ଲଗାନ୍ତୁ। ରାସାଯ଼ନିକ ଉପାଯ଼ରେ ଟେବୁକୋନାଜୋଲ୍ 50 ପ୍ରତିଶତ + ଟ୍ରାଇଫ୍ଲୋକ୍ସିସ୍ଟ୍ରୋବିନ୍ 25 ପ୍ରତିଶତ ଡବ୍ଲୁ. ଜି. @80-ଗ୍ରାମ୍/ଏକର କିମ୍ବା କାର୍ବେନଡାଜିମ୍ 50 ପ୍ରତିଶତ ଡବ୍ଲ୍ଯ଼ୁ. ପି. @400 ଗ୍ରାମ୍/ଏକର ସହିତ 200 ଲିଟର ପାଣି ମିଶାଇ ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "cotton": {
         "advisory": [
            "ଯେତେବେଳେ ବୋଲ୍ ଗୁଡ଼ିକ ସମ୍ପୂର୍ଣ୍ଣ ଭାବେ ଫୁଟିଯାଏ, ସେତେବେଳେ ଉଠାଇବା ଉଚିତ।",
            "ଆର୍ଦ୍ରତାକୁ 8-10% କୁ ହ୍ରାସ କରିବା ପାଇଁ ଏକ କଂକ୍ରିଟ୍ ଚଟାଣ କିମ୍ବା ତିରପାଲ ଶୀଟ୍ ଉପରେ ବୀଜ କପା ଶୁଖାଇ ଦିଅନ୍ତୁ | ଭଲ ମୂଲ୍ଯ଼ ପାଇବା ପାଇଁ ପ୍ରଥମ ଉଠାଣରୁ ମିଳିଥିବା ବିହନ କପଡ଼ାକୁ ଅଲଗା ଭାବେ ରଖନ୍ତୁ।",
            "ଉତ୍ତମ ଉଦ୍ଭିଦ ବୃଦ୍ଧି ଏବଂ ଶୁଣ୍ଢର ବିକାଶ ପାଇଁ ଏନ. ପି. କେ.-<ଆଇ. ଡି. 1> ପରି ତରଳ ସାରର ପତ୍ର ସ୍ପ୍ରେ 20 ଗ୍ରାମ୍/10 ଲିଟର ପାଣିରେ କରାଯିବା ଉଚିତ।",
            "କୌଣସି ନୂତନ କୀଟପତଙ୍ଗ ଏବଂ ରୋଗର ପ୍ରକୋପ ବିଷଯ଼ରେ ଜାଣିବା ପାଇଁ ଫସଲର ନିଯ଼ମିତ ତଦାରଖ।"
         ]
      },
      "greengram": {
         "advisory": [
            "ସବୁଜ ଚଣା ଏବଂ କଳା ଚଣା ବୁଣିବା ପାଇଁ ଉପଯୁକ୍ତ ସମଯ଼। ବୁଣିବା ପୂର୍ବରୁ ମଞ୍ଜି ଗୁଡ଼ିକୁ ଥିରମ୍ 50 ଡବ୍ଲ୍ଯ଼ୁ. ପି. କିମ୍ବା କାର୍ବେଣ୍ଡାଜିମ୍ 50 ଡବ୍ଲ୍ଯ଼ୁ. ପି. @2 ଗ୍ରାମ୍/କେଜି ମଞ୍ଜି ଦେଇ ଉପଚାର କରନ୍ତୁ।",
            "ବିହନ ଦରଃ 8-10 କିଲୋଗ୍ରାମ/ଏକର",
            "ଉପଯୁକ୍ତ କିସମଃ ସବୁଜ ଚଣା-ଆଇ. ପି. ଏମ୍. <ଆଇ. ଡି. 1>, ବିରାଟ, ଶିଖା, ଏମ୍. ଏଚ୍. 1142, କେ-851, ପି. ଡି. ଏମ୍. 11, ପି. ଡି. ଏମ୍.-14, ଓ. ଯ଼ୁ. ଏମ୍.-115 ଇତ୍ଯ଼ାଦି। ଚଣା-ପି. ଯ଼ୁ.-10, ପି. ଯ଼ୁ.-11, ପି. ଯ଼ୁ.-19, ପି. ଯ଼ୁ.-30, ପି. ଯ଼ୁ.-31, ଟି. 9 ଇତ୍ଯ଼ାଦି।"
         ]
      },
      "blackgram": {
         "advisory": [
            "ସବୁଜ ଚଣା ଏବଂ କଳା ଚଣା ବୁଣିବା ପାଇଁ ଉପଯୁକ୍ତ ସମଯ଼। ବୁଣିବା ପୂର୍ବରୁ ମଞ୍ଜି ଗୁଡ଼ିକୁ ଥିରମ୍ 50 ଡବ୍ଲ୍ଯ଼ୁ. ପି. କିମ୍ବା କାର୍ବେଣ୍ଡାଜିମ୍ 50 ଡବ୍ଲ୍ଯ଼ୁ. ପି. @2 ଗ୍ରାମ୍/କେଜି ମଞ୍ଜି ଦେଇ ଉପଚାର କରନ୍ତୁ।",
            "ବିହନ ଦରଃ 8-10 କିଲୋଗ୍ରାମ/ଏକର",
            "ଉପଯୁକ୍ତ କିସମଃ ସବୁଜ ଚଣା-ଆଇ. ପି. ଏମ୍. <ଆଇ. ଡି. 1>, ବିରାଟ, ଶିଖା, ଏମ୍. ଏଚ୍. 1142, କେ-851, ପି. ଡି. ଏମ୍. 11, ପି. ଡି. ଏମ୍.-14, ଓ. ଯ଼ୁ. ଏମ୍.-115 ଇତ୍ଯ଼ାଦି। ଚଣା-ପି. ଯ଼ୁ.-10, ପି. ଯ଼ୁ.-11, ପି. ଯ଼ୁ.-19, ପି. ଯ଼ୁ.-30, ପି. ଯ଼ୁ.-31, ଟି. 9 ଇତ୍ଯ଼ାଦି।"
         ]
      },
      "groundnut": {
         "advisory": [
            "ରବି ଚିନାବାଦାମ ବୁଣିବା ପାଇଁ ଉପଯୁକ୍ତ ସମୟ। ବୀଜକୁ ବୁଣିବା ପୂର୍ବରୁ କାର୍ବେନଡାଜିମ୍ 25 ପ୍ରତିଶତ + ମାନକୋଜେବ୍ 50 ପ୍ରତିଶତ ଡବ୍ଲୁଏସ୍ @3-3.5 ଗ୍ରାମ୍/କେଜି ମଞ୍ଜି ସହିତ ଏବଂ ବୁଣିବା ସମୟରେ 25 କେଜି ମଞ୍ଜି ପିଛା 500 ଗ୍ରାମ୍ କିମ୍ବା 250 ମିଲିଲିଟର ରାଇଜୋବିୟମ୍ କଲ୍ଚର ସହିତ ଚିକିତ୍ସା କରନ୍ତୁ। ମଧ୍ୟାହ୍ନ ସମୟରେ ମଞ୍ଜି ବୁଣିବା ଉଚିତ।",
            "ଉପଯୁକ୍ତ କିସମଃ ଦେବୀ (ଆଇ. ସି. ଜି. ଭି.-91114), କାଦ୍ରି-6, କାଦ୍ରି-9, ଟି. ଏ. ଜି.-51, ଟି. ଏମ୍. ଭି.-2, ସ୍ମୃତି (ଓ. ଜି. <ଆଇ. ଡି. 1>), ସି. ଓ.-7, ଧରଣୀ ଇତ୍ଯ଼ାଦି।",
            "ବିହନ ଦରଃ ଏକର ପିଛା 40-50 କିଲୋଗ୍ରାମ ଚିନାବାଦାମ ମଞ୍ଜି।",
            "ପୋଷକ ତତ୍ତ୍ୱ ପରିଚାଳନାଃ ବୁଣିବା ପୂର୍ବରୁ ଏକର ପିଛା 40 କିଲୋଗ୍ରାମ ଡିଏପି, 25 କିଲୋଗ୍ରାମ ଏମଓପି ଏବଂ 12 କିଲୋଗ୍ରାମ ସଲଫର୍ ଲଗାନ୍ତୁ।"
         ]
      },
      "mustard": {
         "advisory": [
            "ନିଡ ମ୍ଯ଼ାନେଜମେଣ୍ଟଃ 1-2 ଡିଏଏସରେ 3 ମିଲି/ଲିଟର ଜଳ କିମ୍ବା କୁଇଜାଲୋଫପ-ଇଥାଇଲ 5 ପ୍ରତିଶତ ଇସିରେ 2 ମିଲି/ଲିଟର ଜଳ 15-20 ଡିଏଏସରେ ଆବିର୍ଭାବ ପରେ ଅକ୍ସାଡିଆର୍ଜିଲ 6 ପ୍ରତିଶତ ଇସି ଲଗାନ୍ତୁ।"
         ]
      },
      "toria": {
         "advisory": [
            "ନିଡ ମ୍ଯ଼ାନେଜମେଣ୍ଟଃ 1-2 ଡିଏଏସରେ 3 ମିଲି/ଲିଟର ଜଳ କିମ୍ବା କୁଇଜାଲୋଫପ-ଇଥାଇଲ 5 ପ୍ରତିଶତ ଇସିରେ 2 ମିଲି/ଲିଟର ଜଳ 15-20 ଡିଏଏସରେ ଆବିର୍ଭାବ ପରେ ଅକ୍ସାଡିଆର୍ଜିଲ 6 ପ୍ରତିଶତ ଇସି ଲଗାନ୍ତୁ।"
         ]
      },
      "sunflower": {
         "advisory": [
            "ନିଡ୍ ମ୍ୟାନେଜମେଣ୍ଟଃ ପ୍ରାକ୍-ଆବିର୍ଭାବ ହର୍ବିସାଇଡ୍ ଭାବରେ 200 ଲିଟର ପାଣି ସହିତ ମିଶ୍ରଣ କରି ଏକର ପିଛା 1.25 ଲିଟରରେ 30 ପ୍ରତିଶତ ଇ. ସି. ପେଣ୍ଡିମିଥାଲିନ୍ ସ୍ପ୍ରେ କରନ୍ତୁ। ଜଳସେଚନ ପୂର୍ବରୁ ଡି. ଏ. ଏସ୍. <ଆଇ. ଡି. 1> ରେ ବିଦ୍ୟୁତ ଅପତୃଣ, ଅପତୃଣ ପରିଚାଳନା କରିବାରେ ଏକ ଗୁରୁତ୍ୱପୂର୍ଣ୍ଣ ଭୂମିକା ଗ୍ରହଣ କରିଥାଏ।"
         ]
      },
      "cauliflower": {
         "advisory": [
            "30-45 ଦିନର ପୁରୁଣା ଚାରା ଗୁଡ଼ିକୁ ମୁଖ୍ଯ଼ କ୍ଷେତରେ 45-60 ସେ. ମି. ର ଧାଡ଼ି ଠାରୁ ଧାଡ଼ି ବ୍ଯ଼ବଧାନ ସହିତ ରୋପଣ କରନ୍ତୁ ଏବଂ 30-45 ସେ. ମି. ର ଚାରା ବ୍ଯ଼ବଧାନ ସହିତ ରୋପଣ କରନ୍ତୁ।",
            "ରୋପଣ ପୂର୍ବରୁ, ଚାରା ଉପରେ କାର୍ବେନଡାଜିମ୍ 12 ପ୍ରତିଶତ + ମାନକୋଜେବ୍ 63 ପ୍ରତିଶତ ଡବ୍ଲ୍ଯ଼ୁ. ପି. ଲଗାନ୍ତୁ, ଏବଂ ଅପରାହ୍ନରେ ପ୍ରତିରୋପଣ କରନ୍ତୁ।",
            "ପୋଷକ ତତ୍ତ୍ୱ ପରିଚାଳନାଃ ପ୍ରତିରୋପଣ ସମଯ଼ରେ 26 କିଲୋଗ୍ରାମ ଡିଏପି, 10 କିଲୋଗ୍ରାମ ଏମଓପି, 15 କିଲୋଗ୍ରାମ ଯ଼ୁରିଆ ଏବଂ 5 କିଲୋଗ୍ରାମ ବୋରାକ୍ସକୁ ଆଧାର ଭାବେ ପ୍ରଯ଼ୋଗ କରନ୍ତୁ।"
         ]
      },
      "cabbage": {
         "advisory": [
            "30-45 ଦିନର ପୁରୁଣା ଚାରା ଗୁଡ଼ିକୁ ମୁଖ୍ଯ଼ କ୍ଷେତରେ 45-60 ସେ. ମି. ର ଧାଡ଼ି ଠାରୁ ଧାଡ଼ି ବ୍ଯ଼ବଧାନ ସହିତ ରୋପଣ କରନ୍ତୁ ଏବଂ 30-45 ସେ. ମି. ର ଚାରା ବ୍ଯ଼ବଧାନ ସହିତ ରୋପଣ କରନ୍ତୁ।"
         ]
      },
      "broccoli": {
         "advisory": [
            "30-45 ଦିନର ପୁରୁଣା ଚାରା ଗୁଡ଼ିକୁ ମୁଖ୍ଯ଼ କ୍ଷେତରେ 45-60 ସେ. ମି. ର ଧାଡ଼ି ଠାରୁ ଧାଡ଼ି ବ୍ଯ଼ବଧାନ ସହିତ ରୋପଣ କରନ୍ତୁ ଏବଂ 30-45 ସେ. ମି. ର ଚାରା ବ୍ଯ଼ବଧାନ ସହିତ ରୋପଣ କରନ୍ତୁ।"
         ]
      },
      "onion": {
         "advisory": [
            "ଏବେ ହେଉଛି ଆଳୁ ବୁଣିବା ପାଇଁ ଉପଯୁକ୍ତ ସମଯ଼।",
            "ଉପଯୁକ୍ତ ବିବିଧତାଃ ଭୀମ ରାଜ, ଭୀମ ଗାଢ଼ ଲାଲ, ଭୀମ ଶ୍ୱେତା, ଭୀମ ସୁଭ୍ରା, ଭୀମ ସଫେଦ୍, ଆଗ୍ରିଫାଉଣ୍ଡ୍ ଗାଢ଼ ଲାଲ, ଭୀମ ଶକ୍ତି, ଭୀମ ସୁପର, ଅର୍କ ନିକେତନ୍ ଇତ୍ଯ଼ାଦି ଶୀତ ଋତୁ ପାଇଁ ଉପଯୁକ୍ତ ଚାଷ।",
            "ବିହନ ଦରଃ ଏକର ପିଛା 4 କିଲୋଗ୍ରାମ"
         ]
      },
      "tomato": {
         "advisory": [
            "75-90 ସେ. ମି. ର ଧାଡ଼ି ଠାରୁ ଧାଡ଼ି ବ୍ଯ଼ବଧାନ ସହିତ ମୁଖ୍ଯ଼ କ୍ଷେତରେ 30-35 ଦିନର ପୁରୁଣା ଚାରା ରୋପଣ କରନ୍ତୁ ଏବଂ 45-60 ସେ. ମି. ର ଚାରା ବ୍ଯ଼ବଧାନ ସହିତ ରୋପଣ କରନ୍ତୁ।",
            "ରୋପଣ ପୂର୍ବରୁ, ବାଭିଷ୍ଟିନ୍ @1.5 ଗ୍ରାମ ଏବଂ ପ୍ଲାଣ୍ଟୋମାଇସିନ୍ @1 ଗ୍ରାମ୍ର ଦ୍ରବଣକୁ 1 ଲିଟର ପାଣିରେ ମିଶାଇ 10 ରୁ 15 ମିନିଟ୍ ପର୍ଯ୍ଯ଼ନ୍ତ ଚାରା ରୋପଣ କରନ୍ତୁ, ଏବଂ ଅପରାହ୍ନରେ ପ୍ରତିରୋପଣ କରନ୍ତୁ।",
            "ପୋଷକ ତତ୍ତ୍ୱ ପରିଚାଳନାଃ ଏକର ପିଛା 66 କିଲୋଗ୍ରାମ ଡିଏପି, 33 କିଲୋଗ୍ରାମ ଏମଓପି ଏବଂ 80 କିଲୋଗ୍ରାମ ୟୁରିଆ ପ୍ରୟୋଗ କରନ୍ତୁ। ୟୁରିଆର ଏକ ତୃତୀୟାଂଶ + ସମ୍ପୂର୍ଣ୍ଣ ଡିଏପି + ଏକ ତୃତୀୟାଂଶ ଏମଓପିକୁ ଆଧାର ଭାବେ ପ୍ରୟୋଗ କରନ୍ତୁ।"
         ]
      },
      "rose": {
         "advisory": [
            "ପ୍ରଚଳିତ ପାଣିପାଗ ସ୍ଥିତି ପାଉଡର ଫଙ୍ଗୁର ସଂକ୍ରମଣ ପାଇଁ ଅନୁକୂଳ | ଏହାକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ କାର୍ବେନଡାଜିମ୍ ଉପରେ 50 ପ୍ରତିଶତ ଡବ୍ଲ୍ୟୁ. ପି. @<ଆଇ. ଡି. 1> ପାଣି ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "marigold": {
         "advisory": [
            "ପିଞ୍ଚିଂ 30-45 DAT ରେ କିମ୍ବା କଳ ଗଠନ ପୂର୍ବରୁ ଶାଖାକୁ ଉତ୍ସାହିତ କରିବା ସହିତ ସାମଗ୍ରିକ ଉତ୍ପାଦନ ବୃଦ୍ଧି କରିବା ପାଇଁ କରାଯିବା ଉଚିତ |"
         ]
      },
      "cattle": {
         "advisory": [
            "ନିଯ଼ମିତ ବ୍ଯ଼ବଧାନରେ ଗୋରୁ ଏବଂ ମଇଁଷିକୁ କୃମି ମୁକ୍ତ କରନ୍ତୁ ଏବଂ ସେମାନଙ୍କୁ ଟୀକାକରଣ ମଧ୍ଯ଼ କରନ୍ତୁ। ଯଦି 4 ବର୍ଷ ପରେ ମଧ୍ଯ଼ ପଶୁଟି ଗରମ ହେଉନାହିଁ, ତେବେ ପଶୁ ଚିକିତ୍ସକଙ୍କ ସହ ପରାମର୍ଶ କରନ୍ତୁ ଏବଂ ଯୌବନ ଆରମ୍ଭ ପାଇଁ ଡାକ୍ତରଙ୍କ ପରାମର୍ଶ ଅନୁସରଣ କରନ୍ତୁ।"
         ]
      },
      "buffalo": {
         "advisory": [
            "ନିଯ଼ମିତ ବ୍ଯ଼ବଧାନରେ ଗୋରୁ ଏବଂ ମଇଁଷିକୁ କୃମି ମୁକ୍ତ କରନ୍ତୁ ଏବଂ ସେମାନଙ୍କୁ ଟୀକାକରଣ ମଧ୍ଯ଼ କରନ୍ତୁ। ଯଦି 4 ବର୍ଷ ପରେ ମଧ୍ଯ଼ ପଶୁଟି ଗରମ ହେଉନାହିଁ, ତେବେ ପଶୁ ଚିକିତ୍ସକଙ୍କ ସହ ପରାମର୍ଶ କରନ୍ତୁ ଏବଂ ଯୌବନ ଆରମ୍ଭ ପାଇଁ ଡାକ୍ତରଙ୍କ ପରାମର୍ଶ ଅନୁସରଣ କରନ୍ତୁ।"
         ]
      },
      "goat": {
         "advisory": [
            "ଶୀତ ଋତୁ ଆରମ୍ଭ ହେବା ପୂର୍ବରୁ ଛେଳି ଘର ମରାମତି କରିବାକୁ କୃଷକମାନଙ୍କୁ ପରାମର୍ଶ ଦିଆଯାଇଛି। କାରଣ ଥଣ୍ଡା ପାଗ ଯୋଗୁଁ ପିଲାମାନଙ୍କ ମଧ୍ଯ଼ରେ ମୃତ୍ଯ଼ୁ ହେବାର ଅଧିକ ସମ୍ଭାବନା ରହିଛି।"
         ]
      },
      "sheep": {
         "advisory": [
            "ଶୀତ ଋତୁ ଆରମ୍ଭ ହେବା ପୂର୍ବରୁ ଛେଳି ଘର ମରାମତି କରିବାକୁ କୃଷକମାନଙ୍କୁ ପରାମର୍ଶ ଦିଆଯାଇଛି। କାରଣ ଥଣ୍ଡା ପାଗ ଯୋଗୁଁ ପିଲାମାନଙ୍କ ମଧ୍ଯ଼ରେ ମୃତ୍ଯ଼ୁ ହେବାର ଅଧିକ ସମ୍ଭାବନା ରହିଛି।"
         ]
      },
      "poultry": {
         "advisory": [
            "ଶୀତ ଋତୁରେ ଥଣ୍ଡା ପାଗ ଯୋଗୁଁ ମୃତ୍ୟୁ ଏଡ଼ାଇବା ପାଇଁ କୃଷକମାନେ ଛୁଆ ଏବଂ ବତକ ପିଲାମାନଙ୍କର ପ୍ରଜନନ ପରିଚାଳନାର ଯତ୍ନ ନେବା ଆବଶ୍ୟକ |"
         ]
      },
      "duckery": {
         "advisory": [
            "ଶୀତ ଋତୁରେ ଥଣ୍ଡା ପାଗ ଯୋଗୁଁ ମୃତ୍ୟୁ ଏଡ଼ାଇବା ପାଇଁ କୃଷକମାନେ ଛୁଆ ଏବଂ ବତକ ପିଲାମାନଙ୍କର ପ୍ରଜନନ ପରିଚାଳନାର ଯତ୍ନ ନେବା ଆବଶ୍ୟକ |"
         ]
      }
   },
   "date": "19-11-2024"
}