{
   "weather_details": {
      "20-11-2024": {
         "rainfall": 0,
         "t_max": 27,
         "t_min": 12,
         "rh_max": 72,
         "rh_min": 32,
         "wind_speed": 2,
         "wind_direction": 51,
         "cloud_cover": 0
      },
      "21-11-2024": {
         "rainfall": 0,
         "t_max": 27,
         "t_min": 12,
         "rh_max": 71,
         "rh_min": 31,
         "wind_speed": 2,
         "wind_direction": 45,
         "cloud_cover": 0
      },
      "22-11-2024": {
         "rainfall": 0,
         "t_max": 27,
         "t_min": 12,
         "rh_max": 71,
         "rh_min": 31,
         "wind_speed": 1,
         "wind_direction": 0,
         "cloud_cover": 1
      },
      "23-11-2024": {
         "rainfall": 0,
         "t_max": 27,
         "t_min": 12,
         "rh_max": 70,
         "rh_min": 29,
         "wind_speed": 2,
         "wind_direction": 76,
         "cloud_cover": 0
      },
      "24-11-2024": {
         "rainfall": 0,
         "t_max": 27,
         "t_min": 12,
         "rh_max": 70,
         "rh_min": 30,
         "wind_speed": 3,
         "wind_direction": 60,
         "cloud_cover": 1
      }
   },
   "names_of_crops": [
      "ଚାଉଳ",
      "ଡାଲିଗୁଡ଼ିକ",
      "କଳା ଚଣା",
      "ସବୁଜ ଚଣା",
      "ରବି ଚିନାବାଦାମ",
      "ସୋରିଷ",
      "ବିନ୍ସ",
      "ବାଇଗଣ",
      "ଲଙ୍କା"
   ],
   "general_advisory": "ଆଗାମୀ ପାଞ୍ଚ ଦିନ ମଧ୍ଯ଼ରେ ବର୍ଷା ଏବଂ ଶୁଖିଲା ପାଗ ହେବାର ସମ୍ଭାବନା ନାହିଁ। ଶୀତକାଳୀନ ପନିପରିବା ଫସଲ ପାଇଁ ସମ୍ପୂର୍ଣ୍ଣ ନର୍ସରୀ ବୁଣିବା। କମ୍ ଜମିରେ ଧାନ ଅମଳ କରିବାର ପନ୍ଦର ଦିନ ପୂର୍ବରୁ ମଟର, ଚଣା ଏବଂ ସବୁଜ ଚଣା ଯୋଡ଼ି ଫସଲ ଭାବରେ ବୁଣିବା ପାଇଁ ଯାଆନ୍ତୁ।",
   "crops_data": {
      "rice": {
         "advisory": [
            "ଶସ୍ଯ଼ ଭରିବା ପର୍ଯ୍ଯ଼ନ୍ତ କ୍ଷେତରେ ପାଣି ରଖନ୍ତୁ।",
            "କ୍ଲୋରାଣ୍ଟ୍ରାନିଲିପ୍ରୋଲ୍ କିମ୍ବା କାର୍ଟ୍ରାପ୍ ହାଇଡ୍ରୋକ୍ଲୋରାଇଡ୍ ସିଞ୍ଚନ ଦ୍ୱାରା ଷ୍ଟେମ ବୋରର୍ ସଂକ୍ରମଣକୁ ନିଯ଼ନ୍ତ୍ରଣ କରନ୍ତୁ |",
            "ଇଥୋଫେନୋପ୍ରୋକ୍ସ ସିଞ୍ଚନ କରି ଗୁଣ୍ଡି ବଗ୍କୁ ନିଯ଼ନ୍ତ୍ରଣ କରନ୍ତୁ।",
            "ଧାନ ଅମଳ କରନ୍ତୁ ଯେତେବେଳେ 80-85% ପାନିକଲରେ ଥିବା ଶସ୍ଯ଼ ପରିପକ୍ୱ ହୋଇଯାଏ।"
         ]
      },
      "pulses": {
         "advisory": [
            "ଉଚ୍ଚଭୂମିରେ କଳା ଗହମ ଏବଂ ସବୁଜ ଗହମର ସମ୍ପୂର୍ଣ୍ଣ ବୁଣିବା।",
            "ଉଚ୍ଚ ଉତ୍ପାଦନକାରୀ କିସମ ବ୍ୟବହାର କରନ୍ତୁ ଏବଂ ରାଇଜୋବିୟମ୍ ସଂସ୍କୃତି ସହିତ ମଞ୍ଜି ଚିକିତ୍ସା କରନ୍ତୁ |",
            "ଅନ୍ତିମ ଜମି ପ୍ରସ୍ତୁତି ସମଯ଼ରେ ଏକର ପିଛା ଯ଼ୁରିଆ, ଡିଏପି ଏବଂ ଏମଓପି ଲଗାନ୍ତୁ।"
         ]
      },
      "black gram": {
         "advisory": [
            "ଟି-9, ପି. ଯ଼ୁ. 11, ପି. ଯ଼ୁ. 19 ଭଳି ଅଧିକ ଉତ୍ପାଦନକ୍ଷମ କିସମ ବ୍ଯ଼ବହାର କରନ୍ତୁ।"
         ]
      },
      "green gram": {
         "advisory": [
            "କେ 851, ପି. ଡି. ଏମ୍. 11, ପି. ଡି. ଏମ୍. 54, ଓ. ୟୁ. ଏମ୍. 115 ଭଳି ଅଧିକ ଉତ୍ପାଦନକ୍ଷମ କିସମ ବ୍ୟବହାର କରନ୍ତୁ।",
            "ବୁଣିବା ପୂର୍ବରୁ ମଞ୍ଜିଗୁଡ଼ିକୁ ରାଇଜୋବିୟମ୍ ସଂସ୍କୃତି ସହିତ ଚିକିତ୍ସା କରନ୍ତୁ।"
         ]
      },
      "rabi groundnut": {
         "advisory": [
            "ଜମି ପ୍ରସ୍ତୁତ କରିବା ଏବଂ ସୁପାରିଶ କରାଯାଇଥିବା ବିହନ ଦର ସହିତ ନିର୍ଦ୍ଦିଷ୍ଟ ବ୍ଯ଼ବଧାନରେ ରବି ଚିନାବାଦାମ ବୁଣିବା ପାଇଁ ଯାଆନ୍ତୁ।",
            "ବିହନ ଉପଚାର ସହିତ ଏକର ପିଛା ଡିଏପି, ଯ଼ୁରିଆ, ଏମଓପି, ଜିଙ୍କ୍ ସଲଫେଟ୍ ଏବଂ ବୋରାକ୍ସ ଲଗାନ୍ତୁ।"
         ]
      },
      "mustard": {
         "advisory": [
            "ସର୍ବୋତ୍ତମ ଉତ୍ପାଦନ ପାଇବା ପାଇଁ ଜମି ପ୍ରସ୍ତୁତି ଏବଂ ବୁଣିବା ଆରମ୍ଭ କରନ୍ତୁ।",
            "କୀଟପତଙ୍ଗ ନିଯ଼ନ୍ତ୍ରଣ ପାଇଁ ଉପଯୁକ୍ତ କିସମର ବ୍ଯ଼ବହାର କରନ୍ତୁ ଏବଂ ନିମ୍ବ ତେଲ ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "beans": {
         "advisory": [
            "ନିର୍ଦ୍ଦିଷ୍ଟ ବୀଜ ହାର ସହିତ ଉଚ୍ଚ ଉତ୍ପାଦନକାରୀ କିସମ ବୁଣନ୍ତୁ ଏବଂ ସୁପାରିସ କରାଯାଇଥିବା ସାର ପ୍ରୟୋଗ କରନ୍ତୁ।",
            "ନିର୍ଦ୍ଦିଷ୍ଟ ବ୍ୟବଧାନ ବ୍ୟବହାର କରନ୍ତୁ ଏବଂ ସେହି ଅନୁଯାୟୀ ମଞ୍ଜି ବୁଣନ୍ତୁ।"
         ]
      },
      "brinjal": {
         "advisory": [
            "ନିର୍ଦ୍ଦିଷ୍ଟ ପର୍ଯ୍ଯ଼ାଯ଼ରେ ଏକର ପିଛା ଯ଼ୁରିଆ ଏବଂ ଏମଓପି ପ୍ରଯ଼ୋଗ କରନ୍ତୁ।",
            "ଅଧିକ ଉତ୍ପାଦନ ପାଇବା ପାଇଁ ମାଇକ୍ରୋ ନ୍ଯ଼ୁଟ୍ରିଏଣ୍ଟ ମିଶ୍ରଣ ସ୍ପ୍ରେ କରନ୍ତୁ ଏବଂ ସୁଟ୍ ବୋରରକୁ ନିଯ଼ନ୍ତ୍ରଣ କରନ୍ତୁ।"
         ]
      },
      "chilli": {
         "advisory": [
            "ଲଙ୍କାରେ ଥ୍ରୀପ୍ ନିଯ଼ନ୍ତ୍ରଣ କରିବା ପାଇଁ ସୁପାରିସ କରାଯାଇଥିବା କୀଟନାଶକ ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      }
   },
   "date": "19-11-2024"
}