{
   "weather_details": {
      "20-11-2024": {
         "rainfall": 0,
         "t_max": 29,
         "t_min": 16,
         "rh_max": 71,
         "rh_min": 30,
         "wind_speed": 2,
         "wind_direction": 198,
         "cloud_cover": 2
      },
      "21-11-2024": {
         "rainfall": 0,
         "t_max": 28,
         "t_min": 16,
         "rh_max": 70,
         "rh_min": 30,
         "wind_speed": 2,
         "wind_direction": 202,
         "cloud_cover": 1
      },
      "22-11-2024": {
         "rainfall": 0,
         "t_max": 28,
         "t_min": 16,
         "rh_max": 70,
         "rh_min": 29,
         "wind_speed": 2,
         "wind_direction": 189,
         "cloud_cover": 1
      },
      "23-11-2024": {
         "rainfall": 0,
         "t_max": 28,
         "t_min": 15,
         "rh_max": 70,
         "rh_min": 28,
         "wind_speed": 2,
         "wind_direction": 189,
         "cloud_cover": 2
      },
      "24-11-2024": {
         "rainfall": 0,
         "t_max": 28,
         "t_min": 15,
         "rh_max": 64,
         "rh_min": 28,
         "wind_speed": 2,
         "wind_direction": 191,
         "cloud_cover": 1
      }
   },
   "names_of_crops": [
      "ଚାଉଳ",
      "କପା",
      "ସୋରିଷ",
      "ଓକ୍ରା",
      "କୋଲେ ଫସଲ"
   ],
   "general_advisory": "ଆଗାମୀ ସପ୍ତାହରେ ମଧ୍ଯ଼ ପାଗ ଶୁଖିଲା ଥିବାରୁ, କୃଷକମାନଙ୍କୁ ବିଭିନ୍ନ ସ୍ଥାଯ଼ୀ ଫସଲକୁ ଜଳସେଚନ ପାଇଁ ବ୍ଯ଼ବସ୍ଥା କରିବାକୁ ପରାମର୍ଶ ଦିଆଯାଇଛି। ରାତିର ତାପମାତ୍ରା କମ୍ ଏବଂ ଆର୍ଦ୍ରତା ଅଧିକ ଥିବାରୁ ଉଭଯ଼ କ୍ଷେତ ତଥା ପନିପରିବା ଫସଲରେ ବିଭିନ୍ନ ରୋଗ ସଂକ୍ରମଣ ବୃଦ୍ଧି ହେବାର ସମ୍ଭାବନା ରହିଛି, ତେଣୁ ଏହି ରୋଗଗୁଡ଼ିକ ଉପରେ ନିଯ଼ମିତ ନଜର ରଖିବା ପାଇଁ ପରାମର୍ଶ ଦିଆଯିବା ଉଚିତ। ବର୍ତ୍ତମାନର ରାତ୍ରି ତାପମାତ୍ରାକୁ ଦୃଷ୍ଟିରେ ରଖି, କୃଷକମାନଙ୍କୁ ସେମାନଙ୍କ ଫସଲ ତଥା ପଶୁମାନଙ୍କୁ ଥଣ୍ଡାରୁ ରକ୍ଷା କରିବା ପାଇଁ ଉପଯୁକ୍ତ ଯତ୍ନ ନେବାକୁ ପରାମର୍ଶ ଦିଆଯାଇଛି। ରୋଗ ପ୍ରତିରୋଧକ ଶକ୍ତି ବୃଦ୍ଧି କରିବା ଏବଂ କୌଣସି କ୍ଷତିକାରକ ରୋଗରୁ ରକ୍ଷା କରିବା ପାଇଁ ପଶୁମାନଙ୍କୁ କୃମି ଦୂରୀକରଣ ଏବଂ ଟୀକାକରଣ ପାଇଁ ପରାମର୍ଶ ଦିଆଯିବା ଉଚିତ।",
   "crops_data": {
      "rice": {
         "advisory": [
            "ଯଦି ଧାନ ପରିପକ୍ୱତା ପର୍ଯ୍ଯ଼ାଯ଼ରେ ଅଛି, ଅମଳ ପୂର୍ବରୁ କ୍ଷେତରେ ଜଳସେଚନ ବନ୍ଦ କରନ୍ତୁ |",
            "ଯେହେତୁ ଆଗାମୀ ଦିନରେ ପାଗ ଶୁଖିଲା ରହିବ ବୋଲି ଆଶା କରାଯାଏ, ତେଣୁ ଶସ୍ଯ଼ର 80-85% ପରିପକ୍ୱ ହେବା ପରେ ଗଛଗୁଡ଼ିକୁ ଅମଳ କରନ୍ତୁ ଏବଂ ଗଛର ରଙ୍ଗ ଫିକା ହଳଦିଆ ଦେଖାଯାଏ |",
            "ଅମଳ ପରେ ଧାନକୁ 2ରୁ 3 ଦିନ ପାଇଁ କ୍ଷେତରେ ଶୁଖାଇବା ଉଚିତ ଏବଂ ତା 'ପରେ ଅମଳ କରିବା ଉଚିତ। ଚାଉଳକୁ 12 ପ୍ରତିଶତ ଆର୍ଦ୍ରତା ସ୍ତରରେ ରଖିବା ଉଚିତ।",
            "ନିମ୍ନ ରାତ୍ରି ତାପମାତ୍ରା ଏବଂ ଉଚ୍ଚ ଆର୍ଦ୍ରତା ହେତୁ ବିଳମ୍ବରେ ପରିପକ୍ୱ ହେଉଥିବା ଧାନ କିସମଗୁଡ଼ିକରେ ଫାଲ୍ସ୍ ଏବଂ ନେକ/ପେନିକଲ୍ ବିସ୍ଫୋରଣର ଅଧିକ ସମ୍ଭାବନା ରହିପାରେ, ତେଣୁ ଏହାର ନିଯ଼ମିତ ତଦାରଖ ପାଇଁ ପରାମର୍ଶ ଦିଆଯିବା ଉଚିତ।"
         ]
      },
      "cotton": {
         "advisory": [
            "କପା ଫସଲରେ ବୋଲୱର୍ମ କମ୍ପ୍ଲେକ୍ସକୁ ନିଯ଼ନ୍ତ୍ରଣ କରିବା ପାଇଁ, କୃଷକମାନଙ୍କୁ ସ୍ୱଚ୍ଛ ପାଗରେ 10 ଲିଟର ପାଣିରେ 5 ପ୍ରତିଶତ ଏସ୍ଜି @4ଜି କିମ୍ବା ପ୍ରୋଫେନୋଫସ୍ 50 ପ୍ରତିଶତ ଇସି @30 ମିଲି ସିଞ୍ଚନ କରିବାକୁ ପରାମର୍ଶ ଦିଆଯାଇଛି।",
            "ପରିପକ୍ୱ ଶୁଆ ଅମଳ କରିବା ପାଇଁ ପରାମର୍ଶ ଦିଆଯିବା ଉଚିତ।"
         ]
      },
      "mustard": {
         "advisory": [
            "ଘନ ରୋପଣ କ୍ଷେତ୍ରରେ ସୋରିଷରେ ସର୍ବୋତ୍ତମ ଉଦ୍ଭିଦ ସଂଖ୍ୟା ବଜାୟ ରଖିବା ପାଇଁ ଗୋଟିଏ ପତଳା ଅପରେସନ ପରାମର୍ଶ ଦିଆଯିବା ଉଚିତ | 15 ରୁ 20 ଦିନର ପୁରୁଣା ଫସଲ କ୍ଷେତ୍ରରେ ହୋଇଂ ଏବଂ ଆଗାଛା ସଫା କରିବା ପାଇଁ ପରାମର୍ଶ ଦିଆଯାଇଛି।"
         ]
      },
      "okra": {
         "advisory": [
            "ଓକ୍ରା ଆଦିରେ ଫଳ ଏବଂ ଅଙ୍କୁର ଛେଦକକୁ ନିଯ଼ନ୍ତ୍ରଣ କରିବା ପାଇଁ ପ୍ରାରମ୍ଭିକ ପର୍ଯ୍ଯ଼ାଯ଼ରେ ଏକର ପିଛା ନିମ୍ବ ଆଧାରିତ କୀଟନାଶକ 1500 ପିପିଏମ @600ml ସିଞ୍ଚନ କରିବାକୁ ପରାମର୍ଶ ଦିଆଯିବା ଉଚିତ। ଗୁରୁତର କ୍ଷେତ୍ରରେ, 15 ଦିନର ବ୍ଯ଼ବଧାନରେ ଏକର ପିଛା ସ୍ପିନୋସାଦ୍ 45 ପ୍ରତିଶତ ଏସ୍. ସି. @70 ମିଲି ଏବଂ ଇମାମେକ୍ଟିନ୍ ବେନ୍ଜୋଏଟ୍ @80 ଗ୍ରାମ୍ ବିକଳ୍ପ ସ୍ପ୍ରେ କରିବା ପାଇଁ ପରାମର୍ଶ ଦିଆଯିବା ଉଚିତ।",
            "ପରିପକ୍ୱ ଫସଲ ଅମଳ ପାଇଁ ପରାମର୍ଶ ଦିଆଯିବା ଉଚିତ।"
         ]
      },
      "cole crop": {
         "advisory": [
            "ନର୍ସରୀ ଶଯ୍ଯ଼ା 3 ମିଟର ଲମ୍ବ, 1 ମିଟର ଚଉଡ଼ା ଏବଂ 15-20 ସେ. ମି. ଉଚ୍ଚତା ସହିତ ପ୍ରସ୍ତୁତ ହେବା ଉଚିତ୍। ବୁଣିବା ପୂର୍ବରୁ, ପ୍ରତ୍ଯ଼େକ ନର୍ସରୀ ଶଯ୍ଯ଼ାରେ <ଆଇ. ଡି. 1>...............................................।",
            "ଯେଉଁଠାରେ ଜଳସେଚନ ସୁବିଧା ଉପଲବ୍ଧ ଅଛି, ସେଠାରେ ପୂର୍ବରୁ ପ୍ରସ୍ତୁତ ଜମିରେ ଫସଲ ରୋପଣ କରିବାକୁ ପରାମର୍ଶ ଦିଆଯାଇଛି। ରୋପଣ ସମଯ଼ରେ, ନୂତନ ରୋପଣ କରାଯାଇଥିବା ପନିପରିବା ଫସଲରେ ଆର୍ଦ୍ରତା ତଥା ମୃତ୍ତିକା ତାପମାତ୍ରା ବଜାଯ଼ ରଖିବା ପାଇଁ ଷ୍ଟ୍ରା କିମ୍ବା ପଲିଥିନ୍ ମଲ୍ଚିଙ୍ଗ୍ ସାମଗ୍ରୀ ଭାବରେ ବ୍ଯ଼ବହୃତ ହୋଇପାରେ | ରୋପଣ ପୂର୍ବରୁ, ପନିପରିବା ଫସଲରେ ଅଧିକ ରୋଗ ସଂକ୍ରମଣକୁ ଏଡ଼ାଇବା ପାଇଁ ମୂଳକୁ ସୁପାରିଶ କରାଯାଇଥିବା ଫଙ୍ଗିସାଇଡ୍ ସହିତ ଚିକିତ୍ସା କରାଯିବା ଉଚିତ୍ |",
            "ଫୁଲକୋବିରେ ଡାଇମଣ୍ଡ ବ୍ଯ଼ାକ୍ ମଥ୍ର ଆକ୍ରମଣ ବିରୁଦ୍ଧରେ ନିଯ଼ମିତ ତଦାରଖ କରିବାକୁ ପରାମର୍ଶ ଦିଆଯିବା ଉଚିତ ଏବଂ ଯଦି ସମ୍ଭବ, କୃଷକମାନେ ଏହି ଉଦ୍ଦେଶ୍ଯ଼ରେ କ୍ଷେତରେ ଫେରୋମୋନ୍ ଟ୍ରାପ୍ ବ୍ଯ଼ବହାର କରିବା ଉଚିତ୍ |"
         ]
      }
   },
   "date": "19-11-2024"
}