{
   "weather_details": {
      "20-11-2024": {
         "rainfall": 0,
         "t_max": 30,
         "t_min": 16,
         "rh_max": 74,
         "rh_min": 41,
         "wind_speed": 6,
         "wind_direction": 340,
         "cloud_cover": 2
      },
      "21-11-2024": {
         "rainfall": 0,
         "t_max": 29,
         "t_min": 16,
         "rh_max": 73,
         "rh_min": 41,
         "wind_speed": 7,
         "wind_direction": 335,
         "cloud_cover": 2
      },
      "22-11-2024": {
         "rainfall": 0,
         "t_max": 29,
         "t_min": 17,
         "rh_max": 71,
         "rh_min": 39,
         "wind_speed": 7,
         "wind_direction": 338,
         "cloud_cover": 1
      },
      "23-11-2024": {
         "rainfall": 0,
         "t_max": 29,
         "t_min": 17,
         "rh_max": 72,
         "rh_min": 38,
         "wind_speed": 6,
         "wind_direction": 330,
         "cloud_cover": 2
      },
      "24-11-2024": {
         "rainfall": 0,
         "t_max": 28,
         "t_min": 17,
         "rh_max": 66,
         "rh_min": 35,
         "wind_speed": 7,
         "wind_direction": 339,
         "cloud_cover": 1
      }
   },
   "names_of_crops": [
      "ଚାଉଳ",
      "ବଳାତ୍କାର",
      "ସୋରିଷ",
      "ଫଳ",
      "ମତ୍ସ୍ୟଚାଷ",
      "ପଶୁପାଳନ"
   ],
   "general_advisory": "ଧାନ କ୍ଷେତରେ ଗୁଣ୍ଡି ବଗ୍ର କାର୍ଯ୍ୟକଳାପ ଉପରେ ନଜର ରଖନ୍ତୁ ଏବଂ କୀଟପତଙ୍ଗକୁ ବ୍ୟାପକ ଭାବେ ଫସାଇବା ଏବଂ ମାରିବା ପାଇଁ ସଡି ଯାଇଥିବା ଶାମୁକା ଫାନ୍ଦ ଲଗାନ୍ତୁ। ବିପିଏଚ, ଡବ୍ଲ୍ୟୁ. ବି. ପି. ଏଚ., ଲିଫ୍ ଫୋଲଡର, ଗୁଣ୍ଡି ବଗ୍ର ସଂକ୍ରମଣ ସ୍ତର ଏବଂ ଚାଉଳରେ ବି. ଏଲ. ବି. ଏବଂ ନେକ ବ୍ଲାଷ୍ଟ ଏବଂ ସିଥ୍ ରଟ୍ର ଘଟଣା ଦେଖିବା ପାଇଁ ନିୟମିତ ଭାବେ କ୍ଷେତକୁ ଯାଆନ୍ତୁ। ପଶୁମାନଙ୍କର ଟୀକାକରଣ ଏବଂ କୃମି ଦୂରୀକରଣ ପାଇଁ ନିକଟସ୍ଥ ପଶୁ ଚିକିତ୍ସକଙ୍କ ପରାମର୍ଶ ନିଅନ୍ତୁ।",
   "crops_data": {
      "rice": {
         "advisory": [
            "ପ୍ରଚଳିତ ମାଇକ୍ରୋକ୍ଲାଇମେଟ୍ ଅବସ୍ଥା ପ୍ଲାଣ୍ଟ ହପର୍ସର ଜନସଂଖ୍ଯ଼ା ବୃଦ୍ଧି କରିପାରେ | ଭୂପୃଷ୍ଠରେ ସୂର୍ଯ୍ଯ଼କିରଣର ଉପଯୁକ୍ତ ପ୍ରବେଶ ଏବଂ ଉନ୍ନତ ବାଯ଼ୁ ସଞ୍ଚାଳନ ପାଇଁ ପ୍ରତି 3 ମିଟରରେ/8-10 ଧାଡ଼ି ପରେ ପଡ଼ିଆରେ ଗଳି ତିଆରି କରନ୍ତୁ। ଯଦି ପ୍ଲାଣ୍ଟ ହପର୍ସର ଜନସଂଖ୍ଯ଼ା ସ୍ତର ଇ. ଟି. ଏଲ୍. (10 ପ୍ଲାଣ୍ଟ ହପର୍ସ୍/ହିଲ୍) ପାଖାପାଖି କିମ୍ବା ତା 'ଠାରୁ ଅଧିକ, ତେବେ ଫ୍ଲୋନିକାମିଡ୍ 50 <ଆଇ. ଡି. 2> ଏକର କିମ୍ବା (ଇଥିପ୍ରୋଲେ + ପାଇମେଟ୍ରୋଜିନ୍) <ଆଇ. ଡି. 1> ଏକର କିମ୍ବା ଟ୍ରାଇଫ୍ଲୁମେଜୋପାଇରିମ୍ 10 ଏସ୍. ସି. 92 ମିଲି/ଏକରରେ ସ୍ପ୍ରେ କରନ୍ତୁ। କୀଟନାଶକ ସିଞ୍ଚନ ଗଛର ମୂଳ ଅଂଶକୁ ଲକ୍ଷ୍ଯ଼ କରି କରାଯିବା ଉଚିତ।",
            "କୃଷକମାନଙ୍କୁ ଶୀଘ୍ର ପରିପକ୍ୱ ହୋଇଥିବା ଧାନ ଫସଲ ଅମଳ ପାଇଁ ଯିବାକୁ ପରାମର୍ଶ ଦିଆଯାଇଛି, ଯାହା ପ୍ଯ଼ାନିକଲର 85 ପ୍ରତିଶତ ପରିପକ୍ୱତାରେ ପହଞ୍ଚିଛି ଏବଂ ଫିକା ହଳଦିଆ ରଙ୍ଗର ଦେଖାଯାଏ |",
            "ଅମଳ ହୋଇଥିବା ଧାନର ଆର୍ଦ୍ରତାକୁ ଦିନରେ ସୂର୍ଯ୍ଯ଼କିରଣରେ ରଖି କମ୍ କରନ୍ତୁ।",
            "ମଳତ୍ଯ଼ାଗ ସ୍ଥଳ ଏବଂ ଭଣ୍ଡାର ଗୋଦାମକୁ ସମାନ ଭାବେ ପରିଷ୍କାର ଏବଂ କୀଟାଣୁନାଶକ କରନ୍ତୁ।"
         ]
      },
      "rapeseed": {
         "advisory": [
            "ଅବଶିଷ୍ଟ ମୃତ୍ତିକା ଆର୍ଦ୍ରତାର ଲାଭ ଉଠାଇ, ସର୍ବୋତ୍ତମ ଉତ୍ପାଦନ ପାଇବା ପାଇଁ ଜମି ପ୍ରସ୍ତୁତି ଏବଂ ଫସଲର ସୋରିଷ ବୁଣିବା ଶୀଘ୍ର ଶେଷ କରାଯିବା ଉଚିତ।",
            "ଉପଯୁକ୍ତ କିସମଃ ତୋରିଆ-ଅନୁରାଧା, ପାର୍ବତୀ, ସୁଶ୍ରୀ ଭାରତୀଯ଼ ସୋରିଷ-ଏନ୍. ଆର୍. ସି. ଏଚ୍. ବି. 101, ମାହିକୋ ବୋଲ୍ଡ, ଜେ. ଡି. 6, ସମ୍ପୂର୍ଣ୍ଣା",
            "ବୀଜ ହାର-8-10 କିଲୋଗ୍ରାମ/ହେକ୍ଟର, ବ୍ଯ଼ବଧାନ-30 ସେ. ମି. x 10 ସେ. ମି.",
            "ସାର ମାତ୍ରା-ତୋରିଆ @60:30:30 N-P2O5-K2O କି. ଗ୍ରା./ହେକ୍ଟର ସୋରିଷ @80:40:40 N-P2O5-K2O କି. ଗ୍ରା./ହେକ୍ଟର 50 ପ୍ରତିଶତ N ଏବଂ ସମସ୍ତ P2O5 ଏବଂ K2O ସାର ମୂଳ ସାର ଭାବେ ପ୍ରଯ଼ୋଗ କରାଯିବା ଉଚିତ।"
         ]
      },
      "mustard": {
         "advisory": [
            "ଉପଯୁକ୍ତ ପ୍ରକାରର କୋଇଲା ଫସଲ, ଲଙ୍କା ଏବଂ ବାଇଗଣ ବାଛନ୍ତୁ ଏବଂ ଭଲ ଭାବେ ଦଳି ହୋଇଥିବା ନର୍ସରୀ ଶଯ୍ଯ଼ାରେ ମଞ୍ଜି ବୁଣନ୍ତୁ। ବୁଣିବା ପୂର୍ବରୁ ନର୍ସରୀ ଶଯ୍ଯ଼ାରେ ସମ୍ପୂର୍ଣ୍ଣ ଭାବେ ଅପଘଟିତ ଏଫ୍. ୱାଇ. ଏମ୍., କମ୍ପୋଷ୍ଟ/ଭର୍ମିକମ୍ପୋଷ୍ଟ ମିଶାନ୍ତୁ।",
            "ଯଦି ପ୍ରାରମ୍ଭିକ ଅବଧି କିସମ ପନିପରିବାର ଚାରା ରୋପଣ ପାଇଁ ପ୍ରସ୍ତୁତ, ତେବେ ଚାରା ଗୁଡ଼ିକୁ (ମେଟାଲାକ୍ସିଲ + ମାନକୋଜେବ) 2 ଗ୍ରାମ/ଲି ପାଣିରେ ଏବଂ ପ୍ଲାଣ୍ଟୋମାଇସିନ ଲିଟର ପିଛା 1 ଗ୍ରାମ ପାଣିରେ ଚିକିତ୍ସା କରନ୍ତୁ।"
         ]
      },
      "fruit": {
         "advisory": [
            "ଘୂର୍ଣ୍ଣିବାତ୍ଯ଼ା ଦାନା କାରଣରୁ ସର୍ବାଧିକ ପେଁପେ ଗଛ କ୍ଷତିଗ୍ରସ୍ତ ହୋଇଥାଏ, ତେଣୁ ଉପଯୁକ୍ତ ଖୋଲା ପରାଗିତ କିସମ (କୁର୍ଗ ମହୁ ଶିଶିର, ରାଞ୍ଚି ବାମନ, ସୂର୍ଯ୍ଯ଼, ପୁସା ନନ୍ହା) ଏବଂ ପେଁପେ ଗଛର ହାଇବ୍ରିଡ୍ କିସମ (ସମ୍ପୂର୍ଣ୍ଣା) ଚଯ଼ନ କରନ୍ତୁ। କଦଳୀ ପତ୍ର କର୍ଲ ଭୂତାଣୁର ପ୍ରକୋପକୁ କମ୍ କରିବା ପାଇଁ ରୋପଣ ସମଯ଼ରେ 10 ଗ୍ରାମ୍ ଫିପ୍ରୋନିଲ 0.3 ଗ୍ରାମ୍ ଲଗାନ୍ତୁ।"
         ]
      },
      "pisciculture": {
         "advisory": [
            "ପୋଖରୀରେ ଅମ୍ଳଜାନର ଅଭାବ ହେଲେ, ମାଛଗୁଡ଼ିକ ଭୂପୃଷ୍ଠ ଜଳ ଉପରକୁ ଆସି ସେମାନଙ୍କ ମୁହଁ ଦେଇ ଘୁଞ୍ଚିବାକୁ ଆରମ୍ଭ କରିବେ | ଆଦର୍ଶ ଦ୍ରବୀଭୂତ ଅମ୍ଳଜାନ ପ୍ରାଯ଼ 5 ମି. ଗ୍ରା./ଲି.। ଏରେଟର ବ୍ଯ଼ବହାର କରି ଏହାକୁ ବଜାଯ଼ ରଖାଯାଇପାରିବ। ବାଯ଼ୁ ସଞ୍ଚାରଣର ଏକ ସରଳ ଉପାଯ଼ ହେଉଛି ପୁଷ୍କରିଣୀର ଜଳ ସଞ୍ଚାଳନ କରିବା। ଏହା ଏକ ପମ୍ପ ବ୍ଯ଼ବହାର କରି କରାଯାଇପାରିବ ଯାହା ପୁଷ୍କରିଣୀର ତଳ ପୃଷ୍ଠରୁ ପାଣି ନେଇ ସେହି ପୋଖରୀରେ ଛିଞ୍ଚି ପାରିବ |"
         ]
      },
      "livestock": {
         "advisory": [
            "ଯଦି ପଶୁମାନଙ୍କୁ ଏପର୍ଯ୍ଯ଼ନ୍ତ ଏଫ୍. ଏମ୍. ଡି., ରକ୍ତସ୍ରାବଜନିତ ସେପ୍ଟିସେମିଆ, ବ୍ଲାକ୍ କ୍ୱାର୍ଟର୍, ଏଣ୍ଟେରୋଟକ୍ସିମିଆ ଇତ୍ଯ଼ାଦି ବିରୁଦ୍ଧରେ ଟୀକାକରଣ କରାଯାଇ ନାହିଁ, ତେବେ ଏଗୁଡ଼ିକ କରିବା ଆବଶ୍ଯ଼କ |"
         ]
      }
   },
   "date": "19-11-2024"
}