{
   "weather_details": {
      "20/11/2024": {
         "rainfall": 0,
         "t_max": 30,
         "t_min": 18,
         "rh_max": 75,
         "rh_min": 32,
         "wind_speed": 4,
         "wind_direction": 349,
         "cloud_cover": 2
      },
      "21/11/2024": {
         "rainfall": 0,
         "t_max": 29,
         "t_min": 17,
         "rh_max": 75,
         "rh_min": 33,
         "wind_speed": 4,
         "wind_direction": 349,
         "cloud_cover": 1
      },
      "22/11/2024": {
         "rainfall": 0,
         "t_max": 29,
         "t_min": 17,
         "rh_max": 76,
         "rh_min": 34,
         "wind_speed": 3,
         "wind_direction": 353,
         "cloud_cover": 1
      },
      "23/11/2024": {
         "rainfall": 0,
         "t_max": 29,
         "t_min": 17,
         "rh_max": 70,
         "rh_min": 31,
         "wind_speed": 3,
         "wind_direction": 353,
         "cloud_cover": 0
      },
      "24/11/2024": {
         "rainfall": 0,
         "t_max": 29,
         "t_min": 17,
         "rh_max": 66,
         "rh_min": 29,
         "wind_speed": 3,
         "wind_direction": 354,
         "cloud_cover": 1
      }
   },
   "names_of_crops": [
      "ଖରିଫ ଧାନ",
      "ଚିନାବାଦାମ",
      "ଚଣା ଫସଲ",
      "ଆଳୁ",
      "ସୋରିଷ",
      "କୁକୁଡ଼ା ମାଂସ",
      "ପଶୁପାଳନ"
   ],
   "general_advisory": "କ୍ଷେତରେ ପର୍ଯ୍ୟାପ୍ତ ଆର୍ଦ୍ରତା ଥିଲେ, ଯେତେ ଶୀଘ୍ର ସମ୍ଭବ ଯୋଡ଼ା ଫସଲ ବୁଣନ୍ତୁ। ରବି ଫସଲ ପାଇଁ, କୃଷକମାନେ ନଭେମ୍ବର ମାସରେ ପତିତ କ୍ଷେତରେ ସେମାନଙ୍କର କ୍ଷେତ୍ର କାର୍ଯ୍ୟ ଆରମ୍ଭ କରିପାରିବେ।",
   "crops_data": {
      "kharif paddy": {
         "advisory": [
            "ମିଥ୍ଯ଼ା ସ୍ଥାନୀଯ଼ ଅଞ୍ଚଳରେ, କପର୍ ହାଇଡ୍ରୋକ୍ସାଇଡ୍ 77 ପ୍ରତିଶତ @2 ଗ୍ରାମ୍/ଲିଟର କିମ୍ବା ଟେବୁକୋନାଜୋଲ୍ 25 ପ୍ରତିଶତ @2 ଗ୍ରାମ୍/ଲିଟର ସ୍ପ୍ରେ କରନ୍ତୁ। ଗ୍ରାମ୍ ସ୍ମଟ୍ର ପ୍ରଭାବଶାଳୀ ନିଯ଼ନ୍ତ୍ରଣ ପାଇଁ ସାତ ଦିନ ବ୍ଯ଼ବଧାନରେ ଏହି ସ୍ପ୍ରେକୁ ପୁନରାବୃତ୍ତି କରନ୍ତୁ।"
         ]
      },
      "groundnut": {
         "advisory": [
            "ତାପମାତ୍ରା ହ୍ରାସ ପାଉଥିବାରୁ ବିଳମ୍ବ ନକରି ଧରଣୀ, କଳିଙ୍ଗ ଚିନାବାଦାମ, କଦ୍ରି ଭଳି ଚିନାବାଦାମ ବୁଣିବାକୁ ଯାଆନ୍ତୁ। ବୁଣିବା ପୂର୍ବରୁ ଏକର ପିଛା 35 କି. ଗ୍ରା. ଡିଏପି ଏବଂ 4 କି. ଗ୍ରା. ଯ଼ୁରିଆ ଏବଂ 26 କି. ଗ୍ରା. ଏମ୍. ଓ. ପି. ପ୍ରଯ଼ୋଗ କରନ୍ତୁ। ଧାଡ଼ି ଠାରୁ ଧାଡ଼ି ମଧ୍ଯ଼ରେ 25 ସେ. ମି. ବ୍ଯ଼ବଧାନ ରଖନ୍ତୁ ଏବଂ ଗଛ ଠାରୁ ଗଛ ମଧ୍ଯ଼ରେ 10 ସେ. ମି. ବ୍ଯ଼ବଧାନ ରଖନ୍ତୁ ଏବଂ ବୀଜକୁ 3 ସେ. ମି. ଗଭୀରତାରେ ରଖନ୍ତୁ।"
         ]
      },
      "gram crop": {
         "advisory": [
            "ଚଣା ବୁଣିବା ଉଚିତ। ବୁଣିବା ପୂର୍ବରୁ କୃଷକମାନଙ୍କୁ ଉତ୍ତମ ବୀଜ ଅଙ୍କୁରୋଦଗମ ପାଇଁ ମୃତ୍ତିକାର ସର୍ବୋତ୍ତମ ଆର୍ଦ୍ରତା ସୁନିଶ୍ଚିତ କରିବାକୁ ପରାମର୍ଶ ଦିଆଯାଇଛି। ବୀଜ ହାରଃ-ଛୋଟ ଏବଂ ମଧ୍ୟମ ଆକାରର କିସମ ପାଇଁ 60-80 କିଲୋଗ୍ରାମ ଏବଂ ବଡ଼ ଆକାରର ପ୍ରଜାତି ପାଇଁ 80-100 କିଲୋଗ୍ରାମ। R x R ବ୍ୟବଧାନ 30-35 ସେ. ମି. ବଜାୟ ରଖାଯିବ। ବୁଣିବା ପୂର୍ବରୁ, ବୀଜକୁ ରାଇଜୋବିୟମ୍ ସଂସ୍କୃତି ଏବଂ ଫସଫରସ୍ ଦ୍ରବଣୀୟ ବ୍ୟାକ୍ଟେରିଆ ସହିତ ଚିକିତ୍ସା କରାଯିବା ଉଚିତ୍ |"
         ]
      },
      "potato": {
         "advisory": [
            "କେ. ପୋଖରାଜ, କେ. ଲଲିମା, କେ. ସିନ୍ଦୁରୀ, କେ. ସୂର୍ଯ୍ଯ଼ @60-80 କ୍ଯ଼ୁ/ଏସି ଭଳି ମଞ୍ଜି ସଂଗ୍ରହ କରନ୍ତୁ। ଉପଯୁକ୍ତ ଅଙ୍କୁରୋଦଗମ ପାଇଁ ମଞ୍ଜି ଭିତରେ ଥିବା ମଞ୍ଜି ଗୁଡ଼ିକୁ 5ରୁ 7 ଦିନ ପର୍ଯ୍ଯ଼ନ୍ତ ରଖନ୍ତୁ। 20 ଗ୍ରାମ୍ ମାନକୋଜେବ୍, 1 ଗ୍ରାମ୍ ଷ୍ଟ୍ରେପ୍ଟୋସାଇକ୍ଲିନ୍ ସହିତ 10 ଲିଟର ପାଣିରେ ମଞ୍ଜି ମିଶାନ୍ତୁ ଏବଂ କନ୍ଦକୁ 30 ମିନିଟ୍ ଗଭୀର କରନ୍ତୁ ଏବଂ ତା 'ପରେ ସେଡ୍ ତଳେ ଶୁଖାନ୍ତୁ | ଅନ୍ତିମ ଜମି ପ୍ରସ୍ତୁତି ସମଯ଼ରେ ଏକର ପିଛା 5 ଟନ ଏଫ୍. ୱାଇ. ଏମ୍. ପ୍ରଯ଼ୋଗ କରନ୍ତୁ।"
         ]
      },
      "mustard": {
         "advisory": [
            "ବୁଣିବା ପରେ 10 ଦିନ ପରେ ପତଳା କରିବା କାର୍ଯ୍ଯ଼ କରନ୍ତୁ ଏବଂ ସୁସ୍ଥ ଉଦ୍ଭିଦ ରଖନ୍ତୁ ଏବଂ ଉପଯୁକ୍ତ ଉଦ୍ଭିଦ ସଂଖ୍ଯ଼ା ବଜାଯ଼ ରଖନ୍ତୁ |"
         ]
      },
      "poultry": {
         "advisory": [
            "କୁକୁଡ଼ା ଘରକୁ ଗରମ ରଖିବା ପାଇଁ ତାପମାତ୍ରା ବଜାଯ଼ ରଖିବା ପାଇଁ କନ୍ଦ ରଖନ୍ତୁ | ଘରକୁ ବ୍ଯ଼ାଗରେ ଘୋଡାଇ ରଖନ୍ତୁ।"
         ]
      },
      "animal husbandry": {
         "advisory": [
            "ଥଣ୍ଡାରୁ ସୁରକ୍ଷା ପାଇଁ, ସେଡ୍ ହାଉସ୍କୁ ଗରମ ରଖିବାକୁ ହେବ।"
         ]
      }
   },
   "date": "19-11-2024"
}