{
   "weather_details": {
      "2024-11-20": {
         "rainfall": 0,
         "t_max": 32,
         "t_min": 17,
         "rh_max": 77,
         "rh_min": 35,
         "wind_speed": 3,
         "wind_direction": 90,
         "cloud_cover": 1
      },
      "2024-11-21": {
         "rainfall": 0,
         "t_max": 32,
         "t_min": 17,
         "rh_max": 77,
         "rh_min": 34,
         "wind_speed": 2,
         "wind_direction": 351,
         "cloud_cover": 0
      },
      "2024-11-22": {
         "rainfall": 0,
         "t_max": 32,
         "t_min": 17,
         "rh_max": 78,
         "rh_min": 35,
         "wind_speed": 2,
         "wind_direction": 90,
         "cloud_cover": 0
      },
      "2024-11-23": {
         "rainfall": 0,
         "t_max": 32,
         "t_min": 17,
         "rh_max": 78,
         "rh_min": 35,
         "wind_speed": 2,
         "wind_direction": 351,
         "cloud_cover": 1
      },
      "2024-11-24": {
         "rainfall": 0,
         "t_max": 31,
         "t_min": 17,
         "rh_max": 78,
         "rh_min": 34,
         "wind_speed": 3,
         "wind_direction": 90,
         "cloud_cover": 2
      }
   },
   "names_of_crops": [
      "ଚାଉଳ",
      "ଫୁଲକୋବି",
      "ମାରିଗୋଲ୍ଡ",
      "ଗାଈ।",
      "ଛେଳି।",
      "ସାଧାରଣ ମାଛ",
      "ଚିକେନ୍"
   ],
   "general_advisory": "ଗତ ସପ୍ତାହରେ ଗଜପତି ଜିଲ୍ଲାର ହାରାହାରି ସର୍ବାଧିକ ଦୈନିକ ତାପମାତ୍ରା 33 ଡିଗ୍ରୀ ସେଲସିୟସ୍ ଏବଂ ହାରାହାରି ସର୍ବନିମ୍ନ ଦୈନିକ ତାପମାତ୍ରା 20.3 ଡିଗ୍ରୀ ସେଲସିୟସ୍ ଥିଲା। ଗତ ସପ୍ତାହରେ ଜିଲ୍ଲାରେ କୌଣସି ବର୍ଷା ହୋଇନଥିଲା। ଆଇ. ଏମ୍. ଡି. ର ପାଞ୍ଚ ଦିନିଆ ପାଣିପାଗ ପୂର୍ବାନୁମାନ ଆଧାରରେ, କୃଷକମାନଙ୍କୁ ଆବଶ୍ୟକ କୃଷି କାର୍ଯ୍ୟକଳାପ ଯଥା ନିଡ଼ାଇ, ସାର ପ୍ରୟୋଗ, ଜଳସେଚନ, ଅମଳ ଏବଂ କୀଟନାଶକ ପ୍ରୟୋଗ କରିବା ପାଇଁ ପରାମର୍ଶ ଦିଆଯାଇଛି। କ୍ଷେତରେ ଉପଲବ୍ଧ ମୃତ୍ତିକା ଆର୍ଦ୍ରତାକୁ ଉପଯୋଗ କରିବା ପାଇଁ ମଧ୍ୟମ କିମ୍ବା ଅଗଭୀର ନିମ୍ନ ଜମିରେ ସବୁଜ ଚଣା, କଳା ଚଣା, ତୋରିଆ, ଚିକେନ୍ ମଟର, ମସୁର ଡାଲି, ସୂର୍ଯ୍ୟମୁଖୀ, ଚିନାବାଦାମ, କାଉପି, ଫିଲ୍ଡ ମଟର ଇତ୍ୟାଦି ରବି ଫସଲ ବୁଣିବା ଆରମ୍ଭ କରନ୍ତୁ। ଭୂତାଣୁ ସଂକ୍ରମିତ ଫସଲର ଘାସକୁ ଲଙ୍କା, ଟମାଟୋ ଏବଂ ବାଇଗଣରେ କାଟିବା ଉଚିତ। ସଂକ୍ରମିତ ଗଛଗୁଡ଼ିକୁ ଉପୁଡ଼ାଇ ମାଟିରେ ପୋତିଦେବା ଉଚିତ। ଡାଲି/କଳା ଚଣା/ସବୁଜ ଚଣା ଭଳି ଡାଲି ଗୁଡ଼ିକୁ ଅମଳ କରିବାର ଏକ ସପ୍ତାହ ପୂର୍ବରୁ ଠିଆ ହୋଇଥିବା ପରିପକ୍ୱ ଫସଲ (ଧାନ) ରେ ପ୍ରସାରଣ କରାଯାଇପାରିବ, ଯାହାଦ୍ୱାରା ଉପଯୁକ୍ତ ଅଞ୍ଚଳରେ ମାଟିରେ ଅବଶିଷ୍ଟ ଆର୍ଦ୍ରତାର ଉପଯୋଗ କରାଯାଇପାରିବ।",
   "crops_data": {
      "rice": {
         "advisory": [
            "ଶୀଘ୍ର ପରିପକ୍ୱ ହେଉଥିବା କିସମଗୁଡ଼ିକରେ, ଫସଲ ଅମଳ କରନ୍ତୁ ଯେତେବେଳେ 80-85% ଶସ୍ଯ଼ ହାତ ଦ୍ୱାରା ହାତୁଡ଼ି ଦ୍ୱାରା କିମ୍ବା କମ୍ବାଇନ୍ ହାରଭେଷ୍ଟର କିମ୍ବା ରିପ୍ପର୍ ବ୍ଯ଼ବହାର କରି ପରିପକ୍ୱ ହୁଏ | ବ୍ଯ଼ବହାର ଉଦ୍ଦେଶ୍ଯ଼ରେ ଧାନ ଶସ୍ଯ଼କୁ 14 ପ୍ରତିଶତ ଆର୍ଦ୍ରତା ପର୍ଯ୍ଯ଼ନ୍ତ ସୂର୍ଯ୍ଯ଼ାଲୋକରେ ଶୁଖାଇବା ଆବଶ୍ଯ଼କ ଏବଂ ଉନ୍ନତ ସ୍ୱଯ଼ଂ-ଜୀବନ ପାଇଁ ବୀଜ ଉଦ୍ଦେଶ୍ଯ଼ରେ ଏହାକୁ 12 ପ୍ରତିଶତ ଆର୍ଦ୍ରତା ପର୍ଯ୍ଯ଼ନ୍ତ ଶୁଖାଇବା ଆବଶ୍ଯ଼କ। ଧାନ କ୍ଷେତରୁ ପାଣି ବାହାର କରନ୍ତୁ, ଅମଳ କରିବାର 15 ଦିନ ପୂର୍ବରୁ 11/19/24, ଅପରାହ୍ନ 3ଃ48 ଜିଲ୍ଲା ପରାମର୍ଶ"
         ]
      },
      "cauliflower": {
         "advisory": [
            "ଏକର ପିଛା 33 କି. ଗ୍ରା. ଯ଼ୁରିଆ ଏବଂ 23 କି. ଗ୍ରା. ଏମ୍. ଓ. ପି. ପ୍ରଯ଼ୋଗ କରନ୍ତୁ ଏବଂ <ଆଇ. ଡି. 1> ଡି. ଏ. ଟି. ରେ ହାତ କାଟିବା ଏବଂ ଏକର ପିଛା 33 କି. ଗ୍ରା. ଯ଼ୁରିଆ ଏବଂ 23 କି. ଗ୍ରା. ଏମ୍. ଓ. ପି. କୁ <ଆଇ. ଡି. 2> ଡି. ଏ. ଟି. ରେ ଶେଷ ଟପ୍ ଡ୍ରେସିଙ୍ଗ୍ ସାର ଭାବରେ ପ୍ରଯ଼ୋଗ କରନ୍ତୁ। ଯଦି ଚାରା ରୋପଣ ସମଯ଼ରେ ବୋରାକ୍ସ ପ୍ରଯ଼ୋଗ କରାଯାଇନଥାଏ, ତେବେ ବୋରାକ୍ସ ସ୍ପ୍ରେ @4 କେଜି/ଏକର କିମ୍ବା ଫୋଲିବୋର/ସଲ୍ଯ଼ୁବର ସ୍ପ୍ରେ @1.5 ଗ୍ରାମ/ଲିଟର। ପ୍ରତିରୋପଣର ଦୁଇ ସପ୍ତାହ ପରେ ଏବଂ ଦହି ତିଆରି ହେବାର ଦୁଇ ସପ୍ତାହ ପୂର୍ବରୁ ବୋରନ ମାଇକ୍ରୋ ନ୍ଯ଼ୁଟ୍ରିଏଣ୍ଟ ସିଞ୍ଚନ କରାଯିବା ଉଚିତ।"
         ]
      },
      "marigold": {
         "advisory": [
            "ମାରିଗୋଲ୍ଡ ଏବଂ ଗୋଲାପ ପରି ଫୁଲରେ ରେଡ୍ ସ୍ପାଇଡର ମାଇଟ୍କୁ ପରିଚାଳନା କରିବା ପାଇଁ 80 ପ୍ରତିଶତ ୱେଟେବଲ୍ ସଲଫର୍ (ସଲଫେକ୍ସ/ବଲୱାନ/ସଲଫାଡେକ୍ସ) @2 ଗ୍ରାମ/ଲିଟର ପାଣି କିମ୍ବା ପ୍ରୋପାର୍ଜାଇଟ୍ 57 ପ୍ରତିଶତ ଇସି (ଓମାଇଟ୍/ମାଇଟକିଲ/ସୁପର ଡାଇନାମାଇଟ୍) @2 ମିଲି/ଲିଟର ପାଣି କିମ୍ବା ଫେନପାଇରୋକ୍ସିମେଟ୍ 5 ପ୍ରତିଶତ ଇସି (ସିଗେଟ/ମିଟିଗେଟ/ଫର୍ମାଇଟ୍) @2 ମିଲି/ଲିଟର ପାଣି ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "cow": {
         "advisory": [
            "ନିୟମିତ ବ୍ୟବଧାନରେ ଗୋରୁ ଏବଂ ମଇଁଷିକୁ କୃମି ମୁକ୍ତ କରନ୍ତୁ ଏବଂ ସେମାନଙ୍କୁ ଟୀକାକରଣ ମଧ୍ୟ କରନ୍ତୁ। 4 ବର୍ଷ ପରେ ମଧ୍ୟ ଯଦି ପଶୁଟି ଗରମ ହେଉନାହିଁ, ତେବେ ପଶୁ ଚିକିତ୍ସକଙ୍କ ସହ ପରାମର୍ଶ କରନ୍ତୁ ଏବଂ ଯୌବନ ଆରମ୍ଭ କରିବା ପାଇଁ ଡାକ୍ତରଙ୍କ ପରାମର୍ଶ ଅନୁସରଣ କରନ୍ତୁ।"
         ]
      },
      "goat": {
         "advisory": [
            "ଶୀତ ଋତୁ ଆରମ୍ଭ ହେବା ପୂର୍ବରୁ ଛେଳି ଘର ମରାମତି କରିବାକୁ କୃଷକମାନଙ୍କୁ ପରାମର୍ଶ ଦିଆଯାଇଛି। କାରଣ ଥଣ୍ଡା ପାଗ ଯୋଗୁଁ ପିଲାମାନଙ୍କ ମଧ୍ଯ଼ରେ ମୃତ୍ଯ଼ୁ ହେବାର ଅଧିକ ସମ୍ଭାବନା ରହିଛି।"
         ]
      },
      "common fish": {
         "advisory": [
            "ଶୀତ ଋତୁରେ, ମାଛ ଫଙ୍ଗଲ୍, ବ୍ୟାକ୍ଟେରିଆ ଏବଂ ପରଜୀବୀ ସଂକ୍ରମଣର ଶିକାର ହୋଇପାରନ୍ତି। ଏଗୁଡ଼ିକୁ ରୋକିବା ପାଇଁ, ଶୀତ ଋତୁ ଆରମ୍ଭ ହେବାର ଠିକ୍ ପୂର୍ବରୁ ଏକର ପିଛା 400 ମି. ଲି. ରେ ସି. ଆଇ. ଏଫ୍. ଏ. ଏକ୍ସ. ଲଗାନ୍ତୁ। ଏହାବ୍ୟତୀତ, ପୋଖରୀରେ ପୋଟାସିୟମ୍ ପର୍ମାଙ୍ଗାନେଟ୍ ପ୍ରତି ଏକର ପିଛା 1 ରୁ 2 କିଲୋଗ୍ରାମ କିମ୍ବା ଚୂନପଥର ପ୍ରତି ଏକର ପିଛା 50-100 କିଲୋଗ୍ରାମ ବ୍ୟବହାର କରନ୍ତୁ। ଏକର ପିଛା 100 କିଲୋଗ୍ରାମରେ ଲୁଣ ଲଗାଇବା ମଧ୍ୟ ଶୀତ ଋତୁରେ ମାଛମାନଙ୍କୁ ରୋଗ ପ୍ରାଦୁର୍ଭାବରୁ ରକ୍ଷା କରିବାରେ ପ୍ରଭାବଶାଳୀ।"
         ]
      },
      "chicken": {
         "advisory": [
            "ଶୀତ ଋତୁରେ ଥଣ୍ଡା ପାଗ ଯୋଗୁଁ ମୃତ୍ଯ଼ୁ ଏଡ଼ାଇବା ପାଇଁ କୃଷକମାନେ ଛୁଆ ଏବଂ ବତକ ପିଲାମାନଙ୍କର ପ୍ରଜନନ ପରିଚାଳନାର ଯତ୍ନ ନେବା ଆବଶ୍ଯ଼କ |"
         ]
      }
   },
   "date": "19-11-2024"
}