{
   "weather_details": {
      "21-09-2024": {
         "rainfall": 15,
         "t_max": 31,
         "t_min": 20,
         "rh_max": 91,
         "rh_min": 69,
         "wind_speed": 5,
         "wind_direction": 208,
         "cloud_cover": 7
      },
      "22-09-2024": {
         "rainfall": 15,
         "t_max": 31,
         "t_min": 20,
         "rh_max": 93,
         "rh_min": 59,
         "wind_speed": 5,
         "wind_direction": 195,
         "cloud_cover": 7
      },
      "23-09-2024": {
         "rainfall": 20,
         "t_max": 30,
         "t_min": 20,
         "rh_max": 92,
         "rh_min": 56,
         "wind_speed": 6,
         "wind_direction": 75,
         "cloud_cover": 8
      },
      "24-09-2024": {
         "rainfall": 20,
         "t_max": 30,
         "t_min": 19,
         "rh_max": 91,
         "rh_min": 65,
         "wind_speed": 4,
         "wind_direction": 198,
         "cloud_cover": 8
      },
      "25-09-2024": {
         "rainfall": 10,
         "t_max": 30,
         "t_min": 19,
         "rh_max": 93,
         "rh_min": 67,
         "wind_speed": 5,
         "wind_direction": 193,
         "cloud_cover": 8
      }
   },
   "names_of_crops": [
      "ଚାଉଳ",
      "ମକା",
      "ରାଗି।",
      "କଳା ଚଣା",
      "ତିଲ।",
      "ଅଦା।",
      "ହଳଦୀ"
   ],
   "general_advisory": "ଆଗାମୀ ପାଞ୍ଚ ଦିନ ମଧ୍ଯ଼ରେ ବର୍ଷା ହେବାର ସମ୍ଭାବନା ରହିଛି, କେବଳ ଆକାଶ ସଫା ହେବା ପରେ ସ୍ପ୍ରେ କରନ୍ତୁ ଏବଂ ସ୍ପ୍ରେ ଦ୍ରବଣରେ ଷ୍ଟିକର ବ୍ଯ଼ବହାର କରନ୍ତୁ। କ୍ଷେତର ଗୋଟିଏ ଅଂଶରେ ବର୍ଷା ଜଳ ସଂରକ୍ଷଣ ପାଇଁ ଉପଯୁକ୍ତ ବ୍ଯ଼ବସ୍ଥା କରିବାକୁ କୃଷକମାନଙ୍କୁ ପରାମର୍ଶ ଦିଆଯାଇଛି। ଏହି ଜଳକୁ ଶୁଖିଲା ଋତୁରେ ଫସଲରେ ଜଳସେଚନ ପାଇଁ ବ୍ଯ଼ବହାର କରାଯାଇପାରିବ। ଅଧିକ ଆର୍ଦ୍ରତା ହେତୁ, ପୂର୍ବରୁ ବୁଣାଯାଇଥିବା ଫସଲରେ କୀଟପତଙ୍ଗ ଏବଂ ରୋଗ ସୃଷ୍ଟି ହେବାର ସମ୍ଭାବନା ରହିଛି। ଫସଲ ଏବଂ ପାଣିପାଗ ସ୍ଥିତି ଉପରେ ନିର୍ଭର କରି ଉଦ୍ଭିଦ ସୁରକ୍ଷା ପଦକ୍ଷେପ ନିଅନ୍ତୁ।",
   "crops_data": {
      "rice": {
         "advisory": [
            "ବର୍ତ୍ତମାନର ପାଣିପାଗ ଧାନରେ ବିସ୍ଫୋରଣ ରୋଗକୁ ସମର୍ଥନ କରିପାରେ | ଏହାକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ ଟିବୁକୋନାଜୋଲ୍ 50 ପ୍ରତିଶତ + ଟ୍ରାଇଫ୍ଲୋକ୍ସିସ୍ଟ୍ରୋବିନ୍ 25 ପ୍ରତିଶତ ଡବ୍ଲୁ. ଜି. @4 ଗ୍ରାମ/ଲିଟର ପାଣି କିମ୍ବା ଟ୍ରାଇସାଇକ୍ଲାଜୋଲ୍ 45 ପ୍ରତିଶତ + ହେକ୍ସାକୋନାଜୋଲ୍ 10 ପ୍ରତିଶତ ଡବ୍ଲୁ. ଜି. @1 ଗ୍ରାମ/ଲିଟର ପାଣି ସିଞ୍ଚନ କରନ୍ତୁ।",
            "କାଣ୍ଡ ଛେଦକ ଏବଂ ପତ୍ର ଫୋଲଡର ସଂକ୍ରମଣ ହେବାର ସମ୍ଭାବନା ରହିଛି। ଯଦି କ୍ଷେତରେ ମିଳେ ତେବେ କ୍ଲୋରାଣ୍ଟ୍ରାନିଲିପ୍ରୋଲ୍ 18.5% ଏସ୍ସି @0.3 ମିଲି/ଲିଟର ପାଣି କିମ୍ବା ଫ୍ଲୁବେଣ୍ଡିଆମାଇଡ୍ 20 ପ୍ରତିଶତ ଡବ୍ଲୁଜି @0.25 ଗ୍ରାମ୍/ଲିଟର ପାଣି ସ୍ପ୍ରେ କରନ୍ତୁ।",
            "ବ୍ଯ଼ାକ୍ଟେରିଆ ଲିଫ୍ ବ୍ଲାଇଟ୍ କୁ ନିଯ଼ନ୍ତ୍ରଣ କରିବା ପାଇଁ କପର୍ ଅକ୍ସିକ୍ଲୋରାଇଡ୍ 50 ପ୍ରତିଶତ ଡବ୍ଲ୍ଯ଼ୁ. ପି. @3 ଗ୍ରାମ୍ ଏବଂ ଷ୍ଟ୍ରେପ୍ଟୋମାଇସିନ୍ + ଟେଟ୍ରାସାଇକ୍ଲିନ୍ (<ଆଇ. ଡି. 1>) @0.15 ଗ୍ରାମ୍/ଲିଟର ପାଣି ସ୍ପ୍ରେ କରନ୍ତୁ ଯେତେବେଳେ ଆକାଶ ସ୍ୱଚ୍ଛ ହୋଇଯାଏ।"
         ]
      },
      "maize": {
         "advisory": [
            "ଅତ୍ଯ଼ଧିକ ବର୍ଷା କାରଣରୁ ଜଳମଗ୍ନ ପରିସ୍ଥିତିକୁ ଏଡ଼ାଇବା ପାଇଁ ଏକ ଉନ୍ନତ ଜଳ ନିଷ୍କାସନ ବ୍ଯ଼ବସ୍ଥା ବିକଶିତ କରନ୍ତୁ।",
            "ଅଧିକ ଆର୍ଦ୍ରତା ଏବଂ ମେଘୁଆ ପରିସ୍ଥିତି ହେତୁ ମକା କ୍ଷେତ୍ରରେ ଏଫିଡ୍ ଘଟଣା ଘଟିପାରେ, ଯଦି ଥାଯ଼ାମେଥୋକ୍ସାମ୍ 12.6% + ଲାମ୍ବଡା-ସାଇହାଲୋଥ୍ରିନ୍ 9.5% ZC @0.25 ମିଲି/ଲିଟର ପାଣି କିମ୍ବା ଇମିଡାକ୍ଲୋପ୍ରିଡ୍ 17.8% SL @0.3 ମିଲି/ଲିଟର ପାଣି ସୂର୍ଯ୍ଯ଼କିରଣ ଦିନରେ ସ୍ପ୍ରେ କରାଯାଏ।",
            "ପଡ଼ିଆରେ ଫଲ୍ ଆର୍ମି କୃମି ଦେଖିବାକୁ ମିଳିପାରେ, ଏହାକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ ଇମାମେକ୍ଟିନ୍ ବେନ୍ଜୋଏଟ୍ 5 ପ୍ରତିଶତ ଏସ୍ଜି @0.4 ଗ୍ରାମ୍/ଲିଟର ପାଣି କିମ୍ବା କ୍ଲୋରାଣ୍ଟ୍ରାନିଲିପ୍ରୋଲ୍ 18.5% ଏସ୍ସି @0.4 ମିଲି/ଲିଟର ପାଣି ସ୍ପ୍ରେ କରାଯାଏ।"
         ]
      },
      "ragi": {
         "advisory": [
            "ଯଦି ରାଗି ସ୍ପ୍ରେ 'ଜିନେବ୍' ରେ 75 ପ୍ରତିଶତ ଡବ୍ଲ୍ୟୁ. ପି. @2 ଗ୍ରାମ୍/ଲିଟର ପାଣି କିମ୍ବା ଆକାଶ ସ୍ୱଚ୍ଛ ହେବା ସମୟରେ ଟ୍ରାଇସାଇକ୍ଲାଜୋଲ୍ 75 ପ୍ରତିଶତ ଡବ୍ଲ୍ୟୁ. ପି. @1 ଗ୍ରାମ୍/ଲିଟର ପାଣିରେ ବିସ୍ଫୋରଣ ଘଟିଥାଏ।"
         ]
      },
      "black gram": {
         "advisory": [
            "ଏହା ପ୍ରାକ୍-ରାବି କଳା ଗହମ (ବୀରି) ଏବଂ ସବୁଜ ଗହମ (ମୁଙ୍ଗ) ବୁଣିବା ସମୟ। ଏକର ପିଛା 10 କିଲୋଗ୍ରାମ ମଞ୍ଜି ବ୍ୟବହାର କରନ୍ତୁ। ବୁଣିବା ପୂର୍ବରୁ, ମଞ୍ଜିଗୁଡ଼ିକୁ ରାଇଜୋବିୟମ୍ ସଂସ୍କୃତି ସହିତ ଚିକିତ୍ସା କରିବାକୁ ହେବ। ଅନ୍ତିମ ଜମି ପ୍ରସ୍ତୁତି ସମୟରେ ଏକର ପିଛା 4 କିଲୋଗ୍ରାମ ୟୁରିଆ, 35 କିଲୋଗ୍ରାମ ଡିଏପି ଏବଂ 13 କିଲୋଗ୍ରାମ ଏମଓପି ଲଗାନ୍ତୁ। ଗଛ-ଗଛନି ମଧ୍ୟରେ 10-15 ସେ. ମି. ଦୂରତା ସହିତ 30 ସେ. ମି. ବ୍ୟବଧାନରେ ମଞ୍ଜି ବୁଣନ୍ତୁ।"
         ]
      },
      "sesame": {
         "advisory": [
            "ପ୍ରାକ୍-ରାବି ତିଲ ବୁଣିବା ପାଇଁ ଏହା ହେଉଛି ସର୍ବୋତ୍ତମ ସମଯ଼। ଏକର ପିଛା 3 କି. ଗ୍ରା. ମଞ୍ଜି ବ୍ଯ଼ବହାର କରି ଗଛଗୁଡ଼ିକ ମଧ୍ଯ଼ରେ 30 ସେ. ମି. ଏବଂ 10 ସେ. ମି. ବ୍ଯ଼ବଧାନରେ ମଞ୍ଜି ବୁଣନ୍ତୁ। ଅନ୍ତିମ ଜମି ପ୍ରସ୍ତୁତି ସମଯ଼ରେ ଏକର ପିଛା 6.5 କି. ଗ୍ରା. ଯ଼ୁରିଆ, 17 କି. ଗ୍ରା. ଡିଏପି ଏବଂ 13 କି. ଗ୍ରା. ଏମଓପି ଲଗାନ୍ତୁ।"
         ]
      },
      "ginger": {
         "advisory": [
            "ଆଗାଛା କାଟିବା ପାଇଁ ଯାଆନ୍ତୁ ଏବଂ ରୋପଣର 90 ଦିନ ପରେ ଏକର ପିଛା 54 କିଲୋଗ୍ରାମ ୟୁରିଆ ଏବଂ 33 କିଲୋଗ୍ରାମ ଏମଓପି ଲଗାନ୍ତୁ ଏବଂ ଏକର ପିଛା 2 ଟନ୍ର ମୂଲ୍ୟରେ ମଲ୍ଚିଙ୍ଗ ଲଗାନ୍ତୁ।"
         ]
      },
      "turmeric": {
         "advisory": [
            "ଆଗାଛା କାଟିବା ପାଇଁ ଯାଆନ୍ତୁ ଏବଂ ରୋପଣର 45 ଦିନ ପରେ ଏକର ପିଛା 26 କିଲୋଗ୍ରାମ ଯ଼ୁରିଆ ଲଗାନ୍ତୁ ଏବଂ ଏକର ପିଛା 2 ଟନ୍ର ହାରରେ ମଲ୍ଚିଙ୍ଗ ଲଗାନ୍ତୁ।"
         ]
      }
   },
   "date": "20-09-2024"
}