{
   "weather_details": {
      "21/09/2024": {
         "rainfall": 4,
         "t_max": 36,
         "t_min": 27,
         "rh_max": 84,
         "rh_min": 53,
         "wind_speed": 8,
         "wind_direction": 198,
         "cloud_cover": 5
      },
      "22/09/2024": {
         "rainfall": 5,
         "t_max": 36,
         "t_min": 27,
         "rh_max": 83,
         "rh_min": 53,
         "wind_speed": 8,
         "wind_direction": 180,
         "cloud_cover": 6
      },
      "23/09/2024": {
         "rainfall": 6,
         "t_max": 34,
         "t_min": 27,
         "rh_max": 82,
         "rh_min": 52,
         "wind_speed": 8,
         "wind_direction": 75,
         "cloud_cover": 7
      },
      "24/09/2024": {
         "rainfall": 10,
         "t_max": 33,
         "t_min": 26,
         "rh_max": 87,
         "rh_min": 57,
         "wind_speed": 6,
         "wind_direction": 135,
         "cloud_cover": 8
      },
      "25/09/2024": {
         "rainfall": 10,
         "t_max": 33,
         "t_min": 26,
         "rh_max": 90,
         "rh_min": 62,
         "wind_speed": 9,
         "wind_direction": 156,
         "cloud_cover": 8
      }
   },
   "names_of_crops": [
      "ଚାଉଳ",
      "ଚିନାବାଦାମ",
      "ଅରହର",
      "କାକୁଡ଼ି",
      "ପେଁପେ",
      "ମାଛ।"
   ],
   "general_advisory": "ଧାନର ଏଚ. ୱାଇ. ଭି. ପାଇଁ ପି. ଆଇ. ପର୍ଯ୍ଯ଼ାଯ଼ରେ ଏକର ପିଛା 17 କିଲୋଗ୍ରାମ ଯ଼ୁରିଆ ପ୍ରଯ଼ୋଗ କରନ୍ତୁ। ହାଲୁକା ବାଲୁକାମଯ଼ ମାଟି କ୍ଷେତ୍ରରେ, ଏକର ପିଛା 17 କିଲୋଗ୍ରାମ ଯ଼ୁରିଆ ଏବଂ 15 କିଲୋଗ୍ରାମ ଏମଓପି ଲଗାନ୍ତୁ। ହାଇବ୍ରିଡ୍ ପାଇଁ ପି. ଆଇ. ପର୍ଯ୍ଯ଼ାଯ଼ରେ 20 କିଲୋଗ୍ରାମ ଯ଼ୁରିଆ ସହିତ 20 କିଲୋଗ୍ରାମ ଏମ୍. ଓ. ପି. ପ୍ରଯ଼ୋଗ କରନ୍ତୁ। ବିଭିନ୍ନ ସ୍ଥାଯ଼ୀ ଫସଲରେ ଫଙ୍ଗାଲ୍ ଏବଂ ବ୍ଯ଼ାକ୍ଟେରିଆ ରୋଗ (ପତ୍ର ବ୍ଲାଇଟ୍, ୱିଲ୍ଟ, ଏବଂ ରଟ୍) କୁ ପରିଚାଳନା କରିବା ପାଇଁ, ପ୍ଲାଣ୍ଟୋମାଇସିନ୍ ସହିତ ଲିଟର ପିଛା 2 ଗ୍ରାମ୍/ଲିଟର ପାଣି କିମ୍ବା (କାର୍ବେନଡାଜିମ୍ + ମାନକୋଜେବ୍) ଲିଟର ପିଛା 2 ଗ୍ରାମ୍/ଲିଟର ପାଣି ସ୍ପ୍ରେ କରନ୍ତୁ। କୁକୁଡ଼ା ଫାର୍ମକୁ ପରିଷ୍କାର ପରିଚ୍ଛନ୍ନ ରଖନ୍ତୁ, ଚାଷ ପାଇଁ ରୋଗମୁକ୍ତ ଛୁଆ ବାଛନ୍ତୁ ଏବଂ କୁକୁଡ଼ା ପକ୍ଷୀ ରୋଗରୁ ରକ୍ଷା ପାଇବା ପାଇଁ ପର୍ଯ୍ଯ଼ାପ୍ତ କୁକୁଡ଼ା ଖାଦ୍ଯ଼ ଏବଂ ସ୍ୱଚ୍ଛ ଜଳ ପ୍ରଦାନ କରନ୍ତୁ। ନର୍ସରୀରେ ଟମାଟୋ ଚାଷ ପାଇଁ ସେପ୍ଟେମ୍ବର ହେଉଛି ସର୍ବୋତ୍ତମ ସମଯ଼। ବି. ଟି.-2, ବି. ଟି.-10, ବି. ଟି.-12, ନୀଳାଦ୍ରି, ସଦାବାହାର, ମାଧୁରୀ, ମହାରଥି, ରଶ୍ମୀ, ନବୀନ ଇତ୍ଯ଼ାଦି ପ୍ରତିରୋଧୀ କିସମର ଚାଷ କରନ୍ତୁ। ପନିପରିବାରେ ଶୋଷକ କୀଟ, ଫଳ ମାଛି ଏବଂ ଛେଦକ କୀଟ ଉପରେ ନଜର ରଖିବା ପାଇଁ, କୃଷକମାନଙ୍କୁ ଫେରୋମୋନ୍ ଟ୍ରାପ୍ @8nos./acre ବ୍ଯ଼ବହାର କରିବାକୁ ପରାମର୍ଶ ଦିଆଯାଇଛି।",
   "crops_data": {
      "rice": {
         "advisory": [
            "ଫୁଲ ଫୁଟିବା ଆରମ୍ଭ କରିବା ପାଇଁ ପେନିକଲ୍ ଇନିସିଏସନ",
            "ବ୍ରାଉନ୍ ପ୍ଲାଣ୍ଟ ହପର୍-ଧାନରେ ବିପିଏଚ ସଂକ୍ରମଣ ହେବାର ସମ୍ଭାବନା ରହିଛି। ଯଦି 10-15 ହପର/ପାହାଡ ଲକ୍ଷ୍ଯ଼ କରେ, ତେବେ ପାଇମେଟ୍ରୋଜିନ୍ 50 ପ୍ରତିଶତ WG @120 ଗ୍ରାମ/ଏକର କିମ୍ବା ଡାଇନୋଟେଫୁରାନ୍ 20 ପ୍ରତିଶତ SG @80 ଗ୍ରାମ/ଏକର କିମ୍ବା ଫ୍ଲୋନିକାମିଡ୍ 50 ପ୍ରତିଶତ WG @60 ଗ୍ରାମ/ଏକର କିମ୍ବା ଟ୍ରାଇଫ୍ଲୁମେଜୋପାଇରିମ୍ 10 ପ୍ରତିଶତ SC @100 ମିଲି/ଏକର ଗଛର ତଳେ ସ୍ପ୍ରେ କରନ୍ତୁ।",
            "ବ୍ୟାକ୍ଟେରିଆଲ୍ ଲିଫ୍ ବ୍ଲାଇଟ୍-ଧାନରେ ବ୍ୟାକ୍ଟେରିଆଲ୍ ଲିଫ୍ ବ୍ଲାଇଟ୍ ରୋଗ ସଂକ୍ରମଣ ହେବାର ସମ୍ଭାବନା ରହିଛି। ଯଦି ଲକ୍ଷ୍ୟ କରାଯାଏ, ତେବେ କପର୍ ହାଇଡ୍ରୋକ୍ସାଇଡ୍ 53.8% DF @600-ଗ୍ରାମ୍/ଏକର କିମ୍ବା 200-ଗ୍ରାମ୍ ପ୍ଲାଣ୍ଟୋମାଇସିନ୍ ସହିତ କପର୍ ଅକ୍ସି କ୍ଲୋରାଇଡ୍ 50% WP @600-ଗ୍ରାମ୍/ଏକର ସହିତ ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "groundnut": {
         "advisory": [
            "ପ୍ରଜନନ ପର୍ଯ୍ଯ଼ାଯ଼",
            "ଷ୍ଟେମ ରଟ୍ ରୋଗ-ବର୍ଷା ପରେ ଏହି ରୋଗର ପ୍ରକୋପ ସର୍ବାଧିକ ହୋଇଥାଏ। ଏହି ରୋଗକୁ ରୋକିବା ପାଇଁ, କାର୍ବେଣ୍ଡାଜିମ୍ 50 ପ୍ରତିଶତ ଡବ୍ଲ୍ୟୁ. ପି. @2-ଗ୍ରାମ୍/କି. ଗ୍ରା. ମଞ୍ଜି କିମ୍ବା କାରବକ୍ସିନ୍ <ଆଇ. ଡି. 1> + ଥିରମ୍ <ଆଇ. ଡି. 1> ଡି. ଏସ୍. ଡବ୍ଲ୍ୟୁ. ପି. @3-ଗ୍ରାମ୍/କି. ଗ୍ରା. ମଞ୍ଜି ବ୍ୟବହାର କରି ମଞ୍ଜି ଚିକିତ୍ସା କରାଯିବା ଉଚିତ। ଚିନାବାଦାମରେ ଷ୍ଟେମ ରୋଟ୍ ରୋଗ ପରିଚାଳନା ପାଇଁ, ଭାଲିଡାମାଇସିନ୍ 3 ପ୍ରତିଶତ ଏଲ @400-ମିଲି/ଏକର କିମ୍ବା କ୍ୟାପଟାନ 70 ପ୍ରତିଶତ + ହେକ୍ସାକୋନାଜୋଲ 5 ପ୍ରତିଶତ @300-ଗ୍ରାମ/ଏକର ସ୍ପ୍ରେ କରନ୍ତୁ। ଏହି କବକନାଶକକୁ ସିଞ୍ଚନ କରିବା ପାଇଁ ଏକର ପିଛା 200 ଲିଟର ପାଣି ଆବଶ୍ୟକ ହୋଇଥାଏ।"
         ]
      },
      "arhar": {
         "advisory": [
            "ଉଦ୍ଭିଦଗତ ପର୍ଯ୍ଯ଼ାଯ଼",
            "ଲିଫ୍ ୱେବର୍-ପ୍ରୋଫେନୋଫସ୍ 50 ପ୍ରତିଶତ ଇସି କିମ୍ବା କ୍ଲୋରପିରିଫସ୍ 50 ପ୍ରତିଶତ + ସାଇପର୍ମେଥ୍ରିନ୍ 5 ପ୍ରତିଶତ ଇସି @2 ମିଲି/ଲିଟର ପାଣି ସ୍ପ୍ରେ କରନ୍ତୁ।",
            "ଶୋଷକ କୀଟ (ଏଫିଡ୍, ଜାସିଡ୍, ଥ୍ରିପ୍ସ, ହ୍ୱାଇଟ୍ଫ୍ଲାଇ)-ଶୋଷକ କୀଟ ସାଧାରଣତଃ ପ୍ରଚଳିତ ପାଣିପାଗ ପରିସ୍ଥିତିରେ ଅଧିକ ସକ୍ରିୟ | ନିମ୍ବ-ଆଧାରିତ କୀଟନାଶକ (1500 ପିପିଏମ) ସଂକ୍ରମଣର ପ୍ରାରମ୍ଭିକ ପର୍ଯ୍ୟାୟରେ 3 ମିଲି/ଲିଟର ପାଣିରେ ସିଞ୍ଚନ କରାଯାଇପାରେ।",
            "ବିଲ୍ଟ-ବର୍ଷା କମିବା ପରେ ବିଲ୍ଟିଂ ଦେଖାଯାଇପାରେ | ଏକ ନିୟନ୍ତ୍ରଣ ପଦକ୍ଷେପ ଭାବରେ ଗଛର ମୂଳ ଅଞ୍ଚଳରେ ମେଟିରାମ୍ 75 ପ୍ରତିଶତ WG @1.5g/liter ପ୍ରୟୋଗ କରନ୍ତୁ।"
         ]
      },
      "cucurbits": {
         "advisory": [
            "ଫଳ ଦେବା ପାଇଁ ଫଳପ୍ରଦ ଉଦ୍ଭିଦ",
            "ଏପିଲାଚନା ବିଟଲ-କାକୁଡ଼ିରେ ଏପିଲାଚନା ବିଟଲକୁ ପରିଚାଳନା କରିବା ପାଇଁ, ସଂକ୍ରମଣର ପ୍ରାରମ୍ଭିକ ପର୍ଯ୍ୟାୟରେ ନିମ୍ବ-ଆଧାରିତ କୀଟନାଶକ (ନିମ୍ବ ତେଲ 1500 ପିପିଏମ) ଲିଟର ପିଛା 3 ମିଲି ପାଣି ସ୍ପ୍ରେ କରନ୍ତୁ। ଏପିଲାକ୍ନା ବିଟଲ୍କୁ ରାସାୟନିକ ଭାବେ ପରିଚାଳନା କରିବା ପାଇଁ କ୍ଲୋରପିରିଫସ୍ 20 ପ୍ରତିଶତ ଇସି @2 ମିଲି/ଲିଟର ପାଣି କିମ୍ବା ପ୍ରୋଫେନୋଫସ୍ 50 ପ୍ରତିଶତ ଇସି @2 ମିଲି/ଲିଟର ପାଣି ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "papaya": {
         "advisory": [
            "ଫଳ ଦେବା ପାଇଁ ଫଳପ୍ରଦ ଉଦ୍ଭିଦ",
            "ମିଳି ବଗ-ସଂକ୍ରମଣର ପ୍ରାରମ୍ଭିକ ପର୍ଯ୍ଯ଼ାଯ଼ରେ ମିଳି ବଗକୁ ପରିଚାଳନା କରିବା ପାଇଁ, ନିମ-ଆଧାରିତ କୀଟନାଶକ (ନିମ ତେଲ 1500 ପିପିଏମ @30-ମିଲି/10 ଲିଟର ପାଣି କିମ୍ବା କୀଟନାଶକ ସାବୁନ ସ୍ପ୍ରେ କରନ୍ତୁ। ଗୁରୁତର ସଂକ୍ରମଣ କ୍ଷେତ୍ରରେ, ପ୍ରୋଫେନ୍ଫସ୍ 50 ପ୍ରତିଶତ ଇସି @20-ମିଲି/10-ଲିଟର ପାଣି କିମ୍ବା ଥିଯ଼ାମେଥୋକ୍ସାମ୍ 25 ପ୍ରତିଶତ ଡବ୍ଲୁଜି @3-ଗ୍ରାମ୍/10-ଲିଟର ପାଣି ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "fish": {
         "advisory": [
            "ପୋଖରୀରେ ଅମ୍ଳଜାନର ଅଭାବ ହେଲେ, ମାଛଗୁଡ଼ିକ ଭୂପୃଷ୍ଠ ଜଳ ଉପରକୁ ଆସି ସେମାନଙ୍କ ମୁହଁ ଦେଇ ଘୁଞ୍ଚିବାକୁ ଆରମ୍ଭ କରିବେ | ଆଦର୍ଶ ଦ୍ରବୀଭୂତ ଅମ୍ଳଜାନ ପ୍ରାୟ 5 ମି. ଗ୍ରା./ଲି.। ଏକ ଏରେଟର ବ୍ୟବହାର କରି ଏହାକୁ ବଜାୟ ରଖାଯାଇପାରିବ। ବାୟୁ ସଞ୍ଚାରଣର ଏକ ସରଳ ଉପାୟ ହେଉଛି ପୁଷ୍କରିଣୀର ଜଳ ସଞ୍ଚାଳନ କରିବା। ଏହା ଏକ ପମ୍ପ ବ୍ୟବହାର କରି କରାଯାଇପାରିବ ଯାହା ପୁଷ୍କରିଣୀର ତଳ ପୃଷ୍ଠରୁ ପାଣି ନେଇ ସେହି ପୋଖରୀରେ ଛିଞ୍ଚି ପାରିବ |"
         ]
      }
   },
   "date": "20-09-2024"
}