{
   "weather_details": {
      "2024-09-21": {
         "rainfall": 5,
         "t_max": 33,
         "t_min": 24,
         "rh_max": 93,
         "rh_min": 66,
         "wind_speed": 4,
         "wind_direction": 195,
         "cloud_cover": 5
      },
      "2024-09-22": {
         "rainfall": 7,
         "t_max": 33,
         "t_min": 25,
         "rh_max": 94,
         "rh_min": 60,
         "wind_speed": 5,
         "wind_direction": 135,
         "cloud_cover": 6
      },
      "2024-09-23": {
         "rainfall": 10,
         "t_max": 32,
         "t_min": 25,
         "rh_max": 92,
         "rh_min": 59,
         "wind_speed": 4,
         "wind_direction": 165,
         "cloud_cover": 7
      },
      "2024-09-24": {
         "rainfall": 15,
         "t_max": 32,
         "t_min": 25,
         "rh_max": 94,
         "rh_min": 70,
         "wind_speed": 4,
         "wind_direction": 158,
         "cloud_cover": 8
      },
      "2024-09-25": {
         "rainfall": 15,
         "t_max": 31,
         "t_min": 24,
         "rh_max": 96,
         "rh_min": 77,
         "wind_speed": 5,
         "wind_direction": 156,
         "cloud_cover": 8
      }
   },
   "names_of_crops": [
      "ଚାଉଳ",
      "ମକା",
      "ଉଦ୍ୟାନ କୃଷି",
      "ପଶୁପାଳନ",
      "କୁକୁଡ଼ା ମାଂସ"
   ],
   "general_advisory": "ବର୍ଷା ଏବଂ ଆର୍ଦ୍ର ପାଗ, ଉଚ୍ଚ ସକାଳ ଆରଏଚ (> 85 ପ୍ରତିଶତ) ଏବଂ ଜଳ ପରିପୂର୍ଣ୍ଣ ମୃତ୍ତିକା କୁକୁଡ଼ା ପନିପରିବାରେ ଡାଉନି ମାଇଲ୍ଡ୍ୟୁ ରୋଗକୁ ପସନ୍ଦ କରେ | କୁକୁଡ଼ାରେ ଡାଉନି ମାଇଲ୍ଡ୍ୟୁ ରୋଗ ପରିଚାଳନା କରିବା ପାଇଁ 10 ଦିନ ବ୍ୟବଧାନରେ ଦୁଇଥର ମେଟାଲାକ୍ସିଲ୍ @2-ଗ୍ରାମ୍/ଲିଟର କିମ୍ବା ଏଜୋକ୍ସିସ୍ଟ୍ରୋବିନ୍ @1-ଗ୍ରାମ୍/ଲିଟର କିମ୍ବା କପର ଅକ୍ସିକ୍ଲୋରାଇଡ୍ 50% ଡବ୍ଲ୍ୟୁ. ପି. @3-ଗ୍ରାମ୍/ଲିଟର ସ୍ପ୍ରେ କରନ୍ତୁ।",
   "crops_data": {
      "rice": {
         "advisory": [
            "ବିସ୍ପିରିବାକ୍ ସୋଡ଼ିଅମ୍ 10 ଏସ୍. ସି. <ଆଇ. ଡି. 3> ଏମ୍. ଏଲ୍./ଏକରକୁ <ଆଇ. ଡି. 1> ଡି. ଏ. ଟି. ରେ ଲଗାନ୍ତୁ (2-3 ପତ୍ର ପର୍ଯ୍ଯ଼ାଯ଼) କିମ୍ବା ସ୍ପ୍ରେ ପ୍ରସ୍ତୁତ ମିଶ୍ରଣ ପେନୋକ୍ସୁଲାମ୍ + ସାଇହାଲୋଫପ୍ ବୁଟାଇଲ୍ @900 ଏମ୍. ଏଲ୍./ଏକର କିମ୍ବା ସ୍ପ୍ରେ ଟ୍ଯ଼ାଙ୍କ୍ ମିଶ୍ରଣ ଫେନୋକ୍ସାପ୍ରୋପ୍-ଇଥାଇଲ 240 ଗ୍ରାମ୍ + ଇଥୋକ୍ସିସଲ୍ଫୁରନ୍ 50 ଗ୍ରାମ୍ ପ୍ରତି ଏକରକୁ <ଆଇ. ଡି. 2> ଡି. ଏ. ଟି. ରେ ରୋପଣର 15-20 ଦିନ ପରେ 16 ଲିଟର କ୍ଷମତା ବିଶିଷ୍ଟ ସ୍ପ୍ରେଯ଼ରର 8ଟି ଟ୍ଯ଼ାଙ୍କିରେ ଲଗାନ୍ତୁ। ଅଗଭୀର ତଳିଆ/ମଧ୍ଯ଼ମ ଧରଣର ଜମିରେ ଧାନ ରୋପଣ ସମଯ଼ରେ ଏଚ. ୱାଇ. ଭି. ପାଇଁ ଏକର ପିଛା 35 କିଲୋଗ୍ରାମ ଯ଼ୁରିଆ ଏବଂ ହାଇବ୍ରିଡ୍ ପାଇଁ ଏକର ପିଛା 42 କିଲୋଗ୍ରାମ ଯ଼ୁରିଆ ପ୍ରଯ଼ୋଗ କରନ୍ତୁ।"
         ]
      },
      "maize": {
         "advisory": [
            "ଶରତ ଋତୁର ପରିଚାଳନା ପାଇଁ ସେନା କୃମି କୀଟ 200 ଲିଟର ପାଣିରେ ମିଶାଇ ଏକର ପିଛା 1200 ଗ୍ରାମ୍ ବାଯ଼ୋପଷ୍ଟିସାଇଡ୍ ବିଉଭେରିଆ ବାସିଆନା ସ୍ପ୍ରେ କରନ୍ତୁ। ଏକର ପିଛା 10-12 ପକ୍ଷୀ ପର୍ଚ୍ ବ୍ଯ଼ବହାର କରନ୍ତୁ ଏବଂ ଟାସେଲିଂ ପର୍ଯ୍ଯ଼ାଯ଼ ପୂର୍ବରୁ ସେଗୁଡ଼ିକୁ ବାହାର କରନ୍ତୁ | ପତ୍ର ଚକ୍ର ଭିତରେ ବାଲି, ମାଟି ଏବଂ କାଠର ଛାଇର ଧୂଳି ମିଶ୍ରଣ ଯାହା ଦ୍ୱାରା କ୍ଯ଼ାଟର୍ପିଲାର୍ମାନେ ପତ୍ରକୁ ଖାଇପାରିବେ ନାହିଁ | ରାସାଯ଼ନିକ ଉପାଯ଼ରେ ଏହି କୀଟକୁ ନିଯ଼ନ୍ତ୍ରଣ କରିବା ପାଇଁ ଇମାମେକ୍ଟିନ୍ ବେନ୍ଜୋଏଟ୍ 5 ପ୍ରତିଶତ ଏସ୍. ଜି. @80-ଗ୍ରାମ୍/ଏକର କିମ୍ବା ସ୍ପିନେଟୋରାମ୍ <ଆଇ. ଡି. 2> ଏସ୍. ସି. @100-ମିଲି/ଏକର କିମ୍ବା କ୍ଲୋରାଣ୍ଟ୍ରାନିଲିପ୍ରୋଲ୍ <ଆଇ. ଡି. 1> ଏସ୍. ସି. @80-ମିଲି/ଏକରକୁ 200-ଲିଟର ପାଣିରେ ମିଶାଇ ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "horticulture": {
         "advisory": [
            "ପେୟାରା ଫଳ ସଡ଼ିବା ଦ୍ୱାରା ସଂକ୍ରମିତ ହେବାର ସମ୍ଭାବନା ରହିଛି। ବର୍ଷା କିମ୍ବା ଜଳସେଚନ ଜଳ ଗଛର ଅବବାହିକା ନିକଟରେ ଛିଡ଼ା ହେବାକୁ ଦେବା ଉଚିତ ନୁହେଁ। ସଂକ୍ରମିତ ଗଛର ଅଂଶକୁ କାଟି ଦିଅନ୍ତୁ ଏବଂ ବ୍ଲିଟାକ୍ସ 3 ଗ୍ରାମ/1 ଲିଟର ପାଣି ସ୍ପ୍ରେ କରନ୍ତୁ, ଫଳ ସେଟ୍ ହେବାର 20 ଦିନ ପରେ ଏହାକୁ ପୁନରାବୃତ୍ତି କରନ୍ତୁ ଏବଂ ପରିପକ୍ୱତା ପର୍ଯ୍ୟନ୍ତ ଜାରି ରଖନ୍ତୁ | ସଡି ଯାଇଥିବା ଏବଂ ମମି କରାଯାଇଥିବା ପେୟାରା ସଂଗ୍ରହ କରି ପୋତିଦେବା ଆବଶ୍ୟକ। (ପାଣିପାଗ ସ୍ୱଚ୍ଛ ଥିବାବେଳେ ଆବେଦନ ପାଇଁ ଯାଆନ୍ତୁ)"
         ]
      },
      "livestock": {
         "advisory": [
            "ଆଭ୍ଯ଼ନ୍ତରୀଣ ପରଜୀବୀଗୁଡ଼ିକର ଭାର ହ୍ରାସ କରିବା ପାଇଁ ସେଗୁଡ଼ିକୁ ପତଳା କରନ୍ତୁ। ବାହ୍ଯ଼ ପରଜୀବୀ ବିରୁଦ୍ଧରେ ମେଣ୍ଢା କ୍ଷେତ୍ରରେ ଡିପିଂ କରାଯିବା ଉଚିତ୍ | ବର୍ଷା ସମଯ଼ରେ ପଶୁମାନଙ୍କୁ ଘର ଭିତରେ ରଖନ୍ତୁ ଏବଂ ସ୍ୱଚ୍ଛ ତଥା ସ୍ୱାସ୍ଥ୍ଯ଼କର ପାଣି ଯୋଗାଇ ଦିଅନ୍ତୁ ଏବଂ ବର୍ଷା ଋତୁରେ ମେଣ୍ଢା ଏବଂ ଛେଳି ପାଇଁ ଘରେ ଶୁଖିଲା ପଶୁଖାଦ୍ଯ଼ ଏବଂ ନଡ଼ିଆ ପ୍ରସ୍ତୁତ ରଖନ୍ତୁ | ଦଯ଼ା କରି ମଜା କରିବା ଏବଂ ଲାମ୍ବାଙ୍ଗ କରିବାର ଏକ ମାସ ପୂର୍ବରୁ ମେଣ୍ଢା ଏବଂ ଛେଳିଙ୍କୁ ସନ୍ତୁଳିତ ଏକାଗ୍ରତା ଦେବା ପାଇଁ ଫ୍ଲାଶିଂ ଅଭ୍ଯ଼ାସ ନିଶ୍ଚିତ କରନ୍ତୁ |"
         ]
      },
      "poultry": {
         "advisory": [
            "ବର୍ଷା ଋତୁରେ ଚିକେନ୍ କୋକ୍ସିଡିଓସିସ୍ ଅନୁଭବ କରିପାରେ, ନିକଟତମ ପଶୁ ଚିକିତ୍ସା ବିଶେଷଜ୍ଞଙ୍କ ସୁପାରିଶ ସହିତ ଚିକେନ୍ ଫିଡରେ କୋକ୍ସିଡିଓଷ୍ଟାଟ ଦିଅନ୍ତୁ |"
         ]
      }
   },
   "date": "20-09-2024"
}