{
   "weather_details": {
      "20.12.2024": {
         "rainfall": 0,
         "t_max": 25,
         "t_min": 15,
         "rh_max": 85,
         "rh_min": 60,
         "wind_speed": 10,
         "wind_direction": 120,
         "cloud_cover": 3
      }
   },
   "names_of_crops": [
      "ସୋରିଷ",
      "କାକୁଡ଼ି",
      "ଭାରତୀୟ ବିନ୍",
      "ପାଳଙ୍ଗ ଶାଗ",
      "ରସୁଣ",
      "ଆଳୁ",
      "ଫୁଲକୋବି",
      "ପଶୁପାଳନ"
   ],
   "general_advisory": "ରୋଗରୁ ରକ୍ଷା ପାଇବା ପାଇଁ ଶୀତ ଋତୁରେ ପଶୁମାନଙ୍କ ପାଇଁ ଭଲ ଭେଣ୍ଟିଲେସନ୍ ସୁନିଶ୍ଚିତ କରନ୍ତୁ।",
   "crops_data": {
      "mustard": {
         "advisory": [
            "ମଷ୍ଟ୍ ଆର୍ଡ୍ ଫସଲରେ ସଫ୍ଲାଇ ସଂକ୍ରମଣ ହେବାର ସମ୍ଭାବନା ରହିବ। ଏହି କୀଟକୁ ପରିଚାଳନା କରିବା ପାଇଁ, ବୀଜ ଲିଙ୍ଗ ପର୍ଯ୍ୟାୟରେ (3 ରୁ 4 ସପ୍ତାହ) ଜଳସେଚନ କରାଯିବା ଉଚିତ କାରଣ ଅଧିକାଂଶ ଲାର୍ଭା ଡୁଙ୍ଗିଙ୍ଗ ପ୍ରଭାବ ହେତୁ ମରିଯାଏ | ମୋର ନିଙ୍ଗ ଏବଂ ସନ୍ଧ୍ୟା ସମୟରେ ହାତ ଦ୍ୱାରା ସାଫ୍ଲାଇର ଗ୍ରବ୍ ସଂଗ୍ରହ ଏବଂ ନଷ୍ଟ କରନ୍ତୁ |",
            "ସୋରଫ୍ଲାଇକୁ ପରିଚାଳନା କରିବା ପାଇଁ ଇଥୋଫେନପ୍ରୋକ୍ସ 10 ପ୍ରତିଶତ ଇସି @200-ମିଲି/ଏକର କିମ୍ବା କ୍ଲୋରପିରିଫସ୍ 50 ପ୍ରତିଶତ + ସାଇପର୍ମେଥ୍ରିନ 5 ପ୍ରତିଶତ ଇସି @400 ମିଲି/ଏକରକୁ 200 ଲିଟର ପାଣିରେ ମିଶାଇ ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "cucurbits": {
         "advisory": [
            "ବର୍ତ୍ତମାନର ନିମ୍ନ ତାପମାତ୍ରା ଏବଂ କୁହୁଡ଼ି ପରିସ୍ଥିତି ହେତୁ ଡାଉନି ଫଙ୍ଗୁର ସଂକ୍ରମଣ ବୃଦ୍ଧି ପାଇବ। କାକୁଡ଼ିରେ ଏହି ରୋଗକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ, ମେଟାଲ୍ୟାକ୍ସିଲ 8 ପ୍ରତିଶତ + ମାନକୋଜେବ 64 ପ୍ରତିଶତ ଡବ୍ଲ୍ୟୁ. ପି. @400 ଗ୍ରାମ/ଏକର କିମ୍ବା ଫୋସେଟାଇଲ-ଏ. ଏଲ୍. 80 ପ୍ରତିଶତ ଡବ୍ଲ୍ୟୁ. ପି. @600 ଗ୍ରାମ/ଏକର ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "indian bean": {
         "advisory": [
            "ପ୍ରାରମ୍ଭିକ ପର୍ଯ୍ୟାୟରେ ଏଫିଡ୍ ପରିଚାଳନା କରିବାକୁ, ଏକର ପିଛା 8 ଟି ହଳଦିଆ ଷ୍ଟିକ୍ ଟ୍ରାପ୍ ଲଗାନ୍ତୁ | 200 ଲିଟର ପାଣିରେ ମିଶାଇ ନିମ୍ବ ଆଧାରିତ କୀଟନାଶକ 15000 ପିପି ଏମ୍ @600 ମିଲି/ଏକର ସ୍ପ୍ରେ କରନ୍ତୁ। ଯଦି ରାସାୟନିକ କୀଟନାଶକ ଥିୟାମେଥୋକ୍ସାମ 2% ଡବ୍ଲୁ. ଜି. @50 ଗ୍ରାମ୍/ଏକର କିମ୍ବା ଏସିଟାମିପ୍ରିଡ୍ 20% ଏସ. ପି. @50 ଗ୍ରାମ୍/ଏକର 200-ଲିଟର ପାଣିରେ ସିଞ୍ଚନ କରିବା ଅପେକ୍ଷା ଗୁରୁତର ହୋଇଥାଏ।"
         ]
      },
      "spinach": {
         "advisory": [
            "ପାଳକର କେତେକ ପ୍ରଜାତି ହେଉଛି ପୁସା ପାଲକ୍, ଅଲ୍ ଗ୍ରୀନ୍, ପୁସା ଜ୍ୟୋତି, ପୁସା ହରିତ, କୋମଲ, ପଞ୍ଜାବ ଗ୍ରୀନ୍। ପାଲା କେ ଚାଷ ପାଇଁ ଏକର ପିଛା 1012 କିଲୋଗ୍ରାମ ମଞ୍ଜି ଆବଶ୍ୟକ ହୋଇଥାଏ। 20 ସେ. ମି. ଏବଂ 2ରୁ 3 ସେ. ମି. ଗଭୀରତାରେ ରେଖା ରୋପଣ କରାଯାଇଥାଏ। ଚାଲନ୍ତୁ ବୀଜ ଚିକିତ୍ସା ଏବଂ ପାଲକର ବୁଣିବା ସମୟ ବିଷୟରେ ଆଲୋଚନା କରିବା। ବୁଣିବା ପୂର୍ବରୁ 10-12 ଉର୍ ପାଇଁ ମଞ୍ଜିଗୁଡ଼ିକୁ ପାଣିରେ ଭିଜାଇ ରଖନ୍ତୁ।"
         ]
      },
      "garlic": {
         "advisory": [
            "ବର୍ତ୍ତମାନ ଏହା ଗାର୍ଲି ରୋପଣ ପାଇଁ ଉପଯୁକ୍ତ ସମୟ। କେତେକ ପ୍ରକାରର ରସୁଣ ମଧ୍ୟରେ ଏଗ୍ରିଫାଉଣ୍ଡ୍ ହ୍ୱାଇଟ୍, ଜମୁନା ସାଫେଡ୍ (ଜି-1), ଜି-282, ଏଗ୍ରିଫାଉଣ୍ଡ୍ ପାର୍ବତୀ (ଜି-323) ଇତ୍ୟାଦି ଅନ୍ତର୍ଭୁକ୍ତ। ରସୁଣରେ, ଚାଷ ପାଇଁ ଏକର ପିଛା କେ. ଜି. ଲବଙ୍ଗ ଆବଶ୍ୟକ ହୋଇଥାଏ।",
            "ରସୁଣ ଲବଙ୍ଗକୁ ପ୍ରତି କିଲୋଗ୍ରାମ ମଞ୍ଜି ପିଛା 2 ଗ୍ରାମ୍ କାର୍ବେନଡାଜିମ୍ ସହିତ ଚିକିତ୍ସା କରାଯିବା ଉଚିତ୍। ରସୁଣ ପାଇଁ ଧାଡ଼ି ମଧ୍ୟରେ 15 ସେ. ମି. ଏବଂ ଧାଡ଼ି ମଧ୍ୟରେ 8 ସେ. ମି. ର ବ୍ୟବଧାନ ସର୍ବୋତ୍ତମ।"
         ]
      },
      "potato": {
         "advisory": [
            "ଆଳୁ ଫସଲରେ ଅର୍ଲି ଲିଫ୍ ବ୍ଲାଇଟ୍ ରୋଗ ହେବାର ସମ୍ଭାବନା ରହିଛି। ଆଳୁରେ ଶୀଘ୍ର ପତ୍ର ରୋଗକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ, ଏକର ପିଛା ମାନକୋଜେବ୍ 75 ପ୍ରତିଶତ ଡବ୍ଲୁ. ପି. @600 ଗ୍ରାମ୍ କିମ୍ବା କାର୍ବେଣ୍ଡାଜିମ୍ 12 ପ୍ରତିଶତ + ମାନକୋଜେବ୍ 63 ପ୍ରତିଶତ ଡବ୍ଲୁ. ପି. @400 ଗ୍ରାମ୍ ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "cauliflower": {
         "advisory": [
            "କୋଇଲା ଫସଲରେ ଆଲ୍ଟରନେରିଆ ଲିଫ୍ ସ୍ପଟ୍ ରୋଗକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ ମାଙ୍କୋଜେବ୍ ସ୍ପ୍ରେ 75 ପ୍ରତିଶତ ଡବ୍ଲ୍ୟୁ. ପି. @600-ଗ୍ରାମ୍/ଏକର କିମ୍ବା କାର୍ବେଣ୍ଡାଜିମ୍ 12 ପ୍ରତିଶତ + ମାଙ୍କୋଜେବ୍ 63 ପ୍ରତିଶତ ଡବ୍ଲ୍ୟୁ. ପି. @400-ଗ୍ରାମ୍/ଏକରକୁ 200-ଲିଟର ପାଣିରେ ମିଶାଇ ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "animal husbandry": {
         "advisory": [
            "ପଶୁମାନଙ୍କର ଛପର ଓ ତା 'ର ଚଟାଣ ଓଦା ରହିବା ଉଚିତ ନୁହେଁ, ଏବଂ ଅଧିକ ସମୟ ପର୍ଯ୍ୟନ୍ତ ଥଣ୍ଡା ରହିବା ଉଚିତ, ଏହା ପଶୁମାନଙ୍କୁ, ବିଶେଷ କରି ଯୁବକମାନଙ୍କୁ, ନିମୋନିଆ, ଜ୍ୱର, କୋକ୍ସିଡିଓସିସ୍, ତରଳ ଝାଡ଼ା ଭଳି ବିଭିନ୍ନ ରୋଗ ଏବଂ ଏପରିକି ଗୁରୁତର କ୍ଷେତ୍ରରେ ଡି. ଇଥ୍ ଭଳି ରୋଗର ସମ୍ମୁଖୀନ କରାଇପାରେ। ଶୀତ ଋତୁରେ ଭଲ ଭେଣ୍ଟିଲେସନ୍ ସୁନିଶ୍ଚିତ କରାଯିବା ଆବଶ୍ୟକ।"
         ]
      }
   },
   "date": "20-12-2024"
}