{
   "weather_details": {
      "21/12/2024": {
         "rainfall": 18,
         "t_max": 23,
         "t_min": 21,
         "rh_max": 91,
         "rh_min": 68,
         "wind_speed": 15,
         "wind_direction": 23,
         "cloud_cover": 8
      },
      "22/12/2024": {
         "rainfall": 15,
         "t_max": 24,
         "t_min": 21,
         "rh_max": 90,
         "rh_min": 55,
         "wind_speed": 16,
         "wind_direction": 22,
         "cloud_cover": 7
      },
      "23/12/2024": {
         "rainfall": 2,
         "t_max": 23,
         "t_min": 20,
         "rh_max": 79,
         "rh_min": 41,
         "wind_speed": 22,
         "wind_direction": 16,
         "cloud_cover": 6
      }
   },
   "names_of_crops": [
      "ଧାନ।",
      "କପା",
      "ଆଖୁ",
      "ବାଇଗଣ",
      "ଫୁଲକୋବି"
   ],
   "general_advisory": "ଶନିବାର ଏବଂ ରବିବାର ଦିନ ହାଲୁକା ରୁ ମଧ୍ୟମ ବର୍ଷା ହୋଇପାରେ ଏବଂ ସାଧାରଣତଃ ମେଘୁଆ ରୁ ମେଘୁଆ ଆକାଶ ହୋଇପାରେ | ଅମଳ ହୋଇଥିବା ଧାନକୁ ବର୍ଷାରୁ ସୁରକ୍ଷିତ ରଖିବା ପାଇଁ ପଲିଥିନ୍ ଥିବା ଏକ ସୁରକ୍ଷିତ ସ୍ଥାନରେ ରଖନ୍ତୁ। ବିଳମ୍ବ ଅବଧି ଧାନ ଫସଲରେ ଅତିରିକ୍ତ ବର୍ଷା ଜଳ ନିଷ୍କାସନ ପାଇଁ ଗଲି (ପାହି) ତିଆରି କରି ବ୍ୟବସ୍ଥା କରନ୍ତୁ ଏବଂ ଡ୍ରେନ୍ ପ୍ରାନ୍ତକୁ ଖୋଲା ରଖନ୍ତୁ |",
   "crops_data": {
      "paddy": {
         "advisory": [
            "ଧାନ ପାଇଁ ଆର୍ଦ୍ର ନର୍ସରୀ ମଞ୍ଜି ପ୍ରସ୍ତୁତ କରନ୍ତୁ। ବର୍ଷା ଜଳ ବ୍ୟବହାର କରି, ନର୍ସରୀ ଶଯ୍ୟାଗୁଡ଼ିକ 2 ରୁ 3 ଥର କାଦୁଅ ହୋଇ ଯାଇପାରେ ଏବଂ ତା 'ପରେ ପ୍ଲାଙ୍କିଙ୍ଗ୍ ହୋଇପାରେ | ଶେଷ ପୁଡଲିଂ ସମୟରେ 200 କିଲୋଗ୍ରାମ ଏଫ୍. ଆଇ. ଏମ୍., 4 କିଲୋଗ୍ରାମ ଡି. ଏ. ପି., 2.5 କିଲୋଗ୍ରାମ ଏମ୍. ଓ. ପି. ଏବଂ 1 କିଲୋଗ୍ରାମ ଜିଙ୍କ୍ ସଲଫେଟ୍ ଲଗାନ୍ତୁ। ନର୍ସରୀ ଅଞ୍ଚଳକୁ ସୁବିଧାଜନକ ଦୈର୍ଘ୍ୟର ଛୋଟ ଛୋଟ ପ୍ଲଟରେ ବିଭକ୍ତ କରନ୍ତୁ। ଜଳସେଚନ/ଜଳ ନିଷ୍କାସନ ଉଦ୍ଦେଶ୍ୟରେ ଶଯ୍ୟା ସହିତ 30 ସେ. ମି. ଓସାରର ଜଳସେଚନ ଚ୍ୟାନେଲ ନିର୍ମାଣ କରାଯିବା ଉଚିତ। ପ୍ରତ୍ୟେକ ଧାଡ଼ି ମଧ୍ୟରେ 5 ସେ. ମି. ବ୍ୟବଧାନ ସହିତ ଧାଡ଼ି ବୁଣିବା ଦ୍ୱାରା ଅଙ୍କୁରିତ ମଞ୍ଜି ବୀଜ ଶଯ୍ୟାର @40-50 ଗ୍ରାମ୍/ମି2 ଅଞ୍ଚଳରେ ବୁଣାଯିବା ଉଚିତ।"
         ]
      },
      "sugarcane": {
         "advisory": [
            "ଓଡ଼ିଶାର ଜଳବାୟୁ ଅନୁସାରେ ଆଖୁ ଚାଷ ପାଇଁ ନଭେମ୍ବରରୁ ଫେବୃଆରୀ ହେଉଛି ସର୍ବୋତ୍ତମ ସମୟ। ଭଲ ଜଳସେଚନ ସୁବିଧା ଥିବା ଭଲ ଭାବେ ଜଳ ନିଷ୍କାସନ ହେଉଥିବା ମାଟିରେ ଆଖୁ ଚାଷ କରିବାକୁ କୃଷକମାନଙ୍କୁ ପରାମର୍ଶ ଦିଆଯାଇଛି।"
         ]
      },
      "brinjal": {
         "advisory": [
            "ଫଳ ଏବଂ ଅଙ୍କୁର ଛେଦକ ପାଇଁ ଉଦ୍ଭିଦଜାତଃ ବାଇଗଣରେ ଫଳ ଏବଂ ଅଙ୍କୁର ଛେଦକକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ, ପ୍ରାରମ୍ଭିକ ପର୍ଯ୍ୟାୟରେ ନିମ୍ବ ଆଧାରିତ କୀଟନାଶକ 1500 ପିପିଏମ @600ml ଏକର ସ୍ପ୍ରେ କରନ୍ତୁ। ପରେ ଶୁଷ୍କ ପାଗରେ 15 ଦିନ ବ୍ୟବଧାନରେ 45 ପ୍ରତିଶତ ଏସ୍. ସି. @70ml ଏକର ଏବଂ Thiodicarb@300g ଏକରର ବିକଳ୍ପ ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "cauliflower": {
         "advisory": [
            "ଉଦ୍ଭିଦ-ଫଳ ଗଠନର ପର୍ଯ୍ୟାୟ ବ୍ରାଉନିଙ୍ଗ୍ କିମ୍ବା ବ୍ରାଉନ୍ ରଟ୍ଃ ବ୍ରାଉନ୍ ରଟ୍ କୁ ରୋକିବା ପାଇଁ କୋଲ୍ ଫସଲରେ ରୋପଣ ସମୟରେ ମାଟି ପ୍ରୟୋଗ ଭାବରେ ଏକର ପିଛା 4 କେଜି ବୋରାକ୍ସ ଲଗାନ୍ତୁ | ଯଦି ଚାରା ରୋପଣ ସମୟରେ ବୋରାକ୍ସ ପ୍ରୟୋଗ କରାଯାଇନଥାଏ, ତେବେ ବୋରାକ୍ସ @2.5 ଗ୍ରାମ/ଲିଟର କିମ୍ବା ଫୋଲିବୋର/ସଲ୍ୟୁବର @1.5 ଗ୍ରାମ/ଲିଟର ସ୍ପ୍ରେ କରନ୍ତୁ। ପ୍ରତିରୋପଣର ଦୁଇ ସପ୍ତାହ ପରେ ଏବଂ ଦହି ତିଆରି ହେବାର ଦୁଇ ସପ୍ତାହ ପୂର୍ବରୁ ବୋରନ ମାଇକ୍ରୋ ନ୍ୟୁଟ୍ରିଏଣ୍ଟ ସିଞ୍ଚନ କରାଯିବା ଉଚିତ।"
         ]
      }
   },
   "date": "20-12-2024"
}