{
   "weather_details": {
      "21-12-2024": {
         "rainfall": 7,
         "t_max": 27,
         "t_min": 19,
         "rh_max": 56,
         "rh_min": 89,
         "wind_speed": 5,
         "wind_direction": 54,
         "cloud_cover": 5
      },
      "22-12-2024": {
         "rainfall": 3,
         "t_max": 27,
         "t_min": 19,
         "rh_max": 43,
         "rh_min": 84,
         "wind_speed": 5,
         "wind_direction": 52,
         "cloud_cover": 5
      },
      "23-12-2024": {
         "rainfall": 1,
         "t_max": 28,
         "t_min": 18,
         "rh_max": 31,
         "rh_min": 78,
         "wind_speed": 5,
         "wind_direction": 50,
         "cloud_cover": 3
      },
      "24-12-2024": {
         "rainfall": 0,
         "t_max": 28,
         "t_min": 19,
         "rh_max": 29,
         "rh_min": 71,
         "wind_speed": 5,
         "wind_direction": 70,
         "cloud_cover": 1
      },
      "25-12-2024": {
         "rainfall": 1,
         "t_max": 28,
         "t_min": 19,
         "rh_max": 28,
         "rh_min": 68,
         "wind_speed": 4,
         "wind_direction": 67,
         "cloud_cover": 1
      }
   },
   "names_of_crops": [
      "ଖରିଫ ଚାଉଳ",
      "ଗ୍ରୀଷ୍ମକାଳୀନ ଚାଉଳ",
      "ସବୁଜ ଚଣା/କଳା ଚଣା",
      "ମାଟି ବାଦାମ",
      "କୋଲେ ଫସଲ",
      "ପଶୁପାଳନ",
      "କୁକୁଡ଼ା ମାଂସ"
   ],
   "general_advisory": "ସେହି ଅନୁଯାୟୀ ଅମଳ, ବୁଣିବା ଏବଂ ସିଞ୍ଚନ କାର୍ଯ୍ୟ କରିବାକୁ କୃଷକମାନଙ୍କୁ ପରାମର୍ଶ ଦିଆଯାଇଛି। ସେମାନେ ଫସଲ ଏବଂ ପଶୁମାନଙ୍କୁ ଥଣ୍ଡାରୁ ରକ୍ଷା କରିବା ପାଇଁ ବ୍ୟବସ୍ଥା କରିବା ଉଚିତ୍। ସୋରିଷ, ତିଲ, ଚଣା, ଚିନାବାଦାମ, ସବୁଜ ଚଣା/କଳା ଚଣା ଇତ୍ୟାଦି ରବି ଫସଲ ବୁଣିବା ଏବଂ ଜଳସେଚନ ସୁବିଧା ଉପଲବ୍ଧ ଥିବା ଗ୍ରୀଷ୍ମ ଧାନର ନର୍ସରୀ ବୁଣିବା ଆରମ୍ଭ କରିବା।",
   "crops_data": {
      "kharif rice": {
         "advisory": [
            "ଆଗାମୀ ଦିନର ପ୍ରଥମାର୍ଦ୍ଧରେ କିଛି ବର୍ଷା ହେବାର ସମ୍ଭାବନା ରହିଛି, ତେଣୁ କୃଷକମାନଙ୍କୁ ଅମଳ କାର୍ଯ୍ୟ ପାଇଁ ଅପେକ୍ଷା କରିବାକୁ ଏବଂ ଅଧିକ କ୍ଷତି ଏଡ଼ାଇବା ପାଇଁ ଅମଳ ହୋଇଥିବା ଧାନ ଫସଲକୁ ସୁରକ୍ଷିତ ସ୍ଥାନରେ ରଖିବା ପାଇଁ ବ୍ୟବସ୍ଥା କରିବାକୁ ପରାମର୍ଶ ଦିଆଯାଇଛି।",
            "ଅଧିକ ସମୟ ଧରି ଧାନ/ଚାଉଳର ସୁରକ୍ଷିତ ସଂରକ୍ଷଣ ପାଇଁ 'ସୁପର ଗ୍ରେନ୍ ବ୍ୟାଗ୍ \"ବ୍ୟବହାର କରନ୍ତୁ କିମ୍ବା ଅସମୟ ବର୍ଷା କାରଣରୁ କ୍ଷୟକ୍ଷତି ଏଡ଼ାଇବା ପାଇଁ ଅମଳ ହୋଇଥିବା ଧାନକୁ ଉପଯୁକ୍ତ ବ୍ୟାଗରେ ଏବଂ ଉପଯୁକ୍ତ ଢାଙ୍କି ସହିତ ଷ୍ଟକ୍ କରି ରଖନ୍ତୁ।"
         ]
      },
      "summer rice": {
         "advisory": [
            "ଗ୍ରୀଷ୍ମ ଋତୁ ଧାନ ଚାଷ ପାଇଁ କୃଷକମାନେ କ୍ଷେତ ପ୍ରସ୍ତୁତି ଆରମ୍ଭ କରିବା ଉଚିତ। ଏହି ଉଦ୍ଦେଶ୍ୟରେ କୃଷକମାନେ କେତେକ ଉନ୍ନତ କିସମ ଯଥା ଏମ. ଟି. ୟୁ. 1010, ଏମ. ଟି. ୟୁ. 1156, ଏମ. ଟି. ୟୁ. 1001, ଲଲାଟ, ଉନ୍ନତ ଲଲାଟ, ଚନ୍ଦନ, ସ୍ୱର୍ଣ୍ଣ ଇତ୍ୟାଦି ଚୟନ କରିପାରିବେ।"
         ]
      },
      "green gram/black gram": {
         "advisory": [
            "ସବୁଜ ଚଣା/କଳା ଚଣା ଫସଲ ବୁଣିବାର ଏକ ସପ୍ତାହ ପୂର୍ବରୁ, ପ୍ରତି କିଲୋଗ୍ରାମ ମଞ୍ଜି ପିଛା କାର୍ବେନଡାଜିମ୍ @1.5-2.0g ଏବଂ ଇମିଡାକ୍ଲୋପ୍ରିଡ୍ @5 ଗ୍ରାମ୍ ସହିତ ମଞ୍ଜି ଉପଚାର କରାଯିବା ଉଚିତ।",
            "30 ସେ. ମି. × 10 ସେ. ମି. ବ୍ୟବଧାନରେ ପ୍ରତି ଏକରରେ 8-10 କି. ଗ୍ରା. ହାରରେ ବୀଜ ବୁଣିବା ଉଚିତ।",
            "କିଛି ଦିନ ପାଇଁ ଜଳସେଚନରୁ ଦୂରେଇ ରୁହନ୍ତୁ କାରଣ ଆଗାମୀ ସପ୍ତାହରେ କିଛି ପରିମାଣର ବର୍ଷା ହେବାର ସମ୍ଭାବନା ରହିଛି।"
         ]
      },
      "ground nut": {
         "advisory": [
            "ଯେଉଁ କୃଷକମାନେ ଏପର୍ଯ୍ୟନ୍ତ ମଞ୍ଜି ବୁଣିନାହାନ୍ତି, ସେମାନେ ଉନ୍ନତ ଚିନାବାଦାମ କିସମ ଯଥା ଟିଏଜି-24, ଜେଏଲ-24, ଗିରନାର-3, ସ୍ମୃତି, ଟିଜି-3, ଟିଜି-22, କାଦ୍ରି-5, କାଦ୍ରି-6, କାଦ୍ରି-9, ଟିପିଜି-41, ଜିପିବିଡି-4, ଦେବୀ, ସିଓ-7, ଧରଣୀ ଏବଂ ଦିବ୍ୟା ଇତ୍ୟାଦି ବ୍ୟବହାର କରିପାରିବେ।"
         ]
      },
      "cole crop": {
         "advisory": [
            "ଶୀତ ଋତୁରେ କ୍ଷେତରେ ମୃତ୍ତିକାର ଆର୍ଦ୍ରତା ଏବଂ ମୃତ୍ତିକାର ତାପମାତ୍ରା ବଜାୟ ରଖିବା ପାଇଁ ପନିପରିବା ଫସଲରେ ମଲ୍ଚିଙ୍ଗ ସାମଗ୍ରୀ ଭାବରେ ଷ୍ଟ୍ରା ବ୍ୟବହାର କରାଯାଇପାରିବ |",
            "ଫୁଲକୋବିରେ ଡାଇମଣ୍ଡବ୍ୟାକ୍ ମଥ୍ର ଆକ୍ରମଣ ବିରୁଦ୍ଧରେ ନିୟମିତ ତଦାରଖ କରିବାକୁ ପରାମର୍ଶ ଦିଆଯିବା ଉଚିତ ଏବଂ ଯଦି ସମ୍ଭବ, କୃଷକମାନେ ଏହି ଉଦ୍ଦେଶ୍ୟରେ କ୍ଷେତରେ ଫେରୋମୋନ୍ ଟ୍ରାପ୍ ବ୍ୟବହାର କରିବା ଉଚିତ୍ |"
         ]
      },
      "livestock": {
         "advisory": [
            "ଶୀତ ଋତୁରେ ପଶୁମାନଙ୍କୁ ଥଣ୍ଡାରୁ ରକ୍ଷା କରିବା ପାଇଁ କୃଷକମାନେ ବ୍ୟବସ୍ଥା କରିବା ଉଚିତ ଏବଂ ପଶୁମାନଙ୍କୁ ସ୍ୱଚ୍ଛ ପାନୀୟ ଜଳ ଯୋଗାଇବା ଏବଂ ସେମାନଙ୍କ ଘର ସଫା ରଖିବା ଉଚିତ।",
            "ବିଭିନ୍ନ କ୍ଷତିକାରକ ରୋଗ ଏବଂ ପାକସ୍ଥଳୀ କୃମିକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ ଟୀକାକରଣ ଏବଂ କୃମି ଦୂରୀକରଣ କରାଯିବା ଉଚିତ।"
         ]
      },
      "poultry": {
         "advisory": [
            "ଶୁଦ୍ଧ ବାୟୁ ଯୋଗାଇବା ଏବଂ ଘର ଭିତରେ ଥିବା ଗ୍ୟାସଗୁଡ଼ିକୁ ବାହାର କରିବା ପାଇଁ ଉପଯୁକ୍ତ ବାୟୁ ସଞ୍ଚାରଣର ଆବଶ୍ୟକତା ରହିଛି।",
            "ଜଳ ଗ୍ରହଣକୁ ପ୍ରୋତ୍ସାହିତ କରିବା ପାଇଁ ପାନୀୟ ଜଳକୁ ଉପଯୁକ୍ତ ତାପମାତ୍ରାରେ ବଜାୟ ରଖିବା ଉଚିତ୍।"
         ]
      }
   },
   "date": "20-12-2024"
}