{
   "weather_details": {
      "21-12-2024": {
         "rainfall": 5,
         "t_max": 23,
         "t_min": 14,
         "rh_max": 93,
         "rh_min": 56,
         "wind_speed": 4,
         "wind_direction": 79,
         "cloud_cover": 6
      },
      "22-12-2024": {
         "rainfall": 2,
         "t_max": 23,
         "t_min": 14,
         "rh_max": 87,
         "rh_min": 44,
         "wind_speed": 2,
         "wind_direction": 72,
         "cloud_cover": 5
      },
      "23-12-2024": {
         "rainfall": 1,
         "t_max": 24,
         "t_min": 13,
         "rh_max": 83,
         "rh_min": 29,
         "wind_speed": 2,
         "wind_direction": 108,
         "cloud_cover": 5
      },
      "24-12-2024": {
         "rainfall": 0,
         "t_max": 24,
         "t_min": 13,
         "rh_max": 80,
         "rh_min": 28,
         "wind_speed": 4,
         "wind_direction": 119,
         "cloud_cover": 3
      },
      "25-12-2024": {
         "rainfall": 0,
         "t_max": 25,
         "t_min": 13,
         "rh_max": 69,
         "rh_min": 27,
         "wind_speed": 3,
         "wind_direction": 166,
         "cloud_cover": 1
      }
   },
   "names_of_crops": [
      "ଖରିଫ ଚାଉଳ",
      "ଗ୍ରୀଷ୍ମକାଳୀନ ଚାଉଳ",
      "ସବୁଜ ଚଣା/କଳା ଚଣା",
      "ମାଟି ବାଦାମ",
      "କୋଲେ ଫସଲ",
      "ପଶୁପାଳନ",
      "କୁକୁଡ଼ା ମାଂସ"
   ],
   "general_advisory": "ଆଇଏମଡି, ମ୍ୟୁନିସିପାଲିଟି କର୍ପୋରେସନ୍, ଭୁବନେଶ୍ୱରର ବର୍ଦ୍ଧିତ ପରିସର ପୂର୍ବାନୁମାନ ଅନୁଯାୟୀ, ପ୍ରଥମ ସପ୍ତାହରେ (20 ରୁ 26 ଡିସେମ୍ବର, 2024) ଦକ୍ଷିଣ ଓଡ଼ିଶାର କେତେକ ସ୍ଥାନରେ ସର୍ବନିମ୍ନ ତାପମାତ୍ରା (ରାତି ତାପମାତ୍ରା) 18-20 ଡିଗ୍ରୀ ସେଲସିୟସ୍, ଉପକୂଳ ଓଡ଼ିଶାର ଅଧିକାଂଶ ଭାଗରେ ଏବଂ ଆଭ୍ୟନ୍ତରୀଣ ଓଡ଼ିଶାର କିଛି ଅଂଶରେ 14-16 ଡିଗ୍ରୀ ସେଲସିୟସ୍ ଏବଂ ଆଭ୍ୟନ୍ତରୀଣ ଓଡ଼ିଶାର ଅବଶିଷ୍ଟ ଭାଗରେ 10-14 ଡିଗ୍ରୀ ସେଲସିୟସ୍ ହେବାର ସମ୍ଭାବନା ରହିଛି। ଓଡ଼ିଶାର ଜିଲ୍ଲାଗୁଡ଼ିକରେ ସର୍ବନିମ୍ନ ତାପମାତ୍ରା ସ୍ୱାଭାବିକଠାରୁ ସ୍ୱାଭାବିକଠାରୁ ଅଧିକ ରହିବାର ସମ୍ଭାବନା ରହିଛି ଏବଂ ସେହି ସମୟରେ ଉପକୂଳ ଓଡ଼ିଶା ଏବଂ ଆଭ୍ୟନ୍ତରୀଣ ଓଡ଼ିଶାର ଆଖପାଖ ଜିଲ୍ଲାଗୁଡ଼ିକରେ ହାଲୁକା ରୁ ହାଲୁକା ବର୍ଷା ହେବାର ସମ୍ଭାବନା ରହିଛି। ପ୍ରଥମ ସପ୍ତାହରେ ରାଜ୍ୟରେ ସାମଗ୍ରିକ ବର୍ଷା ଗତିବିଧି ସ୍ୱାଭାବିକରୁ ସ୍ୱାଭାବିକଠାରୁ ଅଧିକ ହେବାର ସମ୍ଭାବନା ରହିଛି। ଦ୍ୱିତୀୟ ସପ୍ତାହରେ (27 ଡିସେମ୍ବର, 2024 ରୁ 2 ଜାନୁଆରୀ, 2025) ଦକ୍ଷିଣ ଓଡ଼ିଶାର କେତେକ ସ୍ଥାନରେ ସର୍ବନିମ୍ନ ତାପମାତ୍ରା (ରାତି ତାପମାତ୍ରା) 16-18 °C, ଉପକୂଳ ଓଡ଼ିଶାର ଅଧିକାଂଶ ଭାଗରେ ଏବଂ ଆଭ୍ୟନ୍ତରୀଣ ଓଡ଼ିଶାର କେତେକ ଭାଗରେ 14-16 °C ଏବଂ ଆଭ୍ୟନ୍ତରୀଣ ଓଡ଼ିଶାର ଅବଶିଷ୍ଟ ଭାଗରେ 10-14 °C ରହିବାର ସମ୍ଭାବନା ରହିଛି। ଦ୍ୱିତୀୟ ସପ୍ତାହରେ ରାଜ୍ୟରେ ସର୍ବନିମ୍ନ ତାପମାତ୍ରା ସ୍ୱାଭାବିକ ରହିବାର ସମ୍ଭାବନା ରହିଛି। ଏହି ସମୟରେ ଓଡ଼ିଶାରେ ଶୁଖିଲା ପାଗ ରହିବାର ସମ୍ଭାବନା ରହିଛି। ଉପରୋକ୍ତ ପାଣିପାଗ ସ୍ଥିତିକୁ ଦୃଷ୍ଟିରେ ରଖି କୃଷକମାନଙ୍କୁ ସେହି ଅନୁଯାୟୀ ଅମଳ, ବୁଣିବା ଏବଂ ସିଞ୍ଚନ କାର୍ଯ୍ୟ କରିବାକୁ ପରାମର୍ଶ ଦିଆଯାଇଛି। ଫସଲ ଏବଂ ପଶୁମାନଙ୍କୁ ଥଣ୍ଡାରୁ ରକ୍ଷା କରିବା ପାଇଁ ଉପଯୁକ୍ତ ଯତ୍ନ ନେବା ପାଇଁ କୃଷକମାନଙ୍କୁ ପରାମର୍ଶ ଦିଆଯାଇଛି। କୃଷକମାନଙ୍କୁ ରବି ଫସଲ ଯଥା ସୋରିଷ, ତିଲ, ଚଣା, ଚିନାବାଦାମ, ସବୁଜ ଚଣା/କଳା ଚଣା ଇତ୍ୟାଦି ବୁଣିବା ସମ୍ପୂର୍ଣ୍ଣ କରିବାକୁ ଏବଂ ଜଳସେଚନ ସୁବିଧା ଉପଲବ୍ଧ ଥିବା ଗ୍ରୀଷ୍ମ ଧାନର ନର୍ସରୀ ବୁଣିବା ଆରମ୍ଭ କରିବାକୁ ପରାମର୍ଶ ଦିଆଯାଇଛି।",
   "crops_data": {
      "kharif rice": {
         "advisory": [
            "ଆଗାମୀ ଦିନର ପ୍ରଥମାର୍ଦ୍ଧରେ କିଛି ବର୍ଷା ହେବାର ସମ୍ଭାବନା ରହିଛି, ତେଣୁ କୃଷକମାନଙ୍କୁ ଅମଳ କାର୍ଯ୍ୟ ପାଇଁ କିଛି ଦିନ ଅପେକ୍ଷା କରିବାକୁ ଏବଂ ଅଧିକ କ୍ଷତି ଏଡ଼ାଇବା ପାଇଁ ଅମଳ ହୋଇଥିବା ଧାନ ଫସଲକୁ ସୁରକ୍ଷିତ ସ୍ଥାନରେ ରଖିବା ପାଇଁ ବ୍ୟବସ୍ଥା କରିବାକୁ ପରାମର୍ଶ ଦିଆଯାଇଛି।",
            "ଅଧିକ ସମୟ ଧରି ଧାନ/ଚାଉଳର ସୁରକ୍ଷିତ ସଂରକ୍ଷଣ ପାଇଁ 'ସୁପର ଗ୍ରେନ୍ ବ୍ୟାଗ୍ \"ବ୍ୟବହାର କରନ୍ତୁ କିମ୍ବା ଅସମୟ ବର୍ଷା କାରଣରୁ କ୍ଷୟକ୍ଷତି ଏଡ଼ାଇବା ପାଇଁ ଅମଳ ହୋଇଥିବା ଧାନକୁ ଉପଯୁକ୍ତ ବ୍ୟାଗରେ ଏବଂ ଉପଯୁକ୍ତ ଢାଙ୍କି ସହିତ ଷ୍ଟକ୍ କରି ରଖନ୍ତୁ।"
         ]
      },
      "summer rice": {
         "advisory": [
            "ଗ୍ରୀଷ୍ମ ଋତୁ ଧାନ ଚାଷ ପାଇଁ କୃଷକମାନେ କ୍ଷେତ ପ୍ରସ୍ତୁତି ଆରମ୍ଭ କରିବା ଉଚିତ। ଏହି ଉଦ୍ଦେଶ୍ୟରେ କୃଷକମାନେ କେତେକ ଉନ୍ନତ କିସମ ଯଥା ଏମ. ଟି. ୟୁ. 1010, ଏମ. ଟି. ୟୁ. 1156, ଏମ. ଟି. ୟୁ. 1001, ଲଲାଟ, ଉନ୍ନତ ଲଲାଟ, ଚନ୍ଦନ, ସ୍ୱର୍ଣ୍ଣ ଇତ୍ୟାଦି ଚୟନ କରିପାରିବେ।"
         ]
      },
      "green gram/black gram": {
         "advisory": [
            "ସବୁଜ ଚଣା/କଳା ଚଣା ଫସଲ ବୁଣିବାର ଏକ ସପ୍ତାହ ପୂର୍ବରୁ, ପ୍ରତି କିଲୋଗ୍ରାମ ମଞ୍ଜି ପିଛା କାର୍ବେନଡାଜିମ୍ @1.5-2.0g ଏବଂ ଇମିଡାକ୍ଲୋପ୍ରିଡ୍ @5 ଗ୍ରାମ୍ ସହିତ ମଞ୍ଜି ଉପଚାର କରାଯିବା ଉଚିତ।",
            "30 ସେ. ମି. × 10 ସେ. ମି. ବ୍ୟବଧାନରେ ପ୍ରତି ଏକରରେ 8-10 କି. ଗ୍ରା. ହାରରେ ବୀଜ ବୁଣିବା ଉଚିତ।",
            "ବିଭିନ୍ନ ପ୍ରକାରଃ ସବୁଜ ଗ୍ରାମ-କାମଦେବ, ଦୁର୍ଗା, ଆଇ. ପି. ଏମ୍. 02-3, ଆଇ. ପି. ଏମ୍. 02-14, ଟି. ଏ. ଆର୍. ଏମ୍. 1। କଳା ଗ୍ରାମ-ପ୍ରସାଦ, ଉସାଲା, ପି. ୟୁ. 31, ଆଇ. ପି. ୟୁ. 2-43, ମାହୁରୀ",
            "କିଛି ଦିନ ପାଇଁ ଜଳସେଚନରୁ ଦୂରେଇ ରୁହନ୍ତୁ କାରଣ ଆଗାମୀ ସପ୍ତାହରେ କିଛି ପରିମାଣର ବର୍ଷା ହେବାର ସମ୍ଭାବନା ରହିଛି।"
         ]
      },
      "ground nut": {
         "advisory": [
            "ଯେଉଁ କୃଷକମାନେ ଏପର୍ଯ୍ୟନ୍ତ ମଞ୍ଜି ବୁଣିନାହାନ୍ତି, ସେମାନେ ଉନ୍ନତ ଚିନାବାଦାମ କିସମ ଯଥା ଟିଏଜି-24, ଜେଏଲ-24, ଗିରନାର-3, ସ୍ମୃତି, ଟିଜି-3, ଟିଜି-22, କାଦ୍ରି-5, କାଦ୍ରି-6, କାଦ୍ରି-9, ଟିପିଜି-41, ଜିପିବିଡି-4, ଦେବୀ, ସିଓ-7, ଧରଣୀ ଏବଂ ଦିବ୍ୟା ଇତ୍ୟାଦି ବ୍ୟବହାର କରିପାରିବେ।",
            "ମଞ୍ଜି ବୁଣିବା ପୂର୍ବରୁ ମଞ୍ଜି ଚିକିତ୍ସା ସୁନିଶ୍ଚିତ କରନ୍ତୁ ଏବଂ ଯଦି ସମ୍ଭବ, ଚିକିତ୍ସାର 7 ଦିନ ପରେ ବ୍ୟାକ୍ଟେରିଆ କିମ୍ବା ଫସଫୋ କଲ୍ଚର ସହିତ ଚିକିତ୍ସା କରନ୍ତୁ।"
         ]
      },
      "cole crop": {
         "advisory": [
            "ଶୀତ ଋତୁରେ କ୍ଷେତରେ ମୃତ୍ତିକା ଆର୍ଦ୍ରତା ତଥା ମୃତ୍ତିକା ତାପମାତ୍ରା ବଜାୟ ରଖିବା ପାଇଁ ପନିପରିବା ଫସଲରେ ମଲ୍ଚିଙ୍ଗ ସାମଗ୍ରୀ ଭାବରେ ଷ୍ଟ୍ରା ବ୍ୟବହାର କରାଯାଇପାରିବ |",
            "ଫୁଲକୋବିରେ ଡାଇମଣ୍ଡ ବ୍ୟାକ୍ ମଥ୍ର ଆକ୍ରମଣ ବିରୁଦ୍ଧରେ ନିୟମିତ ତଦାରଖ କରିବାକୁ ପରାମର୍ଶ ଦିଆଯିବା ଉଚିତ ଏବଂ ଯଦି ସମ୍ଭବ, କୃଷକମାନେ ଏହି ଉଦ୍ଦେଶ୍ୟରେ କ୍ଷେତରେ ଏକ ଫେରୋମୋନ୍ ଟ୍ରାପ୍ ବ୍ୟବହାର କରିବା ଉଚିତ୍ |",
            "ଯଦି ଆକ୍ରମଣ ପରିଲକ୍ଷିତ ହୁଏ, ତେବେ ବର୍ଷା ହେବା ପରେ ନିମ୍ବ ତେଲ @5 ମିଲି କିମ୍ବା ଇମାମେକ୍ଟିନ୍ ବେନ୍ଜୋଏଟ୍ @0.40 ଗ୍ରାମ୍ ପ୍ରତି ଲିଟର ପାଣିରେ ସିଞ୍ଚନ କରିବା ଉଚିତ।"
         ]
      },
      "livestock": {
         "advisory": [
            "ଶୀତ ଋତୁରେ ପଶୁମାନଙ୍କୁ ଥଣ୍ଡାରୁ ରକ୍ଷା କରିବା ପାଇଁ କୃଷକମାନେ ବ୍ୟବସ୍ଥା କରିବା ଉଚିତ (ଯଦି ସମ୍ଭବ ପଶୁମାନଙ୍କୁ ଆଚ୍ଛାଦନ କରିବା ପାଇଁ ଏକ ଝୋଟ ବ୍ୟାଗ ଏବଂ ଶଯ୍ୟା ସାମଗ୍ରୀ ଭାବରେ ନଡ଼ିଆ ବ୍ୟବହାର କରନ୍ତୁ) ଏବଂ ଗୋରୁମାନଙ୍କୁ ସ୍ୱଚ୍ଛ ପାନୀୟ ଜଳ ଯୋଗାଇବା ଏବଂ ସେମାନଙ୍କ ଛପର ସଫା ରଖିବା ଉଚିତ୍ |",
            "ବିଭିନ୍ନ କ୍ଷତିକାରକ ରୋଗ ଏବଂ ପାକସ୍ଥଳୀ କୃମିକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ ଟୀକାକରଣ ଏବଂ କୃମି ଦୂରୀକରଣ କରାଯିବା ଉଚିତ।"
         ]
      },
      "poultry": {
         "advisory": [
            "ଶୁଦ୍ଧ ବାୟୁ ଯୋଗାଇବା ଏବଂ ଘର ଭିତରେ ଥିବା ଗ୍ୟାସଗୁଡ଼ିକୁ ବାହାର କରିବା ପାଇଁ ଉପଯୁକ୍ତ ବାୟୁ ସଞ୍ଚାରଣର ଆବଶ୍ୟକତା ରହିଛି।",
            "କୁକୁଡ଼ା ପାଳିକୁ ଗରମ ଏବଂ ଶୁଖିଲା ରଖିବା ପାଇଁ ବାହ୍ୟ ଉତ୍ତାପ ଉତ୍ସ ଯୋଗାଇ ଦିଆଯାଏ | କ୍ଷେତକୁ ସୁରକ୍ଷିତ ରଖିବା ପାଇଁ ବିଭିନ୍ନ ପ୍ରକାରର ପରଦା ଏବଂ ଝୋଟ ବସ୍ତା ବ୍ୟବହାର କରାଯାଇଥାଏ।",
            "ଜଳ ଗ୍ରହଣକୁ ପ୍ରୋତ୍ସାହିତ କରିବା ପାଇଁ ପାନୀୟ ଜଳକୁ ଉପଯୁକ୍ତ ତାପମାତ୍ରାରେ ବଜାୟ ରଖିବା ଉଚିତ୍।"
         ]
      }
   },
   "date": "20-12-2024"
}