{
   "weather_details": {
      "2024-12-21": {
         "rainfall": 5,
         "t_max": 25,
         "t_min": 16,
         "rh_max": 87,
         "rh_min": 57,
         "wind_speed": 3,
         "wind_direction": 58,
         "cloud_cover": 6
      },
      "2024-12-22": {
         "rainfall": 3,
         "t_max": 25,
         "t_min": 16,
         "rh_max": 83,
         "rh_min": 47,
         "wind_speed": 3,
         "wind_direction": 14,
         "cloud_cover": 6
      },
      "2024-12-23": {
         "rainfall": 1,
         "t_max": 25,
         "t_min": 15,
         "rh_max": 81,
         "rh_min": 32,
         "wind_speed": 2,
         "wind_direction": 27,
         "cloud_cover": 4
      },
      "2024-12-24": {
         "rainfall": 0,
         "t_max": 26,
         "t_min": 15,
         "rh_max": 75,
         "rh_min": 30,
         "wind_speed": 3,
         "wind_direction": 74,
         "cloud_cover": 3
      },
      "2024-12-25": {
         "rainfall": 0,
         "t_max": 26,
         "t_min": 14,
         "rh_max": 69,
         "rh_min": 29,
         "wind_speed": 1,
         "wind_direction": 0,
         "cloud_cover": 3
      }
   },
   "names_of_crops": [
      "ସୋରିଷ",
      "ସାଧାରଣ ମାଛ",
      "କୁକୁଡ଼ା ମାଂସ",
      "ଅନ୍ୟଗୁଡ଼ିକ (ମାଟି/ଜମି ପ୍ରସ୍ତୁତି)"
   ],
   "general_advisory": "ଆଗାମୀ ବର୍ଷାକୁ ଦୃଷ୍ଟିରେ ରଖି ପନିପରିବା ଫସଲରୁ ଜଳ ନିଷ୍କାସନ ପାଇଁ ବ୍ୟବସ୍ଥା କରନ୍ତୁ. କିଛି ସମୟ ପାଇଁ ଉଦ୍ଭିଦ ସୁରକ୍ଷା ପ୍ରୟୋଗ ବନ୍ଦ କରନ୍ତୁ. ଆଗାମୀ ବର୍ଷାକୁ ଦୃଷ୍ଟିରେ ରଖି ଅମଳ ହୋଇଥିବା ଧାନର ସଂରକ୍ଷଣ ପାଇଁ ବ୍ୟବସ୍ଥା କରନ୍ତୁ. ଆଲୁମିନିୟମ୍ ଫସଫାଇଡ୍ ଟାବଲେଟ୍ ବ୍ୟବହାର କରି ଧୂମ୍ରକରଣ ପାଇଁ ବ୍ୟବସ୍ଥା କରନ୍ତୁ @3 ଟାବଲେଟ୍/ଟନ୍ ଶସ୍ୟ ମୋଟାମୋଟି ବାୟୁ ଟାଇଟ କଣ୍ଟେନରରେ କିମ୍ବା ମୋଟା ତିରପାଲରେ ଆଚ୍ଛାଦନ କରି କୌଣସି ବ୍ୟବଧାନ ନ ରଖି | ଟାବଲେଟ୍ ଗୁଡ଼ିକୁ ଷ୍ଟାକରେ ରଖିବା ପୂର୍ବରୁ ସୂତା ପାଉଚରେ ଆବୃତ କରାଯିବା ଉଚିତ, ଯାହା ଫିଉମିଗେସନ୍ ସମ୍ପୂର୍ଣ୍ଣ କରିବା ପରେ ଅବଶିଷ୍ଟାଂଶକୁ ପରିତ୍ୟାଗ କରିବାରେ ସାହାଯ୍ୟ କରେ |",
   "crops_data": {
      "mustard": {
         "advisory": [
            "କୁହୁଡ଼ି ପାଗ ଏବଂ ଆଗାମୀ ଦିନଗୁଡ଼ିକରେ ମେଘୁଆ ପାଗ ଯୋଗୁଁ ବର୍ତ୍ତମାନର ପାଣିପାଗ ସ୍ଥିତିରେ ସୋରିଷ ଫସଲରେ ଏଫିଡ୍ ଏବଂ ଧଳା ଜଙ୍କ ଉପରେ ନିରନ୍ତର ନଜର ରଖିବାକୁ ପରାମର୍ଶ ଦିଆଯାଇଛି। କୁହୁଡ଼ି ପାଗ ହେତୁ ଶୀଘ୍ର ବୁଣାଯାଇଥିବା ସୋରିଷ ଏଫିଡ୍ ଦ୍ୱାରା ପ୍ରଭାବିତ ହେବାର ସମ୍ଭାବନା ରହିଛି। ବର୍ଷା ବନ୍ଦ ହେବା ପରେ 200 ଲିଟର ପାଣିରେ 80 ଗ୍ରାମ ଥାୟାମେଥୋକ୍ସାମ କିମ୍ବା 80 ମିଲି ଇମିଡାକ୍ଲୋପ୍ରିଡ ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "common fish": {
         "advisory": [
            "ଅମ୍ଳଜାନର ପରିମାଣ ବଢ଼ାଇବା ପାଇଁ ହେକ୍ଟର ପିଛା 4 ରୁ 5 ଘଣ୍ଟା ପାଇଁ 4 ରୁ 5 ଏରେଟର ବ୍ୟବହାର କରନ୍ତୁ। ପ୍ରବଳ ବର୍ଷା ପରେ 80-100 କେଜି ପଥର ଚୂନ ଲଗାଇବା ପାଇଁ ଯାଆନ୍ତୁ।"
         ]
      },
      "poultry": {
         "advisory": [
            "ଖାଦ୍ୟ ସାମଗ୍ରୀଗୁଡ଼ିକ ଓଦା ହେବାରୁ ରକ୍ଷା କରନ୍ତୁ, ଏବଂ ଖାଦ୍ୟର ପରିମାଣ ଅତ୍ୟଧିକ ହେବା ଉଚିତ ନୁହେଁ। ଘରର ଯୌଗିକ ଖାଦ୍ୟକୁ ମାଟି ଉପରେ ଥିବା ମଞ୍ଚ ଉପରେ ରଖିବା ଉଚିତ, ଯାହାଦ୍ୱାରା ଖାଦ୍ୟକୁ ଆର୍ଦ୍ରତା ଫେରିଆସିବାରୁ ରୋକାଯାଇପାରିବ। ଫଙ୍ଗସ୍ ପ୍ରଦୂଷଣରୁ ରକ୍ଷା ପାଇବା ପାଇଁ ଫିଡର୍ଗୁଡ଼ିକର ନିୟମିତ ଯାଞ୍ଚ। ଏହି ଋତୁରେ ନିୟମିତ ବ୍ୟବଧାନରେ ଆପଣଙ୍କ ପକ୍ଷୀମାନଙ୍କୁ ଗରମ ପାଣି ଦିଅନ୍ତୁ, ଯାହାଦ୍ୱାରା ସେମାନେ ବ୍ୟବହାରକୁ ପ୍ରୋତ୍ସାହିତ କରିପାରିବେ ଏବଂ ଏହି ପ୍ରକ୍ରିୟାରେ ବଳକା ଥିବା ଶକ୍ତିର ଉପଯୋଗ ନକରି ସେମାନଙ୍କୁ ଗରମ ରଖିବାରେ ସାହାଯ୍ୟ କରିପାରିବେ।"
         ]
      },
      "others (soil / land preparation)": {
         "advisory": [
            "ଆଗାମୀ ବର୍ଷାକୁ ଦୃଷ୍ଟିରେ ରଖି ଅମଳ ହୋଇଥିବା ଧାନ ସଂରକ୍ଷଣ ପାଇଁ ବ୍ୟବସ୍ଥା କରନ୍ତୁ। ଆଲୁମିନିୟମ୍ ଫସଫାଇଡ୍ ଟାବଲେଟ୍ @3 ଟାବଲେଟ୍/ଟନ୍ ଶସ୍ୟର ବ୍ୟବହାର କରି ମୋଟାମୋଟି ବାୟୁ ଟାଇଟ କଣ୍ଟେନରରେ କିମ୍ବା ମୋଟା ତିରପାଲରେ ଆଚ୍ଛାଦନ କରି କୌଣସି ବ୍ୟବଧାନ ନ ରଖି ଧୂଆଁ ପାଇଁ ବ୍ୟବସ୍ଥା କରନ୍ତୁ | ଟାବଲେଟ୍ ଗୁଡ଼ିକୁ ଷ୍ଟାକରେ ରଖିବା ପୂର୍ବରୁ ସୂତା ପାଉଚରେ ଆବୃତ କରାଯିବା ଉଚିତ, ଯାହା ଫିଉମିଗେସନ୍ ସମ୍ପୂର୍ଣ୍ଣ କରିବା ପରେ ଅବଶିଷ୍ଟାଂଶକୁ ପରିତ୍ୟାଗ କରିବାରେ ସାହାଯ୍ୟ କରେ |"
         ]
      }
   },
   "date": "20-12-2024"
}