{
   "weather_details": {
      "2025-01-22": {
         "rainfall": 0,
         "t_max": 28,
         "t_min": 13,
         "rh_max": 65,
         "rh_min": 14,
         "wind_speed": 2,
         "wind_direction": 329,
         "cloud_cover": 3
      },
      "2025-01-23": {
         "rainfall": 0,
         "t_max": 29,
         "t_min": 13,
         "rh_max": 74,
         "rh_min": 15,
         "wind_speed": 1,
         "wind_direction": 225,
         "cloud_cover": 2
      },
      "2025-01-24": {
         "rainfall": 0,
         "t_max": 29,
         "t_min": 14,
         "rh_max": 74,
         "rh_min": 17,
         "wind_speed": 1,
         "wind_direction": 243,
         "cloud_cover": 2
      },
      "2025-01-25": {
         "rainfall": 0,
         "t_max": 29,
         "t_min": 14,
         "rh_max": 71,
         "rh_min": 18,
         "wind_speed": 1,
         "wind_direction": 297,
         "cloud_cover": 2
      },
      "2025-01-26": {
         "rainfall": 0,
         "t_max": 28,
         "t_min": 14,
         "rh_max": 59,
         "rh_min": 15,
         "wind_speed": 2,
         "wind_direction": 329,
         "cloud_cover": 1
      }
   },
   "names_of_crops": [
      "ପିଜନ୍ ମଟର",
      "ମକା",
      "କଦଳୀ"
   ],
   "general_advisory": "ଥ୍ରିପ୍ସ ସଂକ୍ରମଣର ପରିଚାଳନା ପାଇଁ ଏକର ପିଛା 8 ନମ୍ବରରେ ବ୍ଲୁ ଷ୍ଟିକି ଟ୍ରାପ୍ ଲଗାନ୍ତୁ। ରାସାୟନିକ ନିୟନ୍ତ୍ରଣ ପାଇଁ ଇମାମେକ୍ଟିନ୍ ବେନ୍ଜୋଏଟ୍ 5 ପ୍ରତିଶତ ଏସ୍. ଜି. @4 ଗ୍ରାମ/ଲିଟର କିମ୍ବା ଫିପ୍ରୋନିଲ୍ 5 ପ୍ରତିଶତ ଏସ୍. ସି. @2 ମିଲି/ଲିଟର କିମ୍ବା ଇମିଡାକ୍ଲୋପ୍ରିଡ୍ 17.8% ଏସ୍. ଏଲ୍. 0.35 ମିଲି/ଲିଟର ପାଣି ସ୍ପ୍ରେ କରନ୍ତୁ। କୁହୁଡ଼ି, ନିମ୍ନ ତାପମାତ୍ରା ଏବଂ ଆର୍ଦ୍ରତା ଚାପରୁ କ୍ଷତିକୁ ରୋକିବା ପାଇଁ ସକାଳ ସମୟରେ ଠିଆ ହୋଇଥିବା ପନିପରିବା ଏବଂ ଫସଲକୁ ହାଲୁକା ଜଳସେଚନ ପ୍ରଦାନ କରନ୍ତୁ |",
   "crops_data": {
      "pigeon pea": {
         "advisory": [
            "ପତ୍ର ୱେବରର ସଂକ୍ରମଣ ପରିଲକ୍ଷିତ ହୋଇଛି। ପତ୍ର ୱେବରକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ ପ୍ରୋଫେନୋଫସ୍ 50 ପ୍ରତିଶତ ଇସି କିମ୍ବା କ୍ଲୋରପିରିଫସ୍ 50 ପ୍ରତିଶତ + ସାଇପର୍ମେଥ୍ରିନ୍ 5 ପ୍ରତିଶତ ଇସି @2 ମିଲି/ଲିଟର @2 ମିଲି/ଲିଟର ପାଣି ସ୍ପ୍ରେ କରନ୍ତୁ। ହାତ ଦ୍ୱାରା ନିରାମୟ କାର୍ଯ୍ୟ ସମ୍ପୂର୍ଣ୍ଣ କରନ୍ତୁ କିମ୍ବା 20-25 DAS ରେ ରାସାୟନିକ ନିୟନ୍ତ୍ରଣ ପାଇଁ ଇମାଜେଥାପାଇର୍ 10 ପ୍ରତିଶତ SL @1.5 ମିଲି/ଲିଟର ସହିତ MSO ଆଡଜୁୱାଣ୍ଟ @2 ମିଲି/ଲିଟର ପାଣି ସ୍ପ୍ରେ କରନ୍ତୁ। ଏଫିଡ୍ ଏବଂ ଥ୍ରୀପ୍ ପରି ଶୋଷକ କୀଟକୁ ରୋକିବା ପାଇଁ, ନିମ୍ବ-ଆଧାରିତ କୀଟନାଶକ (1500 ପିପିଏମ୍) ଲିଟର ପିଛା 3 ମିଲିଲିଟରରେ ପାଣି ସିଞ୍ଚନ କରାଯାଇପାରେ।"
         ]
      },
      "maize": {
         "advisory": [
            "ମକା ଭିତରେ ଷ୍ଟେମ ବୋରର ସଂକ୍ରମଣ ଦେଖିବାକୁ ମିଳିଛି। 10 ଦିନର ବ୍ୟବଧାନରେ ଦୁଇଥର ଟ୍ରାଇକୋଗ୍ରାମାକିଲୋନିସର 2000 ଅଣ୍ଡା ଛାଡ଼ନ୍ତୁ। ଯଦି ଉପରୋକ୍ତ ପଦ୍ଧତି ଦ୍ୱାରା ନିୟନ୍ତ୍ରିତ ନହୁଏ, ତେବେ 1 ଲିଟର ପାଣିରେ 2 ମିଲି ଫିପ୍ରୋନିଲ ସିଞ୍ଚନ କରନ୍ତୁ।"
         ]
      },
      "banana": {
         "advisory": [
            "ଷ୍ଟେମ ୱିଭିଲକୁ ପରିଚାଳନା କରିବା ପାଇଁ, କଦଳୀ ବଗିଚାରେ ଏକର ପିଛା 10ରେ କସମୋଲୁର ଫେରୋମୋନ୍ ଟ୍ରାପ୍ ଲଗାନ୍ତୁ। ରୋପଣ ପୂର୍ବରୁ କଦଳୀ କାଣ୍ଡକୁ 30 ମିନିଟ୍ ପାଇଁ ଉଷୁମ ପାଣିରେ ବୁଡ଼ାଇ ଦିଅନ୍ତୁ। ଚାରା ଲଗାଇବା ପୂର୍ବରୁ ଗର୍ତ୍ତରେ 25 ଗ୍ରାମ୍ ନିମ୍ବ ପେଡିଆ କିମ୍ବା 25-50 ଗ୍ରାମ୍ ଯେକୌଣସି ଦାଣାଦାର କୀଟନାଶକ ଭର୍ତ୍ତି କରନ୍ତୁ। ପ୍ରଭାବିତ ଗଛକୁ ଖଣ୍ଡ ଖଣ୍ଡ କରି କାଟି ସୂର୍ଯ୍ୟକିରଣ ତଳେ ଶୁଖାଇ ଦିଅନ୍ତୁ। କଦଳୀ ବଗିଚାକୁ ପରିଷ୍କାର ପରିଚ୍ଛନ୍ନ ରଖନ୍ତୁ।"
         ]
      }
   },
   "date": "21-01-2025"
}