{
   "weather_details": {
      "2024-07-24": {
         "rainfall": 25,
         "t_max": 28,
         "t_min": 26,
         "rh_max": 83,
         "rh_min": 67,
         "wind_speed": 15,
         "wind_direction": 248,
         "cloud_cover": 8
      },
      "2024-07-25": {
         "rainfall": 10,
         "t_max": 28,
         "t_min": 27,
         "rh_max": 76,
         "rh_min": 72,
         "wind_speed": 17,
         "wind_direction": 249,
         "cloud_cover": 8
      },
      "2024-07-26": {
         "rainfall": 15,
         "t_max": 29,
         "t_min": 27,
         "rh_max": 78,
         "rh_min": 73,
         "wind_speed": 15,
         "wind_direction": 252,
         "cloud_cover": 8
      },
      "2024-07-27": {
         "rainfall": 15,
         "t_max": 29,
         "t_min": 27,
         "rh_max": 82,
         "rh_min": 65,
         "wind_speed": 13,
         "wind_direction": 252,
         "cloud_cover": 8
      },
      "2024-07-28": {
         "rainfall": 30,
         "t_max": 30,
         "t_min": 27,
         "rh_max": 83,
         "rh_min": 63,
         "wind_speed": 10,
         "wind_direction": 252,
         "cloud_cover": 8
      }
   },
   "names_of_crops": [
      "ମକା",
      "ଚିନାବାଦାମ",
      "ଫିଙ୍ଗର ମିଲେଟ୍",
      "ଚାଉଳ"
   ],
   "general_advisory": "ବଙ୍ଗୋପସାଗରରେ ଏକ ଅବପାତ ସୃଷ୍ଟି ହେବାର ସମ୍ଭାବନା ରହିଛି, ଯେଉଁଥିପାଇଁ ଆଗାମୀ ପାଞ୍ଚ ଦିନ ମଧ୍ଯ଼ରେ ପ୍ରବଳ ବର୍ଷା ହେବାର ସମ୍ଭାବନା ରହିଛି। ପର୍ଯ୍ଯ଼ାପ୍ତ ବର୍ଷା ହେବାର ଆଶା ଥିବାରୁ ବର୍ଷା ବନ୍ଦ ହେବା ପରେ କୃଷକମାନେ ଖରିଫ ପନିପରିବା ବୁଣିବା ଏବଂ ନର୍ସରୀ ପ୍ରସ୍ତୁତି ପାଇଁ ଯାଇପାରିବେ। କୃଷି-ରସାଯ଼ନ ଏବଂ ସାର ପ୍ରଯ଼ୋଗର ସ୍ପ୍ରେକୁ ସ୍ଥଗିତ ରଖନ୍ତୁ।",
   "crops_data": {
      "maize": {
         "advisory": [
            "ଯେହେତୁ ପାଞ୍ଚ ଦିନ ମଧ୍ଯ଼ରେ ପର୍ଯ୍ଯ଼ାପ୍ତ ଆର୍ଦ୍ରତା ମିଳିଥାଏ, ଯେଉଁ କୃଷକମାନେ ଏପର୍ଯ୍ଯ଼ନ୍ତ ମକା ଫସଲ ବୁଣି ନାହାଁନ୍ତି, ସେମାନେ ଉପଯୁକ୍ତ ଆର୍ଦ୍ରତା ସ୍ଥିତିରେ ମକା ବୁଣି ପାରିବେ। ଠିଆ ହୋଇଥିବା ଫସଲ କ୍ଷେତରେ ଜଳ ନିଷ୍କାସନ ବ୍ଯ଼ବସ୍ଥା କରନ୍ତୁ।"
         ]
      },
      "groundnut": {
         "advisory": [
            "ଧରଣୀ, କଦ୍ରି-9, ଟିଏଜି-24, କଳିଙ୍ଗ ଚିନାବାଦମ୍ ଭଳି ଭଲ କିସମ ସଂଗ୍ରହ କରନ୍ତୁ। ବୀଜର ହାର ଏସି ପିଛା 50 କିଲୋଗ୍ରାମ ହୋଇଥାଏ। ଫଙ୍ଗିସାଇଡ୍ ଚିକିତ୍ସା ପରେ, ମଞ୍ଜି ବୁଣିବା ପୂର୍ବରୁ 30 ଗ୍ରାମ୍/କେଜି ମଞ୍ଜି ସହିତ ମଞ୍ଜି ଗୁଡ଼ିକୁ ଚିକିତ୍ସା କରନ୍ତୁ। ଦୂରତା ହେଉଛି 30 x 10 ସେ. ମି.। ଚୂଡ଼ାନ୍ତ ଜମି ପ୍ରସ୍ତୁତି ପରେ 2 ଟନ ଏଫୱାଇଏମ, 100 କିଲୋଗ୍ରାମ ଜିପ୍ସମ, 4 କିଲୋଗ୍ରାମ ଯ଼ୁରିଆ, 35 କିଲୋଗ୍ରାମ ଡିଏପି, ଏବଂ 26 କିଲୋଗ୍ରାମ ପୋଟାସକୁ ମୂଳ ମାତ୍ରା ଭାବରେ ପ୍ରଯ଼ୋଗ କରନ୍ତୁ।"
         ]
      },
      "finger millet": {
         "advisory": [
            "ଅର୍ଜୁନ, କଲୁଆ, ଭୈରବୀ, ଚିଲିକା ଭଳି ଉନ୍ନତ ମାନର ମଞ୍ଜି ବ୍ଯ଼ବହାର କରନ୍ତୁ ଏବଂ ଏସ୍. ଏମ୍. ଆଇ. ପଦ୍ଧତିରେ 1.5 କି. ଗ୍ରା., ଲାଇନ ବୁଣିବା ପାଇଁ 2.5 କି. ଗ୍ରା. ଏବଂ ପ୍ରସାରଣ ପାଇଁ ଏସି. ପ୍ରତି 4 କି. ଗ୍ରା. ମଞ୍ଜି ବ୍ଯ଼ବହାର କରନ୍ତୁ। ପ୍ରତି ବର୍ଗ ମିଟର ନର୍ସରୀରେ 10 ଗ୍ରାମ୍ ଏନ୍ ଏବଂ 10 ଗ୍ରାମ୍ ପି ଲଗାନ୍ତୁ। ସିଧାସଳଖ ବୁଣିବା ପାଇଁ 4 ଟନ ଏଫୱାଇଏମ/ଏସି ପ୍ରଯ଼ୋଗ କରନ୍ତୁ। ସାରର ମାତ୍ରା ହେଉଛି 50:25:25 କିଲୋଗ୍ରାମ NPK/ହେକ୍ଟର। ୱାର୍ମାଇଟରୁ ରକ୍ଷା ପାଇବା ପାଇଁ କ୍ଷେତର ଅନ୍ତିମ ପ୍ରସ୍ତୁତି ସମଯ଼ରେ 10 କିଲୋଗ୍ରାମ କ୍ଲୋରପିରିଫସ୍ ଲଗାନ୍ତୁ।"
         ]
      },
      "rice": {
         "advisory": [
            "ପର୍ଯ୍ଯ଼ାପ୍ତ ବର୍ଷା ହୋଇଥିବାରୁ କୃଷକମାନେ ମୁଖ୍ଯ଼ କ୍ଷେତରେ ଧାନ ରୋପଣ ପାଇଁ ଯାଇପାରିବେ।"
         ]
      }
   },
   "date": "23-07-2024"
}