{
   "weather_details": {
      "2024-10-26": {
         "rainfall": 90,
         "t_max": 26,
         "t_min": 23,
         "rh_max": 89,
         "rh_min": 96,
         "wind_speed": 18,
         "wind_direction": 39,
         "cloud_cover": 8
      },
      "2024-10-27": {
         "rainfall": 20,
         "t_max": 25,
         "t_min": 23,
         "rh_max": 83,
         "rh_min": 97,
         "wind_speed": 4,
         "wind_direction": 68,
         "cloud_cover": 8
      },
      "2024-10-28": {
         "rainfall": 4,
         "t_max": 26,
         "t_min": 24,
         "rh_max": 72,
         "rh_min": 97,
         "wind_speed": 2,
         "wind_direction": 68,
         "cloud_cover": 7
      },
      "2024-10-29": {
         "rainfall": 2,
         "t_max": 28,
         "t_min": 24,
         "rh_max": 68,
         "rh_min": 96,
         "wind_speed": 0,
         "wind_direction": 90,
         "cloud_cover": 5
      },
      "2024-10-30": {
         "rainfall": 1,
         "t_max": 30,
         "t_min": 25,
         "rh_max": 59,
         "rh_min": 94,
         "wind_speed": 3,
         "wind_direction": 220,
         "cloud_cover": 4
      }
   },
   "names_of_crops": [
      "ଚାଉଳ",
      "ସବୁଜ ଚଣା",
      "ଉଦ୍ଯ଼ାନ କୃଷି",
      "ଫ୍ରେଞ୍ଚ ବିନ୍",
      "କଦଳୀ",
      "ପେଁପେ",
      "ନଡ଼ିଆ"
   ],
   "general_advisory": "ଅମଳ ହୋଇଥିବା ଧାନ ଏବଂ ଅଣ-ଧାନ ଫସଲକୁ ନିରାପଦ ଏବଂ ଜଳ ପ୍ରତିରୋଧକ ସ୍ଥାନରେ ରଖନ୍ତୁ, ଯାହାଦ୍ୱାରା ବର୍ଷା ଏବଂ ପବନର ତୀବ୍ର ବେଗ ଏଡ଼ାଯାଇପାରିବ। ଫୁଲର ଗୁଣବତ୍ତା ଖରାପ ନହେବା ପାଇଁ ଫୁଲ ତୋଳିବା ପାଇଁ ଯାଆନ୍ତୁ। ରହିବା ଏଡ଼ାଇବା ପାଇଁ ପେଁପେ ଏବଂ କଦଳୀ ଗଛ ପାଇଁ ଦୃଢ଼ କାଠ ଆଧାର ତିଆରି କରନ୍ତୁ | ପରିପକ୍ୱ ପନିପରିବା ଅମଳ କରନ୍ତୁ। ଟ୍ରେଇଲିଂ ପ୍ରକାରର ପନିପରିବା ପାଇଁ ଦୃଢ ସମର୍ଥନ କରନ୍ତୁ | ଏହି ସମଯ଼ରେ କୀଟନାଶକ ସିଞ୍ଚନରୁ ଦୂରେଇ ରୁହନ୍ତୁ। ଏହି ସମଯ଼ରେ ଗୃହପାଳିତ ପଶୁମାନଙ୍କୁ ବାହାରକୁ ଯିବାକୁ ଦିଅନ୍ତୁ ନାହିଁ। 2ରୁ 3 ଦିନ ପାଇଁ ପଶୁଖାଦ୍ଯ଼ ଏବଂ ସ୍ୱଚ୍ଛ ପାନୀଯ଼ ଜଳର ବ୍ଯ଼ବସ୍ଥା କରନ୍ତୁ। ଗାଈମାନଙ୍କୁ ଗଛ ତଳେ କିମ୍ବା କୌଣସି ବଡ଼ ଗଛ ପାଖରେ ବାନ୍ଧନ୍ତୁ ନାହିଁ।",
   "crops_data": {
      "rice": {
         "advisory": [
            "ବର୍ଷା ଜଳର ଉତ୍ତମ ନିଷ୍କାସନ ପାଇଁ 10 ଫୁଟ ବ୍ଯ଼ବଧାନରେ ଏକ ପଥ ତିଆରି କରନ୍ତୁ।",
            "ଯେଉଁ ସ୍ଥାନରେ ପରିପକ୍ୱ ଚାଉଳ ଶସ୍ଯ଼ ଅମଳ ସମ୍ଭବ ନୁହେଁ, ସେହି ସ୍ଥାନରେ 2 ପ୍ରତିଶତ ଲୁଣ ଦ୍ରବଣ (1 ଲିଟର ପାଣିରେ 20 ଗ୍ରାମ ଲୁଣ) ସ୍ପ୍ରେ କରନ୍ତୁ। ଧାନ ଶସ୍ଯ଼ର ଅଙ୍କୁରୋଦଗମକୁ ରୋକିବା ପାଇଁ ଏହା ବ୍ଯ଼ବହୃତ ହୁଏ |",
            "ଯେତେବେଳେ ପ୍ଯ଼ାନିକଲରେ ଚାଉଳ ଶସ୍ଯ଼ରେ 80-85% ପରିପକ୍ୱ ହୁଏ, ଫସଲ ଅମଳ କରନ୍ତୁ ଏବଂ ଏକ ସୁରକ୍ଷିତ ସ୍ଥାନରେ ଷ୍ଟୋର୍ କରନ୍ତୁ |",
            "ଧାନ କ୍ଷେତରୁ ଅମଳ ହୋଇଥିବା ଶସ୍ଯ଼କୁ ସୁରକ୍ଷିତ ଭାବେ ରଖନ୍ତୁ।",
            "ଅମଳ ହୋଇଥିବା ନଡ଼ିଆକୁ ଉପଯୁକ୍ତ ଉପାଯ଼ରେ ରଖିବା ଉଚିତ।",
            "ଗୋଦାମ (ମଣ୍ଡି) ରେ ଥିବା ଧାନଶସ୍ଯ଼କୁ ବର୍ଷାରୁ ରକ୍ଷା କରିବା ପାଇଁ ଆବଶ୍ଯ଼କ ପଦକ୍ଷେପ ନିଅନ୍ତୁ।"
         ]
      },
      "green gram": {
         "advisory": [
            "ଡାଲି ପରେ ଯତ୍ନ (ପିଜନ୍ ମଟର, ସବୁଜ ଚଣା, କଳା ଚଣା)। ଜଳ ନିଷ୍କାସନ ପାଇଁ ବ୍ଯ଼ବସ୍ଥା କରନ୍ତୁ।",
            "ଡାଲି ଫସଲର ଅନ୍ୟ କ୍ଷେତକୁ କଳା ମୁଣ୍ଡ ଥିବା କ୍ୟାଟର୍ପିଲାର୍ କୀଟ ବିସ୍ତାରକୁ ରୋକିବା ପାଇଁ ପାହାଚରେ 1.5% କ୍ଲୋରୋପାଇରିଫୋସ୍ କିମ୍ବା 0.4% ଫେନୋଭାଲାରେଟ୍ ସ୍ପ୍ରେ କରନ୍ତୁ |",
            "ସବୁଜ ଗହମ/କଳା ଗହମରେ, ପତ୍ର ଖାଉଥିବା କ୍ଯ଼ାଟର୍ପିଲର ଏବଂ କଳା ମୁଣ୍ଡ ଥିବା କ୍ଯ଼ାଟର୍ପିଲରର ସଂକ୍ରମଣ ହେବାର ସମ୍ଭାବନା ରହିଛି। ଏହି ସ୍ପ୍ରେ ମିଶ୍ରଣରୁ ନିଯ଼ନ୍ତ୍ରଣ ପାଇଁ ମଧ୍ଯ଼ାହ୍ନ ସମଯ଼ରେ ଏକର ପିଛା ଲିଟର ପିଛା 2 ମିଲି ପ୍ରୋଫେନୋଫସ୍ 50 ପ୍ରତିଶତ ଇ. ସି. କିମ୍ବା 2 ମିଲି କ୍ୱିନାଲଫସ୍ 25 ପ୍ରତିଶତ ଇ. ସି. କିମ୍ବା 1 ମିଲି ଡାଇକ୍ଲୋରୋଭସ୍ 76 ପ୍ରତିଶତ ଇ. ସି.",
            "କଳା ଗହମ/ସବୁଜ ଗହମରେ ଏଫିଡ୍ କୀଟ ସଂକ୍ରମଣ କ୍ଷେତ୍ରରେ ଏକର ପିଛା 200 ଲିଟର ମିଶ୍ରଣରେ ଲିଟର ପିଛା 2 ମିଲି ଡାଇମେଥୋଏଟ୍ 30 ପ୍ରତିଶତ ଇସି କିମ୍ବା 0.3 ମିଲି ଇମିଡାକ୍ଲୋପ୍ରିଡ୍ 17.8%SL ସ୍ପ୍ରେ କରନ୍ତୁ।",
            "ସବୁଜ ଗହମ/କଳା ଗହମରେ, ଫୁଟ୍ରୋଟ୍ କାରଣରୁ ମରିଯିବା ସଂକ୍ରମଣ ହେବାର ସମ୍ଭାବନା ଥାଏ | ଏହି କବକନାଶକକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ ଗଛର ପାଦଦେଶରେ ଏକର ପିଛା 2 ଗ୍ରାମ କାର୍ବେନଡାଜିମ୍ 12 ପ୍ରତିଶତ + ମାନକୋଜେବ୍ 63 ପ୍ରତିଶତ ଡବ୍ଲ୍ୟୁ. ପି. କିମ୍ବା 2 ଗ୍ରାମ ମେଟାଲ୍ୟାକ୍ସିଲ୍ 8 ପ୍ରତିଶତ + ମାନକୋଜେବ୍ 64 ପ୍ରତିଶତ ଡବ୍ଲ୍ୟୁ. ପି. ଲିଟର ପିଛା ପାଣି <ଆଇ. ଡି. 1> ଲିଟର ମିଶ୍ରଣ ସ୍ପ୍ରେ କରନ୍ତୁ।",
            "1 ମିଲି ଫେନକ୍ସୋଲ 10 ପ୍ରତିଶତ ଇସି କିମ୍ବା 1 ମିଲି ପ୍ରୋପିକୋନାଜୋଲ 25 ପ୍ରତିଶତ ଇସି କିମ୍ବା 1 ମିଲି ଟିବୁକୋନାଜୋଲ 25.9%EC କିମ୍ବା 4 ଗ୍ରାମ ସଲଫର୍ 80 ପ୍ରତିଶତ ଡବ୍ଲ୍ଯ଼ୁ. ପି. ପ୍ରତି ଲିଟର ପାଣି @200 ଲିଟର ପ୍ରତି ଏକର ପିଛା ସ୍ପ୍ରେ କରନ୍ତୁ।",
            "ଯେତେବେଳେ ହଳଦିଆ ମୋଜାଇକ ଜୀବାଣୁ ସଂକ୍ରମଣ ହୁଏ, ଏହାର ଭେକ୍ଟର ଅର୍ଥାତ୍ ଧଳା ମାଛି ଯାଞ୍ଚ କରିବା ପାଇଁ ଏକର ପିଛା ଲିଟର ପିଛା 2 ମିଲି ଡାଇମେଥୋଏଟ୍ 30 ପ୍ରତିଶତ ଇସି କିମ୍ବା 0.3 ଗ୍ରାମ ଏସିଟାମିପ୍ରିଡ୍ 20 ପ୍ରତିଶତ ଏସପି @200 ଲିଟରର ମିଶ୍ରଣ ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "horticulture": {
         "advisory": [
            "ଜଳ ନିଷ୍କାସନ ପାଇଁ ବ୍ଯ଼ବସ୍ଥା କରନ୍ତୁ।",
            "ଯଦି ବାଇଗଣ କିମ୍ବା ଟମାଟୋର ଚାରା ବର୍ଷା ଦ୍ୱାରା ଓଲଟି ପଡ଼େ, ତେବେ ସେଗୁଡ଼ିକୁ ଷ୍ଟେକିଂ କରି ସିଧା କରନ୍ତୁ।",
            "ବାଇଗଣ ଏବଂ ଟମାଟୋରେ ଶୁଖିଯିବା ପାଇଁ ପ୍ରତି ଲିଟର ପାଣିରେ 1.5 ଗ୍ରାମ ଷ୍ଟ୍ରିପ୍ଟୋସାଇକ୍ଲିନ୍ + 3 ଗ୍ରାମ କପର ଅକ୍ସିକ୍ଲୋରାଇଡ୍ ମୂଳ ଅଞ୍ଚଳରେ ସ୍ପ୍ରେ କରନ୍ତୁ, ଏକ ଏକର ପାଇଁ ଆବଶ୍ଯ଼କ 200 ଲିଟର ମିଶ୍ରଣ।",
            "ବାଇଗଣରେ ଫଳ ପଚିଯିବା ପାଇଁ ଲିଟର ପିଛା 2 ଗ୍ରାମ କାର୍ବେନଡାଜିମ୍ 12% + ମାନକୋଜେବ୍ 63% ଡବ୍ଲ୍ଯ଼ୁ. ପି. ପାଣି ସ୍ପ୍ରେ କରନ୍ତୁ, ଏକ ଏକର ପାଇଁ ଆବଶ୍ଯ଼କ 200 ଲିଟର ମିଶ୍ରଣ।"
         ]
      },
      "french bean": {
         "advisory": [
            "ଜଳ ନିଷ୍କାସନ ପାଇଁ ବ୍ଯ଼ବସ୍ଥା କରନ୍ତୁ।",
            "0. 4 ମିଲି ଫ୍ଲୁବେଣ୍ଡିଆମାଇଡ୍ 39.35%SC/litre ସ୍ପ୍ରେ କରନ୍ତୁ, କେଶଯୁକ୍ତ କ୍ଯ଼ାଟର୍ପିଲାରର ଆକ୍ରମଣ ପାଇଁ 200 ଲିଟର କୀଟନାଶକ ଆବଶ୍ଯ଼କ।",
            "ଯଦି ସେରକୋସ୍ପୋରା ପତ୍ର ଦାଗ ଦେଖାଯାଏ ତେବେ 1 ମିଲି ଡିଫେନୋକାନାଜୋଲ 25 ପ୍ରତିଶତ ଇସି କିମ୍ବା 2 ଗ୍ରାମ କାର୍ବେଣ୍ଡାଜିମ୍ 12 ପ୍ରତିଶତ + ମାନକୋଜେବ୍ 63 ପ୍ରତିଶତ ଡବ୍ଲ୍ୟୁ. ପି. (2 ଗ୍ରାମ)/1 ଲିଟର ପାଣି ସ୍ପ୍ରେ କରନ୍ତୁ। 1 ଏକର ଜମିରେ ସିଞ୍ଚନ କରିବା ପାଇଁ 200 ଲିଟର ମିଶ୍ରଣ ଆବଶ୍ୟକ ହୋଇଥାଏ।",
            "ଟପ୍ ରଟ୍ ଏବଂ ବ୍ଲାକ୍ ସ୍ପଟ୍ ରୋଗରୁ ନିଯ଼ନ୍ତ୍ରଣ ପାଇଁ ଲିଟର ପିଛା 3 ଗ୍ରାମ କପର୍ ଅକ୍ସିକ୍ଲୋରାଇଡ୍ 50 ପ୍ରତିଶତ ଡବ୍ଲ୍ଯ଼ୁ. ପି. ସ୍ପ୍ରେ କରନ୍ତୁ।",
            "ପାଉଡର ଫଙ୍ଗୁରିରୁ ନିଯ଼ନ୍ତ୍ରଣ ପାଇଁ 1 ମିଲି ପେନକୋନାଜୋଲ 10 ପ୍ରତିଶତ ଇସି କିମ୍ବା 1 ମିଲି ପ୍ରୋପିକୋନାଜୋଲ 25 ପ୍ରତିଶତ ଇସି କିମ୍ବା 1 ଗ୍ରାମ ଟେବୁକୋନାଜୋଲ 25.9%EC କିମ୍ବା 4 ଗ୍ରାମ ସଲଫର 80 ପ୍ରତିଶତ ଡବ୍ଲ୍ଯ଼ୁ. ପି. @200 ଲିଟର ପାଣିର ମିଶ୍ରଣ ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "banana": {
         "advisory": [
            "ଜଳ ନିଷ୍କାସନ ପାଇଁ ବ୍ଯ଼ବସ୍ଥା କରନ୍ତୁ।",
            "ସିଗାଟୋକା ପତ୍ର ଦାଗରୁ ନିୟନ୍ତ୍ରଣ ପାଇଁ ଲିଟର ପିଛା 2 ଗ୍ରାମ କାର୍ବେନଡାଜିମ୍ 12 ପ୍ରତିଶତ + ମାନକୋଜେବ୍ 63 ପ୍ରତିଶତ ଡବ୍ଲ୍ୟୁ. ପି. କିମ୍ବା କ୍ଲୋରୋଥାଲୋନିଲ୍ 75 ପ୍ରତିଶତ ଡବ୍ଲ୍ୟୁ. ପି. ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "papaya": {
         "advisory": [
            "ଜଳ ନିଷ୍କାସନ ପାଇଁ ବ୍ଯ଼ବସ୍ଥା କରନ୍ତୁ।",
            "ମିଲିବଗ୍ ଏବଂ ଏଫିଡ୍ ଠାରୁ ରକ୍ଷା ପାଇବା ପାଇଁ ଲିଟର ପିଛା 0.3 ମିଲି ଇମିଡାକ୍ଲୋପ୍ରିଡ୍ 17.8%SL କିମ୍ବା 0.3 ଗ୍ରାମ୍ ଥିଓମେଥୋକ୍ସାମ୍ 25 ପ୍ରତିଶତ ଡବ୍ଲୁଜି ପାଣି ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "coconut": {
         "advisory": [
            "ଲାଲ ପାମ୍ ୱିଭିଲର ସଂକ୍ରମଣରୁ ନିଯ଼ନ୍ତ୍ରଣ ପାଇଁ କାଣ୍ଡର ଗର୍ତ୍ତରେ କାର୍ବେଣ୍ଡାଜିମ୍ 3% G + ବାଲି 1:1 ଅନୁପାତ ପ୍ରଯ଼ୋଗ କରନ୍ତୁ ଏବଂ ଗର୍ତ୍ତକୁ ପ୍ଲଗ୍ କରନ୍ତୁ |",
            "ଗଣ୍ଡା ଭୃଣରୁ ନିଯ଼ନ୍ତ୍ରଣ ପାଇଁ ନଡ଼ିଆ ବଗିଚାର ନିକଟସ୍ଥ କମ୍ପୋଷ୍ଟ ପ୍ରାଙ୍ଗଣକୁ ସଫା କରନ୍ତୁ ଏବଂ 1.5 ପ୍ରତିଶତ କ୍ଲୋରୋପାଇରିଫୋସ୍ ଧୂଳି ଲଗାଇ ଏହାକୁ ଜୀବାଣୁମୁକ୍ତ କରନ୍ତୁ |"
         ]
      }
   },
   "date": "25-10-2024"
}