{
   "weather_details": {
      "22.07.2024": {
         "rainfall": 94,
         "t_max": 26,
         "t_min": 24,
         "rh_max": 26,
         "rh_min": 24,
         "wind_speed": 0,
         "wind_direction": 0,
         "cloud_cover": 0
      },
      "23.07.2024": {
         "rainfall": 54,
         "t_max": 26,
         "t_min": 24,
         "rh_max": 26,
         "rh_min": 24,
         "wind_speed": 0,
         "wind_direction": 0,
         "cloud_cover": 0
      },
      "24.07.2024": {
         "rainfall": 25,
         "t_max": 29,
         "t_min": 24,
         "rh_max": 29,
         "rh_min": 24,
         "wind_speed": 0,
         "wind_direction": 0,
         "cloud_cover": 0
      },
      "25.07.2024": {
         "rainfall": 14,
         "t_max": 27,
         "t_min": 24,
         "rh_max": 27,
         "rh_min": 24,
         "wind_speed": 0,
         "wind_direction": 0,
         "cloud_cover": 0
      }
   },
   "names_of_crops": [
      "ଚାଉଳ",
      "ମକା",
      "ରାଗି।",
      "ଫୁଲକୋବି",
      "ଲଙ୍କା"
   ],
   "general_advisory": "କ୍ଷେତରେ ଶେଷ ହଳ କରିବା ସମଯ଼ରେ ଭଲ ଭାବେ ସଙ୍କୁଚିତ ଫାର୍ମ ଯ଼ାର୍ଡ ସାର/ଭର୍ମିକମ୍ପୋଷ୍ଟ ଲଗାନ୍ତୁ। ଖରିଫ ଫସଲ ଅମଳ ପୂର୍ବରୁ ମାଟିର ନମୁନା ସଂଗ୍ରହ କରନ୍ତୁ ଏବଂ ନିକଟସ୍ଥ ମୃତ୍ତିକା ପରୀକ୍ଷଣ ପରୀକ୍ଷାଗାରରେ ଏହାର ପରୀକ୍ଷା କରନ୍ତୁ। ମୃତ୍ତିକା ପରୀକ୍ଷା ଆଧାରିତ ସୁପାରିଶ ଅନୁଯାଯ଼ୀ ସମସ୍ତ ଫସଲରେ ସନ୍ତୁଳିତ ସାର ପ୍ରଯ଼ୋଗ କରନ୍ତୁ। ନିକଟସ୍ଥ ବ୍ଯ଼ବସାଯ଼ୀଙ୍କଠାରୁ କୃଷକମାନଙ୍କ ଜମି ସ୍ଥିତି ଅନୁଯାଯ଼ୀ ରୋଗ ଏବଂ କୀଟପତଙ୍ଗ ପ୍ରତିରୋଧକ ହାଇବ୍ରିଡ୍ କିମ୍ବା ଅଧିକ ଉତ୍ପାଦନକ୍ଷମ ଧାନ ସଂଗ୍ରହ କରନ୍ତୁ।",
   "crops_data": {
      "rice": {
         "advisory": [
            "ନିକଟସ୍ଥ ବ୍ଯ଼ବସାଯ଼ୀଙ୍କଠାରୁ କୃଷକମାନଙ୍କ ଜମି ସ୍ଥିତି ଅନୁଯାଯ଼ୀ ରୋଗ ଏବଂ କୀଟପତଙ୍ଗ ପ୍ରତିରୋଧକ ହାଇବ୍ରିଡ୍ କିମ୍ବା ଅଧିକ ଉତ୍ପାଦନକ୍ଷମ ଧାନ ସଂଗ୍ରହ କରନ୍ତୁ।",
            "ଧାନ ରୋପଣ ପୂର୍ବରୁ ଧାନଚା ମଞ୍ଜି ଏକର ପିଛା 10 କିଲୋଗ୍ରାମ ଲେଖାଏଁ ବୁଣିବା ପାଇଁ କୃଷକମାନଙ୍କୁ ପରାମର୍ଶ ଦିଆଯାଇଛି, ଯାହାଦ୍ୱାରା ଧାନ ରୋପଣ ସମଯ଼ରେ ଧାନଚା ଫସଲ 3-4 ସପ୍ତାହ ପୁରୁଣା ହୋଇଯିବ। ଧାନ ଚାଷ ପାଇଁ ଆବଶ୍ଯ଼କ ଧାଇଞ୍ଚା କ୍ଷେତରେ ଫସଫଟିକ୍ ସାର ପ୍ରଯ଼ୋଗ କରନ୍ତୁ।",
            "15-25 ଦିନର ଚାରା ରୋପଣ କରନ୍ତୁ। ନର୍ସରୀ ଚାରା କିମ୍ବା ମୂଳ ଉପୁଡ଼ି ଯାଇଥିବା ଚାରା ଗୁଡ଼ିକୁ ନିମ୍ବ ତେଲର ଦ୍ରବଣରେ ଲିଟର ପିଛା 5 ମିଲି ଏବଂ ମେଟାଲାକ୍ସାଇଲ୍ + ମାଙ୍କୋଜେବ୍ ଲିଟର ପିଛା 1.25 ଗ୍ରାମ୍ ପାଣିରେ ବ୍ଯ଼ବହାର କରନ୍ତୁ।"
         ]
      },
      "maize": {
         "advisory": [
            "ଏକର ପିଛା 10 କିଲୋଗ୍ରାମ ମକା ସଂକର ମଞ୍ଜି ବୁଣିବା ସମ୍ପୂର୍ଣ୍ଣ କରନ୍ତୁ, ଯେଉଁଥିରେ ଧାଡ଼ି ଠାରୁ ଧାଡ଼ି ମଧ୍ଯ଼ରେ 60 ସେ. ମି. ଏବଂ ଗଛଗୁଡ଼ିକ ମଧ୍ଯ଼ରେ 20-25 ସେ. ମି. ବ୍ଯ଼ବଧାନ ରହିବ।",
            "ମକା କ୍ଷେତରେ ଆଗାଛାକୁ ନିଯ଼ନ୍ତ୍ରଣ କରିବା ପାଇଁ ବୁଣିବାର 2 ଦିନ ମଧ୍ଯ଼ରେ ଆଟ୍ରାଜିନ୍ @1Kg/ଏକର ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "ragi": {
         "advisory": [
            "ସିଧାସଳଖ ରାଗି ବୁଣିବା ପାଇଁ ଏହା ହେଉଛି ସର୍ବୋତ୍ତମ ସମଯ଼। ଏକର ପିଛା 4 କି. ଗ୍ରା. ହାରରେ 22.5 ସେ. ମି. ବ୍ଯ଼ବଧାନରେ ମଞ୍ଜି ବୁଣନ୍ତୁ। ବୁଣିବା ସମଯ଼ରେ ଏକର ପିଛା 35 କିଲୋଗ୍ରାମ ଡିଏପି ଏବଂ 17 କିଲୋଗ୍ରାମ ଏମଓପି ଲଗାନ୍ତୁ। ମଞ୍ଜି ବୁଣିବା ପୂର୍ବରୁ କାର୍ବୋକ୍ସିନ 37.5% + ଥିରାମ 37.5% DS @2 ଗ୍ରାମ/କିଲୋଗ୍ରାମ ମଞ୍ଜି ବ୍ଯ଼ବହାର କରିବା ଉଚିତ।",
            "ଏକର ପିଛା 4 କିଲୋଗ୍ରାମ ଅର୍ଜୁନ, କଲୁଆ, ଭରବି ଇତ୍ଯ଼ାଦି ଅଧିକ ଉତ୍ପାଦନକ୍ଷମ କିସମ ରାଗି ମଞ୍ଜି ବୁଣନ୍ତୁ।"
         ]
      },
      "cauliflower": {
         "advisory": [
            "ଏକର ପିଛା 6 କିଲୋଗ୍ରାମ ପତ୍ରଯୁକ୍ତ ଧନିଆ ବୁଣାଯାଇପାରେ।",
            "ବ୍ଯ଼ାକ୍ଟେରିଆ ୱିଲ୍ଟ ପ୍ରତିରୋଧକ ପ୍ରାରମ୍ଭିକ ଫୁଲକୋବି ଏବଂ ବନ୍ଧାକୋବି କିସମର ନର୍ସରୀ ବଢ଼ାନ୍ତୁ |"
         ]
      },
      "chilli": {
         "advisory": [
            "ଯଦି କାର୍ବେଣ୍ଡାଜିମ୍ ସ୍ପ୍ରେ 50 ପ୍ରତିଶତ ଡବ୍ଲ୍ଯ଼ୁ. ପି. @2 ଗ୍ରାମ୍/ଲିଟର ପାଣି କିମ୍ବା କପର୍ ଅକ୍ସାଇକ୍ଲୋରାଇଡ୍ 50 ପ୍ରତିଶତ ଡବ୍ଲ୍ଯ଼ୁ. ପି. @3 ଗ୍ରାମ୍/ଲିଟର ପାଣି ସ୍ପ୍ରେ କରାଯାଏ, ତେବେ ଲଙ୍କା ଏବଂ ବାଇଗଣରେ ଫଳ କ୍ଷଯ଼ ହେବାର ସମ୍ଭାବନା ରହିଛି।"
         ]
      }
   },
   "date": "26-07-2024"
}