{
   "weather_details": {
      "2024-09-27": {
         "rainfall": 0,
         "t_max": 29,
         "t_min": 22,
         "rh_max": 97,
         "rh_min": 76,
         "wind_speed": 9,
         "wind_direction": 156,
         "cloud_cover": 8
      },
      "2024-09-28": {
         "rainfall": 5,
         "t_max": 30,
         "t_min": 23,
         "rh_max": 92,
         "rh_min": 67,
         "wind_speed": 6,
         "wind_direction": 225,
         "cloud_cover": 8
      },
      "2024-09-29": {
         "rainfall": 5,
         "t_max": 31,
         "t_min": 23,
         "rh_max": 87,
         "rh_min": 65,
         "wind_speed": 6,
         "wind_direction": 270,
         "cloud_cover": 6
      },
      "2024-09-30": {
         "rainfall": 2,
         "t_max": 32,
         "t_min": 24,
         "rh_max": 90,
         "rh_min": 64,
         "wind_speed": 6,
         "wind_direction": 244,
         "cloud_cover": 6
      },
      "2024-10-01": {
         "rainfall": 2,
         "t_max": 34,
         "t_min": 25,
         "rh_max": 92,
         "rh_min": 68,
         "wind_speed": 7,
         "wind_direction": 238,
         "cloud_cover": 6
      }
   },
   "names_of_crops": [
      "ଚାଉଳ",
      "ଆଖୁ",
      "କଦଳୀ ବୋତଲ",
      "ଚିକେନ୍"
   ],
   "general_advisory": "ସାର ପ୍ରଯ଼ୋଗ ଏବଂ ରାସାଯ଼ନିକ ସିଞ୍ଚନ ଠାରୁ ଦୂରେଇ ରୁହନ୍ତୁ। ଜଳମଗ୍ନ ଅବସ୍ଥା କିମ୍ବା ମୃତ୍ତିକାର ନିରନ୍ତର ପରିପୂର୍ଣ୍ଣ ଅବସ୍ଥା ହେତୁ, ଫସଲଗୁଡ଼ିକ ମାଇକ୍ରୋ ନ୍ଯ଼ୁଟ୍ରିଏଣ୍ଟ ଅଭାବ ଦେଖାନ୍ତି | ତେଣୁ, ବର୍ଷା ବନ୍ଦ ହେବା ପରେ ତୁରନ୍ତ ସୂକ୍ଷ୍ମ ପୋଷକ ତତ୍ତ୍ୱର ପତ୍ର ସ୍ପ୍ରେ କରନ୍ତୁ।",
   "crops_data": {
      "rice": {
         "advisory": [
            "ଟ୍ରାନ୍ସପ୍ଲାଣ୍ଟ ହୋଇଥିବା ଚାଉଳ ସର୍ବାଧିକ ପି. ଆଇ. ପର୍ଯ୍ଯ଼ାଯ଼ରେ ରହିଛି, ଆଗାମୀ ପାଞ୍ଚ ଦିନ ମଧ୍ଯ଼ରେ ଚାରି ଦିନ ପାଇଁ ଜିଲ୍ଲାରେ ମଧ୍ଯ଼ମ ବର୍ଷା ହେବାର ସମ୍ଭାବନା ରହିଛି। ତେଣୁ ଅତିରିକ୍ତ ଜଳ ନିଷ୍କାସନ ପାଇଁ ବ୍ଯ଼ବସ୍ଥା କରନ୍ତୁ ଏବଂ ସାର ଏବଂ କୀଟନାଶକ ପ୍ରଯ଼ୋଗକୁ କିଛି ସମଯ଼ ପାଇଁ ବନ୍ଦ କରନ୍ତୁ। ବର୍ତ୍ତମାନର ସ୍ଥିତି (ମେଘୁଆ ଆକାଶ, ଉଚ୍ଚ ଆର୍ଦ୍ରତା, ଦିନର ତାପମାତ୍ରା ସହିତ ମଧ୍ଯ଼ବର୍ତ୍ତୀ ବର୍ଷା କିନ୍ତୁ ରାତିର ତାପମାତ୍ରା କମ୍) ବ୍ଯ଼ାକ୍ଟେରିଆଲ୍ ବ୍ଲାଇଟ୍, ବିସ୍ଫୋରଣ ଇତ୍ଯ଼ାଦି ଅନେକ ରୋଗର ଘଟଣା ପାଇଁ ଅତ୍ଯ଼ନ୍ତ ଅନୁକୂଳ | ତେଣୁ ନିଜ ପଡ଼ିଆରେ ସତର୍କ ରୁହନ୍ତୁ। ଜୀବାଣୁଜନିତ ରୋଗ ପାଇଁ ଏକର ପିଛା 200 ଲିଟର ପାଣିରେ 200 ଗ୍ରାମ୍ ପ୍ଲାଣ୍ଟୋମାଇସିନ୍ + 200 ଗ୍ରାମ୍ କପର ଅକ୍ସିକ୍ଲୋରାଇଡ୍ ଲଗାନ୍ତୁ। ବିସ୍ଫୋରଣ ଘଟଣା କ୍ଷେତ୍ରରେ, ବର୍ଷା ବନ୍ଦ ହେବା ପରେ ରୋଗକୁ ନିଯ଼ନ୍ତ୍ରଣ କରିବା ପାଇଁ ଏକର ପିଛା 50 ପ୍ରତିଶତ + ଟ୍ରାଇଫ୍ଲୋକ୍ସିଷ୍ଟୋବିନ୍ 25 ପ୍ରତିଶତ @80 ଗ୍ରାମ କିମ୍ବା କାର୍ବେଣ୍ଡାଜିମ୍ 50 ଡବ୍ଲ୍ଯ଼ୁ. ପି. @400 ଗ୍ରାମ ସ୍ପ୍ରେ କରାଯାଇପାରେ।"
         ]
      },
      "sugarcane": {
         "advisory": [
            "କାର୍ଯ୍ଯ଼କ୍ରମ ଶେଷ ହେବା ପରେ, ଠିଆ ହୋଇଥିବା ଫସଲ କ୍ଷେତରୁ ଅତିରିକ୍ତ ପାଣି ବାହାର କରନ୍ତୁ ଏବଂ ଆଖୁ, କଦଳୀ ଗଛ (ସେଗୁଡ଼ିକୁ ଫସଲ (ପର୍ଯ୍ଯ଼ାଯ଼) ଫସଲ ନିର୍ଦ୍ଦିଷ୍ଟ ପରାମର୍ଶ ସ୍ଥିର ରଖିବା ପାଇଁ), ପନିପରିବା ଏବଂ ଫଳ ଗଛକୁ ଯାନ୍ତ୍ରିକ ସହାଯ଼ତା ଏବଂ ଏହିପରି, କ୍ଷତିକୁ ହ୍ରାସ କରିବା ପାଇଁ କାର୍ଯ୍ଯ଼ କରନ୍ତୁ |"
         ]
      },
      "bottle gourd": {
         "advisory": [
            "ବର୍ଷା ପରେ ପନିପରିବାରେ ଫଙ୍ଗସ୍ ସଂକ୍ରମଣ ହୋଇପାରେ, କାର୍ବେନଡାଜିମ୍ + ମାଙ୍କୋଜେବ୍ 2 ଗ୍ରାମ୍/ଲିଟର ପାଣି ପ୍ରୟୋଗ କରନ୍ତୁ।"
         ]
      },
      "chicken": {
         "advisory": [
            "ଖାଦ୍ଯ଼ ସାମଗ୍ରୀଗୁଡ଼ିକ ଓଦା ହେବାରୁ ରକ୍ଷା କରନ୍ତୁ, ଏବଂ ଖାଦ୍ଯ଼ର ପରିମାଣ ଅତ୍ଯ଼ଧିକ ହେବା ଉଚିତ ନୁହେଁ। ଘରର ଯୌଗିକ ଖାଦ୍ଯ଼କୁ ମାଟି ଉପରେ ଥିବା ମଞ୍ଚ ଉପରେ ରଖିବା ଉଚିତ, ଯାହାଦ୍ୱାରା ଖାଦ୍ଯ଼କୁ ଆର୍ଦ୍ରତା ଫେରିଆସିବାରୁ ରୋକାଯାଇପାରିବ। ଫଙ୍ଗସ୍ ପ୍ରଦୂଷଣରୁ ରକ୍ଷା ପାଇବା ପାଇଁ ଫିଡର୍ଗୁଡ଼ିକର ନିଯ଼ମିତ ଯାଞ୍ଚ। ଏହି ବର୍ଷା ଋତୁରେ ନିଯ଼ମିତ ବ୍ଯ଼ବଧାନରେ ଆପଣଙ୍କ ପକ୍ଷୀମାନଙ୍କୁ ଗରମ ପାଣି ଦିଅନ୍ତୁ, ଯାହାଦ୍ୱାରା ସେମାନେ ଖାଇବାରେ ଉତ୍ସାହିତ ହୋଇପାରିବେ ଏବଂ ଏହି ପ୍ରକ୍ରିଯ଼ାରେ ସଂରକ୍ଷିତ 'ଅପ୍ ଏନର୍ ଜି' ବ୍ଯ଼ବହାର ନକରି ସେମାନଙ୍କୁ ଗରମ ରଖିବାରେ ସାହାଯ୍ଯ଼ କରିପାରିବେ।"
         ]
      }
   },
   "date": "27-09-2024"
}