{
   "weather_details": {
      "2024-09-28": {
         "rainfall": 15,
         "t_max": 29,
         "t_min": 24,
         "rh_max": 93,
         "rh_min": 75,
         "wind_speed": 13,
         "wind_direction": 198,
         "cloud_cover": 8
      },
      "2024-09-29": {
         "rainfall": 10,
         "t_max": 30,
         "t_min": 25,
         "rh_max": 92,
         "rh_min": 66,
         "wind_speed": 9,
         "wind_direction": 212,
         "cloud_cover": 7
      },
      "2024-09-30": {
         "rainfall": 5,
         "t_max": 32,
         "t_min": 25,
         "rh_max": 88,
         "rh_min": 68,
         "wind_speed": 8,
         "wind_direction": 246,
         "cloud_cover": 4
      },
      "2024-10-01": {
         "rainfall": 5,
         "t_max": 32,
         "t_min": 25,
         "rh_max": 89,
         "rh_min": 62,
         "wind_speed": 9,
         "wind_direction": 248,
         "cloud_cover": 4
      },
      "2024-10-02": {
         "rainfall": 5,
         "t_max": 34,
         "t_min": 26,
         "rh_max": 90,
         "rh_min": 68,
         "wind_speed": 9,
         "wind_direction": 207,
         "cloud_cover": 4
      }
   },
   "names_of_crops": [
      "ଚାଉଳ",
      "ପିଜନ୍ ମଟର",
      "ମକା",
      "ବାଇଗଣ",
      "କାକୁଡ଼ି",
      "ପେଁପେ",
      "ଛେଳି।",
      "ଗାଈ।",
      "ମଧୁର ଜଳ"
   ],
   "general_advisory": "ଧାନ ଏବଂ ଅଣ-ଧାନ ଫସଲରୁ ଅତିରିକ୍ତ ପାଣି ବାହାର କରନ୍ତୁ। ପରିପକ୍ୱ ହୋଇଥିବା ପନିପରିବା ଏବଂ ଫୁଲଗୁଡ଼ିକୁ କାଟି ସୁରକ୍ଷିତ ସ୍ଥାନରେ ରଖନ୍ତୁ। ଅଗଭୀର ତଳିଆ/ମଧ୍ୟମ ଧରଣର ଜମିରେ ଧାନ ପ୍ରତିରୋପଣ ସମୟରେ ଏଚ. ୱାଇ. ଭି. ପାଇଁ ଏକର ପିଛା 35 କିଲୋଗ୍ରାମ ୟୁରିଆ ଏବଂ ହାଇବ୍ରିଡ୍ ପାଇଁ ଏକର ପିଛା 42 କିଲୋଗ୍ରାମ ୟୁରିଆ ଚାଷ କରନ୍ତୁ। ଜିଙ୍କ ଅଭାବ ଥିବା ମାଟିରେ, ଯଦି ଅନ୍ତିମ ଭୂମି ପ୍ରସ୍ତୁତି ସମୟରେ ଜିଙ୍କ ସଲଫେଟ୍ (ଜେଡ. ଏନ. ଏସ. ଓ. 4) ପ୍ରୟୋଗ କରାଯାଇନଥାଏ, ତେବେ ଧାନ ରୋପଣର 30 ଏବଂ 45 ଦିନ ପରେ ଲିଟର ପିଛା 0.5 ଗ୍ରାମ ଜଳରେ ଜେଡ. ଏନ.-ଇ. ଡି. ଟି. ଏ. ସ୍ପ୍ରେ କରନ୍ତୁ କିମ୍ବା ହେକ୍ଟର ପିଛା 400 ଲିଟର ପାଣିରେ 0.5 ପ୍ରତିଶତ ଜେଡ. ଏନ. ଏସ. ଓ. 4 ଦ୍ରବଣ (2 କି. ଗ୍ରା. ଜେଡ. ଏନ. ଏସ. ଓ. 4 + 10 କି. ଗ୍ରା. ଚୂନ) 15 ଦିନ ବ୍ୟବଧାନରେ ତିନିଥର ସ୍ପ୍ରେ କରନ୍ତୁ। ଧାନ ଚାଷ ସମୟରେ 2ରୁ 3 ସେ. ମି. ପାଣି ଛିଡ଼ା କରି ରଖନ୍ତୁ, ଯଦି ପୂର୍ବରୁ ପ୍ରୟୋଗ କରାଯାଇନଥାଏ। କୀଟପତଙ୍ଗ ଏବଂ ରୋଗର ପ୍ରକୋପ ପାଇଁ ଫସଲର ନିୟମିତ ତଦାରଖ କରାଯିବା ଉଚିତ। ପଶୁଶାଳାକୁ ସଫା ଏବଂ ଶୁଖିଲା ରଖନ୍ତୁ। ପଶୁମାନଙ୍କୁ ଉପଯୁକ୍ତ ଖାଦ୍ୟ ଏବଂ ପାଣି ଯୋଗାଇ ଦିଅନ୍ତୁ ଏବଂ ବର୍ଷାରୁ ରକ୍ଷା ପାଇବା ପାଇଁ ଖାଦ୍ୟକୁ ସୁରକ୍ଷିତ ସ୍ଥାନରେ ରଖନ୍ତୁ।",
   "crops_data": {
      "rice": {
         "advisory": [
            "ପ୍ରଚଳିତ ଆର୍ଦ୍ର ଏବଂ ଆର୍ଦ୍ର ପରିସ୍ଥିତି ହେତୁ ଫସଲରେ ହଳଦିଆ କାଣ୍ଡ ଛେଦକ ଏବଂ ପତ୍ର ଫୋଲଡର ପରି କୀଟପତଙ୍ଗର ଆକ୍ରମଣ ବୃଦ୍ଧି ପାଇପାରେ | ବର୍ତ୍ତମାନର ଉଚ୍ଚ ଆର୍ଦ୍ର ପାଣିପାଗ ସ୍ଥିତି ଏବଂ ବର୍ଷା ପରେ ସ୍ୱଚ୍ଛ ଆକାଶ ଧାନରେ ବ୍ରାଉନ୍ ପ୍ଲାଣ୍ଟ ହପର୍ (ବିପିଏଚ) ଏବଂ ହ୍ୱାଇଟ୍ ବ୍ଯ଼ାକ୍ଡ୍ ପ୍ଲାଣ୍ଟ ହପର୍ (ଡବ୍ଲୁବିପିଏଚ) ସଂକ୍ରମଣ ପାଇଁ ଅନୁକୂଳ | ଧାନରେ ବିପିଏଚ ଏବଂ ଡବ୍ଲ୍ଯ଼ୁ. ବି. ପି. ଏଚ. ପରିଚାଳନା କରିବା ପାଇଁ ନାଇଟ୍ରୋଜେନ ସାରର ଅତ୍ଯ଼ଧିକ ବ୍ଯ଼ବହାରରୁ ଦୂରେଇ ରୁହନ୍ତୁ। କ୍ଷେତରେ ଅଧିକ ସମଯ଼ ଧରି ପାଣି ଛିଡ଼ା କରି ରଖନ୍ତୁ ନାହିଁ। ବିକଳ୍ପ ଭିଜା ଏବଂ ଶୁଖାଇବା କୌଶଳ ଦ୍ୱାରା ଧାନ କ୍ଷେତର ମାଇକ୍ରୋ-ଜଳବାଯ଼ୁ ପରିବର୍ତ୍ତନ କରନ୍ତୁ | ଫସଲ ଅଞ୍ଚଳ ତଳେ ସୂର୍ଯ୍ଯ଼ାଲୋକ ପ୍ରବେଶ ଏବଂ ଉପଯୁକ୍ତ ବାଯ଼ୁ ସଞ୍ଚାଳନ ପାଇଁ 6 ଫୁଟ ବ୍ଯ଼ବଧାନରେ ଗଳି ତିଆରି କରନ୍ତୁ। ଯଦି ବିପିଏଚ ସଂକ୍ରମଣ ହୁଏ (5-10 ହପର/ପାହାଡ), ଗଛର ପାଦଦେଶରେ ନିମ୍ବ ଆଧାରିତ କୀଟନାଶକ 1500 ପିପିଏମ @600-ମିଲି/ଏକର ସ୍ପ୍ରେ କରନ୍ତୁ। ଯଦି ସମସ୍ଯ଼ା ଜାରି ରହେ, ତେବେ ପ୍ଲାଣ୍ଟର ପାଦଦେଶରେ ଏକର ପିଛା 120 ଗ୍ରାମ୍ ପାଇମେଟ୍ରୋଜିନ୍ 50 ପ୍ରତିଶତ ଡବ୍ଲୁ. ଜି. କିମ୍ବା ଏକର ପିଛା 80 ଗ୍ରାମ୍ ଡିନୋଟେଫୁରାନ୍ 20 ପ୍ରତିଶତ ଏସ୍. ଜି. କିମ୍ବା ଏକର ପିଛା 60 ଗ୍ରାମ୍ ଫ୍ଲୋନିକାମିଡ୍ 50 ପ୍ରତିଶତ ଡବ୍ଲୁ. ଜି. କିମ୍ବା ଏକର ପିଛା 100 ମିଲି. ଟ୍ରାଇଫ୍ଲୁମେଜୋପାଇରିମ୍ 10 ପ୍ରତିଶତ ଏସ୍. ସି. ସ୍ପ୍ରେ କରନ୍ତୁ। ବ୍ରାଉନ୍ ପ୍ଲାଣ୍ଟ ହପର୍ ପାଇଁ ସୁପାରିଶ କରାଯାଇଥିବା କୀଟନାଶକକୁ କେବଳ ସୁପାରିସ କରାଯାଇଥିବା ମାତ୍ରାରେ ବ୍ଯ଼ବହାର କରନ୍ତୁ। ଧାନରେ ଲିଫ୍ ଫୋଲ୍ଡର୍ ଏବଂ କେସ୍ ୱର୍ମ୍ କୀଟପତଙ୍ଗ ପରିଚାଳନା ପାଇଁ ଏକର ପିଛା 200 ମିଲି. ରେ ବାଇଫେନ୍ଥ୍ରିନ 10 ପ୍ରତିଶତ ଇସି କିମ୍ବା ଏକର ପିଛା 200 ମିଲି. ରେ ଲାମ୍ବଡା ସାଇହାଲୋଥ୍ରିନ 5 ପ୍ରତିଶତ ଇସି କିମ୍ବା ଏକର ପିଛା 400 ମିଲି. ରେ ଫିପ୍ରୋନିଲ 5 ପ୍ରତିଶତ ଏସସି କିମ୍ବା ଏକର ପିଛା 60 ମିଲି. ରେ କ୍ଲୋରାଣ୍ଟ୍ରାନିଲିପ୍ରୋଲ 18.5% ଏସସି ସ୍ପ୍ରେ କରନ୍ତୁ। ହଳଦିଆ କାଣ୍ଡ ଛେଦକ ପରିଚାଳନାଃ ଫସଲର ପ୍ରାରମ୍ଭିକ ପର୍ଯ୍ଯ଼ାଯ଼ରେ ଧାନରେ କାଣ୍ଡ ଛେଦକକୁ ପରିଚାଳନା କରିବା ପାଇଁ, କାର୍ଟାପ୍ ହାଇଡ୍ରୋକ୍ଲୋରାଇଡ୍ 4 ପ୍ରତିଶତ ଜି @18.45-kg/ha କିମ୍ବା କ୍ଲୋରାଣ୍ଟ୍ରାନିଲିପ୍ରୋଲ୍ 0.4 ପ୍ରତିଶତ ଜିଆର @10 କିଲୋଗ୍ରାମ/ହେକ୍ଟର କିମ୍ବା ଇମିଡାକ୍ଲୋପ୍ରିଡ୍ 0.3 ପ୍ରତିଶତ ଜି @15 କିଲୋଗ୍ରାମ/ହେକ୍ଟର 1:1 ଅନୁପାତରେ ବାଲି ସହିତ ମିଶ୍ରଣ କରି ପ୍ରଯ଼ୋଗ କରନ୍ତୁ। ପତ୍ର ଫୋଲଡର ଏବଂ କେସ୍ କୃମି ପରିଚାଳନାଃ ପତ୍ର ଫୋଲଡର ଏବଂ କେସ୍ କୃମି ଦ୍ୱାରା ଆକ୍ରାନ୍ତ ଧାନ କ୍ଷେତରେ, ହେକ୍ଟର ପିଛା କିରୋସିନି ଏବଂ 50 କିଲୋଗ୍ରାମ ବାଲିର ମିଶ୍ରଣ ଲଗାନ୍ତୁ ଏବଂ ତା 'ପରେ କ୍ଷେତର ଉଭଯ଼ ପାର୍ଶ୍ୱରେ ବିସ୍ତାର କରି ଧାନ ଫସଲ ଉପରେ ଏକ ସୂତା ଘୁଞ୍ଚାନ୍ତୁ | ଏହି ପଦ୍ଧତି ଦ୍ୱାରା କୀଟପତଙ୍ଗର ଲାର୍ଭା ପାଣିରେ ପଡ଼ି ମରିଯାଏ। ଧାନ ସ୍ପ୍ରେରେ ଲିଫ୍ ଫୋଲ୍ଡର୍ ଏବଂ କେସ୍ ୱର୍ମ୍ କୀଟପତଙ୍ଗ ପରିଚାଳନା ପାଇଁ ଫିପ୍ରୋନିଲ୍ 5 ପ୍ରତିଶତ ଏସ୍ସି @1000-ମିଲି/ହେକ୍ଟର କିମ୍ବା ପ୍ରୋଫେନୋଫସ୍ 50 ପ୍ରତିଶତ ଇସି @1000-ମିଲି/ହେକ୍ଟର କିମ୍ବା କ୍ଲୋରାଣ୍ଟ୍ରାନିଲିପ୍ରୋଲ୍ 18.5% ଏସ୍ସି @200-ମିଲି/ହେକ୍ଟର ସ୍ପ୍ରେ କରନ୍ତୁ। ବ୍ଯ଼ାକ୍ଟେରିଆଲ୍ ଲିଫ୍ ବ୍ଲାଇଟ୍ଃ ବ୍ଯ଼ାକ୍ଟେରିଆଲ୍ ଲିଫ୍ ବ୍ଲାଇଟ୍ର ପରିଚାଳନା ପାଇଁ, କପର୍ ହାଇଡ୍ରୋକ୍ସାଇଡ୍ 53.8% DF 3g/ltr କିମ୍ବା କପର୍ ଅକ୍ସିକ୍ଲୋରାଇଡ୍ 50% WP 3.0 g/ltr ସ୍ପ୍ରେ କରନ୍ତୁ। ବିସ୍ଫୋରଣ ରୋଗ ନିଯ଼ନ୍ତ୍ରଣ ପାଇଁ ହେକ୍ଟର ପିଛା 400-ମିଲି ହେକ୍ସାକୋନାଜୋଲ 5 ପ୍ରତିଶତ ଏସ୍. ସି. କିମ୍ବା ଏକର ପିଛା 200-ମିଲି ଡିଫେନୋକୋନାଜୋଲ ଏସ୍. ସି. କିମ୍ବା ଏକର ପିଛା 50 ପ୍ରତିଶତ ଟିବୁକୋନାଜୋଲ, ଟ୍ରାଇଫ୍ଲୋକ୍ସିସ୍ଟ୍ରୋବିନ 25 ପ୍ରତିଶତ ଡବ୍ଲୁ. ଜି., ଏକର ପିଛା 80-ଗ୍ରାମ୍ ସ୍ପ୍ରେ କରନ୍ତୁ। ସିଥ୍ ବ୍ଲାଇଟ୍ ରୋଗକୁ ପରିଚାଳନା କରିବା ପାଇଁ ରାସାଯ଼ନିକ ଭାବରେ ଭାଲିଡାମାଇସିନ୍ 3 ପ୍ରତିଶତ ଏଲ @400-ମିଲି/ଏକର କିମ୍ବା ହେକ୍ସାକୋନାଜୋଲ୍ 5 ପ୍ରତିଶତ ଏସସି @400-ମିଲି/ଏକର କିମ୍ବା ଟେବୁକୋନାଜୋଲ୍ 50 ପ୍ରତିଶତ + ଟ୍ରାଇଫ୍ଲୋକ୍ସିସ୍ଟ୍ରୋବିନ୍ 25 ପ୍ରତିଶତ ଡବ୍ଲୁଜି @80-ଗ୍ରାମ/ଏକର ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "pigeon pea": {
         "advisory": [
            "ଫସଲଟି ବନସ୍ପତିକ ବୃଦ୍ଧି (ସାତରୁ ଆଠ ସପ୍ତାହ) ପର୍ଯ୍ଯ଼ାଯ଼ରେ ରହିଛି। ଫସଲର ଏହି ପର୍ଯ୍ଯ଼ାଯ଼ରେ ହୋଇଂ, ଆଗାଛା କାଟିବା ଏବଂ ମାଟି କାଟିବା ପାଇଁ ଯାଆନ୍ତୁ। ବର୍ଷା କାରଣରୁ ପାଣି ଯେପରି ଜମା ନହୁଏ, ସେଥିପାଇଁ ଜଳ ନିଷ୍କାସନ ବ୍ଯ଼ବସ୍ଥା ରଖନ୍ତୁ। ଜସ୍ସିଡ୍ ସଂକ୍ରମଣ ହେବାର ସମ୍ଭାବନା ରହିଛି। ଜ୍ଯାସିଡ୍ ପରିଚାଳନା ପାଇଁ, 500 ଲିଟର ପାଣିରେ ଇମିଡାକ୍ଲୋପ୍ରିଡ୍ 17.8% ଏସ୍. ଏଲ୍. @140 ମିଲି/ହେକ୍ଟର କିମ୍ବା ଥିଯ଼ାମେଥୋକ୍ସାମ୍ 25 ପ୍ରତିଶତ ଡବ୍ଲୁ. ଜି. @100 ଗ୍ରାମ୍/ହେକ୍ଟର କିମ୍ବା କ୍ଲୋଥିଯ଼ାନିଡିନ୍ 50 ପ୍ରତିଶତ ଡବ୍ଲୁ. ଡି. ଜି. @100 ଗ୍ରାମ୍/ହେକ୍ଟର ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "maize": {
         "advisory": [
            "ଶରତ ଋତୁର ପରିଚାଳନା ପାଇଁ ସେନା କୃମି କୀଟ 200 ଲିଟର ପାଣିରେ ମିଶାଇ ଏକର ପିଛା 1200-ଗ୍ରାମ୍ ବାଯ଼ୋପଷ୍ଟିସାଇଡ୍ ବିଉଭେରିଆ ବାସିଆନା ସ୍ପ୍ରେ କରନ୍ତୁ। ଏକର ପିଛା 10-12 ପକ୍ଷୀ ପର୍ଚ୍ ବ୍ଯ଼ବହାର କରନ୍ତୁ ଏବଂ ଟାସେଲିଂ ପର୍ଯ୍ଯ଼ାଯ଼ ପୂର୍ବରୁ ସେଗୁଡ଼ିକୁ ବାହାର କରନ୍ତୁ | ପତ୍ର ଚକ୍ର ଭିତରେ ବାଲି, ମାଟି ଏବଂ କାଠର ଛାଇର ଧୂଳି ମିଶ୍ରଣ ଲଗାନ୍ତୁ ଯାହା ଦ୍ୱାରା କ୍ଯ଼ାଟର୍ପିଲାର୍ମାନେ ପତ୍ରକୁ ଖାଇପାରିବେ ନାହିଁ | ରାସାଯ଼ନିକ ଉପାଯ଼ରେ ଏହି କୀଟକୁ ନିଯ଼ନ୍ତ୍ରଣ କରିବା ପାଇଁ ଇମାମେକ୍ଟିନ୍ ବେନ୍ଜୋଏଟ୍ 5 ପ୍ରତିଶତ ଏସ୍. ଜି. @80-ଗ୍ରାମ୍/ଏକର କିମ୍ବା ସ୍ପିନେଟୋରାମ୍ <ଆଇ. ଡି. 2> ଏସ୍. ସି. @100-ମିଲି/ଏକର କିମ୍ବା କ୍ଲୋରାଣ୍ଟ୍ରାନିଲିପ୍ରୋଲ୍ <ଆଇ. ଡି. 1> ଏସ୍. ସି. @80-ମିଲି/ଏକରକୁ 200-ଲିଟର ପାଣିରେ ମିଶାଇ ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "brinjal": {
         "advisory": [
            "ବାଇଗଣ ଫୁଲ ଫୁଟାଇବାର ପର୍ଯ୍ଯ଼ାଯ଼ ପର୍ଯ୍ଯ଼ନ୍ତ ରହିଛି। ବର୍ଷା ହ୍ରାସ ପାଇବା ପରେ ଏବଂ ଦିନ ଓ ରାତିର ତାପମାତ୍ରା ବୃଦ୍ଧି ହେବାର ସମ୍ଭାବନା ରହିଛି ଏବଂ ସକାଳ ଆପେକ୍ଷିକ ଆର୍ଦ୍ରତା 70 ପ୍ରତିଶତରୁ ଅଧିକ ବାଇଗଣରେ ଶୁଟ୍ ଏବଂ ଫଳ ଛେଦକକୁ ପସନ୍ଦ କରେ | କୀଟକୁ ପରିଚାଳନା କରିବା ପାଇଁ, ଛିଦ୍ର ଏବଂ ପ୍ରଭାବିତ ଫଳ ଦେଖାଇଥିବା ପ୍ରଭାବିତ ଟର୍ମିନାଲ୍ ଶୁଟ୍ ଅପସାରଣ କରନ୍ତୁ | ଏହି କୀଟକୁ ନିଯ଼ନ୍ତ୍ରଣ କରିବା ପାଇଁ, ଏକର ପିଛା ଲିଉସିନ୍ ଲ୍ଯ଼ୁର୍ ଥିବା 8ଟି ଫେରୋମୋନ୍ ଫାନ୍ଦ ଲଗାନ୍ତୁ। ରାସାଯ଼ନିକ ନିଯ଼ନ୍ତ୍ରଣ ବ୍ଯ଼ବହାର କରନ୍ତୁ ଯଦି ଟର୍ମିନାଲ୍ ଶୁଟର 4 ପ୍ରତିଶତ ଶୁଖିଲା ଅଛି କିମ୍ବା 14 ପ୍ରତିଶତ ଫଳ ବୋରର ଦ୍ୱାରା ସଂକ୍ରମିତ | ରାସାଯ଼ନିକ ନିଯ଼ନ୍ତ୍ରଣ ପାଇଁ ଏମାମେକ୍ଟିନ୍ ବେନ୍ଜୋଏଟ୍ 5 ପ୍ରତିଶତ ଏସ୍ଜି @80-ଗ୍ରାମ୍/ଏକର କିମ୍ବା କ୍ଲୋରାଣ୍ଟ୍ରାନିଲିପ୍ରୋଲ୍ 18.5% ଏସ୍ସି @80-ମିଲି/ଏକର କିମ୍ବା ସ୍ପିନେଟୋରାମ୍ 1 1.7% ଏସ୍ସି @200-ମିଲି/ଏକର ସ୍ପ୍ରେ କରନ୍ତୁ। କୀଟନାଶକ ପ୍ରଯ଼ୋଗ ଏବଂ ଅମଳ ମଧ୍ଯ଼ରେ 7-10 ଦିନର ବ୍ଯ଼ବଧାନ ରହିବା ଉଚିତ୍। ଉପରୋକ୍ତ ଯେ କୌଣସି କୀଟନାଶକକୁ 15 ଦିନର ବ୍ଯ଼ବଧାନରେ ବିକଳ୍ପ ଭାବେ ବ୍ଯ଼ବହାର କରନ୍ତୁ।"
         ]
      },
      "cucumber": {
         "advisory": [
            "ବର୍ଷା ଏବଂ ଆର୍ଦ୍ର ପାଗ, ଉଚ୍ଚ ସକାଳ ଆରଏଚ (> 85 ପ୍ରତିଶତ) ଏବଂ ଜଳ ପରିପୂର୍ଣ୍ଣ ମୃତ୍ତିକା କୁକୁଡ଼ା ପନିପରିବାରେ ଡାଉନି ମାଇଲ୍ଡ୍ଯ଼ୁ ରୋଗକୁ ପସନ୍ଦ କରେ | କୁକୁଡ଼ାରେ ଡାଉନି ମାଇଲ୍ଡ୍ଯ଼ୁ ରୋଗ ପରିଚାଳନା କରିବା ପାଇଁ 10 ଦିନ ବ୍ଯ଼ବଧାନରେ ଦୁଇଥର ମେଟାଲାକ୍ସିଲ୍ @2-ଗ୍ରାମ୍/ଲିଟର କିମ୍ବା ଏଜୋକ୍ସିସ୍ଟ୍ରୋବିନ୍ @1-ଗ୍ରାମ୍/ଲିଟର କିମ୍ବା କପର ଅକ୍ସିକ୍ଲୋରାଇଡ୍ 50% ଡବ୍ଲ୍ଯ଼ୁ. ପି. @3-ଗ୍ରାମ୍/ଲିଟର ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "papaya": {
         "advisory": [
            "ସଂକ୍ରମଣର ପ୍ରାରମ୍ଭିକ ପର୍ଯ୍ଯ଼ାଯ଼ରେ କ୍ଷୁଦ୍ର କୀଟକୁ ପରିଚାଳନା କରିବା ପାଇଁ ନିମ୍ବ-ଆଧାରିତ କୀଟନାଶକ (ନିମ୍ବ ତେଲ 1500 ପିପିଏମ @30-ମିଲି/10 ଲିଟର ପାଣି କିମ୍ବା କୀଟନାଶକ ସାବୁନ) ସ୍ପ୍ରେ କରନ୍ତୁ। ଗୁରୁତର ସଂକ୍ରମଣ କ୍ଷେତ୍ରରେ ପ୍ରୋଫେନ୍ଫସ୍ 50 ପ୍ରତିଶତ ଇସି @20-ମିଲି/10-ଲିଟର ପାଣି କିମ୍ବା ଥିଯ଼ାମେଥୋକ୍ସାମ୍ 25 ପ୍ରତିଶତ ଡବ୍ଲୁଜି @3-ଗ୍ରାମ୍/10-ଲିଟର ପାଣି ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "goat": {
         "advisory": [
            "ଚଟାଣ ଉପରେ ବାଲି ବ୍ଯ଼ବହାର କରି ଆମେ ଚଟାଣକୁ ଶୁଖିଲା ରଖିପାରିବା ଯାହା ଦ୍ୱାରା ପଶୁମାନଙ୍କୁ ବିଭିନ୍ନ ରୋଗରୁ ମୁକ୍ତ ରଖାଯାଇପାରିବ। ଏହି ସେଡର ବିଶେଷତ୍ୱ ହେଉଛି ଚଟାଣଟି ଇଟା ଏବଂ ସିମେଣ୍ଟରେ ନିର୍ମିତ ଏବଂ ନଦୀର ବାଲି ଏହା ଉପରେ 4 ରୁ 6 ଇଞ୍ଚ ମୋଟା ହୋଇଥାଏ। ବାଲି ପରିସ୍ରାକୁ ଭିଜାଇ ରଖେ, ଯାହାଦ୍ୱାରା ପଶୁମାନେ ତା 'ଉପରେ ଆରାମରେ ଶୋଇପାରିବେ। ବାଲିର ଚଟାଣ ଉପରେ ଥିବା ମଳ ପଦାର୍ଥକୁ ସଫା କରିବା ମଧ୍ଯ଼ ସହଜ। ବାଲିକୁ ଶୁଖିଲା ରଖିବା ପାଇଁ ଏହାକୁ 15-20 ଦିନ ବ୍ଯ଼ବଧାନରେ ଓଲଟପାଲଟ କରି ଦିଆଯାଏ। ଶିଶୁଙ୍କ ପାଇଁ ଚଟାଣ ସ୍ଥାନର ଆବଶ୍ଯ଼କତା 0.5, ବଯ଼ସ୍କଙ୍କ ପାଇଁ 1.2, ହରିଣ ପାଇଁ 2 ବର୍ଗ ମିଟର ଏବଂ ଗର୍ଭବତୀ ମହିଳାଙ୍କ ପାଇଁ 2 ବର୍ଗ ମିଟର ଚଟାଣ ସ୍ଥାନ ଆବଶ୍ଯ଼କ, ଯାହା ପ୍ରତ୍ଯ଼େକ ପ୍ରକାରର ଘର ପାଇଁ ଉପଯୁକ୍ତ।"
         ]
      },
      "cow": {
         "advisory": [
            "ମୌସୁମୀ ବର୍ଷା ଆର୍ଦ୍ରତା ଏବଂ ଜଳ ନିଷ୍କାସନ ଅଭାବ ସୃଷ୍ଟି କରିପାରେ, ଅତିରିକ୍ତ ଆର୍ଦ୍ରତାରୁ ମୁକ୍ତି ପାଇବା ପାଇଁ ବାଲି ଏବଂ ଛାଇ ବ୍ଯ଼ବହାର କରେ | ମାଛି ଏବଂ ସେମାନଙ୍କ ସହିତ ଜଡିତ ରୋଗରୁ ରକ୍ଷା ପାଇବା ପାଇଁ ଆଶ୍ରଯ଼ସ୍ଥଳୀକୁ ଫିନାଇଲ ଦ୍ୱାରା ଦୁଇଥର ସଫା କରନ୍ତୁ।"
         ]
      },
      "freshwater": {
         "advisory": [
            "ଫିଙ୍ଗରଲିଙ୍ଗ ଷ୍ଟକ୍ କରିବା ପରେ, ଚିନାବାଦାମ ତେଲ କେକ୍ ଏବଂ ଚାଉଳ ଚୋପା 1:1 ଅନୁପାତରେ ଦିନକୁ ଦୁଇଥର ସେମାନଙ୍କ ଶରୀରର ଓଜନର 5 ପ୍ରତିଶତ ଖାଦ୍ଯ଼ ଭାବରେ ଦିଆଯାଏ | ମାଛକୁ ଦିଆଯାଉଥିବା ମୋଟ ଖାଦ୍ଯ଼ରେ ଭିଟାମିନ୍ ଏବଂ ଖଣିଜ ମିଶ୍ରଣ @1% ମିଶାନ୍ତୁ। ଫିଙ୍ଗରଲିଙ୍ଗ୍ ଷ୍ଟକ୍ କରିବା ପରେ ନିଯ଼ମିତ ଭାବରେ ପିଏଚ୍ ଏବଂ ଜଳ ତାପମାତ୍ରା ଯାଞ୍ଚ କରନ୍ତୁ | ପୋଖରୀ ଜଳକୁ ଶୁଦ୍ଧ କରିବା ପାଇଁ ଏକର ପିଛା 40 କିଲୋଗ୍ରାମ ଚୂନ ମିଶାନ୍ତୁ। ପୋଖରୀରେ ପ୍ଲାଙ୍କଟନର ପରିମାଣ ବଢ଼ାଇବା ପାଇଁ, ମାସକୁ ଦୁଇଥର ଏକର ପିଛା 200 କିଲୋଗ୍ରାମ ଗୋବର ଏବଂ 4 କିଲୋଗ୍ରାମ ସୁପରଫସଫେଟ ଲଗାନ୍ତୁ।"
         ]
      }
   },
   "date": "27-09-2024"
}