{
   "weather_details": {
      "28-09-2024": {
         "rainfall": 20,
         "t_max": 34,
         "t_min": 25,
         "rh_max": 75,
         "rh_min": 97,
         "wind_speed": 9,
         "wind_direction": 162,
         "cloud_cover": 8
      },
      "29-09-2024": {
         "rainfall": 10,
         "t_max": 34,
         "t_min": 26,
         "rh_max": 68,
         "rh_min": 92,
         "wind_speed": 7,
         "wind_direction": 225,
         "cloud_cover": 7
      },
      "30-09-2024": {
         "rainfall": 2,
         "t_max": 35,
         "t_min": 26,
         "rh_max": 64,
         "rh_min": 89,
         "wind_speed": 8,
         "wind_direction": 225,
         "cloud_cover": 6
      },
      "01-10-2024": {
         "rainfall": 2,
         "t_max": 35,
         "t_min": 26,
         "rh_max": 65,
         "rh_min": 95,
         "wind_speed": 10,
         "wind_direction": 225,
         "cloud_cover": 6
      },
      "02-10-2024": {
         "rainfall": 2,
         "t_max": 36,
         "t_min": 27,
         "rh_max": 71,
         "rh_min": 93,
         "wind_speed": 8,
         "wind_direction": 238,
         "cloud_cover": 6
      }
   },
   "names_of_crops": [
      "ଚାଉଳ",
      "କପା",
      "ମକା",
      "ପନିପରିବା ଫସଲ",
      "ଆମ୍ବ",
      "ଗାଈ/ମଇଁଷି"
   ],
   "general_advisory": "ସମ୍ଭାବ୍ଯ଼ ହାଲୁକା ରୁ ମଧ୍ଯ଼ମ ବର୍ଷା ହେତୁ ଜଳସେଚନ ଏବଂ ସିଞ୍ଚନ କାର୍ଯ୍ଯ଼ ସମଯ଼ରେ କୃଷକମାନଙ୍କୁ ଉପଯୁକ୍ତ ଯତ୍ନ ନେବାକୁ ପରାମର୍ଶ ଦିଆଯାଇଛି। ଫଳ ବଗିଚା ଏବଂ ପନିପରିବା କ୍ଷେତରେ ଭଲ ଜଳ ନିଷ୍କାସନ ବ୍ଯ଼ବସ୍ଥା କରାଯିବା ଉଚିତ। ଧାନ ଫସଲରେ କୀଟପତଙ୍ଗ ଏବଂ ରୋଗ ପାଇଁ ନିଯ଼ମିତ ନିରୀକ୍ଷଣ ସୁପାରିଶ କରାଯାଏ | ଅତ୍ଯ଼ଧିକ ବନସ୍ପତି ବୃଦ୍ଧିକୁ ରୋକିବା ଏବଂ କୀଟପତଙ୍ଗ ଏବଂ ରୋଗଗୁଡ଼ିକୁ ଆକର୍ଷିତ କରିବା ପାଇଁ ନାଇଟ୍ରୋଜେନଯୁକ୍ତ ସାରର ଅତ୍ଯ଼ଧିକ ବ୍ଯ଼ବହାରରୁ ଦୂରେଇ ରୁହନ୍ତୁ।",
   "crops_data": {
      "rice": {
         "advisory": [
            "ଧାନ କ୍ଷେତରେ ଉପଯୁକ୍ତ ବୃଦ୍ଧି ପାଇଁ 5 ସେ. ମି. ଜଳ ସ୍ତର ବଜାଯ଼ ରଖନ୍ତୁ।",
            "ବ୍ଯ଼ାକ୍ଟେରିଆ ଲିଫ୍ ବ୍ଲାଇଟ୍ ରୋଗ କ୍ଷେତ୍ରରେ, ନାଇଟ୍ରୋଜେନ୍ ସାରର ଉପର ଡ୍ରେସିଂ ବନ୍ଦ କରନ୍ତୁ ଏବଂ ନିର୍ଦ୍ଦିଷ୍ଟ ଚିକିତ୍ସା ଅନୁସରଣ କରନ୍ତୁ |",
            "ସୁପାରିସ କରାଯାଇଥିବା କୀଟନାଶକ ଦ୍ୱାରା କେସ୍ କୃମି ଆକ୍ରମଣକୁ ନିଯ଼ନ୍ତ୍ରଣ କରନ୍ତୁ।",
            "ଧାନ କ୍ଷେତରେ ପିତ୍ତ ମିଜ୍ ଏବଂ ଅନ୍ଯ଼ାନ୍ଯ଼ କୀଟପତଙ୍ଗକୁ ନିଯ଼ନ୍ତ୍ରଣ କରିବା ପାଇଁ ନିର୍ଦ୍ଦିଷ୍ଟ କୀଟନାଶକ ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "cotton": {
         "advisory": [
            "କପା ଫସଲରେ ଶୋଷକ କୀଟପତଙ୍ଗକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ ନିମ ଆଧାରିତ କୀଟନାଶକ ପ୍ରୟୋଗ କରନ୍ତୁ।",
            "ଫୁଲର ପ୍ରାରମ୍ଭିକ ପର୍ଯ୍ଯ଼ାଯ଼ରେ ରାସାଯ଼ନିକ କୀଟନାଶକରୁ ଦୂରେଇ ରୁହନ୍ତୁ।"
         ]
      },
      "maize": {
         "advisory": [
            "ଟାସେଲିଂ/ସିଲ୍କିଙ୍ଗ ପର୍ଯ୍ଯ଼ାଯ଼ରେ ଯ଼ୁରିଆ ସାର ପ୍ରଯ଼ୋଗ କରନ୍ତୁ।",
            "ନିର୍ଦ୍ଦିଷ୍ଟ କୀଟନାଶକ ଦ୍ୱାରା ସେନା କୃମି ଆକ୍ରମଣକୁ ନିଯ଼ନ୍ତ୍ରଣ କରନ୍ତୁ।"
         ]
      },
      "vegetable crops": {
         "advisory": [
            "ଫଳ ଏବଂ ଶୁଟ୍ ବୋରର୍, ଶୋଷକ କୀଟପତଙ୍ଗ ଏବଂ ରୋଗକୁ ନିଯ଼ନ୍ତ୍ରଣ କରିବା ପାଇଁ ନିର୍ଦ୍ଦିଷ୍ଟ କୀଟନାଶକ ବ୍ଯ଼ବହାର କରନ୍ତୁ |",
            "ଉପଯୁକ୍ତ ଜଳ ନିଷ୍କାସନ ସୁନିଶ୍ଚିତ କରନ୍ତୁ ଏବଂ ଜଳମଗ୍ନ ପରିସ୍ଥିତିକୁ ଏଡ଼ାନ୍ତୁ।"
         ]
      },
      "mango": {
         "advisory": [
            "ପୁରୁଣା ଆମ୍ବ ବଗିଚାରେ ତାଲିମ, ଛାଣିବା ଏବଂ ସଫେଇ ଅଭ୍ୟାସ କାର୍ଯ୍ୟକାରୀ କରନ୍ତୁ।",
            "ଆମ୍ବ ବଗିଚାରେ ପତ୍ର ୱେବର୍ ଏବଂ ପତ୍ର କାଟିବା ୱେଭିଲ୍ ନିଯ଼ନ୍ତ୍ରଣ କରିବାକୁ ନିର୍ଦ୍ଦିଷ୍ଟ କୀଟନାଶକ ବ୍ଯ଼ବହାର କରନ୍ତୁ |"
         ]
      },
      "cow/buffalo": {
         "advisory": [
            "ଗାଈ ଏବଂ ମଇଁଷିରେ ମାସ୍ତାଇଟିସ୍ ରୋଗ ପାଇଁ ପ୍ରତିଷେଧକ ପଦକ୍ଷେପ ଅନୁସରଣ କରନ୍ତୁ |",
            "ଉପଯୁକ୍ତ ପରିମଳ, ଖାଦ୍ଯ଼ ଅଭ୍ଯ଼ାସ ସୁନିଶ୍ଚିତ କରନ୍ତୁ, ଏବଂ ଗୁରୁତର କ୍ଷେତ୍ରରେ ପଶୁ ଚିକିତ୍ସକଙ୍କ ପରାମର୍ଶ ନିଅନ୍ତୁ |"
         ]
      }
   },
   "date": "27-09-2024"
}