{
   "weather_details": {
      "28-09-2024": {
         "rainfall": 5,
         "t_max": 30,
         "t_min": 24,
         "rh_max": 94,
         "rh_min": 71,
         "wind_speed": 7,
         "wind_direction": 159,
         "cloud_cover": 8
      },
      "29-09-2024": {
         "rainfall": 5,
         "t_max": 30,
         "t_min": 25,
         "rh_max": 87,
         "rh_min": 66,
         "wind_speed": 7,
         "wind_direction": 225,
         "cloud_cover": 6
      },
      "30-09-2024": {
         "rainfall": 2,
         "t_max": 31,
         "t_min": 25,
         "rh_max": 86,
         "rh_min": 62,
         "wind_speed": 8,
         "wind_direction": 225,
         "cloud_cover": 6
      },
      "01-10-2024": {
         "rainfall": 2,
         "t_max": 33,
         "t_min": 25,
         "rh_max": 89,
         "rh_min": 64,
         "wind_speed": 9,
         "wind_direction": 238,
         "cloud_cover": 6
      },
      "02-10-2024": {
         "rainfall": 2,
         "t_max": 34,
         "t_min": 26,
         "rh_max": 89,
         "rh_min": 64,
         "wind_speed": 9,
         "wind_direction": 238,
         "cloud_cover": 6
      }
   },
   "names_of_crops": [
      "ଚାଉଳ",
      "କପା",
      "ମକା",
      "ପନିପରିବା ଫସଲ",
      "ଆମ୍ବ",
      "ଗାଈ/ମଇଁଷି"
   ],
   "general_advisory": "ହାଲୁକା ରୁ ମଧ୍ୟମ ବର୍ଷା ହେବାର ସମ୍ଭାବନା ଥିବାରୁ ଜଳସେଚନ ଏବଂ ସିଞ୍ଚନ କାର୍ଯ୍ୟ ସମୟରେ କୃଷକମାନଙ୍କୁ ଉପଯୁକ୍ତ ଯତ୍ନ ନେବାକୁ ପରାମର୍ଶ ଦିଆଯାଇଛି। ଫଳ ବଗିଚା ଏବଂ ପନିପରିବା କ୍ଷେତରେ ଉପଯୁକ୍ତ ଜଳ ନିଷ୍କାସନ ବ୍ୟବସ୍ଥା ବଜାୟ ରଖିବା ଉଚିତ। ଫସଲରେ କୀଟପତଙ୍ଗ ଏବଂ ରୋଗ ପାଇଁ ନିୟମିତ ନିରୀକ୍ଷଣ ସୁପାରିଶ କରାଯାଏ | କୀଟପତଙ୍ଗ ଏବଂ ରୋଗକୁ ରୋକିବା ପାଇଁ ଅତ୍ୟଧିକ ନାଇଟ୍ରୋଜେନ୍ ସାର ବ୍ୟବହାରରୁ ଦୂରେଇ ରୁହନ୍ତୁ।",
   "crops_data": {
      "rice": {
         "advisory": [
            "ଧାନ କ୍ଷେତରେ ଉପଯୁକ୍ତ ବୃଦ୍ଧି ପାଇଁ 5 ସେ. ମି. ଜଳ ସ୍ତର ବଜାୟ ରଖନ୍ତୁ।",
            "ବ୍ଯ଼ାକ୍ଟେରିଆ ଲିଫ୍ ବ୍ଲାଇଟ୍ ରୋଗ କ୍ଷେତ୍ରରେ, ନାଇଟ୍ରୋଜେନ୍ ସାରର ଉପର ଡ୍ରେସିଂ ବନ୍ଦ କରନ୍ତୁ ଏବଂ ଉପଯୁକ୍ତ ଚିକିତ୍ସା ପ୍ରଯ଼ୋଗ କରନ୍ତୁ |",
            "ସୁପାରିସ କରାଯାଇଥିବା ସ୍ପ୍ରେ ଦ୍ୱାରା କେସ୍ କୃମି ଆକ୍ରମଣକୁ ନିୟନ୍ତ୍ରଣ କରନ୍ତୁ।",
            "ନିର୍ଦ୍ଦିଷ୍ଟ କୀଟନାଶକ ଦ୍ୱାରା ପିତ୍ତ ମଧ୍ଯ଼ଭାଗ ଆକ୍ରମଣ ଉପରେ ନଜର ରଖନ୍ତୁ ଏବଂ ନିଯ଼ନ୍ତ୍ରଣ କରନ୍ତୁ।"
         ]
      },
      "cotton": {
         "advisory": [
            "ଶୋଷକ କୀଟପତଙ୍ଗକୁ ନିଯ଼ନ୍ତ୍ରଣ କରିବା ପାଇଁ ନିମ ଆଧାରିତ କୀଟନାଶକ ବ୍ଯ଼ବହାର କରନ୍ତୁ।",
            "ଫୁଲର ପ୍ରାରମ୍ଭିକ ପର୍ଯ୍ଯ଼ାଯ଼ରେ ରାସାଯ଼ନିକ କୀଟନାଶକରୁ ଦୂରେଇ ରୁହନ୍ତୁ।"
         ]
      },
      "maize": {
         "advisory": [
            "ଯ଼ୁରିଆ ସାରର ଉପର ଡ୍ରେସିଂ ଲଗାନ୍ତୁ।",
            "ନିର୍ଦ୍ଦିଷ୍ଟ ସ୍ପ୍ରେ ଦ୍ୱାରା ସେନା କୃମି ଆକ୍ରମଣକୁ ନିଯ଼ନ୍ତ୍ରଣ କରନ୍ତୁ।"
         ]
      },
      "vegetable crops": {
         "advisory": [
            "ନିମ୍ବ ଆଧାରିତ କୀଟନାଶକ ଦ୍ୱାରା ଫଳ ଏବଂ ଶୁଟ୍ ବୋରରକୁ ନିଯ଼ନ୍ତ୍ରଣ କରନ୍ତୁ।",
            "କୀଟପତଙ୍ଗ ଚୋଷିବା ପାଇଁ ସୁପାରିସ କରାଯାଇଥିବା କୀଟନାଶକ ସ୍ପ୍ରେ କରନ୍ତୁ।",
            "ରୋଗ ନିଯ଼ନ୍ତ୍ରଣ ପାଇଁ ନିର୍ଦ୍ଦିଷ୍ଟ କବକନାଶକ ବ୍ଯ଼ବହାର କରନ୍ତୁ।",
            "ଜଳମଗ୍ନ ପରିସ୍ଥିତିକୁ ଏଡ଼ାଇବା ପାଇଁ ଉପଯୁକ୍ତ ଜଳ ନିଷ୍କାସନ ସୁନିଶ୍ଚିତ କରନ୍ତୁ।"
         ]
      },
      "mango": {
         "advisory": [
            "ପୁରୁଣା ଆମ୍ବ ବଗିଚାରେ ପ୍ରଶିକ୍ଷଣ, ଛାଣିବା ଏବଂ ସଫା କରିବା କାର୍ଯ୍ଯ଼ କରନ୍ତୁ।",
            "ଉପଯୁକ୍ତ ସ୍ପ୍ରେ ଦ୍ୱାରା ପତ୍ର ୱେବର୍ ସଂକ୍ରମଣକୁ ନିଯ଼ନ୍ତ୍ରଣ କରନ୍ତୁ।"
         ]
      },
      "cow/buffalo": {
         "advisory": [
            "ଗାଈ ଏବଂ ମଇଁଷିରେ ମାସ୍ତାଇଟିସ୍ ରୋଗ ନିଯ଼ନ୍ତ୍ରଣ ପାଇଁ ପ୍ରତିଷେଧକ ପଦକ୍ଷେପ ଅନୁସରଣ କରନ୍ତୁ।",
            "ଉପଯୁକ୍ତ ପରିମଳ ଏବଂ ଖାଦ୍ଯ଼ ଅଭ୍ଯ଼ାସ ସୁନିଶ୍ଚିତ କରନ୍ତୁ।",
            "ଗୁରୁତର କ୍ଷେତ୍ରରେ ପଶୁ ସ୍ୱାସ୍ଥ୍ଯ଼ କେନ୍ଦ୍ରର ପରାମର୍ଶ ନିଅନ୍ତୁ।"
         ]
      }
   },
   "date": "27-09-2024"
}