{
   "weather_details": {
      "23-09-2024": {
         "rainfall": 4,
         "t_max": 34,
         "t_min": 26,
         "rh_max": 0,
         "rh_min": 0,
         "wind_speed": 0,
         "wind_direction": 0,
         "cloud_cover": 0
      },
      "24-09-2024": {
         "rainfall": 25,
         "t_max": 33,
         "t_min": 25,
         "rh_max": 0,
         "rh_min": 0,
         "wind_speed": 0,
         "wind_direction": 0,
         "cloud_cover": 0
      },
      "25-09-2024": {
         "rainfall": 20,
         "t_max": 33,
         "t_min": 25,
         "rh_max": 0,
         "rh_min": 0,
         "wind_speed": 0,
         "wind_direction": 0,
         "cloud_cover": 0
      },
      "26-09-2024": {
         "rainfall": 0,
         "t_max": 32,
         "t_min": 25,
         "rh_max": 0,
         "rh_min": 0,
         "wind_speed": 0,
         "wind_direction": 0,
         "cloud_cover": 0
      },
      "28-09-2024": {
         "rainfall": 5,
         "t_max": 32,
         "t_min": 25,
         "rh_max": 94,
         "rh_min": 73,
         "wind_speed": 6,
         "wind_direction": 193,
         "cloud_cover": 8
      },
      "29-09-2024": {
         "rainfall": 5,
         "t_max": 33,
         "t_min": 25,
         "rh_max": 94,
         "rh_min": 70,
         "wind_speed": 5,
         "wind_direction": 165,
         "cloud_cover": 6
      },
      "30-09-2024": {
         "rainfall": 2,
         "t_max": 33,
         "t_min": 25,
         "rh_max": 96,
         "rh_min": 66,
         "wind_speed": 5,
         "wind_direction": 234,
         "cloud_cover": 4
      },
      "01-10-2024": {
         "rainfall": 2,
         "t_max": 34,
         "t_min": 25,
         "rh_max": 96,
         "rh_min": 69,
         "wind_speed": 5,
         "wind_direction": 234,
         "cloud_cover": 4
      },
      "02-10-2024": {
         "rainfall": 2,
         "t_max": 34,
         "t_min": 26,
         "rh_max": 95,
         "rh_min": 70,
         "wind_speed": 5,
         "wind_direction": 225,
         "cloud_cover": 4
      }
   },
   "names_of_crops": [
      "ଚାଉଳ",
      "ମକା",
      "କଳା ଚଣା",
      "ତିଲ।",
      "ଟମାଟୋ",
      "ଲଙ୍କା",
      "ବାଇଗଣ"
   ],
   "general_advisory": "କୀଟନାଶକ ପ୍ରଯ଼ୋଗ କରିବା ପୂର୍ବରୁ ବର୍ଷା ପ୍ରତି ଧ୍ଯ଼ାନ ଦିଅନ୍ତୁ। ଯଦି ଆବଶ୍ଯ଼କ ହୁଏ, କେବଳ ଯେତେବେଳେ ଆକାଶ ସଫା ହୋଇଯାଏ, ସେତେବେଳେ ସ୍ପ୍ରେ କରନ୍ତୁ ଏବଂ ସ୍ପ୍ରେ ଦ୍ରବଣରେ ଏକ ଷ୍ଟିକର ବ୍ଯ଼ବହାର କରନ୍ତୁ। ଅନୁର୍ବର ଉଚ୍ଚଭୂମିରେ, ସାମ୍ପ୍ରତିକ ବର୍ଷାକୁ ଉପଯୋଗ କରି, କୃଷକମାନେ ସ୍ୱଳ୍ପକାଳୀନ, ସ୍ୱଳ୍ପ ଜଳ ଆବଶ୍ଯ଼କ କରୁଥିବା ଫସଲ ଯେପରିକି କଳା ଚଣା, ସବୁଜ ଚଣା, ତିଲ, ପଶୁଖାଦ୍ଯ଼ ଫସଲ ଇତ୍ଯ଼ାଦି ଗ୍ରହଣ କରିବା ଉଚିତ୍। ବିଭିନ୍ନ କୀଟପତଙ୍ଗର ପ୍ରକୋପ ଜାଣିବା ଏବଂ ନିଯ଼ନ୍ତ୍ରଣ ରଣନୀତି ଆରମ୍ଭ କରିବା ପାଇଁ ସମସ୍ତ ଫସଲ ଉପରେ ନିଯ଼ମିତ ନଜର ରଖିବା ଉଚିତ।",
   "crops_data": {
      "rice": {
         "advisory": [
            "ଉପରିସ୍ଥ ଅଞ୍ଚଳରେ ଏକର ପିଛା 16 କିଲୋଗ୍ରାମ ଯ଼ୁରିଆ + 10 କିଲୋଗ୍ରାମ ଏମଓପି ଏବଂ ମଧ୍ଯ଼ମ ଏବଂ ତଳିଆ ଅଞ୍ଚଳରେ ଏକର ପିଛା 20 କିଲୋଗ୍ରାମ ଯ଼ୁରିଆ + 13 କିଲୋଗ୍ରାମ ଏମଓପି ପ୍ରଯ଼ୋଗ କରନ୍ତୁ।",
            "ଷ୍ଟେମ ବୋରର, ଲିଫ୍ ଫୋଲଡର, ଏବଂ ଚାଉଳ କାନ ଖାଉଥିବା କ୍ଯ଼ାଟର୍ପିଲରର ଜନସଂଖ୍ଯ଼ାକୁ ନିରୀକ୍ଷଣ ଏବଂ ନିଯ଼ନ୍ତ୍ରଣ କରିବା ପାଇଁ ଫେରୋମୋନ୍ ଟ୍ରାପ୍ @8nos./acre ଏବଂ ଲାଇଟ୍ ଟ୍ରାପ୍ @1no./acre ସ୍ଥାପନ କରନ୍ତୁ ଏବଂ ତିନି ସପ୍ତାହ ପରେ ଲୋଭକୁ ବଦଳାନ୍ତୁ |",
            "ଷ୍ଟେମ ବୋରର ସ୍ଥାନୀଯ଼ ଅଞ୍ଚଳରେ, ଅଣ୍ଡା ପରଜୀବୀ ଟ୍ରାଇକୋଗ୍ରାମମା ଜାପୋନିକମ (ଟ୍ରାଇକୋ କାର୍ଡ) @60000 ଅଣ୍ଡା (3 କାର୍ଡ)/ଏକର ଛାଡ଼ିବା ଆବଶ୍ଯ଼କ।",
            "ବର୍ତ୍ତମାନର ପାଣିପାଗ ଧାନରେ ବିସ୍ଫୋରଣ ରୋଗ ଅନୁକୂଳ ହୋଇପାରେ | ଏହାକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ, ଟେବୁକୋନାଜୋଲ 50 ପ୍ରତିଶତ + ଟ୍ରାଇଫ୍ଲୋକ୍ସିସ୍ଟ୍ରୋବିନ 25 ପ୍ରତିଶତ ଡବ୍ଲୁ. ଜି. @4 ଗ୍ରାମ/ଲିଟର ପାଣି କିମ୍ବା ଟ୍ରାଇସାଇକ୍ଲାଜୋଲ 45 ପ୍ରତିଶତ + ହେକ୍ସାକୋନାଜୋଲ 10 ପ୍ରତିଶତ ଡବ୍ଲୁ. ଜି. @1 ଗ୍ରାମ/ଲିଟର ପାଣି ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "maize": {
         "advisory": [
            "ଅତ୍ୟଧିକ ବର୍ଷା କାରଣରୁ ଜଳମଗ୍ନ ପରିସ୍ଥିତିକୁ ଏଡ଼ାଇବା ପାଇଁ ଏକ ଉନ୍ନତ ଜଳ ନିଷ୍କାସନ ବ୍ୟବସ୍ଥା ବିକଶିତ କରନ୍ତୁ।",
            "ଯଦି ଫସଲ ଟାସେଲିଂ ପର୍ଯ୍ଯ଼ାଯ଼ରେ ଅଛି, ତା \"ହେଲେ ଏସି ପିଛା 25 କିଲୋଗ୍ରାମ ଯ଼ୁରିଆ ଲଗାନ୍ତୁ ଏବଂ ଯଦି ପର୍ଯ୍ଯ଼ାପ୍ତ ପାଣି ନଥାଏ, ତେବେ ଜଳସେଚନ କରନ୍ତୁ।",
            "ଷ୍ଟେମ ବୋରର, ଏଫ. ଏ. ଡବ୍ଲ୍ଯ଼ୁ, ଏବଂ ବ୍ଯ଼ାଣ୍ଡେଡ ପତ୍ର ଏବଂ ସିଥ୍ ବ୍ଲାଇଟ୍ ବର୍ତ୍ତମାନର ପାଣିପାଗ ପରିସ୍ଥିତି ହେତୁ ଦେଖାଯାଇପାରେ | ନିଯ଼ମିତ ଭାବେ କ୍ଷେତ ଉପରେ ନଜର ରଖନ୍ତୁ ଏବଂ ସଂକ୍ରମିତ ଗଛର ଅଂଶଗୁଡ଼ିକୁ ବାହାର କରନ୍ତୁ।",
            "ଫଲ୍ ଆର୍ମିୱର୍ମକୁ ନିଯ଼ନ୍ତ୍ରଣ କରିବା ପାଇଁ, ଇମାମେକ୍ଟିନ୍ ବେନ୍ଜୋଏଟ୍ 5 ପ୍ରତିଶତ ଏସ୍ଜି @0.4 ଗ୍ରାମ୍/ଲିଟର ପାଣି କିମ୍ବା କ୍ଲୋରାଣ୍ଟ୍ରାନିଲିପ୍ରୋଲ୍ 18.5% ଏସ୍ସି @0.4 ମିଲି/ଲିଟର ପାଣି ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "black gram": {
         "advisory": [
            "ଏହା ପ୍ରାକ୍-ରବି କଳା ଗହମ (ବୀରି) ଏବଂ ସବୁଜ ଗହମ (ମୁଙ୍ଗ) ବୁଣିବା ସମୟ। ଏକର ପିଛା 10 କିଲୋଗ୍ରାମ ମଞ୍ଜି ବ୍ୟବହାର କରନ୍ତୁ। ବୁଣିବା ପୂର୍ବରୁ, ମଞ୍ଜିଗୁଡ଼ିକୁ ରାଇଜୋବିୟମ୍ ସଂସ୍କୃତି ସହିତ ଚିକିତ୍ସା କରିବାକୁ ହେବ। ଅନ୍ତିମ ଜମି ପ୍ରସ୍ତୁତି ସମୟରେ ଏକର ପିଛା 4 କିଲୋଗ୍ରାମ ୟୁରିଆ, 35 କିଲୋଗ୍ରାମ ଡିଏପି ଏବଂ 13 କିଲୋଗ୍ରାମ ଏମଓପି ଲଗାନ୍ତୁ। ଗଛ-ଗଛନି ମଧ୍ୟରେ 10-15 ସେ. ମି. ଦୂରତା ସହିତ 30 ସେ. ମି. ବ୍ୟବଧାନରେ ମଞ୍ଜି ବୁଣନ୍ତୁ।"
         ]
      },
      "sesame": {
         "advisory": [
            "ପ୍ରାକ୍-ରବି ତିଲ ବୁଣିବା ପାଇଁ ଏହା ହେଉଛି ସର୍ବୋତ୍ତମ ସମୟ। ଏକର ପିଛା 3 କି. ଗ୍ରା. ମଞ୍ଜି ବ୍ୟବହାର କରି ଗଛଗୁଡ଼ିକ ମଧ୍ୟରେ 30 ସେ. ମି. ଏବଂ 10 ସେ. ମି. ବ୍ୟବଧାନରେ ମଞ୍ଜି ବୁଣନ୍ତୁ। ଅନ୍ତିମ ଜମି ପ୍ରସ୍ତୁତି ସମୟରେ ଏକର ପିଛା 6.5 କି. ଗ୍ରା. ୟୁରିଆ, 17 କି. ଗ୍ରା. ଡିଏପି, ଏବଂ 13 କି. ଗ୍ରା. ଏମଓପି ଲଗାନ୍ତୁ।"
         ]
      },
      "tomato": {
         "advisory": [
            "ଉଚ୍ଚଭୂମିରେ ଭଲ ଭାବେ ଜଳ ନିଷ୍କାସନ ହେଉଥିବା ମାଟିରେ, ଟମାଟୋ ପାଇଁ ନର୍ସରୀ ବୁଣିବା ସମ୍ପୂର୍ଣ୍ଣ କରନ୍ତୁ। ଏକର ପିଛା 150-200 ଗ୍ରାମ୍ ଉଚ୍ଚ-ଉତ୍ପାଦନକାରୀ କିସମ ବ୍ୟବହାର କରନ୍ତୁ। ଚାରା ଗୁଡ଼ିକୁ ଅତ୍ୟଧିକ ବର୍ଷାରୁ ରକ୍ଷା କରିବା ପାଇଁ ନର୍ସରୀ ଉପରେ କମ୍ ମୂଲ୍ୟର ପଲିଥିନ୍ କଭର ବ୍ୟବହାର କରନ୍ତୁ।",
            "ବର୍ତ୍ତମାନର ଜଳବାଯ଼ୁ ବ୍ଯ଼ାକ୍ଟେରିଆ ଦାଗ ଏବଂ ଟମାଟୋର ଦାଗ ପାଇଁ ଉପଯୁକ୍ତ | ପ୍ରାରମ୍ଭିକ ପର୍ଯ୍ଯ଼ାଯ଼ରେ ପରିଚାଳନା କରିବା ପାଇଁ, ସୋଡିଯ଼ମ୍ ହାଇପୋକ୍ଲୋରାଇଟ୍ ରେ ଏକ ମିନିଟ୍ ପାଇଁ କିମ୍ବା 25 ମିନିଟ୍ ପାଇଁ ଗରମ ପାଣିରେ (50 ଡିଗ୍ରୀ ସେଲସିଯ଼ସ୍) ମଞ୍ଜି ବୁଡ଼ାଇ ଜୈବିକ ଚିକିତ୍ସା ପାଇଁ ଯାଆନ୍ତୁ ଯାହା ଉଭଯ଼ ରୋଗର ପ୍ରକୋପକୁ ହ୍ରାସ କରିପାରିବ |"
         ]
      },
      "chilli": {
         "advisory": [
            "ଫଳ ଛେଦକକୁ ନିଯ଼ନ୍ତ୍ରଣ କରିବା ପାଇଁ, 200 ଲିଟର ପାଣି ସହିତ ସିଣ୍ଟ୍ରାନିଲିପ୍ରୋଲ 10.26% ଓଡି @240 ମିଲି/ଏକର ମିଶାଇ ସ୍ପ୍ରେ କରନ୍ତୁ।",
            "ଯଦି ଲଙ୍କା କ୍ଷେତରେ ପତ୍ର କୁଣ୍ଡାଇ ହେବା ଏବଂ ମୋଜାଇକ ରୋଗ ଦେଖାଯାଏ, ତେବେ ଏହି ରୋଗକୁ ନିଯ଼ନ୍ତ୍ରଣ କରିବା ପାଇଁ ଡାଇମେଥୋଏଟ 30 ଇସି @500 ମିଲି/ହେକ୍ଟର କିମ୍ବା ଇମିଡାକ୍ଲୋପ୍ରିଡ 17.8 ଏସଏଲ @100 ମିଲି/ହେକ୍ଟର ସ୍ପ୍ରେ କରନ୍ତୁ ଯାହା ଦ୍ୱାରା କୀଟ ଭେକ୍ଟରକୁ ନିଯ଼ନ୍ତ୍ରଣ କରାଯାଇପାରିବ ଏବଂ ପ୍ରାରମ୍ଭିକ ଲକ୍ଷଣ ଦେଖାଯିବା ପରେ ତୁରନ୍ତ ସଂକ୍ରମିତ ଗଛଗୁଡ଼ିକୁ ନଷ୍ଟ କରାଯାଇପାରିବ। ଆବଶ୍ଯ଼କ ପଡ଼ିଲେ 15 ଦିନ ପରେ ଏହି ସ୍ପ୍ରେକୁ ପୁନରାବୃତ୍ତି କରନ୍ତୁ।"
         ]
      },
      "brinjal": {
         "advisory": [
            "ୱିଲ୍ଟକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ, 200 ଲିଟର ପାଣି ସହିତ ମିଶ୍ରିତ ମୂଳ ଅଞ୍ଚଳରେ ଟେବୁକୋନାଜୋଲ୍ 25.9% ଇସି @200-ମିଲି/ଏକର + ସ୍ଟ୍ରେପ୍ଟୋସାଇକ୍ଲିନ୍ @30 ଗ୍ରାମ୍/ଏକର ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      }
   },
   "date": "27-09-2024"
}