{
   "weather_details": {
      "28-12-2024": {
         "rainfall": 0,
         "t_max": 27,
         "t_min": 18,
         "rh_max": 82,
         "rh_min": 32,
         "wind_speed": 5,
         "wind_direction": 69,
         "cloud_cover": 1
      },
      "29-12-2024": {
         "rainfall": 5,
         "t_max": 27,
         "t_min": 17,
         "rh_max": 74,
         "rh_min": 37,
         "wind_speed": 4,
         "wind_direction": 0,
         "cloud_cover": 6
      },
      "30-12-2024": {
         "rainfall": 2,
         "t_max": 27,
         "t_min": 17,
         "rh_max": 77,
         "rh_min": 46,
         "wind_speed": 2,
         "wind_direction": 18,
         "cloud_cover": 5
      },
      "31-12-2024": {
         "rainfall": 0,
         "t_max": 27,
         "t_min": 16,
         "rh_max": 74,
         "rh_min": 37,
         "wind_speed": 4,
         "wind_direction": 5,
         "cloud_cover": 3
      },
      "01-01-2025": {
         "rainfall": 0,
         "t_max": 27,
         "t_min": 14,
         "rh_max": 70,
         "rh_min": 31,
         "wind_speed": 4,
         "wind_direction": 355,
         "cloud_cover": 1
      }
   },
   "names_of_crops": [
      "ଖରିଫ ଚାଉଳ",
      "ଗ୍ରୀଷ୍ମକାଳୀନ ଚାଉଳ",
      "ମାଟି ବାଦାମ",
      "କୋଲେ ଫସଲ",
      "ପଶୁପାଳନ",
      "କୁକୁଡ଼ା ମାଂସ"
   ],
   "general_advisory": "ପାଣିପାଗ ସ୍ଥିତି ଅନୁଯାୟୀ ଅମଳ, ବୁଣିବା ଏବଂ ସିଞ୍ଚନ କାର୍ଯ୍ୟ କରିବାକୁ କୃଷକମାନଙ୍କୁ ପରାମର୍ଶ ଦିଆଯାଇଛି। ଫସଲ ଏବଂ ପଶୁମାନଙ୍କୁ ଥଣ୍ଡା ପାଗରୁ ରକ୍ଷା କରିବା ପାଇଁ ବ୍ୟବସ୍ଥା କରନ୍ତୁ। ସୋରିଷ, ତିଲ, ଚଣା, ଚିନାବାଦାମ, ଗ୍ରୀନ୍ ଗ୍ରାମ୍/ବ୍ଲାକ୍ ଗ୍ରାମ୍ ପରି ରବି ଫସଲର ସମ୍ପୂର୍ଣ୍ଣ ବୁଣିବା ଏବଂ ଗ୍ରୀଷ୍ମ ଧାନର ନର୍ସରୀ ବୁଣିବା ଆରମ୍ଭ କରନ୍ତୁ।",
   "crops_data": {
      "kharif rice": {
         "advisory": [
            "ଆଗାମୀ ଦିନର ପ୍ରଥମାର୍ଦ୍ଧରେ କିଛି ବର୍ଷା ହେବାର ସମ୍ଭାବନା ରହିଛି, ତେଣୁ ଅମଳ କାର୍ଯ୍ୟ ପାଇଁ ଅପେକ୍ଷା କରନ୍ତୁ ଏବଂ ଧାନ ଫସଲ ପାଇଁ ନିରାପଦ ସଂରକ୍ଷଣ ପ୍ରଦାନ କରନ୍ତୁ।"
         ]
      },
      "summer rice": {
         "advisory": [
            "ଉନ୍ନତ କିସମର ଧାନ ବ୍ୟବହାର କରି କୃଷକମାନେ ଗ୍ରୀଷ୍ମକାଳୀନ ଧାନ ଚାଷ ପାଇଁ କ୍ଷେତ ପ୍ରସ୍ତୁତି ଆରମ୍ଭ କରିବା ଉଚିତ।",
            "ଆଶା କରାଯାଉଥିବା ବର୍ଷା ପରେ ଜଳସେଚନ ଏବଂ ସିଞ୍ଚନ କାର୍ଯ୍ୟ ପାଇଁ ପ୍ରସ୍ତୁତ ହୁଅନ୍ତୁ।"
         ]
      },
      "ground nut": {
         "advisory": [
            "ଅନୁକୂଳ ପାଣିପାଗ କାରଣରୁ କୀଟ ଆକ୍ରମଣ ପାଇଁ ଚିନାବାଦାମ ଫସଲ ଉପରେ ନଜର ରଖନ୍ତୁ।",
            "ଆକ୍ରମଣର ପ୍ରାରମ୍ଭିକ ପର୍ଯ୍ୟାୟରେ କୀଟନାଶକ ସିଞ୍ଚନ ଏବଂ ଫାନ୍ଦ ପଦ୍ଧତି କାର୍ଯ୍ୟକାରୀ କରନ୍ତୁ |",
            "ଆଗାମୀ ଦିନରେ ଆଶା କରାଯାଉଥିବା ବର୍ଷା ହେତୁ ଜଳସେଚନ ଏବଂ ସିଞ୍ଚନ ପାଇଁ ଅପେକ୍ଷା କରନ୍ତୁ।"
         ]
      },
      "cole crop": {
         "advisory": [
            "ଆର୍ଦ୍ରତା ଏବଂ ମୃତ୍ତିକା ତାପମାତ୍ରା ରକ୍ଷଣାବେକ୍ଷଣ ପାଇଁ ପନିପରିବା ଫସଲରେ ମଲ୍ଚିଙ୍ଗ ସାମଗ୍ରୀ ଭାବରେ ଷ୍ଟ୍ରା ବ୍ୟବହାର କରନ୍ତୁ |",
            "ଫୁଲକୋବିରେ ଡାଇମଣ୍ଡ ବ୍ୟାକ୍ ମଥ୍ ବିରୁଦ୍ଧରେ ନିରୀକ୍ଷଣ କରନ୍ତୁ ଏବଂ ଫେରୋମୋନ୍ ଟ୍ରାପ୍ ବ୍ୟବହାର କରନ୍ତୁ |",
            "ଯଦି ଆକ୍ରମଣ ଦେଖାଯାଏ ତେବେ ବର୍ଷା ପରେ ନିମ୍ବ ତେଲ କିମ୍ବା ଇମାମେକ୍ଟିନ୍ ବେନ୍ଜୋଏଟ୍ ଲଗାନ୍ତୁ |"
         ]
      },
      "livestock": {
         "advisory": [
            "ପଶୁମାନଙ୍କୁ ଥଣ୍ଡା ପାଗରୁ ସୁରକ୍ଷା ପ୍ରଦାନ କରନ୍ତୁ ଏବଂ ପରିଷ୍କାର ଛପର ବଜାୟ ରଖନ୍ତୁ |",
            "ରୋଗ ଏବଂ କୃମିକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ ପଶୁମାନଙ୍କୁ ଟୀକାକରଣ ଏବଂ କୃମିନାଶକ କରନ୍ତୁ।"
         ]
      },
      "poultry": {
         "advisory": [
            "କୁକୁଡ଼ା ପାଳିରେ ଉପଯୁକ୍ତ ବାୟୁ ଚଳାଚଳ ଏବଂ ଉତ୍ତାପ ଉତ୍ସ ସୁନିଶ୍ଚିତ କରନ୍ତୁ।",
            "କୁକୁଡ଼ା ପାଇଁ ଉପଯୁକ୍ତ ପାନୀୟ ଜଳ ତାପମାତ୍ରା ବଜାୟ ରଖନ୍ତୁ |"
         ]
      }
   },
   "date": "27-12-2024"
}