{
   "weather_details": {
      "28-12-2024": {
         "rainfall": 0,
         "t_max": 29,
         "t_min": 18,
         "rh_max": 36,
         "rh_min": 79,
         "wind_speed": 5,
         "wind_direction": 69,
         "cloud_cover": 1
      },
      "29-12-2024": {
         "rainfall": 5,
         "t_max": 28,
         "t_min": 17,
         "rh_max": 39,
         "rh_min": 77,
         "wind_speed": 4,
         "wind_direction": 0,
         "cloud_cover": 6
      },
      "30-12-2024": {
         "rainfall": 5,
         "t_max": 28,
         "t_min": 16,
         "rh_max": 45,
         "rh_min": 82,
         "wind_speed": 4,
         "wind_direction": 18,
         "cloud_cover": 5
      },
      "31-12-2024": {
         "rainfall": 0,
         "t_max": 28,
         "t_min": 15,
         "rh_max": 37,
         "rh_min": 80,
         "wind_speed": 6,
         "wind_direction": 5,
         "cloud_cover": 2
      },
      "01-01-2025": {
         "rainfall": 0,
         "t_max": 29,
         "t_min": 14,
         "rh_max": 31,
         "rh_min": 77,
         "wind_speed": 5,
         "wind_direction": 355,
         "cloud_cover": 1
      }
   },
   "names_of_crops": [
      "ଖରିଫ ଚାଉଳ",
      "ମାଟି ବାଦାମ",
      "କୋଲେ ଫସଲ"
   ],
   "general_advisory": "ସେହି ଅନୁଯାୟୀ ଅମଳ, ବୁଣିବା ଏବଂ ସିଞ୍ଚନ କାର୍ଯ୍ୟ କରିବାକୁ କୃଷକମାନଙ୍କୁ ପରାମର୍ଶ ଦିଆଯାଇଛି। ଫସଲ ଏବଂ ପଶୁମାନଙ୍କୁ ଥଣ୍ଡାରୁ ରକ୍ଷା କରିବା ପାଇଁ ଉପଯୁକ୍ତ ଯତ୍ନ ନେବା ପାଇଁ ବ୍ୟବସ୍ଥା କରନ୍ତୁ। ଜଳସେଚନ ସୁବିଧା ଉପଲବ୍ଧ ଥିବା ସ୍ଥାନରେ ସୋରିଷ, ତିଲ, ଚଣା, ଚିନାବାଦାମ, ସବୁଜ ଚଣା/କଳା ଚଣା ଭଳି ରବି ଫସଲ ବୁଣିବା ଏବଂ ଗ୍ରୀଷ୍ମକାଳୀନ ଧାନର ନର୍ସରୀ ବୁଣିବା ପାଇଁ ପରାମର୍ଶ ଦିଆଯାଇଛି।",
   "crops_data": {
      "kharif rice": {
         "advisory": [
            "ଆଗାମୀ ଦିନର ପ୍ରଥମାର୍ଦ୍ଧରେ କିଛି ବର୍ଷା ହେବାର ସମ୍ଭାବନା ରହିଛି, ତେଣୁ କୃଷକମାନଙ୍କୁ ଅମଳ କାର୍ଯ୍ୟ ପାଇଁ ଅପେକ୍ଷା କରିବାକୁ ଏବଂ ଅଧିକ କ୍ଷତି ଏଡ଼ାଇବା ପାଇଁ ଅମଳ ହୋଇଥିବା ଧାନ ଫସଲକୁ ସୁରକ୍ଷିତ ସ୍ଥାନରେ ରଖିବା ପାଇଁ ବ୍ୟବସ୍ଥା କରିବାକୁ ପରାମର୍ଶ ଦିଆଯାଇଛି।"
         ]
      },
      "ground nut": {
         "advisory": [
            "ଅତୀତର ପାଣିପାଗ ସ୍ଥିତି (ମେଘୁଆ ଏବଂ କୁହୁଡ଼ି) ଚିନାବାଦାମ ଫସଲରେ କୀଟ ଆକ୍ରମଣ ପାଇଁ ଅନୁକୂଳ, ତେଣୁ ନିୟମିତ ନିରୀକ୍ଷଣ ପାଇଁ ପରାମର୍ଶ ଦିଆଯାଇଛି।",
            "ଯଦି କୀଟ ଆକ୍ରମଣ ଦେଖାଯାଏ, ତେବେ ଆଜାଦିରାକ୍ଟିନ କିମ୍ବା ନିମ-ଆଧାରିତ କୀଟନାଶକ ସିଞ୍ଚନ କରିବାକୁ ପରାମର୍ଶ ଦିଆଯାଏ |",
            "ଆଗାମୀ ଦିନରେ କିଛି ପରିମାଣର ବର୍ଷା ହେବାର ସମ୍ଭାବନା ଥିବାରୁ କୃଷକମାନେ ଜଳସେଚନ ଏବଂ ସିଞ୍ଚନ କାର୍ଯ୍ୟ ପାଇଁ ଅପେକ୍ଷା କରିବା ଉଚିତ।"
         ]
      },
      "cole crop": {
         "advisory": [
            "ଶୀତ ଋତୁରେ ମୃତ୍ତିକାର ଆର୍ଦ୍ରତା ଏବଂ ତାପମାତ୍ରା ବଜାୟ ରଖିବା ପାଇଁ ପନିପରିବା ଫସଲରେ ମଲ୍ଚିଙ୍ଗ ସାମଗ୍ରୀ ଭାବରେ ଷ୍ଟ୍ରା ବ୍ୟବହାର କରାଯାଇପାରିବ |",
            "ଫୁଲକୋବିରେ ଡାଇମଣ୍ଡ ବ୍ୟାକ୍ ମଥ୍ର ଆକ୍ରମଣ ବିରୁଦ୍ଧରେ ନିୟମିତ ତଦାରଖ କରିବାକୁ ପରାମର୍ଶ ଦିଆଯାଇଛି।",
            "ଯଦି ଆକ୍ରମଣ ଦେଖାଯାଏ, ବର୍ଷା ହେବା ପରେ ନିମ୍ବ ତେଲ କିମ୍ବା ଇମାମେକ୍ଟିନ୍ ବେନ୍ଜୋଏଟ୍ ସିଞ୍ଚନ କରିବାକୁ ପରାମର୍ଶ ଦିଆଯାଏ |"
         ]
      }
   },
   "date": "27-12-2024"
}