{
   "weather_details": {
      "28-12-2024": {
         "rainfall": 0,
         "t_max": 28,
         "t_min": 16,
         "rh_max": 81,
         "rh_min": 34,
         "wind_speed": 5,
         "wind_direction": 54,
         "cloud_cover": 2
      },
      "29-12-2024": {
         "rainfall": 5,
         "t_max": 27,
         "t_min": 16,
         "rh_max": 76,
         "rh_min": 41,
         "wind_speed": 3,
         "wind_direction": 76,
         "cloud_cover": 6
      },
      "30-12-2024": {
         "rainfall": 2,
         "t_max": 27,
         "t_min": 16,
         "rh_max": 77,
         "rh_min": 46,
         "wind_speed": 4,
         "wind_direction": 9,
         "cloud_cover": 5
      },
      "31-12-2024": {
         "rainfall": 0,
         "t_max": 26,
         "t_min": 15,
         "rh_max": 76,
         "rh_min": 37,
         "wind_speed": 6,
         "wind_direction": 4,
         "cloud_cover": 4
      },
      "01-01-2025": {
         "rainfall": 0,
         "t_max": 26,
         "t_min": 13,
         "rh_max": 67,
         "rh_min": 30,
         "wind_speed": 5,
         "wind_direction": 4,
         "cloud_cover": 2
      }
   },
   "names_of_crops": [
      "ଖରିଫ ଚାଉଳ",
      "ମାଟି ବାଦାମ",
      "କୋଲେ ଫସଲ",
      "ପଶୁପାଳନ",
      "କୁକୁଡ଼ା ମାଂସ"
   ],
   "general_advisory": "ଆଇ. ଏମ୍. ଡି., ଏମ୍. ସି., ଭୁବନେଶ୍ୱରର ବର୍ଦ୍ଧିତ ପରିସୀମା ପୂର୍ବାନୁମାନ ଅନୁଯାୟୀ, ଅକ୍ଟୋବର-1 (27 ଡିସେମ୍ବର, 2024 ରୁ 2 ଜାନୁଆରୀ, 2025) ମଧ୍ୟରେ ଉପକୂଳ ଓଡ଼ିଶା ଜିଲ୍ଲା ଏବଂ ଉପକୂଳ ଓଡ଼ିଶା ସଂଲଗ୍ନ ଜିଲ୍ଲାଗୁଡ଼ିକରେ ସର୍ବନିମ୍ନ ତାପମାତ୍ରା (ରାତ୍ରିକାଳୀନ ତାପମାତ୍ରା) 16-18 ଡିଗ୍ରୀ ସେଲସିୟସ୍, ଆଭ୍ୟନ୍ତରୀଣ ଓଡ଼ିଶାର କିଛି ଅଂଶରେ 14-16 ଡିଗ୍ରୀ ସେଲସିୟସ୍ ଏବଂ ଆଭ୍ୟନ୍ତରୀଣ ଓଡ଼ିଶାର ଅବଶିଷ୍ଟ ଅଂଶରେ 12-14 ଡିଗ୍ରୀ ସେଲସିୟସ୍ ହେବାର ସମ୍ଭାବନା ରହିଛି। ସେହି ସମୟରେ ଓଡ଼ିଶାର ଜିଲ୍ଲାଗୁଡ଼ିକରେ ସ୍ୱାଭାବିକରୁ ଅଧିକ ସର୍ବନିମ୍ନ ତାପମାତ୍ରା ହେବାର ସମ୍ଭାବନା ରହିଛି। ପ୍ରଥମ ସପ୍ତାହରେ ରାଜ୍ୟରେ ମୋଟାମୋଟି ବର୍ଷା ସ୍ୱାଭାବିକରୁ ସ୍ୱାଭାବିକଠାରୁ କମ୍ ହେବାର ସମ୍ଭାବନା ରହିଛି।",
   "crops_data": {
      "kharif rice": {
         "advisory": [
            "ଆଗାମୀ ଦିନର ପ୍ରଥମାର୍ଦ୍ଧରେ କିଛି ବର୍ଷା ହେବାର ସମ୍ଭାବନା ରହିଛି, ତେଣୁ କୃଷକମାନଙ୍କୁ ଫସଲ ଅମଳ ପାଇଁ କିଛି ଦିନ ଅପେକ୍ଷା କରିବାକୁ ଏବଂ ଅଧିକ କ୍ଷୟକ୍ଷତି ଏଡ଼ାଇବା ପାଇଁ ଅମଳ ହୋଇଥିବା ଧାନ ଫସଲକୁ ସୁରକ୍ଷିତ ସ୍ଥାନରେ ରଖିବା ପାଇଁ ବ୍ୟବସ୍ଥା କରିବାକୁ ପରାମର୍ଶ ଦିଆଯାଇଛି।",
            "ଅଧିକ ସମୟ ଧରି ଧାନ/ରିଚ୍ ଇ ର ନିରାପଦ ସଂରକ୍ଷଣ ପାଇଁ 'ସୁପର ଗ୍ରେନ୍ ବ୍ୟାଗ୍' ବ୍ୟବହାର କରନ୍ତୁ କିମ୍ବା ଅସମୟ ବର୍ଷା କାରଣରୁ କ୍ଷୟକ୍ଷତି ଏଡ଼ାଇବା ପାଇଁ ଅମଳ ହୋଇଥିବା ଧାନକୁ ସଠିକ୍ ବ୍ୟାଗରେ ଏବଂ ଉପଯୁକ୍ତ କଭର ସହିତ ଷ୍ଟ୍ୟାକ୍ କରି ରଖନ୍ତୁ |",
            "ଶୀତ ଋତୁରେ ମୃତ୍ତିକାରେ ଆର୍ଦ୍ରତା ବଜାୟ ରଖିବା ସହିତ ମୃତ୍ତିକାର ତାପମାତ୍ରା ବଜାୟ ରଖିବା ପାଇଁ ପନିପରିବା ଫସଲରେ ଷ୍ଟ୍ରା ମଲ୍ଚିଙ୍ଗ୍ ସାମଗ୍ରୀ ଭାବରେ ବ୍ୟବହୃତ ହୋଇପାରେ |"
         ]
      },
      "ground nut": {
         "advisory": [
            "ଅତୀତର ପାଣିପାଗ ସ୍ଥିତି (ମେଘୁଆ ଏବଂ କୁହୁଡ଼ି) ଚିନାବାଦାମ ଫସଲରେ କୀଟ ଆକ୍ରମଣ ପାଇଁ ଅନୁକୂଳ, ତେଣୁ ଏହାର ନିୟମିତ ତଦାରଖ ପାଇଁ ପରାମର୍ଶ ଦିଆଯିବା ଉଚିତ। ଯଦି ଆକ୍ରମଣ ପରିଲକ୍ଷିତ ହୁଏ, ତେବେ ପ୍ରାରମ୍ଭିକ ପର୍ଯ୍ୟାୟରେ ଏକର ପିଛା 200 ଲିଟର ୱେଟ ଆରରେ ଆଜାଦିରାକ୍ଟିନ କିମ୍ବା ନିମ-ଆଧାରିତ କୀଟନାଶକ 1500 ପିପିଏମ @600 ମିଲିଲିଟର ସ୍ପ୍ରେ କରନ୍ତୁ। ଏକର ପିଛା 8ଟି ହଳଦିଆ ଚଟପଟା ଜାଲ ବ୍ୟବହାର କରନ୍ତୁ। ଏକ ସପ୍ତାହ ବ୍ୟବଧାନରେ ଏକର ପିଛା 1-2 ନମ୍ବର ବିଶିଷ୍ଟ ଟ୍ରାଇକୋଗ୍ରାମ ଚିଲିନିସ୍ କାର୍ଡ ମଧ୍ୟ ବ୍ୟବହାର କରାଯାଇପାରିବ। ନିର୍ଦ୍ଧାରିତ ସ୍ଥାନରେ କାର୍ଡଟିକୁ 12ଟି ଖଣ୍ଡରେ କାଟନ୍ତୁ। ରାସାୟନିକ ପରିଚାଳନା ପାଇଁ, ଏକର ପିଛା 40 ଗ୍ରାମ ଥାଇମେଥୋକ୍ସାମ୍ କିମ୍ବା 80 ଗ୍ରାମ ଇମାମେକ୍ଟିନ୍ ବେଞ୍ଜୋଏଟ୍ 200 ଲିଟର ପାଣିରେ ପ୍ରୟୋଗ କରନ୍ତୁ। ଯେହେତୁ ଦୁଇ ଦିନ ମଧ୍ୟରେ କିଛି ପରିମାଣର ବର୍ଷା ହେବାର ସମ୍ଭାବନା ରହିଛି, ତେଣୁ କୃଷକମାନଙ୍କୁ ଜଳସେଚନ ଏବଂ ଆବର୍ଜନା ସିଞ୍ଚନ ପାଇଁ କିଛି ଦିନ ଅପେକ୍ଷା କରିବାକୁ ପଡ଼ିବ।"
         ]
      },
      "cole crop": {
         "advisory": [
            "ଶୀତ ଋତୁରେ ମୃତ୍ତିକାରେ ଆର୍ଦ୍ରତା ବଜାୟ ରଖିବା ସହିତ ମୃତ୍ତିକାର ତାପମାତ୍ରା ବଜାୟ ରଖିବା ପାଇଁ ପନିପରିବା ଫସଲରେ ଷ୍ଟ୍ରା ମଲ୍ଚିଙ୍ଗ୍ ସାମଗ୍ରୀ ଭାବରେ ବ୍ୟବହୃତ ହୋଇପାରେ |",
            "ଫୁଲକୋବିରେ ଡାଇମଣ୍ଡ ବା ସି. କେ. ମଥ୍ର ଆକ୍ରମଣ ଉପରେ ନିୟମିତ ନଜର ରଖିବା ପାଇଁ ପରାମର୍ଶ ଦିଆଯିବା ଉଚିତ ଏବଂ ଯଦି ସମ୍ଭବ, କୃଷକମାନେ ଏହି ଉଦ୍ଦେଶ୍ୟରେ କ୍ଷେତରେ ଫେରୋମୋନ୍ ଟ୍ରାପ୍ ବ୍ୟବହାର କରିବା ଉଚିତ୍। ଯଦି ଆକ୍ରମଣ ପରିଲକ୍ଷିତ ହୁଏ, ତେବେ ବର୍ଷା ହେବା ପରେ ନିମ୍ବ ତେଲ ଲିଟର ପିଛା 5 ମିଲି କିମ୍ବା ଇମାମେକ୍ଟିନ୍ ବେନ୍ଜୋଏଟ୍ ଲିଟର ପିଛା 0.40 ଗ୍ରାମ୍ ସିଞ୍ଚନ କରିବାକୁ ପରାମର୍ଶ ଦିଆଯିବା ଉଚିତ।"
         ]
      },
      "livestock": {
         "advisory": [
            "ଶୀତ ଋତୁରେ ପଶୁମାନଙ୍କୁ ଥଣ୍ଡାରୁ ରକ୍ଷା କରିବା ପାଇଁ କୃଷକମାନେ ବ୍ୟବସ୍ଥା କରିବା ଉଚିତ (ଯଦି ସମ୍ଭବ ପଶୁମାନଙ୍କୁ ଆଚ୍ଛାଦନ କରିବା ପାଇଁ ଝୋଟ ବ୍ୟାଗ ଏବଂ ଶଯ୍ୟା ସାମଗ୍ରୀ ଭାବରେ ନଡ଼ିଆ ବ୍ୟବହାର କରନ୍ତୁ) ଏବଂ ଗୋରୁମାନଙ୍କୁ ସ୍ୱଚ୍ଛ ପାନୀୟ ଜଳ ଯୋଗାଇବା ଏବଂ ସେମାନଙ୍କ ଘର ସଫା ରଖିବା ଉଚିତ। ସେଡ୍ ଚାରିପାଖରେ ପରିସ୍ରା କିମ୍ବା ମଳମୂତ୍ର ଜମା ହେବାକୁ ଦିଅନ୍ତୁ ନାହିଁ ଯାହା ମାଛି ସୃଷ୍ଟି କରିପାରେ ଏବଂ ସେଡ୍ ଭିତରକୁ ବର୍ଷା ଜଳ ପ୍ରବେଶକୁ ସୀମିତ କରିବାର ବ୍ୟବସ୍ଥା କରନ୍ତୁ |",
            "ବିଭିନ୍ନ କ୍ଷତିକାରକ ରୋଗ ଏବଂ ପାକସ୍ଥଳୀ କୃମିକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ ଟୀକାକରଣ ଏବଂ କୃମି ଦୂରୀକରଣ କରାଯିବା ଉଚିତ।"
         ]
      },
      "poultry": {
         "advisory": [
            "ଶୁଦ୍ଧ ବାୟୁ ଯୋଗାଇବା ଏବଂ ଘର ଭିତରେ ଥିବା ଗ୍ୟାସଗୁଡ଼ିକୁ ବାହାର କରିବା ପାଇଁ ଉପଯୁକ୍ତ ବାୟୁ ସଞ୍ଚାରଣର ଆବଶ୍ୟକତା ରହିଛି।",
            "ପୋଲ୍ଟର ୱାଇ ଶେଡ୍କୁ ଉଷ୍ମ ଏବଂ ଶୁଖିଲା ରଖିବା ପାଇଁ ବାହ୍ୟ ଉତ୍ତାପ ଉତ୍ସ ଯୋଗାଇ ଦିଆଯାଏ | କ୍ଷେତକୁ ସୁରକ୍ଷିତ ରଖିବା ପାଇଁ ବିଭିନ୍ନ ପ୍ରକାରର ପରଦା ଏବଂ ଝୋଟ ବସ୍ତା ବ୍ୟବହାର କରାଯାଇଥାଏ।",
            "ପାନୀୟ ଜଳକୁ ଉପଯୁକ୍ତ ତାପମାତ୍ରାରେ ରଖିବା ଉଚିତ, ଯାହାଦ୍ୱାରା ଜଳ ଗ୍ରହଣକୁ ପ୍ରୋତ୍ସାହନ ମିଳିପାରିବ।"
         ]
      }
   },
   "date": "27-12-2024"
}