{
   "weather_details": {
      "28-12-2024": {
         "rainfall": 0,
         "t_max": 25,
         "t_min": 16,
         "rh_max": 85,
         "rh_min": 36,
         "wind_speed": 3,
         "wind_direction": 139,
         "cloud_cover": 3
      },
      "29-12-2024": {
         "rainfall": 4,
         "t_max": 25,
         "t_min": 15,
         "rh_max": 81,
         "rh_min": 39,
         "wind_speed": 3,
         "wind_direction": 154,
         "cloud_cover": 5
      },
      "30-12-2024": {
         "rainfall": 2,
         "t_max": 26,
         "t_min": 14,
         "rh_max": 83,
         "rh_min": 48,
         "wind_speed": 3,
         "wind_direction": 166,
         "cloud_cover": 4
      },
      "31-12-2024": {
         "rainfall": 0,
         "t_max": 27,
         "t_min": 13,
         "rh_max": 84,
         "rh_min": 41,
         "wind_speed": 1,
         "wind_direction": 198,
         "cloud_cover": 1
      },
      "01-01-2025": {
         "rainfall": 0,
         "t_max": 27,
         "t_min": 13,
         "rh_max": 76,
         "rh_min": 33,
         "wind_speed": 1,
         "wind_direction": 236,
         "cloud_cover": 0
      }
   },
   "names_of_crops": [
      "ଖରିଫ ଚାଉଳ",
      "ଗ୍ରୀଷ୍ମକାଳୀନ ଚାଉଳ",
      "ମାଟି ବାଦାମ",
      "କୋଲେ ଫସଲ",
      "ପଶୁପାଳନ",
      "କୁକୁଡ଼ା ମାଂସ"
   ],
   "general_advisory": "ପାଣିପାଗ ସ୍ଥିତି ଅନୁଯାୟୀ ଅମଳ, ବୁଣିବା ଏବଂ ସିଞ୍ଚନ କାର୍ଯ୍ୟ କରିବାକୁ କୃଷକମାନଙ୍କୁ ପରାମର୍ଶ ଦିଆଯାଇଛି। ଫସଲ ଏବଂ ପଶୁମାନଙ୍କୁ ଥଣ୍ଡା ପାଗରୁ ରକ୍ଷା କରିବା ପାଇଁ ପରାମର୍ଶ ଦିଆଯାଇଛି। ରବି ଫସଲର ସମ୍ପୂର୍ଣ୍ଣ ବୁଣିବା ଏବଂ ଯେଉଁଠାରେ ସମ୍ଭବ ଜଳସେଚନ ସୁବିଧା ରହିଛି, ସେଠାରେ ଗ୍ରୀଷ୍ମ ଧାନର ନର୍ସରୀ ବୁଣିବା ଆରମ୍ଭ କରନ୍ତୁ।",
   "crops_data": {
      "kharif rice": {
         "advisory": [
            "ଆଶା କରାଯାଉଥିବା ବର୍ଷା କାରଣରୁ ଅମଳ କାର୍ଯ୍ୟ ପାଇଁ କିଛି ଦିନ ଅପେକ୍ଷା କରନ୍ତୁ।",
            "ଅମଳ ହୋଇଥିବା ଧାନ/ଚାଉଳ ପାଇଁ 'ସୁପର ଗ୍ରେନ୍ ବ୍ୟାଗ୍ \"କିମ୍ବା ଉପଯୁକ୍ତ ସଂରକ୍ଷଣ ପଦ୍ଧତି ବ୍ୟବହାର କରନ୍ତୁ।"
         ]
      },
      "summer rice": {
         "advisory": [
            "ଗ୍ରୀଷ୍ମକାଳୀନ ଧାନ ଚାଷ ପାଇଁ କ୍ଷେତ ପ୍ରସ୍ତୁତି ଆରମ୍ଭ କରନ୍ତୁ",
            "ଚାଷ ପାଇଁ ଉନ୍ନତ ଧାନ କିସମ ବ୍ୟବହାର କରିବା ଉପରେ ବିଚାର କରନ୍ତୁ।"
         ]
      },
      "ground nut": {
         "advisory": [
            "ଚୋଷୁଥିବା କୀଟ ଆକ୍ରମଣ ପାଇଁ ନିୟମିତ ନିରୀକ୍ଷଣ",
            "ପ୍ରାରମ୍ଭିକ ପର୍ଯ୍ୟବେକ୍ଷଣ ପରେ ନିୟନ୍ତ୍ରଣ ପାଇଁ ନିମ-ଆଧାରିତ କୀଟନାଶକ ବ୍ୟବହାର କରନ୍ତୁ।",
            "ସମ୍ଭାବ୍ୟ ବର୍ଷା କାରଣରୁ ଜଳସେଚନ ଏବଂ ସିଞ୍ଚନ କାର୍ଯ୍ୟରେ ବିଳମ୍ବ"
         ]
      },
      "cole crop": {
         "advisory": [
            "ମୃତ୍ତିକାର ଆର୍ଦ୍ରତା ଏବଂ ତାପମାତ୍ରା ବଜାୟ ରଖିବା ପାଇଁ ଘାସକୁ ମଲ୍ଚିଙ୍ଗ ସାମଗ୍ରୀ ଭାବେ ବ୍ୟବହାର କରନ୍ତୁ।",
            "ଫୁଲକୋବିରେ ଡାଇମଣ୍ଡ ବ୍ୟାକ୍ ମଥ ପାଇଁ ନିରୀକ୍ଷଣ କରନ୍ତୁ ଏବଂ ଫେରୋମୋନ୍ ଟ୍ରାପ୍ ବ୍ୟବହାର କରନ୍ତୁ",
            "ଯଦି ଆକ୍ରମଣ ଦେଖାଯାଏ, ତେବେ ବର୍ଷା ପରେ ନିମ୍ବ ତେଲ କିମ୍ବା ଇମାମେକ୍ଟିନ୍ ବେନ୍ଜୋଏଟ୍ ଲଗାନ୍ତୁ।"
         ]
      },
      "livestock": {
         "advisory": [
            "ଥଣ୍ଡା ପାଗରୁ ପଶୁମାନଙ୍କୁ ସୁରକ୍ଷା ଏବଂ ଉପଯୁକ୍ତ ଯତ୍ନ ପ୍ରଦାନ କରନ୍ତୁ",
            "ଗୋରୁମାନଙ୍କ ପାଇଁ ସ୍ୱଚ୍ଛ ପାନୀୟ ଜଳ ସୁନିଶ୍ଚିତ କରିବା ଏବଂ ପରିଷ୍କାର ଛପର ରକ୍ଷଣାବେକ୍ଷଣ କରିବା",
            "ରୋଗ ନିୟନ୍ତ୍ରଣ ପାଇଁ ଟୀକାକରଣ ଏବଂ କୃମି ଦୂରୀକରଣ କାର୍ଯ୍ୟାନ୍ୱୟନ କରନ୍ତୁ।"
         ]
      },
      "poultry": {
         "advisory": [
            "କୁକୁଡ଼ା ଘରେ ଉପଯୁକ୍ତ ଭେଣ୍ଟିଲେସନ୍ ଏବଂ ଗ୍ୟାସ୍ ଅପସାରଣ ସୁନିଶ୍ଚିତ କରନ୍ତୁ",
            "କୁକୁଡ଼ା ପାଳନ ପାଇଁ ପାନୀୟ ଜଳରେ ଉପଯୁକ୍ତ ତାପମାତ୍ରା ବଜାୟ ରଖନ୍ତୁ",
            "କୁକୁଡ଼ା ପାଳିକୁ ଗରମ ଏବଂ ଶୁଖିଲା ରଖିବା ପାଇଁ ଇନସୁଲେସନ୍ ସାମଗ୍ରୀ ବ୍ୟବହାର କରନ୍ତୁ |"
         ]
      }
   },
   "date": "27-12-2024"
}