{
   "weather_details": {
      "28-12-2024": {
         "rainfall": 0,
         "t_max": 28,
         "t_min": 14,
         "rh_max": 87,
         "rh_min": 43,
         "wind_speed": 2,
         "wind_direction": 59,
         "cloud_cover": 1
      },
      "29-12-2024": {
         "rainfall": 5,
         "t_max": 27,
         "t_min": 15,
         "rh_max": 87,
         "rh_min": 48,
         "wind_speed": 2,
         "wind_direction": 191,
         "cloud_cover": 6
      },
      "30-12-2024": {
         "rainfall": 2,
         "t_max": 28,
         "t_min": 14,
         "rh_max": 85,
         "rh_min": 54,
         "wind_speed": 2,
         "wind_direction": 351,
         "cloud_cover": 5
      },
      "31-12-2024": {
         "rainfall": 0,
         "t_max": 28,
         "t_min": 14,
         "rh_max": 82,
         "rh_min": 42,
         "wind_speed": 4,
         "wind_direction": 343,
         "cloud_cover": 2
      },
      "01-01-2025": {
         "rainfall": 0,
         "t_max": 29,
         "t_min": 14,
         "rh_max": 70,
         "rh_min": 33,
         "wind_speed": 3,
         "wind_direction": 334,
         "cloud_cover": 1
      }
   },
   "names_of_crops": [
      "ରୋପଣ କରାଯାଇଥିବା ଧାନ",
      "କପା",
      "ଅରହର",
      "ଗ୍ରୀନଗ୍ରାମ/ବ୍ଲାକଗ୍ରାମ",
      "ଚିନାବାଦାମ",
      "ସୂର୍ଯ୍ୟମୁଖୀ",
      "ରସୁଣ",
      "ଫୁଲକୋବି ଏବଂ ବନ୍ଧାକୋବି",
      "ଟମାଟୋ",
      "ବାଇଗଣ",
      "ଗୋରୁ ଏବଂ ମଇଁଷି",
      "ଛେଳି।",
      "କୁକୁଡ଼ା ମାଂସ"
   ],
   "general_advisory": "ଆଗାମୀ ପାଞ୍ଚ ଦିନ ପାଇଁ ପାଣିପାଗ ପୂର୍ବାନୁମାନକୁ ଦୃଷ୍ଟିରେ ରଖି କୃଷକମାନଙ୍କୁ ଆଉ ଦୁଇରୁ ତିନି ଦିନ ପାଇଁ ଧାନ ଅମଳ ବନ୍ଦ ରଖିବାକୁ ପରାମର୍ଶ ଦିଆଯାଇଛି। ବର୍ତ୍ତମାନ ପାଇଁ ଉଦ୍ଭିଦ ସୁରକ୍ଷା ରାସାୟନିକ ସିଞ୍ଚନ ଏବଂ ରବି ଫସଲ ବୁଣିବା ସ୍ଥଗିତ ରଖିବାକୁ ମଧ୍ୟ କୃଷକମାନଙ୍କୁ ପରାମର୍ଶ ଦିଆଯାଇଛି। ଗୃହପାଳିତ ପଶୁମାନଙ୍କୁ ଘର ଭିତରେ ରଖନ୍ତୁ। ପ୍ରବଳ ଥଣ୍ଡା ପ୍ରଭାବିତ ଅଞ୍ଚଳରେ ରାତିରେ ଧାନ ନର୍ସରୀରେ ପଲିଥିନ୍ କଭର ବ୍ୟବହାର କରନ୍ତୁ।",
   "crops_data": {
      "transplanted paddy": {
         "advisory": [
            "ରବି ଋତୁ ପାଇଁ ନର୍ସରୀ ପ୍ରସ୍ତୁତି ପାଇଁ ଏହା ହେଉଛି ଉପଯୁକ୍ତ ସମୟ। ଏକ ଏକର ଧାନ ଚାଷ ପାଇଁ ନର୍ସରୀ କ୍ଷେତ୍ରର 10 ଦଶମାଂଶ ଆବଶ୍ୟକ। ଏମ. ଟି. ୟୁ. 1010, ଏମ. ଟି. ୟୁ. 1001, ଡି. ଆର. ଆର. 44, ସହଭାଗି ଧନ, ଲଲାଟ, ଉନ୍ନତ ଲଲାଟ, ମନ୍ଦାକିନୀ, ବିନା 11 ଇତ୍ୟାଦି ଉପଯୁକ୍ତ ଉଚ୍ଚ ଉତ୍ପାଦନକାରୀ କିସମର ବ୍ୟବସ୍ଥା କରନ୍ତୁ। ନର୍ସରୀରେ ବୁଣିବା ପୂର୍ବରୁ ପ୍ରତି 1 କି. ଗ୍ରା. ମଞ୍ଜି ପିଛା 2 ଗ୍ରାମ୍ କାର୍ବେନଡାଜିମ୍ କିମ୍ବା 3 ଗ୍ରାମ୍ କାର୍ବୋକ୍ସିନ୍ କିମ୍ବା ଥିରାମ୍ ବ୍ୟବହାର କରନ୍ତୁ।",
            "ଧାନ ନର୍ସରୀକୁ ଥଣ୍ଡା ଆଘାତରୁ ରକ୍ଷା କରିବା ପାଇଁ, ଶଯ୍ୟାକୁ ଅପେକ୍ଷାକୃତ ଗରମ ରଖିବା ପାଇଁ ଓଦା ଶଯ୍ୟାରେ ମଞ୍ଜି ବୁଣିବା ପରେ ଭଲ ଭାବେ ଅପଘଟିତ ଏଫ୍. ଆଇ. ଏମ୍. ର ଏକ ପତଳା ସ୍ତର ଲଗାନ୍ତୁ। ସନ୍ଧ୍ୟାରେ ଜଳସେଚନ ପାଇଁ ବୋର କୂଅ ପାଣିର ବ୍ୟବହାର କରିବା ଉଚିତ ଏବଂ ମୃତ୍ତିକାର ତାପମାତ୍ରା ବୃଦ୍ଧି ପାଇଁ ଅନୁକୂଳ ରଖିବା ପାଇଁ ସକାଳେ ଥଣ୍ଡା ପାଣି ବାହାର କରିଦିଅନ୍ତୁ। ପ୍ରବଳ ଥଣ୍ଡା ପ୍ରଭାବିତ ଅଞ୍ଚଳରେ ରାତିରେ ପଲିଥିନ୍ କଭର ବ୍ୟବହାର କରନ୍ତୁ।",
            "ଚାରା ଗୁଡ଼ିକର ସୁସ୍ଥ ଉତ୍ପାଦନ ପାଇଁ 13-15 କିଲୋଗ୍ରାମ ଡିଏପି ଏବଂ 10-12 କିଲୋଗ୍ରାମ ଏମଓପି ସହିତ 200 କିଲୋଗ୍ରାମ ଏଫୱାଇଏମ ଏବଂ 10 ଦଶମିକ ପିଛା 200 ଗ୍ରାମ ଜେଡଏନକୁ ମୂଳ ମାତ୍ରା ଭାବରେ ପ୍ରୟୋଗ କରନ୍ତୁ।"
         ]
      },
      "cotton": {
         "advisory": [
            "ଯେତେବେଳେ ବୋଲ୍ ଗୁଡ଼ିକ ସମ୍ପୂର୍ଣ୍ଣ ଭାବେ ଫୁଟିଯାଏ, ସେତେବେଳେ ଉଠାଇବା ଉଚିତ।",
            "ଆର୍ଦ୍ରତାକୁ 8-10% କୁ ହ୍ରାସ କରିବା ପାଇଁ କଂକ୍ରିଟ୍ ଚଟାଣ କିମ୍ବା ତିରପାଲ ଶୀଟ୍ ଉପରେ ବୀଜ କପା ଶୁଖାଇ ଦିଅନ୍ତୁ |",
            "ଲମ୍ବା ପ୍ରଧାନ କପା ପାଇଁ ଏମ୍. ଏସ୍. ପି. (7521/କ୍ୟୁ. ଟି.) ପାଇବା ପାଇଁ କୃଷକମାନଙ୍କୁ ନିକଟସ୍ଥ \"ମଣ୍ଡି\" ରେ ସେମାନଙ୍କ ବିହନ କପା ବିକ୍ରି କରିବାକୁ ପରାମର୍ଶ ଦିଆଯାଇଛି।"
         ]
      },
      "arhar": {
         "advisory": [
            "ପ୍ରଚଳିତ ପାଣିପାଗ ସ୍ଥିତି ପରବର୍ତ୍ତୀ କୀଟ ଆକ୍ରମଣକୁ ସମର୍ଥନ କରେ | ତେଣୁ, ଆବଶ୍ୟକତା ଅନୁଯାୟୀ ସୁପାରିସ କରାଯାଇଥିବା ନିୟନ୍ତ୍ରଣ ପଦକ୍ଷେପ ଅନୁସରଣ କରାଯିବା ଉଚିତ।",
            "ପୋଡ୍ ବୋରରକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ, ବେନ୍ଫୁରାକାର୍ବ 40 ପ୍ରତିଶତ ଇସି @1ଲିଟ୍/ଏସି କିମ୍ବା ଡେଲ୍ଟାମେଥ୍ରିନ୍ 2.8 ପ୍ରତିଶତ ଇସି @200 ମିଲି/ଏସି କିମ୍ବା ସ୍ପିନୋସାଡ୍ 45 ପ୍ରତିଶତ ଏସସି @60 ମିଲି/ଏସି କିମ୍ବା ଫ୍ଲୁବେଣ୍ଡିଆମାଇଡ୍ 39.35% ଏସସି @40 ମିଲି/ଏସି ସହିତ 200 ଲିଟର ପାଣି ମିଶାଇ ଲଗାନ୍ତୁ। ଅଧିକ ସୂଚନା ପାଇଁ, ଆଇଏମଡି, ଭୁବନେଶ୍ୱର, ଟେଲିଫୋନ୍ ସହିତ ଯୋଗାଯୋଗ କରନ୍ତୁ। #0674-2596116",
            "ପୋଡ୍ ଶୋଷକ ବଗ୍ ଏବଂ ଏଫିଡ୍ କୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ, ଥିୟାମେଥୋକ୍ସାମ୍ 25 ପ୍ରତିଶତ ଡବ୍ଲୁଜି @40 ଗ୍ରାମ୍/ଏସି କିମ୍ବା ଇମିଡାକ୍ଲୋପ୍ରିଡ୍ 17.8% ଏସ୍ଏଲ୍ @60 ମିଲି/ଏକର ସହିତ 200 ଲିଟର ପାଣି ମିଶାଇ ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "greengram/blackgram": {
         "advisory": [
            "ଆଗାଛା ପରିଚାଳନାଃ 1-2 ଡିଏଏସରେ 200 ଲିଟର ପାଣି ସହିତ ପେଣ୍ଡିମିଥାଲିନ୍ 30 ପ୍ରତିଶତ ଇସି @1.20 ଲିଟର/ଏକର ମିଶ୍ରଣ କରନ୍ତୁ।",
            "20-25 ଡିଏଏସରେ 200 ଲିଟର ପାଣି ସହିତ ଏକର ପିଛା 5 ପ୍ରତିଶତ ଇସି କିମ୍ବା ଇମାଜେଥାପାଇର୍ 10 ଏସଏଲ @300 ମିଲି ମିଶାନ୍ତୁ।",
            "ପତ୍ର ଖାଉଥିବା ଶୁଆକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ, ଏକର ପିଛା ପ୍ରୋଫେନୋଫସ୍ 50 ଇସି 400 ମିଲି 200 ଲିଟର ପାଣିରେ ମିଶାଇ ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "groundnut": {
         "advisory": [
            "ଆଗାଛା ପରିଚାଳନାଃ ଇମାଜେଥାପାଇର୍ 10 ପ୍ରତିଶତ ଏସ୍. ଏଲ୍. @3ମି. ଲି./ଲିଟର ଜଳ 15 ଡିଏଏସ୍ରେ ପ୍ରୟୋଗ କରନ୍ତୁ କିମ୍ବା 15-20 ଡିଏଏସ୍ରେ ଫେନକ୍ସାପ୍ରପ-ପି-ଇଥାଇଲ 9.3 ପ୍ରତିଶତ @35ମି. ଲି./ଡ୍ରମ୍ (15-ଲିଟର କ୍ଷମତା) ପ୍ରୟୋଗ କରନ୍ତୁ।",
            "ପ୍ରଚଳିତ ପାଣିପାଗ ସ୍ଥିତି ଏଫିଡ୍, ଜାସିଡ୍ ଏବଂ ହ୍ୱାଇଟ୍ଫ୍ଲାଇ ପରି ଶୋଷକ କୀଟପତଙ୍ଗର ବିକାଶକୁ ସମର୍ଥନ କରେ | କୀଟ ସଂଖ୍ୟା ଉପରେ ନଜର ରଖିବା ପାଇଁ ଏକର ପିଛା 8ନସ୍ ପିଛା ହଳଦିଆ ଚଟପଟା ଜାଲ ଲଗାନ୍ତୁ। ନିମ୍ବ ତେଲ ଆଧାରିତ କୀଟନାଶକ ଆଜାଦିରାକ୍ଟିନ 0.03% (300 ପିପିଏମ) @5 ମିଲି/ଲିଟର ପାଣି ପ୍ରୟୋଗ କରନ୍ତୁ।"
         ]
      },
      "sunflower": {
         "advisory": [
            "ଶୋଷକ କୀଟ କମ୍ପ୍ଲେକ୍ସ (ଏଫିଡ୍, ହପର୍, ଥ୍ରିପ୍ସ ଏବଂ ହ୍ୱାଇଟ୍ ମାଛି): ପ୍ରଚଳିତ ପାଣିପାଗ ସ୍ଥିତି ଶୋଷକ କୀଟଗୁଡ଼ିକର ବିକାଶକୁ ସମର୍ଥନ କରେ | ଏସିଟାମିପ୍ରିଡ୍ 20 ପ୍ରତିଶତ ଏସ. ପି. @50 ଗ୍ରାମ/ଏକର କିମ୍ବା ଇମିଡାକ୍ଲୋପ୍ରିଡ୍ 17.8% ଏସ. ଏଲ. @60 ମିଲି/ଏକରକୁ 200 ଲିଟର ପାଣି ସହିତ ମିଶାଇ ଆବଶ୍ୟକ ଅନୁଯାୟୀ ସ୍ପ୍ରେ କରିବା ପାଇଁ ପରାମର୍ଶ ଦିଆଯାଇଛି।"
         ]
      },
      "onion": {
         "advisory": [
            "ଆଠ-ସପ୍ତାହ ପର୍ଯ୍ୟାୟରେ ପିଆଜର ଚାରା ରୋପଣ ପାଇଁ ମୁଖ୍ୟ କ୍ଷେତ୍ର ପ୍ରସ୍ତୁତ କରନ୍ତୁ।",
            "ଏକ ଏକର ଜମି ପାଇଁ, ମୁଖ୍ୟ କ୍ଷେତରେ ପିଆଜର ଚାରା ରୋପଣ ପୂର୍ବରୁ 43 କିଲୋଗ୍ରାମ ଡିଏପି, 27 କିଲୋଗ୍ରାମ ୟୁରିଆ, 33 କିଲୋଗ୍ରାମ ଏମଓପି ଏବଂ 20 କିଲୋଗ୍ରାମ ସଲଫର୍ ଲଗାନ୍ତୁ।"
         ]
      },
      "cauliflower & cabbage": {
         "advisory": [
            "ତିନି-ସପ୍ତାହ ପର୍ଯ୍ୟାୟରେ, ହୋଇଂ, ଆଗାଛା କାଟିବା ଏବଂ ୟୁରିଆ ଲଗାନ୍ତୁ @55 କେଜି/ଏସି ପରେ ଜଳସେଚନ |",
            "ଛଅରୁ ସାତ ସପ୍ତାହ ପରେ ଜଳସେଚନ ପାଇଁ 27 କି. ଗ୍ରା. ୟୁରିଆ + 25 କି. ଗ୍ରା. ଏମ୍. ଓ. ପି ପ୍ରୟୋଗ କରନ୍ତୁ।",
            "ଡିମଣ୍ଡ ବ୍ୟାକ୍ ମଥ୍ର ନିୟନ୍ତ୍ରଣ ପାଇଁ, ନିୟନ୍ତ୍ରଣ ପଦକ୍ଷେପ ଭାବରେ ଫାଇପ୍ରୋନିଲ୍ 5 ପ୍ରତିଶତ ଏସ୍. ସି. @2 ମିଲି/ଲିଟର କିମ୍ବା କ୍ଲୋରପିରିଫସ୍ 20 ପ୍ରତିଶତ ଇ. ସି. @4 ମିଲି/ଲିଟର ପାଣି ସ୍ପ୍ରେ କରନ୍ତୁ।",
            "ତମାଖୁ ପତ୍ର ଖାଉଥିବା କ୍ୟାଟର୍ପିଲର ନିୟନ୍ତ୍ରଣ ପାଇଁ, କୀଟ ସଂଖ୍ୟାକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ ସାୟାନ୍ଟ୍ରାନିଲିପ୍ରୋଲ 10.26% ଓଡି @6 ମିଲି/5 ଲିଟର ପାଣି ସ୍ପ୍ରେ କରନ୍ତୁ।",
            "କାବେଜ୍ ଏଫିଡ୍ ନିୟନ୍ତ୍ରଣ ପାଇଁ, ନିୟନ୍ତ୍ରଣ ପଦକ୍ଷେପ ଭାବରେ ଥିୟାମେଥୋକ୍ସାମ୍ 25 ପ୍ରତିଶତ ଡବ୍ଲୁଜି @2 ଗ୍ରାମ୍/5 ଲିଟର ପାଣି ସ୍ପ୍ରେ କରନ୍ତୁ |"
         ]
      },
      "tomato": {
         "advisory": [
            "ଉଚ୍ଚ ଆର୍ଦ୍ର ଅବସ୍ଥାକୁ ଦୃଷ୍ଟିରେ ରଖି ଏହି ପର୍ଯ୍ୟାୟରେ ଶୁଷ୍କତା ଘଟିପାରେ। ଯଦି ଲକ୍ଷଣ ଦେଖାଯାଏ, ତେବେ ମାନକୋଜେବ୍ 75 ପ୍ରତିଶତ ଡବ୍ଲ୍ୟୁ. ପି. @2 ଗ୍ରାମ/ଲିଟର ପାଣି ସ୍ପ୍ରେ କରନ୍ତୁ।",
            "କୀଟପତଙ୍ଗ ସଂଖ୍ୟା ଉପରେ ନଜର ରଖିବା ପାଇଁ ଏକର ପିଛା 8ନସ୍ ସଂଖ୍ୟାରେ ଫେରୋମୋନ୍ ଫାନ୍ଦ ଲଗାନ୍ତୁ।"
         ]
      },
      "brinjal": {
         "advisory": [
            "ଫଳ ଏବଂ ଶୁଟ୍ ବୋରରର ନିୟନ୍ତ୍ରଣ ପାଇଁ, ବନସ୍ପତି ପର୍ଯ୍ୟାୟରେ ଏକର ପିଛା 8 ନମ୍ବରରେ ଫେରୋମୋନ୍ ଟ୍ରାପ୍/ୱାଟା ଟ୍ରାପ୍ ସ୍ଥାପନ କରନ୍ତୁ ଏବଂ 3 ସପ୍ତାହ ପରେ ଲୋଭ ବଦଳାନ୍ତୁ |"
         ]
      },
      "cattle & buffalo": {
         "advisory": [
            "କୃଷକମାନଙ୍କୁ ଅନୁରୋଧ କରାଯାଇଛି ଯେ ସେମାନେ ଏନ୍. ଏ. ଡି. ସି. ପି. ଜରିଆରେ ସେମାନଙ୍କ ଗୋରୁ ଏବଂ ମଇଁଷିକୁ ଏଫ୍. ଏମ୍. ଡି. ଟିକା ଦିଅନ୍ତୁ। କୃଷକମାନେ ପାଦ ଏବଂ ମୁଖ ରୋଗ (ଏଫ୍. ଏମ୍. ଡି.) କୁ ନିୟନ୍ତ୍ରଣ ଏବଂ ପ୍ରତିରୋଧ କରି ଦୁଗ୍ଧ ଉତ୍ପାଦନ ବୃଦ୍ଧି କରିପାରିବେ। 4-8 ମାସ ବୟସର ବାଛୁରୀମାନଙ୍କୁ ବ୍ରୁସେଲୋସିସ୍ ବିରୁଦ୍ଧରେ ଟୀକାକରଣ କରାଯିବା ଉଚିତ୍।"
         ]
      },
      "goat": {
         "advisory": [
            "ଥଣ୍ଡା ପବନ ଏବଂ ଆର୍ଦ୍ର ଚଟାଣରୁ ଛେଳିଙ୍କୁ ରକ୍ଷା କରନ୍ତୁ।"
         ]
      },
      "poultry": {
         "advisory": [
            "ମୃତ୍ୟୁ ହାର ହ୍ରାସ କରିବା ପାଇଁ ବିଶେଷ କରି ରାତିରେ ଛୁଆମାନଙ୍କୁ ଉତ୍ତାପ ପ୍ରଦାନ କରିବା ପାଇଁ ଆବଶ୍ୟକ ବ୍ୟବସ୍ଥା କରନ୍ତୁ। ଛୁଆମାନଙ୍କ ପାଇଁ ଉପଯୁକ୍ତ ପ୍ରଜନନ ବ୍ୟବସ୍ଥା କରନ୍ତୁ। କୁକୁଡ଼ା ଘରକୁ ସଫା ରଖନ୍ତୁ ଏବଂ କ୍ଲାମ୍ପ ମୁକ୍ତ ରଖନ୍ତୁ |"
         ]
      }
   },
   "date": "27-12-2024"
}