{
   "weather_details": {
      "18/01/2025": {
         "rainfall": 0,
         "t_max": 29,
         "t_min": 0,
         "rh_max": 87,
         "rh_min": 46,
         "wind_speed": 4,
         "wind_direction": 236,
         "cloud_cover": 0
      },
      "24/01/2025": {
         "rainfall": 0,
         "t_max": 19,
         "t_min": 0,
         "rh_max": 94,
         "rh_min": 53,
         "wind_speed": 9,
         "wind_direction": 212,
         "cloud_cover": 0
      }
   },
   "names_of_crops": [
      "ସୋରିଷ",
      "ଚିନାବାଦାମ",
      "କପା",
      "ଆଖୁ",
      "ଧାନ।",
      "ରସୁଣ",
      "କଳା ଚଣା",
      "ଆଳୁ",
      "କୋଇଲା ଫସଲ",
      "ଟମାଟୋ",
      "ବାଇଗଣ",
      "ଗୋଲାପ।"
   ],
   "general_advisory": "ହାଲୁକା ଶୁଖିଲା ପରିସ୍ଥିତି ଥିବାରୁ କୃଷକମାନଙ୍କୁ ସେମାନଙ୍କ କ୍ଷେତକୁ ଜଳସେଚନ କରିବାକୁ ପରାମର୍ଶ ଦିଆଯାଇଛି। ବିଭିନ୍ନ ଫସଲ ରୋଗ ଏବଂ କୀଟପତଙ୍ଗ ପରିଚାଳନା ପାଇଁ ନିର୍ଦ୍ଦିଷ୍ଟ ଚିକିତ୍ସା ଆବଶ୍ୟକ କରେ | ପରାମର୍ଶରେ ଉଲ୍ଲେଖ କରାଯାଇଥିବା ପ୍ରତ୍ୟେକ ଫସଲ ପାଇଁ ନିର୍ଦ୍ଦିଷ୍ଟ ପରାମର୍ଶ ପ୍ରଦାନ କରାଯାଇଥାଏ।",
   "crops_data": {
      "mustard": {
         "advisory": [
            "ଏବେ ସୋରିଷ ଫସଲରେ ଏଫିଡ୍ ଏବଂ ପେଣ୍ଟେଡ ବଗ ସଂକ୍ରମଣ ହେବାର ସମ୍ଭାବନା ରହିଛି। ପ୍ରାଥମିକ ସଂକ୍ରମଣ ପରିଚାଳନା ପାଇଁ ନିମ ଆଧାରିତ କୀଟନାଶକ (ଆଜାଦିରାକ୍ଟିନ) 1500 ପିପିଏମ ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "groundnut": {
         "advisory": [
            "ଚିନାବାଦାମରେ କାଣ୍ଡ କ୍ଷୟକୁ ପରିଚାଳନା କରିବା ପାଇଁ, ଅନୁମୋଦିତ ହାରରେ 3 ପ୍ରତିଶତ ଲିଟର ଭାଲିଡାମାଇସିନ୍ ସହିତ ମାଟିକୁ ଭିଜାଇ ଦିଅନ୍ତୁ |"
         ]
      },
      "cotton": {
         "advisory": [
            "କପା ଫସଲ ଉଠାଣ ପ୍ରାୟ ଶେଷ ହୋଇଛି।"
         ]
      },
      "sugarcane": {
         "advisory": [
            "ଆଖୁରେ ରାଟୁନିଂ ପାଇଁ, ଧାଇଞ୍ଚା, ସୁନହେମ୍ପ ଏବଂ କାଉପି ପରି ସବୁଜ ସାର ଫସଲ ଦୁଇଟି ଧାଡ଼ି ମଧ୍ୟରେ ଚାଷ କରାଯାଇପାରିବ |"
         ]
      },
      "paddy": {
         "advisory": [
            "ଧାନରେ କାଣ୍ଡ ଛେଦକକୁ ପରିଚାଳନା କରିବା ପାଇଁ, ସାପ୍ତାହିକ ବ୍ୟବଧାନରେ ଟ୍ରାଇକୋଗ୍ରାମମାଜାପୋନିକମ କାର୍ଡ ବ୍ୟବହାର କରନ୍ତୁ। ଫଳପ୍ରଦ କୀଟ ନିୟନ୍ତ୍ରଣ ପାଇଁ ସୁପାରିସ କରାଯାଇଥିବା କୀଟନାଶକ ପ୍ରୟୋଗ କରନ୍ତୁ।"
         ]
      },
      "onion": {
         "advisory": [
            "ପିଆଜ ଫସଲରେ, ସୁପାରିଶ କରାଯାଇଥିବା ବ୍ୟବଧାନରେ ଆନ୍ତଃ-ଚାଷ ଏବଂ ହାତ-ଆଗାଛା କାଟିବା ପାଇଁ ଯାଆନ୍ତୁ। ପରାମର୍ଶ ଅନୁଯାୟୀ ସାର ପ୍ରୟୋଗ କରନ୍ତୁ।"
         ]
      },
      "black gram": {
         "advisory": [
            "ବ୍ଲାକଗ୍ରାମ୍ ଏବଂ ଗ୍ରୀନ୍ଗ୍ରାମ୍ ଫସଲରେ ପାଉଡର ଫଙ୍ଗସ୍ ରୋଗକୁ ପରିଚାଳନା କରିବା ପାଇଁ, ନିର୍ଦ୍ଦିଷ୍ଟ ହାରରେ ସୁପାରିଶ କରାଯାଇଥିବା ଫଙ୍ଗିସାଇଡ୍ ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "potato": {
         "advisory": [
            "ଆଳୁରେ ଶୀଘ୍ର ରୋଗ ଏବଂ ବିଳମ୍ବରେ ରୋଗ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ, ନିର୍ଦ୍ଦିଷ୍ଟ ବ୍ୟବଧାନରେ ସୁପାରିଶ କରାଯାଇଥିବା କବକନାଶକ ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "cole crops": {
         "advisory": [
            "ବିଳମ୍ବରେ ବୁଣାଯାଇଥିବା ଫୁଲକୋବି ଏବଂ ବନ୍ଧାକୋବି ଫସଲରେ ଡାଇମଣ୍ଡ ବ୍ୟାକ୍ ମଥ୍ ଏବଂ ହେଡ୍ ବୋରର୍ ସଂକ୍ରମଣ ପାଇଁ ବର୍ତ୍ତମାନର ପାଣିପାଗ ଅନୁକୂଳ | ପରାମର୍ଶ ଅନୁଯାୟୀ ଆବଶ୍ୟକ ନିୟନ୍ତ୍ରଣ ପଦକ୍ଷେପ ନିଅନ୍ତୁ।"
         ]
      },
      "tomato": {
         "advisory": [
            "ପ୍ରଚଳିତ କୁହୁଡ଼ି ଅବସ୍ଥା ଟମାଟୋରେ ଏଫିଡ୍ ସଂକ୍ରମଣ ବୃଦ୍ଧି କରିପାରେ | ସୁପାରିସ କରାଯାଇଥିବା ସ୍ପ୍ରେ ଦ୍ୱାରା ନିୟନ୍ତ୍ରଣ ପଦକ୍ଷେପ।"
         ]
      },
      "brinjal": {
         "advisory": [
            "ବାଇଗଣ ଗଛରେ ଏପିଲାକ୍ନା ବିଟଲ୍ର ପରିଚାଳନା ପାଇଁ, ସୁପାରିସ କରାଯାଇଥିବା ପରିଚାଳନା ପଦ୍ଧତି ଅନୁସରଣ କରନ୍ତୁ।"
         ]
      },
      "rose": {
         "advisory": [
            "ଗୋଲାପରେ ଥ୍ରିପ୍ସକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ, ନିର୍ଦ୍ଦିଷ୍ଟ ଭାବରେ ସୁପାରିଶ କରାଯାଇଥିବା କୀଟନାଶକ ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      }
   },
   "date": "28-01-2025"
}