{
   "weather_details": {
      "2024-10-30": {
         "rainfall": 4.0,
         "t_max": 34,
         "t_min": 26,
         "rh_max": 98,
         "rh_min": 71,
         "wind_speed": 1,
         "wind_direction": 288,
         "cloud_cover": 6
      },
      "2024-10-31": {
         "rainfall": 1.0,
         "t_max": 33,
         "t_min": 26,
         "rh_max": 98,
         "rh_min": 68,
         "wind_speed": 1,
         "wind_direction": 315,
         "cloud_cover": 5
      },
      "2024-11-01": {
         "rainfall": 2.0,
         "t_max": 33,
         "t_min": 26,
         "rh_max": 98,
         "rh_min": 61,
         "wind_speed": 2,
         "wind_direction": 297,
         "cloud_cover": 5
      },
      "2024-11-02": {
         "rainfall": 1.0,
         "t_max": 32,
         "t_min": 25,
         "rh_max": 97,
         "rh_min": 60,
         "wind_speed": 2,
         "wind_direction": 315,
         "cloud_cover": 4
      },
      "2024-11-03": {
         "rainfall": 0.0,
         "t_max": 32,
         "t_min": 25,
         "rh_max": 93,
         "rh_min": 51,
         "wind_speed": 2,
         "wind_direction": 90,
         "cloud_cover": 4
      }
   },
   "names_of_crops": [
      "ଚାଉଳ",
      "କପା",
      "ମକା",
      "ପିଜନ୍ ମଟର",
      "ଚିନାବାଦାମ",
      "ଫିଙ୍ଗର ମିଲେଟ୍",
      "ସୋରିଷ",
      "ବାଇଗଣ",
      "ଟମାଟୋ",
      "ଫୁଲକୋବି"
   ],
   "general_advisory": "ଗତ ସପ୍ତାହରେ ଗଜପତି ଜିଲ୍ଲାର ହାରାହାରି ସର୍ବାଧିକ ଦୈନିକ ତାପମାତ୍ରା 33.1 ଡିଗ୍ରୀ ସେଲସିଯ଼ସ୍ ଏବଂ ହାରାହାରି ସର୍ବନିମ୍ନ ଦୈନିକ ତାପମାତ୍ରା 23.3 ଡିଗ୍ରୀ ସେଲସିଯ଼ସ୍ ଥିଲା। ଗତ ସପ୍ତାହରେ ଜିଲ୍ଲାରେ 4.7 ମିଲିମିଟର ବର୍ଷା ହୋଇଥିଲା। ପ୍ରାକ୍-ରାବି ଫସଲ ଯଥା-ଚଣା, ସବୁଜ ଚଣା, ଗହମ, ତିଲ, ସୂର୍ଯ୍ଯ଼ମୁଖୀ ଏବଂ କାକୁଡ଼ିକୁ ମଧ୍ଯ଼ମ ଜମିରେ ବୁଣିବା ପାଇଁ ଯାଆନ୍ତୁ। ମଟର, ଗାଜର, ମୂଳା ଇତ୍ଯ଼ାଦି ପନିପରିବା ଫସଲ ବୁଣିବା ପାଇଁ ଯାଆନ୍ତୁ | ଯେତେବେଳେ 80-85% ଶସ୍ଯ଼ ହାତ ଦ୍ୱାରା ହାତୁଡ଼ି ଦ୍ୱାରା କିମ୍ବା କମ୍ବାଇନ୍ ହାରଭେଷ୍ଟର କିମ୍ବା ରିପ୍ପର୍ ବ୍ଯ଼ବହାର କରି ପରିପକ୍ୱ ହୁଏ ସେତେବେଳେ ଫସଲ ଅମଳ କରନ୍ତୁ | ବ୍ଯ଼ବହାର ଉଦ୍ଦେଶ୍ଯ଼ରେ ଧାନ ଶସ୍ଯ଼କୁ 14 ପ୍ରତିଶତ ଆର୍ଦ୍ରତା ପର୍ଯ୍ଯ଼ନ୍ତ ସୂର୍ଯ୍ଯ଼ାଲୋକରେ ଶୁଖାଇବା ଆବଶ୍ଯ଼କ ଏବଂ ଉନ୍ନତ ସ୍ୱଯ଼ଂ-ଜୀବନ ପାଇଁ ବୀଜ ଉଦ୍ଦେଶ୍ଯ଼ରେ ଏହାକୁ 12 ପ୍ରତିଶତ ଆର୍ଦ୍ରତା ପର୍ଯ୍ଯ଼ନ୍ତ ଶୁଖାଇବା ଆବଶ୍ଯ଼କ। ପରିପକ୍ୱ ମକା ଏବଂ ପନିପରିବା ଅମଳ କରନ୍ତୁ ଏବଂ ଏହାକୁ ସୁରକ୍ଷିତ ସ୍ଥାନରେ ରଖନ୍ତୁ |",
   "crops_data": {
      "rice": {
         "advisory": [
            "ରୋପଣ କରାଯାଇଥିବା ଧାନ ମୁଖ୍ଯ଼ କ୍ଷେତରେ ଶସ୍ଯ଼ ପରିପକ୍ୱତା ପର୍ଯ୍ଯ଼ାଯ଼ରେ ଅଛି | ବର୍ତ୍ତମାନର ଉଚ୍ଚ ଆର୍ଦ୍ର ପାଣିପାଗ ସ୍ଥିତି ଏବଂ ବର୍ଷା ପରେ ସ୍ୱଚ୍ଛ ଆକାଶ ଧାନରେ ବ୍ରାଉନ୍ ପ୍ଲାଣ୍ଟ ହପର୍ (ବିପିଏଚ) ଏବଂ ହ୍ୱାଇଟ୍ ବ୍ଯ଼ାକ୍ଡ୍ ପ୍ଲାଣ୍ଟ ହପର୍ (ଡବ୍ଲୁବିପିଏଚ) ସଂକ୍ରମଣ ପାଇଁ ଅନୁକୂଳ | ଧାନରେ ବିପିଏଚ ଏବଂ ଡବ୍ଲ୍ଯ଼ୁ. ବି. ପି. ଏଚ. ପରିଚାଳନା କରିବା ପାଇଁ ନାଇଟ୍ରୋଜେନ ସାରର ଅତ୍ଯ଼ଧିକ ବ୍ଯ଼ବହାରରୁ ଦୂରେଇ ରୁହନ୍ତୁ। କ୍ଷେତରେ ଅଧିକ ସମଯ଼ ଧରି ପାଣି ଛିଡ଼ା କରି ରଖନ୍ତୁ ନାହିଁ। ବିକଳ୍ପ ଭିଜା ଏବଂ ଶୁଖାଇବା କୌଶଳ ଦ୍ୱାରା ଧାନ କ୍ଷେତର ମାଇକ୍ରୋ-ଜଳବାଯ଼ୁ ପରିବର୍ତ୍ତନ କରନ୍ତୁ | ଫସଲ ଅଞ୍ଚଳ ତଳେ ସୂର୍ଯ୍ଯ଼ାଲୋକ ପ୍ରବେଶ ଏବଂ ଉପଯୁକ୍ତ ବାଯ଼ୁପ୍ରବାହ ପାଇଁ 6 ଫୁଟ ବ୍ଯ଼ବଧାନରେ ଗଳି ତିଆରି କରନ୍ତୁ। ଯଦି ବିପିଏଚ ସଂକ୍ରମଣ ହୁଏ (5-10 ହପର/ପାହାଡ), ଗଛର ପାଦଦେଶରେ ନିମ୍ବ ଆଧାରିତ କୀଟନାଶକ 1500 ପିପିଏମ @600-ମିଲି/ଏକର ସ୍ପ୍ରେ କରନ୍ତୁ। ଯଦି ସମସ୍ଯ଼ା ଜାରି ରହେ, ତେବେ ଗଛର ପାଦଦେଶରେ ଏକର ପିଛା 120 ଗ୍ରାମ୍ ପାଇମେଟ୍ରୋଜିନ୍ 50 ପ୍ରତିଶତ ଡବ୍ଲୁ. ଜି. କିମ୍ବା ଏକର ପିଛା 80 ଗ୍ରାମ୍ ଡିନୋଟେଫୁରାନ୍ 20 ପ୍ରତିଶତ ଏସ୍. ଜି. କିମ୍ବା ଏକର ପିଛା 60 ଗ୍ରାମ୍ ଫ୍ଲୋନିକାମିଡ୍ 50 ପ୍ରତିଶତ ଡବ୍ଲୁ. ଜି. କିମ୍ବା ଏକର ପିଛା 100 ମିଲି. ଟ୍ରାଇଫ୍ଲୁମେଜୋପାଇରିମ୍ 10 ପ୍ରତିଶତ ଏସ୍. ସି. ସ୍ପ୍ରେ କରନ୍ତୁ। ବ୍ରାଉନ୍ ପ୍ଲାଣ୍ଟ ହପର୍ ପାଇଁ ସୁପାରିଶ କରାଯାଇଥିବା କୀଟନାଶକକୁ କେବଳ ସୁପାରିସ କରାଯାଇଥିବା ମାତ୍ରାରେ ବ୍ଯ଼ବହାର କରନ୍ତୁ। ଉଷ୍ମ, ଆର୍ଦ୍ର ପାଗ, ନିମ୍ନ ତାପମାତ୍ରା (<28oC) ହଳଦିଆ କାଣ୍ଡ ଛେଦକକୁ ପସନ୍ଦ କରେ | ଫସଲର ପ୍ରାରମ୍ଭିକ ପର୍ଯ୍ଯ଼ାଯ଼ରେ ଧାନରେ କାଣ୍ଡ ଛେଦକକୁ ପରିଚାଳନା କରିବା ପାଇଁ, କାର୍ଟାପ୍ ହାଇଡ୍ରୋକ୍ଲୋରାଇଡ୍ 4 ପ୍ରତିଶତ ଜି @8 କିଲୋଗ୍ରାମ/ଏକର କିମ୍ବା କ୍ଲୋରାଣ୍ଟ୍ରାନିଲିପ୍ରୋଲ 0.4 ପ୍ରତିଶତ ଜିଆର @4 କିଲୋଗ୍ରାମ/ଏକର କିମ୍ବା କ୍ଲୋରାଣ୍ଟ୍ରାନିଲିପ୍ରୋଲ 18.5 ଏସସି% @12gm ଏକର କିମ୍ବା ଇମିଡାକ୍ଲୋପ୍ରିଡ୍ 0.3 ପ୍ରତିଶତ ଜିଆର @6 କିଲୋଗ୍ରାମ/ଏକର ବାଲିରେ ମିଶ୍ରଣ କରି ପ୍ରଯ଼ୋଗ କରନ୍ତୁ। 1 ଅନୁପାତ। ଏହା ପରିବର୍ତ୍ତେ କ୍ଲୋରାଣ୍ଟ୍ରାନିଲିପ୍ରୋଲେ 18.5% SC @60 ମିଲି/ଏକର ପ୍ରଯ଼ୋଗ କରନ୍ତୁ। ଅଧିକ ଆର୍ଦ୍ରତା ଏବଂ ଅଧିକ ବର୍ଷା ଲିଫ୍ ଫୋଲ୍ଡର୍ ଏବଂ କେସ୍ୱର୍ମ୍ କୀଟକୁ ପସନ୍ଦ କରେ | ଲିଫ୍ ଫୋଲ୍ଡର୍ ଏବଂ କେସ୍ୱର୍ମ୍ କୀଟକୁ ନିଯ଼ନ୍ତ୍ରଣ କରିବା ପାଇଁ ଜୈବିକ ଦୃଷ୍ଟିରୁ ଏକର ପିଛା 2 ନମ୍ବର ଟ୍ରାଇକୋଗ୍ରାମ୍ମା ଚିଲୋନିସ୍ କାର୍ଡ ଲଗାନ୍ତୁ। କ୍ଷେତରେ, କ୍ଷେତର ଉଭଯ଼ ପାର୍ଶ୍ୱକୁ ବିସ୍ତାର କରି ଧାନ ଫସଲ ଉପରେ ଏକ ସୂତା ଘୁଞ୍ଚାନ୍ତୁ। ଏହି ପଦ୍ଧତି ଦ୍ୱାରା କୀଟପତଙ୍ଗର ଲାର୍ଭା ପାଣିରେ ପଡ଼ି ମରିଯାଏ। ଧାନ ସ୍ପ୍ରେରେ ଲିଫ୍ ଫୋଲ୍ଡର୍ ଏବଂ କେସ୍ ୱର୍ମ୍ କୀଟପତଙ୍ଗ ପରିଚାଳନା ପାଇଁ ଫିପ୍ରୋନିଲ୍ 5 ପ୍ରତିଶତ ଏସ୍ସି @400-ମିଲି/ଏକର କିମ୍ବା ପ୍ରୋଫେନୋଫସ୍ 50 ପ୍ରତିଶତ ଇସି @400-ମିଲି/ଏକର କିମ୍ବା କ୍ଲୋରାଣ୍ଟ୍ରାନିଲିପ୍ରୋଲ୍ 18.5% ଏସ୍ସି @60-ମିଲି/ଏକର।"
         ]
      },
      "cotton": {
         "advisory": [
            "ଏହି ଫସଲ ବର୍ଗାକାରରୁ ବୋଲ୍ ଗଠନ ପର୍ଯ୍ଯ଼ାଯ଼ରେ ରହିଛି। ବର୍ତ୍ତମାନ କପାରେ ଶୋଷକ କୀଟପତଙ୍ଗର ସଂକ୍ରମଣ ପାଇଁ ତାପମାତ୍ରା ଏବଂ ଆର୍ଦ୍ର ପରିସ୍ଥିତି ଅନୁକୂଳ | ଯଦି ଶୀଘ୍ର ବୁଣାଯାଇଥିବା କପା ଫସଲରେ ଏଫିଡ୍ ଏବଂ ଜ୍ଯାସିଡ୍ସର ସଂକ୍ରମଣ ହୁଏ, ତେବେ ଏସିଟାମିପ୍ରିଡ୍ 20 ପ୍ରତିଶତ ଏସ. ପି. 20 ଗ୍ରାମ/ଏକର କିମ୍ବା ନିମ-ଆଧାରିତ କୀଟନାଶକ ନିମ୍ବ ତେଲ 1500 ପିପିଏମ <ଆଇ. ଡି. 1>-ମିଲି/ଏକରକୁ 200 ଲିଟର ପାଣିରେ ମିଶାଇ ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "maize": {
         "advisory": [
            "ମକା ଫସଲ ଅମଳ ପର୍ଯ୍ଯ଼ାଯ଼ରେ ପରିପକ୍ୱ ହୋଇଥାଏ। ପରିପକ୍ୱ କୋବ୍କୁ ଅମଳ କରନ୍ତୁ ଏବଂ ସୂର୍ଯ୍ଯ଼କିରଣ ତଳେ 4ରୁ 5 ଦିନ ପର୍ଯ୍ଯ଼ନ୍ତ ଶୁଖାନ୍ତୁ।"
         ]
      },
      "pigeon pea": {
         "advisory": [
            "ଏହି ଫସଲ ଫୁଲର ଆରମ୍ଭ (ପନ୍ଦରରୁ ଷୋହଳ ସପ୍ତାହ) ପର୍ଯ୍ଯ଼ାଯ଼ରେ ବିଶାଳ ବନସ୍ପତି ବୃଦ୍ଧିରେ ଅଛି | ଏହି ପର୍ଯ୍ଯ଼ାଯ଼ରେ ଲିଫ୍ ୱେବର୍ ସଂକ୍ରମଣ ହୋଇପାରେ | ଅରହରରେ ପତ୍ର ୱେବରକୁ ନିଯ଼ନ୍ତ୍ରଣ କରିବା ପାଇଁ 400 ମିଲି କ୍ଲୋରୋପାଇରିଫସ୍ 50 ପ୍ରତିଶତ + ସାଇପର୍ମେଥ୍ରିନ୍ 5 ପ୍ରତିଶତ ଇସି କିମ୍ବା 400 ମିଲି ପ୍ରୋଫେନୋଫସ୍ 50 ପ୍ରତିଶତ ଇସି ସହିତ ଏକର ଫସଲ କ୍ଷେତ୍ର ପିଛା 200 ଲିଟର ପାଣି ମିଶାଇ ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "groundnut": {
         "advisory": [
            "ଫସଲ ଅମଳ ହେବା ପର୍ଯ୍ୟନ୍ତ ପରିପକ୍ୱତା ପର୍ଯ୍ୟାୟରେ ରହିଛି। ପରିପକ୍ୱ ଶୁଣ୍ଢଗୁଡ଼ିକୁ ଅମଳ କରନ୍ତୁ ଏବଂ 3ରୁ 4 ଦିନ ପାଇଁ ସୂର୍ଯ୍ୟକିରଣ ତଳେ ଶୁଖାନ୍ତୁ।"
         ]
      },
      "finger millet": {
         "advisory": [
            "ରାଗି ଫସଲ ପରିପକ୍ୱତା ପର୍ଯ୍ୟାୟରେ (ପନ୍ଦରରୁ ଷୋହଳ ସପ୍ତାହ) ଅଛି |"
         ]
      },
      "mustard": {
         "advisory": [
            "ଅକ୍ଟୋବର ମଧ୍ୟଭାଗରୁ ନଭେମ୍ବର ମଧ୍ୟଭାଗ ପର୍ଯ୍ୟନ୍ତ ବୁଣିବା ପାଇଁ ଉପଯୁକ୍ତ ସମୟ। ବୀଜ ବୁଣିବା ପୂର୍ବରୁ ଥିରମ୍ @2.5g/kg କିମ୍ବା ବାଭିଷ୍ଟିନ୍ @2 ଗ୍ରାମ୍/କେଜି ମଞ୍ଜି ବ୍ୟବହାର କରନ୍ତୁ। ସୋରିଷ ପାଇଁ 2.5-3 କି. ଗ୍ରା./ଏକର ଏବଂ ତୋରିଆ ପାଇଁ <ଆଇ. ଡି. 1> କି. ଗ୍ରା./ଏକରର ମୂଲ୍ୟ ରହିଛି। ଉପଯୁକ୍ତ କିସମଃ ସୋରିଷ-ପୁସା ବୋଲ୍ଡ, ପୁସା ଜୟକିସାନ, ଜେଡି-6। ତୋରିଆ-ସୁଶ୍ରୀ, ଏମ୍. 29, ଅନୁରାଧା, ପାର୍ବତୀ।"
         ]
      },
      "brinjal": {
         "advisory": [
            "ବାଇଗଣରେ ଫୋମୋପ୍ସିସ୍ ବ୍ଲାଇଟ୍ ରୋଗକୁ ନିଯ଼ନ୍ତ୍ରଣ କରିବା ପାଇଁ ମେଟାଲାକ୍ସିଲ୍ 8 ପ୍ରତିଶତ + ମାନକୋଜେବ୍ 64 ପ୍ରତିଶତ ଡବ୍ଲ୍ଯ଼ୁ. ପି. @400 ଗ୍ରାମ/ଏକର କିମ୍ବା ପ୍ରୋପିନେବ୍ 70 ପ୍ରତିଶତ ଡବ୍ଲ୍ଯ଼ୁ. ପି. @400 ଗ୍ରାମ/ଏକର ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "tomato": {
         "advisory": [
            "ଟମାଟୋ ପାଇଁ 20 କିଲୋଗ୍ରାମ ଯ଼ୁରିଆ, 52 କିଲୋଗ୍ରାମ ଡିଏପି ଏବଂ 20 କିଲୋଗ୍ରାମ ଏମଓପି ମୂଳ ସାର ଭାବରେ ପ୍ରଯ଼ୋଗ କରନ୍ତୁ ଏବଂ ଧାଡ଼ି ଠାରୁ ଧାଡ଼ି ମଧ୍ଯ଼ରେ 60 ସେ. ମି. ଏବଂ ଗଛ ଠାରୁ ଗଛ ମଧ୍ଯ଼ରେ 45 ସେ. ମି. ବ୍ଯ଼ବଧାନ ବଜାଯ଼ ରଖନ୍ତୁ।"
         ]
      },
      "cauliflower": {
         "advisory": [
            "ଏକର ପିଛା 33 କି. ଗ୍ରା. ୟୁରିଆ ଏବଂ 23 କି. ଗ୍ରା. ଏମ୍. ଓ. ପି. ପ୍ରୟୋଗ କରନ୍ତୁ ଏବଂ ହାତ କାଟିବା ପାଇଁ <ଆଇ. ଡି. 1> ଡି. ଏ. ଟି. ଏବଂ 33 କି. ଗ୍ରା. ୟୁରିଆ ଏବଂ 23 କି. ଗ୍ରା. ଏମ୍. ଓ. ପି. ଏକର ପିଛା ଶେଷ ଟପ୍-ଡ୍ରେସିଂ ସାର ଭାବେ <ଆଇ. ଡି. 2> ଡି. ଏ. ଟି. ପ୍ରୟୋଗ କରନ୍ତୁ। ଯଦି ଚାରା ରୋପଣ ସମୟରେ ବୋରାକ୍ସ ପ୍ରୟୋଗ କରାଯାଇନଥାଏ, ତେବେ ବୋରାକ୍ସ ସ୍ପ୍ରେ 4 କି. ଗ୍ରା./ଏକର କିମ୍ବା ଫୋଲିବୋର/ସଲ୍ୟୁବର ସ୍ପ୍ରେ 1.5 ଗ୍ରାମ/ଲିଟର କରନ୍ତୁ। ପ୍ରତିରୋପଣର ଦୁଇ ସପ୍ତାହ ପରେ ଏବଂ ଦହି ତିଆରି ହେବାର ଦୁଇ ସପ୍ତାହ ପୂର୍ବରୁ ବୋରନ ମାଇକ୍ରୋ ନ୍ୟୁଟ୍ରିଏଣ୍ଟ ସିଞ୍ଚନ କରାଯିବା ଉଚିତ।"
         ]
      }
   },
   "date": "29-10-2024"
}