{
   "weather_details": {
      "29-11-2024": {
         "rainfall": 0,
         "t_max": 28,
         "t_min": 17,
         "rh_max": 82,
         "rh_min": 45,
         "wind_speed": 8,
         "wind_direction": 36,
         "cloud_cover": 5
      },
      "30-11-2024": {
         "rainfall": 0,
         "t_max": 27,
         "t_min": 17,
         "rh_max": 87,
         "rh_min": 55,
         "wind_speed": 8,
         "wind_direction": 36,
         "cloud_cover": 4
      },
      "01-12-2024": {
         "rainfall": 0,
         "t_max": 27,
         "t_min": 16,
         "rh_max": 88,
         "rh_min": 60,
         "wind_speed": 7,
         "wind_direction": 47,
         "cloud_cover": 5
      },
      "02-12-2024": {
         "rainfall": 0,
         "t_max": 28,
         "t_min": 16,
         "rh_max": 87,
         "rh_min": 61,
         "wind_speed": 6,
         "wind_direction": 52,
         "cloud_cover": 5
      },
      "03-12-2024": {
         "rainfall": 0,
         "t_max": 28,
         "t_min": 15,
         "rh_max": 87,
         "rh_min": 56,
         "wind_speed": 5,
         "wind_direction": 48,
         "cloud_cover": 4
      }
   },
   "names_of_crops": [
      "ଚାଉଳ",
      "ସବୁଜ ଚଣା",
      "କଳା ଚଣା",
      "ସୋରିଷ",
      "ମାଟି ବାଦାମ",
      "କୋଲେ ଫସଲ"
   ],
   "general_advisory": "ଆଗାମୀ ଦିନରେ ପାଗ ମେଘୁଆ ରହିବ ବୋଲି ଆଶା କରାଯାଉଛି, ତେଣୁ ଅମଳ ହୋଇଥିବା ଉତ୍ପାଦକୁ ସୁରକ୍ଷିତ ସ୍ଥାନରେ ରଖିବା ପାଇଁ ସତର୍କତାମୂଳକ ପଦକ୍ଷେପ ନେବାକୁ କୃଷକମାନଙ୍କୁ ପରାମର୍ଶ ଦିଆଯାଇଛି। ବର୍ତ୍ତମାନର ପାଣିପାଗ ପରିସ୍ଥିତି କାରଣରୁ ଉଭୟ କ୍ଷେତ ଏବଂ ପନିପରିବା ଫସଲରେ ବିଭିନ୍ନ ରୋଗ ସଂକ୍ରମଣ ବୃଦ୍ଧି ହେବାର ସମ୍ଭାବନା ରହିଛି, ତେଣୁ ଏହି ରୋଗଗୁଡ଼ିକ ଉପରେ ନିୟମିତ ନଜର ରଖିବା ପାଇଁ ପରାମର୍ଶ ଦିଆଯିବା ଉଚିତ। କୃଷକମାନଙ୍କୁ ରବି ଫସଲ ଯଥା ସୋରିଷ, ବୁଟ, ଚିନାବାଦାମ, ସବୁଜ ଗହମ/କଳା ଗହମ ଇତ୍ୟାଦି ବୁଣିବା ସମ୍ପୂର୍ଣ୍ଣ କରିବାକୁ ଏବଂ ଜଳସେଚନ ସୁବିଧା ଉପଲବ୍ଧ ଥିବା ରବି ଧାନର ନର୍ସରୀ ବୁଣିବା ପାଇଁ ଜମି ପ୍ରସ୍ତୁତି ଆରମ୍ଭ କରିବାକୁ ପରାମର୍ଶ ଦିଆଯାଇଛି। ରୋଗ ପ୍ରତିରୋଧକ ଶକ୍ତି ବୃଦ୍ଧି କରିବା ଏବଂ କୌଣସି କ୍ଷତିକାରକ ରୋଗରୁ ରକ୍ଷା କରିବା ପାଇଁ ପଶୁମାନଙ୍କୁ କୃମି ଦୂରୀକରଣ ଏବଂ ଟୀକାକରଣ ପାଇଁ ପରାମର୍ଶ ଦିଆଯିବା ଉଚିତ।",
   "crops_data": {
      "rice": {
         "advisory": [
            "ଯଦି ଧାନ ପରିପକ୍ୱତା ପର୍ଯ୍ୟାୟରେ ଅଛି, ଅମଳ ପୂର୍ବରୁ କ୍ଷେତରେ ଜଳସେଚନ ବନ୍ଦ କରନ୍ତୁ | ଯେତେବେଳେ 80-85% ଶସ୍ୟ ପରିପକ୍ୱ ହୋଇଯାଏ ଏବଂ ଗଛ ଫିକା ହଳଦିଆ ରଙ୍ଗର ଦେଖାଯାଏ, ସେତେବେଳେ ଗଛଗୁଡ଼ିକୁ ଅମଳ କରନ୍ତୁ। ଅମଳ ପରେ, ଧାନକୁ 2ରୁ 3 ଦିନ ପାଇଁ କ୍ଷେତରେ ଶୁଖାଇବା ଉଚିତ ଏବଂ ତା 'ପରେ ଅମଳ କରାଯିବା ଉଚିତ। ଚାଉଳ 12 ପ୍ରତିଶତ ଆର୍ଦ୍ରତା ସ୍ତରରେ ସୁରକ୍ଷିତ ସ୍ଥାନରେ ରଖିବା ଉଚିତ। ନିମ୍ନ ରାତ୍ରି ତାପମାତ୍ରା ଏବଂ ଉଚ୍ଚ ଆର୍ଦ୍ରତା ହେତୁ, ବିଳମ୍ବରେ ପରିପକ୍ୱ ହେଉଥିବା ଧାନ କିସମଗୁଡ଼ିକରେ ମିଥ୍ୟା ରୋଗ ସଂକ୍ରମଣ ହେବାର ସମ୍ଭାବନା ଥାଇପାରେ, ତେଣୁ ଏହାର ନିୟମିତ ତଦାରଖ ପାଇଁ ପରାମର୍ଶ ଦିଆଯିବା ଉଚିତ। ଯଦି ସଂକ୍ରମଣ ପରିଲକ୍ଷିତ ହୁଏ, ତେବେ କପର୍ ହାଇଡ୍ରୋକ୍ସାଇଡ୍ 77 ପ୍ରତିଶତ @2 ଗ୍ରାମ୍/ଲିଟର କିମ୍ବା ଟେବୁକୋନାଜୋଲ୍ 25 ପ୍ରତିଶତ @2 ଗ୍ରାମ୍/ଲିଟର ସିଞ୍ଚନ କରିବାକୁ ପରାମର୍ଶ ଦିଆଯିବା ଉଚିତ।"
         ]
      },
      "green gram": {
         "advisory": [
            "ବୁଣିବାର ଏକ ସପ୍ତାହ ପୂର୍ବରୁ, ପ୍ରତି କିଲୋଗ୍ରାମ ମଞ୍ଜି ପିଛା କାର୍ବେନଡାଜିମ୍ @1.5-2.0g ଏବଂ ଇମିଡାକ୍ଲୋପ୍ରିଡ୍ @5 ଗ୍ରାମ୍ ସହିତ ମଞ୍ଜି ଚିକିତ୍ସା କରାଯିବା ଉଚିତ। ଏହି ଚିକିତ୍ସାର ସାତ ଦିନ ପରେ, 200 ଗ୍ରାମ୍ ରିଜୋବିୟମ୍ କଲ୍ଚର ଏବଂ 3-4 ଗ୍ରାମ୍ ସୋଡ଼ିଅମ୍ ମଲିବଡେଟ୍ 10 କି. ଗ୍ରା. ମଞ୍ଜି ସହିତ 400 ମିଲି. ପାଣିରେ ମିଶାଇ ଭଲ ଭାବେ ମିଶାଇ ଛାୟାରେ ଅଧା ଘଣ୍ଟା ଶୁଖାନ୍ତୁ, ତା 'ପରେ କ୍ଷେତରେ ବୁଣିବା ପାଇଁ ଯାଆନ୍ତୁ। 30 ସେ. ମି. x 10 ସେ. ମି. ବ୍ୟବଧାନ ସହିତ 8-10 କି. ଗ୍ରା./ଏସି. ର ବୀଜ ହାର ସହିତ ବୀଜ ବୁଣିବା ଉଚିତ। ପ୍ରକାରଃ ସବୁଜ ଗ୍ରାମଃ-କାମଦେବ, ଦୁର୍ଗା, ଆଇ. ପି. ଏମ୍. 02-3, ଆଇ. ପି. ଏମ୍. 02-14, ଟି. ଏ. ଆର୍. ଏମ୍. 1।"
         ]
      },
      "black gram": {
         "advisory": [
            "ଘନ ରୋପଣ କ୍ଷେତ୍ରରେ ସୋରିଷରେ ସର୍ବୋତ୍ତମ ଉଦ୍ଭିଦ ସଂଖ୍ୟାକୁ ବଜାୟ ରଖିବା ପାଇଁ ଗୋଟିଏ ପତଳା ଅପରେସନ ପରାମର୍ଶ ଦିଆଯିବା ଉଚିତ | 15 ରୁ 20 ଦିନ ପୁରୁଣା ଫସଲ କ୍ଷେତ୍ରରେ ହୋଇଂ ଏବଂ ଆଗାଛା ସଫା କରିବା ପାଇଁ ପରାମର୍ଶ ଦିଆଯାଇଛି।"
         ]
      },
      "mustard": {
         "advisory": [
            "ଯେଉଁ କୃଷକମାନେ ଏପର୍ଯ୍ୟନ୍ତ ମଞ୍ଜି ବୁଣିନାହାନ୍ତି, ସେମାନେ ଉନ୍ନତ ଚିନାବାଦାମ କିସମ ଯଥା ଟିଏଜି-24, ଜେଏଲ-24, ଗିରନାର-3, ସ୍ମୃତି, ଟିଜି-3, ଟିଜି-22, କାଦ୍ରି-5, କାଦ୍ରି-6, କାଦ୍ରି-9, ଟିପିଜି-41, ଜିପିବିଡି-4, ଦେବୀ, ସିଓ-7, ଧରଣୀ ଏବଂ ଦିବ୍ୟା ଇତ୍ୟାଦି ବ୍ୟବହାର କରିପାରିବେ। ଏହି ସମସ୍ତ କିସମ 100 ରୁ 130 ଦିନ ମଧ୍ୟରେ ଅମଳ କରାଯାଏ |"
         ]
      },
      "ground nut": {
         "advisory": [
            "ରୋପଣ ସମୟରେ, ପଲିଥିନ୍ ମଲ୍ଚିଙ୍ଗ୍ ସାମଗ୍ରୀ ଭାବରେ ବ୍ୟବହୃତ ହୋଇପାରେ କିମ୍ବା ଯଦି ପୂର୍ବରୁ କରାଯାଇଥିବା ନଡ଼ିଆ ରୋପଣ ଆର୍ଦ୍ରତା ତଥା ମୃତ୍ତିକା ତାପମାତ୍ରା ପନିପରିବା ଫସଲ ବଜାୟ ରଖିବା ପାଇଁ ସମାନ ଉଦ୍ଦେଶ୍ୟରେ ବ୍ୟବହୃତ ହୋଇପାରେ | ଫୁଲକୋବିରେ ଡାଇମଣ୍ଡ ବ୍ୟାକ୍ ମଥ୍ର ଆକ୍ରମଣ ବିରୁଦ୍ଧରେ ନିୟମିତ ତଦାରଖ କରିବାକୁ ପରାମର୍ଶ ଦିଆଯିବା ଉଚିତ ଏବଂ ଯଦି ସମ୍ଭବ, କୃଷକମାନେ ଏହି ଉଦ୍ଦେଶ୍ୟରେ କ୍ଷେତରେ ଏକ ଫେରୋମୋନ୍ ଟ୍ରାପ୍ ବ୍ୟବହାର କରିବା ଉଚିତ୍ |"
         ]
      },
      "cole crop": {
         "advisory": [
            "ଶୀତ ଋତୁରେ ପଶୁମାନଙ୍କୁ ଥଣ୍ଡାରୁ ରକ୍ଷା କରିବା ପାଇଁ କୃଷକମାନେ ଉପଯୁକ୍ତ ବ୍ୟବସ୍ଥା କରିବା ଉଚିତ ଏବଂ ପଶୁମାନଙ୍କୁ ସ୍ୱଚ୍ଛ ପାନୀୟ ଜଳ ଯୋଗାଇବା ଏବଂ ସେମାନଙ୍କ ଘର ସଫା ରଖିବା ଉଚିତ। ଛପର ଚାରିପାଖରେ ପରିସ୍ରା କିମ୍ବା ମଳମୂତ୍ର ଜମା ହେବାକୁ ଦିଅନ୍ତୁ ନାହିଁ ଯାହା ମାଛି ସୃଷ୍ଟି କରିପାରେ | ବିଭିନ୍ନ କ୍ଷତିକାରକ ରୋଗ ଏବଂ ପାକସ୍ଥଳୀ କୃମିକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ ଟୀକାକରଣ ଏବଂ କୃମି ଦୂରୀକରଣ କରାଯିବା ଉଚିତ। ଜଣେ ଯୋଗ୍ୟ ପଶୁ ଚିକିତ୍ସକଙ୍କ ସହିତ ଆଣ୍ଟିବାୟୋଟିକ ଚିକିତ୍ସା ଏବଂ ପରାମର୍ଶ କରାଯିବା ଉଚିତ୍।"
         ]
      }
   },
   "date": "29-11-2024"
}