{
   "weather_details": {
      "29.10.2024": {
         "rainfall": 0,
         "t_max": 32,
         "t_min": 23,
         "rh_max": 89,
         "rh_min": 70,
         "wind_speed": 5,
         "wind_direction": 120,
         "cloud_cover": 3
      }
   },
   "names_of_crops": [
      "ଚିନାବାଦାମ",
      "ସୋରିଷ",
      "ଆଖୁ",
      "ବାଇଗଣ",
      "ଟମାଟୋ",
      "ଆଳୁ",
      "ପଶୁପାଳନ",
      "ମତ୍ସ୍ଯ଼ଚାଷ"
   ],
   "general_advisory": "ବୁଲେଟିନ୍ ରେ ଉଲ୍ଲିଖିତ ବିଭିନ୍ନ ଫସଲ ପାଇଁ ବୁଣିବା ପୂର୍ବରୁ ଏବଂ ପକେଇବା ପର୍ଯ୍ୟାୟ ନିର୍ଦ୍ଦେଶାବଳୀ ଅନୁସରଣ କରିବାକୁ କୃଷକମାନଙ୍କୁ ପରାମର୍ଶ ଦିଆଯାଇଛି। ଚାଷ କରାଯାଉଥିବା ପଶୁମାନଙ୍କର ଟୀକାକରଣ ଏବଂ କୃମି ନିବାରଣ କରାଯିବା ଉଚିତ। ପ୍ରବଳ ବର୍ଷା ପରେ ମତ୍ସ୍ୟପାଳନରେ ଥିବା ଜଳାଶୟଗୁଡ଼ିକୁ ବିଶୋଧନ କରନ୍ତୁ।",
   "crops_data": {
      "groundnut": {
         "advisory": [
            "ମଞ୍ଜିଗୁଡ଼ିକୁ କାର୍ବେନଡାଜିମ୍ 50 ପ୍ରତିଶତ ଡବ୍ଲ୍ୟୁ. ପି. @2 ଗ୍ରାମ୍/କି. ଗ୍ରା. ମଞ୍ଜି କିମ୍ବା କାର୍ବୋକ୍ସିନ୍ <ଆଇ. ଡି. 1> + ଥିରମ୍ <ଆଇ. ଡି. 1> ଡି. ଏସ୍. @3 ଗ୍ରାମ୍/କି. ଗ୍ରା. ମଞ୍ଜି ଦେଇ ଉପଚାର କରନ୍ତୁ। ଏହାର 7 ଦିନ ପରେ, ପ୍ରତି କିଲୋଗ୍ରାମ ମଞ୍ଜି ପିଛା ରାଇଜୋବିୟମ୍ ସଂସ୍କୃତି @20g ସହିତ ମଞ୍ଜିଗୁଡ଼ିକୁ ଚିକିତ୍ସା କରନ୍ତୁ।"
         ]
      },
      "mustard": {
         "advisory": [
            "ଅନୁରାଧା, ପାର୍ବତୀ, ସୁଶ୍ରୀ, ଉତ୍ତରା ପରି ସ୍ୱଳ୍ପ ଅବଧି ସୋରିଷ କିସମର ବୁଣିବା ପାଇଁ ଯାଆନ୍ତୁ ଯାହା ମାଟିର ଆର୍ଦ୍ରତା ଅବସ୍ଥାକୁ ନିରୀକ୍ଷଣ କରି ଅକ୍ଟୋବର ମାସରେ 85 ଦିନ ମଧ୍ଯ଼ରେ ଜଳସେଚିତ ଅବସ୍ଥାରେ ପରିପକ୍ୱ ହୁଏ |",
            "ଯଦି ସୁନିଶ୍ଚିତ ଜଳସେଚନ ଅଛି, ତେବେ ପୁସା ସୋରିଷ-25 ଏବଂ 26 ଏବଂ ଆରଜି ଏନ-236 ଇତ୍ଯ଼ାଦି ଦୀର୍ଘକାଳୀନ କିସମର ବୁଣିବା ପାଇଁ ଯାଆନ୍ତୁ ଯାହା 125 ଦିନ ମଧ୍ଯ଼ରେ ପରିପକ୍ୱ ହୁଏ |"
         ]
      },
      "sugarcane": {
         "advisory": [
            "କାର୍ବେନଡାଜିମ୍ 12 ପ୍ରତିଶତ + ମାନକୋଜେବ୍ 63 ପ୍ରତିଶତ ଡବ୍ଲ୍ଯ଼ୁ. ପି. @400-ଗ୍ରାମ୍/ଏକର କିମ୍ବା ମେଟାଲାକ୍ସିଲ୍ 8 ପ୍ରତିଶତ + ମାନକୋଜେବ୍ 64 ପ୍ରତିଶତ @400-ଗ୍ରାମ୍/ଏକରକୁ 200 ଲିଟର ପାଣିରେ ମିଶାଇ ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "brinjal": {
         "advisory": [
            "ବାଇଗଣ ଏବଂ ଟମାଟୋରେ ୱିଲ୍ଟ ଏବଂ ରଟ୍ ରୋଗକୁ ପରିଚାଳନା କରିବା ପାଇଁ, 10 ଗ୍ରାମ୍ ପ୍ଲାଣ୍ଟୋମାଇସିନ୍ ଏବଂ 20 ଗ୍ରାମ୍ (ମେଟାଲାକ୍ସିଲ୍ 8 ପ୍ରତିଶତ + ମାନକୋଜେବ୍ 64 ପ୍ରତିଶତ ଡବ୍ଲ୍ଯ଼ୁ. ପି.) କିମ୍ବା 10 ମିଲି ଟେବୁକୋନାଜୋଲ୍ 10 ଲିଟର ପାଣିରେ ମିଶାଇ ମୂଳ ଅଞ୍ଚଳକୁ ଭିଜାଇ ଦିଅନ୍ତୁ |"
         ]
      },
      "tomato": {
         "advisory": [
            "ବାଇଗଣ ଏବଂ ଟମାଟୋରେ ୱିଲ୍ଟ ଏବଂ ରଟ୍ ରୋଗକୁ ପରିଚାଳନା କରିବା ପାଇଁ, 10 ଗ୍ରାମ୍ ପ୍ଲାଣ୍ଟୋମାଇସିନ୍ ଏବଂ 20 ଗ୍ରାମ୍ (ମେଟାଲାକ୍ସିଲ୍ 8 ପ୍ରତିଶତ + ମାନକୋଜେବ୍ 64 ପ୍ରତିଶତ ଡବ୍ଲ୍ଯ଼ୁ. ପି.) କିମ୍ବା 10 ମିଲି ଟେବୁକୋନାଜୋଲ୍ 10 ଲିଟର ପାଣିରେ ମିଶାଇ ମୂଳ ଅଞ୍ଚଳକୁ ଭିଜାଇ ଦିଅନ୍ତୁ |"
         ]
      },
      "potato": {
         "advisory": [
            "ଚାରା ଲଗାଇବା ପୂର୍ବରୁ ମଞ୍ଜି ଗୁଡ଼ିକୁ ଚିକିତ୍ସା କରନ୍ତୁ। କନ୍ଦ ମଞ୍ଜି ଚିକିତ୍ସା ପାଇଁ ପ୍ରଥମେ 100 ଲିଟର ପାଣିରେ 600 ଗ୍ରାମ କାର୍ବେନଡାଜିମ୍ 25 ପ୍ରତିଶତ + ମାନକୋଜେବ୍ 50 ପ୍ରତିଶତ ୱାସ୍ ମିଶାଇ ଏକ ଦ୍ରବଣ ପ୍ରସ୍ତୁତ କରନ୍ତୁ। ଏହି ଦ୍ରବଣରେ ଏକ କ୍ୱିଣ୍ଟାଲ୍ କନ୍ଦ ମଞ୍ଜି 20-25 ମିନିଟ୍ ପାଇଁ ବୁଡ଼ାଇ ଦିଅନ୍ତୁ। ଏହି ଦ୍ରବଣରୁ କନ୍ଦ ମଞ୍ଜି ବାହାର କରି ଦିଅନ୍ତୁ ଏବଂ ରୋପଣ ପୂର୍ବରୁ 2ରୁ 4 ଘଣ୍ଟା ଶୁଖାଇବା ପାଇଁ ସେଡରେ ରଖନ୍ତୁ।"
         ]
      },
      "animal husbandry": {
         "advisory": [
            "ଚାଷ କରାଯାଉଥିବା ପଶୁମାନଙ୍କର ଟୀକାକରଣ ଏବଂ କୃମି ଦୂରୀକରଣ କରାଯିବା ଉଚିତ।"
         ]
      },
      "fishery": {
         "advisory": [
            "ପ୍ରବଳ ବର୍ଷା ଫଳରେ ପୋଖରୀରେ ଥିବା ଜଳର ଲବଣାକ୍ତତା ହ୍ରାସ ପାଇପାରେ। ବର୍ଷା ବନ୍ଦ ହେବା ପରେ ଆଲ୍କି-ଡାଇମିଥାଇଲ-ବେଞ୍ଜାଇଲ ଆମୋନିଯ଼ମ କ୍ଲୋରାଇଡ (3 ପିପିଏମ) କୁ କୀଟାଣୁନାଶକ ଭାବରେ ପ୍ରଯ଼ୋଗ କରିବାକୁ କୃଷକମାନଙ୍କୁ ପରାମର୍ଶ ଦିଆଯାଇଛି।"
         ]
      }
   },
   "date": "29-10-2024"
}