{
   "weather_details": {
      "29.11.2024": {
         "rainfall": 0,
         "t_max": 26,
         "t_min": 16,
         "rh_max": 92,
         "rh_min": 65,
         "wind_speed": 10,
         "wind_direction": 180,
         "cloud_cover": 5
      }
   },
   "names_of_crops": [
      "ସୋରିଷ",
      "ସୁଚିନ୍ତିତ ଲାଉ",
      "ଲଙ୍କା",
      "ଆଳୁ ଓ ଫୁଲକୋବି",
      "ପଶୁପାଳନ",
      "ମତ୍ସ୍ୟଚାଷ",
      "କୁକୁଡ଼ା ମାଂସ"
   ],
   "general_advisory": "ବର୍ତ୍ତମାନର ପାଣିପାଗ ପରିସ୍ଥିତିରେ ଉଲ୍ଲିଖିତ ଫସଲ ପାଇଁ ଆବଶ୍ୟକ ସତର୍କତା ଅବଲମ୍ବନ କରିବାକୁ କୃଷକମାନଙ୍କୁ ପରାମର୍ଶ ଦିଆଯାଇଛି। ଶୀତ ଋତୁ ପାଇଁ ପଶୁପାଳନ, ମତ୍ସ୍ୟଚାଷ ଏବଂ କୁକୁଡ଼ା ପାଳନ ସମ୍ବନ୍ଧୀୟ ପରାମର୍ଶ ମଧ୍ୟ ପ୍ରଦାନ କରାଯାଇଥାଏ।",
   "crops_data": {
      "mustard": {
         "advisory": [
            "ନିମ୍ନ ତାପମାତ୍ରା ସ୍ଥିତିରେ, ଏଫିଡ୍ ସଂକ୍ରମଣ ପାଇଁ ନିରୀକ୍ଷଣ କରନ୍ତୁ ଏବଂ ଉପଯୁକ୍ତ ପଦକ୍ଷେପ ନିଅନ୍ତୁ |"
         ]
      },
      "pointed gourd": {
         "advisory": [
            "ଡାଉନି ଫଙ୍ଗୁକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ, ଉଲ୍ଲିଖିତ ସାନ୍ଦ୍ରତାରେ ସୁପାରିଶ କରାଯାଇଥିବା ଫଙ୍ଗିସାଇଡ୍ ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "chilli": {
         "advisory": [
            "ଏଫିଡ୍ ଏବଂ ଥ୍ରିପ୍ସ ସଂକ୍ରମଣ ଉପରେ ନଜର ରଖନ୍ତୁ, ଏବଂ ନିୟନ୍ତ୍ରଣ ପାଇଁ ନିମ-ଆଧାରିତ କୀଟନାଶକ ବ୍ୟବହାର କରନ୍ତୁ।",
            "ପରିଚାଳନା ପାଇଁ ଥାୟାମେଥୋକ୍ସାମ୍ କିମ୍ବା ଏସିଟାମିପ୍ରିଡ୍ ପରି ରାସାୟନିକ ସ୍ପ୍ରେ ବ୍ୟବହାର କରାଯାଇପାରିବ |"
         ]
      },
      "cabbage & cauliflower": {
         "advisory": [
            "ହାଲୁକା ଜାଲ ଲଗାନ୍ତୁ ଏବଂ ଡାଇମଣ୍ଡ ବ୍ୟାକ୍ ମଥ କୀଟପତଙ୍ଗ ପାଇଁ ନିମ ଆଧାରିତ କୀଟନାଶକ ବ୍ୟବହାର କରନ୍ତୁ।",
            "କୀଟ ପରିଚାଳନା ପାଇଁ ସୁପାରିସ କରାଯାଇଥିବା ରାସାୟନିକ ସ୍ପ୍ରେ ମଧ୍ୟ ବ୍ୟବହାର କରାଯାଇପାରିବ।"
         ]
      },
      "livestock": {
         "advisory": [
            "ଥଣ୍ଡା ସମୟରେ, ପଶୁମାନଙ୍କର ଆରାମ ଏବଂ ସ୍ୱାସ୍ଥ୍ୟ ସୁନିଶ୍ଚିତ କରିବା ପାଇଁ ପଦକ୍ଷେପ ନିଅନ୍ତୁ।"
         ]
      },
      "fishery": {
         "advisory": [
            "ଜଳର ଗଭୀରତା ବଜାୟ ରଖନ୍ତୁ ଏବଂ ତାପମାତ୍ରା ପରିବର୍ତ୍ତନ ଅନୁଯାୟୀ ଖାଦ୍ୟ ହାରକୁ ନିୟନ୍ତ୍ରଣ କରନ୍ତୁ।",
            "ଶୀତଦିନେ ପୋଖରୀରେ ଜୈବିକ ସାର ମିଶାନ୍ତୁ ନାହିଁ।"
         ]
      },
      "poultry": {
         "advisory": [
            "ଶୀତଦିନେ କୁକୁଡ଼ା ପାଳିରେ ଉତ୍ତାପ ରକ୍ଷଣାବେକ୍ଷଣ ପାଇଁ ହିଟର୍ ଲଗାନ୍ତୁ ଏବଂ ବଲ୍ବ ବ୍ୟବହାର କରନ୍ତୁ।",
            "ଆବଶ୍ୟକ ଟିକା ଠିକ୍ ସମୟରେ ନିଆଯାଉ ବୋଲି ସୁନିଶ୍ଚିତ କରନ୍ତୁ।"
         ]
      }
   },
   "date": "29-11-2024"
}