{
   "weather_details": {
      "30-11-2024": {
         "rainfall": 0,
         "t_max": 28,
         "t_min": 12,
         "rh_max": 81,
         "rh_min": 43,
         "wind_speed": 13,
         "wind_direction": 43,
         "cloud_cover": 5
      },
      "01-12-2024": {
         "rainfall": 0,
         "t_max": 28,
         "t_min": 12,
         "rh_max": 83,
         "rh_min": 56,
         "wind_speed": 11,
         "wind_direction": 42,
         "cloud_cover": 4
      },
      "02-12-2024": {
         "rainfall": 1,
         "t_max": 29,
         "t_min": 11,
         "rh_max": 87,
         "rh_min": 61,
         "wind_speed": 10,
         "wind_direction": 49,
         "cloud_cover": 4
      },
      "03-12-2024": {
         "rainfall": 1,
         "t_max": 29,
         "t_min": 11,
         "rh_max": 85,
         "rh_min": 63,
         "wind_speed": 9,
         "wind_direction": 48,
         "cloud_cover": 5
      },
      "04-12-2024": {
         "rainfall": 0,
         "t_max": 28,
         "t_min": 11,
         "rh_max": 84,
         "rh_min": 61,
         "wind_speed": 7,
         "wind_direction": 45,
         "cloud_cover": 5
      }
   },
   "names_of_crops": [
      "ଚାଉଳ",
      "ସବୁଜ ଚଣା",
      "କଳା ଚଣା",
      "ସୋରିଷ",
      "ମାଟି ବାଦାମ",
      "କୋଲେ ଫସଲ"
   ],
   "general_advisory": "ଆଗାମୀ ଦିନରେ ପାଗ ମେଘୁଆ ରହିବ ବୋଲି ଆଶା କରାଯାଉଛି, ତେଣୁ ଅମଳ ହୋଇଥିବା ଉତ୍ପାଦକୁ ସୁରକ୍ଷିତ ସ୍ଥାନରେ ରଖିବା ପାଇଁ ସତର୍କତାମୂଳକ ପଦକ୍ଷେପ ନେବାକୁ କୃଷକମାନଙ୍କୁ ପରାମର୍ଶ ଦିଆଯାଇଛି। ବର୍ତ୍ତମାନର ପାଣିପାଗ ପରିସ୍ଥିତି କାରଣରୁ ଉଭୟ କ୍ଷେତ ଏବଂ ପନିପରିବା ଫସଲରେ ବିଭିନ୍ନ ରୋଗ ସଂକ୍ରମଣ ବୃଦ୍ଧି ହେବାର ସମ୍ଭାବନା ରହିଛି, ତେଣୁ ଏହି ରୋଗଗୁଡ଼ିକ ଉପରେ ନିୟମିତ ନଜର ରଖିବା ପାଇଁ ପରାମର୍ଶ ଦିଆଯିବା ଉଚିତ। କୃଷକମାନଙ୍କୁ ପରାମର୍ଶ ଦିଆଯାଇଛି ଯେ ସେମାନେ ସୋରିଷ, ଚଣା, ଚିନାବାଦାମ, ସବୁଜ ଚଣା/କଳା ଚଣା ଇତ୍ୟାଦି ରବି ଫସଲର ବୁଣିବା ସମ୍ପୂର୍ଣ୍ଣ କରନ୍ତୁ ଏବଂ ଜଳସେଚନ ସୁବିଧା ଉପଲବ୍ଧ ଥିବା ସ୍ଥାନରେ ରବି ଧାନର ନର୍ସରୀ ବୁଣିବା ପାଇଁ ଜମି ପ୍ରସ୍ତୁତି ଆରମ୍ଭ କରନ୍ତୁ। ରୋଗ ପ୍ରତିରୋଧକ ଶକ୍ତି ବୃଦ୍ଧି କରିବା ଏବଂ କୌଣସି କ୍ଷତିକାରକ ରୋଗରୁ ରକ୍ଷା କରିବା ପାଇଁ ପଶୁମାନଙ୍କୁ କୃମି ଦୂରୀକରଣ ଏବଂ ଟୀକାକରଣ ପାଇଁ ପରାମର୍ଶ ଦିଆଯିବା ଉଚିତ।",
   "crops_data": {
      "rice": {
         "advisory": [
            "ଯଦି ଧାନ ପରିପକ୍ୱତା ପର୍ଯ୍ୟାୟରେ ଅଛି, ଅମଳ ପୂର୍ବରୁ କ୍ଷେତରେ ଜଳସେଚନ ବନ୍ଦ କରନ୍ତୁ | ଯେତେବେଳେ 80-85% ଶସ୍ୟ ପରିପକ୍ୱ ହୋଇଯାଏ ଏବଂ ଗଛ ଫିକା ହଳଦିଆ ରଙ୍ଗର ଦେଖାଯାଏ, ସେତେବେଳେ ଗଛଗୁଡ଼ିକୁ ଅମଳ କରନ୍ତୁ। ଅମଳ ପରେ, ଧାନକୁ 2ରୁ 3 ଦିନ ପାଇଁ କ୍ଷେତରେ ଶୁଖାଇବା ଉଚିତ ଏବଂ ତା 'ପରେ ଅମଳ କରାଯିବା ଉଚିତ। ଚାଉଳ 12 ପ୍ରତିଶତ ଆର୍ଦ୍ରତା ସ୍ତରରେ ସୁରକ୍ଷିତ ସ୍ଥାନରେ ରଖିବା ଉଚିତ। ନିମ୍ନ ରାତ୍ରି ତାପମାତ୍ରା ଏବଂ ଉଚ୍ଚ ଆର୍ଦ୍ରତା ହେତୁ, ବିଳମ୍ବରେ ପରିପକ୍ୱ ହେଉଥିବା ଧାନ କିସମଗୁଡ଼ିକରେ ମିଥ୍ୟା ରୋଗ ସଂକ୍ରମଣ ହେବାର ସମ୍ଭାବନା ଥାଇପାରେ, ତେଣୁ ଏହାର ନିୟମିତ ତଦାରଖ କରିବାକୁ ପରାମର୍ଶ ଦିଆଯିବା ଉଚିତ। ଯଦି ସଂକ୍ରମଣ ପରିଲକ୍ଷିତ ହୁଏ, ତେବେ କପର୍ ହାଇଡ୍ରୋକ୍ସାଇଡ୍ 77 ପ୍ରତିଶତ @2 ଗ୍ରାମ୍/ଲିଟର କିମ୍ବା ଟେବୁକୋନାଜୋଲ୍ 25 ପ୍ରତିଶତ @2 ଗ୍ରାମ୍/ଲିଟର ସିଞ୍ଚନ କରିବାକୁ ପରାମର୍ଶ ଦିଆଯିବା ଉଚିତ। ଏହାର ପ୍ରଭାବଶାଳୀ ନିୟନ୍ତ୍ରଣ ପାଇଁ 7-10 ଦିନ ପରେ ସ୍ପ୍ରେକୁ ପୁନରାବୃତ୍ତି କରନ୍ତୁ।"
         ]
      },
      "green gram": {
         "advisory": [
            "ବୁଣିବାର ଏକ ସପ୍ତାହ ପୂର୍ବରୁ, ପ୍ରତି କିଲୋଗ୍ରାମ ମଞ୍ଜି ପିଛା କାର୍ବେନଡାଜିମ୍ @1.5-2.0g ଏବଂ ଇମିଡାକ୍ଲୋପ୍ରିଡ୍ @5 ଗ୍ରାମ୍ ସହିତ ମଞ୍ଜି ଚିକିତ୍ସା କରାଯିବା ଉଚିତ। ବିଭିନ୍ନ ପ୍ରକାରଃ ସବୁଜ ଗ୍ରାମ-କାମଦେବ, ଦୁର୍ଗା, ଆଇ. ପି. ଏମ୍. 02-3, ଆଇ. ପି. ଏମ୍. 02-14, ଟି. ଏ. ଆର୍. ଏମ୍. 1।"
         ]
      },
      "black gram": {
         "advisory": [
            "ବୁଣିବାର ଏକ ସପ୍ତାହ ପୂର୍ବରୁ, ପ୍ରତି କିଲୋଗ୍ରାମ ମଞ୍ଜି ପିଛା କାର୍ବେନଡାଜିମ୍ @1.5-2.0g ଏବଂ ଇମିଡାକ୍ଲୋପ୍ରିଡ୍ @5 ଗ୍ରାମ୍ ସହିତ ମଞ୍ଜି ଚିକିତ୍ସା କରାଯିବା ଉଚିତ। ବିଭିନ୍ନ ପ୍ରକାରଃ କଳା ଗ୍ରାମ-ପ୍ରସାଦ, ଉସାଲା, ପି. ୟୁ. 31, ଆଇ. ପି. ୟୁ. 2-43, ମାହୁରୀ।"
         ]
      },
      "mustard": {
         "advisory": [
            "ଘନ ରୋପଣ କ୍ଷେତ୍ରରେ ସୋରିଷରେ ସର୍ବୋତ୍ତମ ଉଦ୍ଭିଦ ସଂଖ୍ୟା ବଜାୟ ରଖିବା ପାଇଁ ଗୋଟିଏ ପତଳା ଅପରେସନ ପରାମର୍ଶ ଦିଆଯିବା ଉଚିତ | 15 ରୁ 20 ଦିନ ପୁରୁଣା ଫସଲ କ୍ଷେତ୍ରରେ ହୋଇଂ ଏବଂ ଆଗାଛା ସଫା କରିବା ପାଇଁ ପରାମର୍ଶ ଦିଆଯାଇଛି।"
         ]
      },
      "ground nut": {
         "advisory": [
            "ଯେଉଁ କୃଷକମାନେ ଏପର୍ଯ୍ୟନ୍ତ ମଞ୍ଜି ବୁଣିନାହାନ୍ତି, ସେମାନେ ଉନ୍ନତ ଚିନାବାଦାମ କିସମ ବ୍ୟବହାର କରିପାରିବେ। ମଞ୍ଜି ବୁଣିବା ପୂର୍ବରୁ ମଞ୍ଜି ଚିକିତ୍ସା ସୁନିଶ୍ଚିତ କରନ୍ତୁ ଏବଂ ଯଦି ସମ୍ଭବ, ଚିକିତ୍ସାର 7 ଦିନ ପରେ ବ୍ୟାକ୍ଟେରିଆ କିମ୍ବା ଫସଫୋ କଲ୍ଚର ସହିତ ଚିକିତ୍ସା କରନ୍ତୁ। ଯଦି ଚାରା 10 ଦିନ ପୁରୁଣା ହୋଇଥାଏ, ତେବେ ଯେଉଁ ସ୍ଥାନରେ ଚାରା ବାହାରି ନାହିଁ, ସେହି ସ୍ଥାନରେ ଶୂନ୍ୟସ୍ଥାନ ପୂରଣ କରନ୍ତୁ।"
         ]
      },
      "cole crop": {
         "advisory": [
            "ରୋପଣ ସମୟରେ, ପଲିଥିନକୁ ମଲ୍ଚିଙ୍ଗ ସାମଗ୍ରୀ ଭାବରେ ବ୍ୟବହାର କରାଯାଇପାରିବ କିମ୍ବା ଯଦି ରୋପଣ ପୂର୍ବରୁ ହୋଇସାରିଛି, ତେବେ ପନିପରିବା ଫସଲରେ ଆର୍ଦ୍ରତା ତଥା ମୃତ୍ତିକା ତାପମାତ୍ରା ବଜାୟ ରଖିବା ପାଇଁ ସମାନ ଉଦ୍ଦେଶ୍ୟରେ ଷ୍ଟ୍ରା ବ୍ୟବହାର କରାଯାଇପାରିବ | ଫୁଲକୋବିରେ ଡାଇମଣ୍ଡ ବ୍ୟାକ୍ ମଥ୍ର ଆକ୍ରମଣ ବିରୁଦ୍ଧରେ ନିୟମିତ ତଦାରଖ କରିବାକୁ ପରାମର୍ଶ ଦିଆଯିବା ଉଚିତ ଏବଂ ଯଦି ସମ୍ଭବ, କୃଷକମାନେ ଏହି ଉଦ୍ଦେଶ୍ୟରେ କ୍ଷେତରେ ଫେରୋମୋନ୍ ଟ୍ରାପ୍ ବ୍ୟବହାର କରିବା ଉଚିତ୍ |"
         ]
      }
   },
   "date": "29-11-2024"
}