{
   "weather_details": {
      "30/10/2024": {
         "rainfall": 2,
         "t_max": 31,
         "t_min": 22,
         "rh_max": 95,
         "rh_min": 31,
         "wind_speed": 2,
         "wind_direction": 79,
         "cloud_cover": 6
      },
      "31/10/2024": {
         "rainfall": 1,
         "t_max": 31,
         "t_min": 23,
         "rh_max": 94,
         "rh_min": 31,
         "wind_speed": 2,
         "wind_direction": 79,
         "cloud_cover": 5
      },
      "01/11/2024": {
         "rainfall": 0,
         "t_max": 31,
         "t_min": 23,
         "rh_max": 92,
         "rh_min": 32,
         "wind_speed": 2,
         "wind_direction": 53,
         "cloud_cover": 5
      },
      "02/11/2024": {
         "rainfall": 0,
         "t_max": 32,
         "t_min": 23,
         "rh_max": 86,
         "rh_min": 32,
         "wind_speed": 2,
         "wind_direction": 39,
         "cloud_cover": 4
      },
      "03/11/2024": {
         "rainfall": 0,
         "t_max": 31,
         "t_min": 22,
         "rh_max": 78,
         "rh_min": 32,
         "wind_speed": 2,
         "wind_direction": 31,
         "cloud_cover": 4
      }
   },
   "names_of_crops": [
      "ଧାନ।",
      "ଗହମ",
      "ସୋରିଷ",
      "ମକା",
      "ବାଇଗଣ",
      "ପଶୁମାନେ",
      "ମତ୍ସ୍ୟଚାଷ"
   ],
   "general_advisory": "ବହୁତ ହାଲୁକା ବର୍ଷା ହେବାର ପୂର୍ବାନୁମାନ ହେତୁ ଫସଲ ଅମଳ କିଛି ଦିନ ପାଇଁ ସ୍ଥଗିତ ରଖାଯାଇଛି। ରବି ଫସଲ ବୁଣିବା ପାଇଁ ଯାଆନ୍ତୁ। ପକେଟରେ ଆର୍ଦ୍ରତାର ଚାପ କ୍ଷେତ୍ରରେ, ପ୍ରଜନନ ପର୍ଯ୍ୟାୟରେ 1 ପ୍ରତିଶତ କେ. ସି. ଏଲ୍. ଦ୍ରବଣର ପତ୍ର ପ୍ରୟୋଗ ଉତ୍ପାଦନରେ ଅଧିକ କ୍ଷତି ନକରି ଆର୍ଦ୍ରତା ଅବସ୍ଥାର ପ୍ରଭାବକୁ ହ୍ରାସ କରିବ।",
   "crops_data": {
      "paddy": {
         "advisory": [
            "ନେକ୍ ବିସ୍ଫୋରଣ ଘଟଣା କ୍ଷେତ୍ରରେ ରୋଗକୁ ନିଯ଼ନ୍ତ୍ରଣ କରିବା ପାଇଁ କାର୍ବେନଡାଜିମ୍ 50 ଡବ୍ଲ୍ଯ଼ୁ. ପି. @2 ଗ୍ରାମ୍/ଲିଟର କିମ୍ବା ଟ୍ରାଇସାଇକ୍ଲାଜୋଲ୍ 75 ଡବ୍ଲ୍ଯ଼ୁ. ପି. @0.6 ଗ୍ରାମ୍/ଲିଟର ପାଣି ସିଞ୍ଚନ କରାଯାଇପାରେ। ଅମଳ କରିବାର କିଛି ଦିନ ପୂର୍ବରୁ ଠିଆ ହୋଇଥିବା ଧାନ ଫସଲ 15-20 ଉପରେ ଉତେରା ଫସଲ ପ୍ରସାରଣ କରିବାକୁ କୃଷକମାନଙ୍କୁ ପରାମର୍ଶ ଦିଆଯାଇଛି।"
         ]
      },
      "wheat": {
         "advisory": [
            "ଯ଼ୁପି 262 ଭଳି ଉତ୍ତମ ମାନର ମଞ୍ଜି ସଂଗ୍ରହ କରନ୍ତୁ। ପ୍ରତି କିଲୋଗ୍ରାମ ମଞ୍ଜି ପିଛା 2 ଗ୍ରାମ ମୂଲ୍ଯ଼ରେ ଭିଟାବ୍ଯ଼ାକ୍ସ ଶକ୍ତିରେ ମଞ୍ଜିଗୁଡ଼ିକୁ ଚିକିତ୍ସା କରନ୍ତୁ। ବୁଣିବା ପୂର୍ବରୁ ଏକର ପିଛା 600 ଗ୍ରାମ୍ ପି. ଏସ୍. ବି. ସହିତ ମଧ୍ଯ଼ ଉପଚାର କରନ୍ତୁ। ଏକର ପିଛା ଏହାର ବିହନ ମୂଲ୍ଯ଼ 40 କିଲୋଗ୍ରାମ ରହିଛି।"
         ]
      },
      "mustard": {
         "advisory": [
            "ଯେଉଁ କୃଷକମାନେ ସୋରିଷ ଫସଲ ଚାଷ କରିବାକୁ ଚାହାଁନ୍ତି, ସେମାନେ କ୍ଷେତ ପ୍ରସ୍ତୁତ କରିବା ପରେ ବୁଣିବା ଆରମ୍ଭ କରିପାରିବେ ଏବଂ ଏହି ଅଞ୍ଚଳ ପାଇଁ ସୁପାରିଶ କରାଯାଇଥିବା ଉନ୍ନତ ମଞ୍ଜି ଯଥା ବରୁଣ, ପୁସା ବୋଲ୍ଡ, ଏମ 27, ଅନୁରାଧା ଇତ୍ଯ଼ାଦି ଚଯ଼ନ କରିପାରିବେ। ଗୋଟିଏ ଏକର ଜମିରେ ଚାଷ କରିବା ପାଇଁ 3 କିଲୋ ମଞ୍ଜି ଆବଶ୍ଯ଼କ ହୋଇଥାଏ। 30 ସେ. ମି. ଦୂରରେ ଧାଡ଼ିରେ ମଞ୍ଜି ବୁଣନ୍ତୁ। (ଧାଡ଼ି ରୁ ଧାଡ଼ି) ଏବଂ 10 ସେ. ମି. (ଗଛରୁ ଗଛ)।"
         ]
      },
      "maize": {
         "advisory": [
            "ପତନକୁ ନିଯ଼ନ୍ତ୍ରଣ କରିବା ପାଇଁ ସେନା କୃମି ଚାଷୀମାନଙ୍କୁ ଏମ୍ମାମେକ୍ଟିନ୍ ବେନ୍ଜୋଏଟ୍ 5 ଏସ୍. ଜି. @0.40 ଗ୍ରାମ୍/ଲିଟର ପାଣି ସିଞ୍ଚନ କରିବାକୁ ପରାମର୍ଶ ଦିଆଯାଇଛି।"
         ]
      },
      "brinjal": {
         "advisory": [
            "ଶୁଟ୍ ଏବଂ ଫଳ ଛେଦକ ସଂକ୍ରମଣ ହେବାର ସମ୍ଭାବନା ଅଛି | ଏକର ପିଛା 200 ଲିଟର ପାଣିରେ ଏମାମେକ୍ଟିନ୍ ବେନ୍ଜୋଏଟ୍ 5 ପ୍ରତିଶତ ଏସ୍. ଜି. @80 ଗ୍ରାମ୍ କିମ୍ବା ଏକର ପିଛା 200 ଲିଟର ପାଣିରେ କାର୍ବାରିଲ୍ 50 ପ୍ରତିଶତ ଡବ୍ଲ୍ଯ଼ୁ. ପି. @800 ଗ୍ରାମ୍ ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "animals": {
         "advisory": [
            "ଦୁଗ୍ଧ ଉତ୍ପାଦନକୁ ବଜାୟ ରଖିବା ଏବଂ ରୋଗରୁ ରକ୍ଷା କରିବା ପାଇଁ ଗାଈଶାଳାଗୁଡ଼ିକୁ ମାଛି ଏବଂ ମଶାଙ୍କଠାରୁ ଭଲ ଭାବରେ ରକ୍ଷା କରାଯିବା ଉଚିତ।"
         ]
      },
      "pisciculture": {
         "advisory": [
            "ଶରୀର ପୁଞ୍ଜିର 3 ପ୍ରତିଶତ ମାତ୍ରାରେ ଖଣିଜ ପଦାର୍ଥ ଦିଅନ୍ତୁ।"
         ]
      }
   },
   "date": "29-10-2024"
}