{
   "weather_details": {
      "31-07-2024": {
         "rainfall": 10,
         "t_max": 30,
         "t_min": 28,
         "rh_max": 85,
         "rh_min": 64,
         "wind_speed": 17,
         "wind_direction": 257,
         "cloud_cover": 8
      },
      "01-08-2024": {
         "rainfall": 15,
         "t_max": 30,
         "t_min": 26,
         "rh_max": 88,
         "rh_min": 69,
         "wind_speed": 19,
         "wind_direction": 270,
         "cloud_cover": 8
      },
      "02-08-2024": {
         "rainfall": 20,
         "t_max": 30,
         "t_min": 25,
         "rh_max": 85,
         "rh_min": 64,
         "wind_speed": 21,
         "wind_direction": 252,
         "cloud_cover": 8
      },
      "03-08-2024": {
         "rainfall": 7,
         "t_max": 31,
         "t_min": 25,
         "rh_max": 86,
         "rh_min": 70,
         "wind_speed": 19,
         "wind_direction": 248,
         "cloud_cover": 7
      },
      "04-08-2024": {
         "rainfall": 7,
         "t_max": 32,
         "t_min": 26,
         "rh_max": 90,
         "rh_min": 66,
         "wind_speed": 16,
         "wind_direction": 246,
         "cloud_cover": 6
      }
   },
   "names_of_crops": [
      "ସିଧାସଳଖ ବିହନ ବୁଣାଯାଇଥିବା ଧାନ",
      "ରୋପଣ କରାଯାଇଥିବା ଧାନ",
      "କପା",
      "ଅରହର",
      "ସଂକର ମକା",
      "ବାଇଗଣ",
      "ଲଙ୍କା",
      "ଓକ୍ରା",
      "ରସୁଣ",
      "ଆମ୍ବ",
      "ପେଁପେ",
      "ଗାଈ।",
      "କୁକୁଡ଼ା ମାଂସ",
      "ଛେଳି ଏବଂ ମେଣ୍ଢା"
   ],
   "general_advisory": "ଆଇଏମଡିରୁ ମିଳିଥିବା ପୂର୍ବାନୁମାନର ବର୍ଦ୍ଧିତ ପରିସର ଅନୁଯାଯ଼ୀ, ଆସନ୍ତା ସପ୍ତାହରେ (2 ରୁ 8 ଅଗଷ୍ଟ 2024) ଓଡ଼ିଶାର ଜିଲ୍ଲାଗୁଡ଼ିକରେ ବ୍ଯ଼ାପକରୁ ବ୍ଯ଼ାପକ ବର୍ଷା/ବଜ୍ରପାତ ହେବାର ସମ୍ଭାବନା ରହିଛି ଏବଂ ଆସନ୍ତା ସପ୍ତାହରେ ଓଡ଼ିଶାର ଜିଲ୍ଲାଗୁଡ଼ିକରେ ବିଚ୍ଛିନ୍ନ ଭାବେ ପ୍ରବଳରୁ ଅତି ପ୍ରବଳ ବର୍ଷା ହେବାର ସମ୍ଭାବନା ସହିତ ସାମଗ୍ରିକ ବୃଷ୍ଟିପାତ ସ୍ୱାଭାବିକଠାରୁ ସାମାନ୍ଯ଼ ଅଧିକ ହେବାର ସମ୍ଭାବନା ରହିଛି। ଉପରୋକ୍ତ ପୂର୍ବାନୁମାନକୁ ଦୃଷ୍ଟିରେ ରଖି କୃଷକମାନଙ୍କୁ ଆଗାମୀ ତିନି ଦିନ ପାଇଁ ଆନ୍ତଃସାଂସ୍କୃତିକ ପରିଚାଳନା, ଟପ୍ ଡ୍ରେସିଂ ଏବଂ କୀଟନାଶକ ପ୍ରଯ଼ୋଗ ବନ୍ଦ କରିବାକୁ ପରାମର୍ଶ ଦିଆଯାଇଛି। ଅନୁଭୂତ ଏବଂ ପ୍ରତ୍ଯାଶିତ ବର୍ଷାକୁ ଦୃଷ୍ଟିରେ ରଖି କୃଷକମାନଙ୍କୁ ଧାନ ରୋପଣ ସମ୍ପୂର୍ଣ୍ଣ କରିବାକୁ ପରାମର୍ଶ ଦିଆଯାଇଛି ଯେଉଁଠାରେ କ୍ଷେତ ପ୍ରସ୍ତୁତ ହୋଇଛି। ଡାଲି, ମକା, ଚିନାବାଦାମ ଏବଂ ପନିପରିବା କ୍ଷେତରୁ ଅତିରିକ୍ତ ଜଳ ନିଷ୍କାସନ ପାଇଁ ବ୍ଯ଼ବସ୍ଥା କରନ୍ତୁ। କ୍ଷେତ ଭିତରେ ବର୍ଷା ଜଳ ସଂରକ୍ଷଣ ପାଇଁ ବନ୍ଧ ପ୍ରସ୍ତୁତ କରନ୍ତୁ, ବିଶେଷ କରି ଉଚ୍ଚଭୂମି ପରିସ୍ଥିତିରେ। ଉଚ୍ଚ ଆର୍ଦ୍ରତା ସହିତ ଜଡିତ ପ୍ରଚଳିତ ମେଘୁଆ ପାଣିପାଗ ହେତୁ ଫସଲରେ କୀଟପତଙ୍ଗ ଏବଂ ରୋଗ ଘଟଣା ପାଇଁ ନିଯ଼ମିତ ତଦାରଖ କରିବାକୁ ପରାମର୍ଶ ଦିଆଯାଇଛି। ଏସ୍. ଏମ୍. ଏସ୍. ପରାମର୍ଶଃ ଆବଶ୍ଯ଼କ ସୁରକ୍ଷା ବ୍ଯ଼ବସ୍ଥା ଅନୁସରଣ କରି ସର୍ବଦା କୀଟନାଶକଗୁଡ଼ିକର ସୁପାରିସ କରାଯାଇଥିବା ମାତ୍ରା ପ୍ରଯ଼ୋଗ କରନ୍ତୁ।",
   "crops_data": {
      "direct seeded paddy": {
         "advisory": [
            "ଆଗାଛା ପରିଚାଳନାଃ ଫେନାକ୍ସାପ୍ରପ-ପି-ଇଥାଇଲ 10 ପ୍ରତିଶତ ଇ. ସି. (ୱିପସୁପର) @<ଆଇ. ଡି. 2> ମିଲିଲିଟର/ଏକରରେ ପ୍ରଯ଼ୋଗ କରନ୍ତୁ ଏବଂ ଉଚ୍ଚଭୂମି ସ୍ଥିତିରେ <ଆଇ. ଡି. 1> ଡି. ଏ. ଏସ୍. ରେ 200 ଲିଟର ପାଣି ସହିତ ମିଶ୍ରଣ କରନ୍ତୁ।",
            "ମଧ୍ଯ଼ମ ଏବଂ ତଳିଆ ଅଞ୍ଚଳରେ, ଯେଉଁଠାରେ ଆଗାଛା ନିଯ଼ନ୍ତ୍ରଣ ପାଇଁ ତୃଣନାଶକ ପ୍ରଯ଼ୋଗ କରାଯାଏ ନାହିଁ, କ୍ଷେତରେ ପର୍ଯ୍ଯ଼ାପ୍ତ ଜଳ (ଅତିକମ୍ରେ 7-10 ସେ. ମି. ଠିଆ ହୋଇଥିବା ଜଳ) ଜମା ହେବା ପରେ ଏବଂ ଉପଯୁକ୍ତ ଉଦ୍ଭିଦ ସଂଖ୍ଯ଼ା (ଖେଲୁଆ) ରକ୍ଷଣାବେକ୍ଷଣ ପରେ ବିଉଶେନିଂ କରାଯାଇପାରିବ।",
            "ପୋଷକ ତତ୍ତ୍ୱ ପରିଚାଳନାଃ ଉଚ୍ଚଭୂମିରେ ଘାସ କାଟିବା ପରେ ଏକର ପିଛା 26 କି. ଗ୍ରା. ଯ଼ୁରିଆ ଏବଂ ମଧ୍ଯ଼ମ ଏବଂ ତଳିଆ ଭୂମିରେ ଶୁଖିଲା ପରେ ଏକର ପିଛା 36 କି. ଗ୍ରା. ଯ଼ୁରିଆ ପ୍ରଯ଼ୋଗ କରନ୍ତୁ।"
         ]
      },
      "transplanted paddy": {
         "advisory": [
            "ସାରର ସୁପାରିସ କରାଯାଇଥିବା ମାତ୍ରା-ଉଚ୍ଚଭୂମିରେ 26 କିଲୋଗ୍ରାମ ଡିଏପି + 10 କିଲୋଗ୍ରାମ ଏମଓପି + 10 କିଲୋଗ୍ରାମ ଜେଡଏନଏସଓ4 ଏବଂ ମଧ୍ଯ଼ମ ଏବଂ ତଳଭୂମିରେ ଏକର ପିଛା 35 କିଲୋଗ୍ରାମ ଡିଏପି + 13 କିଲୋଗ୍ରାମ ଏମଓପି + 10 କିଲୋଗ୍ରାମ ଜେଡଏନଏସଓ4 ପ୍ରଯ଼ୋଗ କରନ୍ତୁ। ବୋରନ ଅଭାବ ଥିବା ମାଟିରେ ଅନ୍ତିମ ଭୂମି ପ୍ରସ୍ତୁତି ସମଯ଼ରେ ବୋରାକ୍ସ @2kg ଏସି ଲଗାନ୍ତୁ।",
            "20x15 ସେ. ମି. ବ୍ଯ଼ବଧାନରେ <ଆଇ. ଡି. 1> ଦିନ ପୁରୁଣା ଚାରା/ପାହାଡ଼ ପ୍ରତିରୋପଣ କରିବା ପାଇଁ ସୁପାରିସ କରାଯାଏ।",
            "ନିଡ୍ ମ୍ଯ଼ାନେଜମେଣ୍ଟଃ ରୋପଣର 1ରୁ 3 ଦିନ ପରେ 20 କିଲୋଗ୍ରାମ ବାଲି ସହିତ ମିଶ୍ରଣ କରି ଦାନାଦାର ତୃଣନାଶକ ବେନ୍ସଲ୍ଫୁରନ୍ ମିଥାଇଲ 0.6% + ପ୍ରିଟିଲାକ୍ଲୋର 6% ଜିଆର (ଲଣ୍ଡ୍ଯ଼ାକ୍ସ ପାୱାର) @4 କେଜି/ଏକର ଲଗାନ୍ତୁ।",
            "ପାଇରାଜୋସଲ୍ଫୁରନ୍ ଇଥାଇଲ 10% ଡବ୍ଲ୍ଯ଼ୁ. ପି. <ଆଇ. ଡି. 1> ଏସି. କୁ 200 ଲିଟର ପାଣି ସହିତ ମିଶ୍ରଣ କରି ପ୍ରଯ଼ୋଗ କରନ୍ତୁ, ଯାହା ଏକ ପ୍ରାରମ୍ଭିକ ଉଦ୍ଭବ ପରବର୍ତ୍ତୀ ହର୍ବିସାଇଡ୍।",
            "ଯଦି ପ୍ରାକ୍-ଆବିର୍ଭାବ ହର୍ବିସାଇଡ୍ ପ୍ରଯ଼ୋଗ କରାଯାଇନାହିଁ, ତେବେ 15-20 DAT ରେ 200 ଲିଟର ପାଣି ସହିତ ମିଶ୍ରଣ କରି ବିସ୍ପିରିବାକ୍ ସୋଡ଼ିଅମ୍ 10 ପ୍ରତିଶତ SC (ମନୋନୀତ ସୁନା) @120ml ଏକର ଲଗାନ୍ତୁ। ଅଧିକ ସୂଚନା ପାଇଁ, ଆଇଏମଡି, ଭୁବନେଶ୍ୱର, Tel.#0674-2596116 ସହିତ ଯୋଗାଯୋଗ କରନ୍ତୁ।"
         ]
      },
      "cotton": {
         "advisory": [
            "ଅତିରିକ୍ତ ବର୍ଷା ଜଳ ନିଷ୍କାସନ ପାଇଁ ଡ୍ରେନେଜ୍ ଚ୍ଯ଼ାନେଲ୍ ତିଆରି କରନ୍ତୁ।",
            "ହୋଇଂ, ନିଡ଼ାଇ, ଏବଂ ପ୍ରଥମ ଉପର ଡ୍ରେସିଂ ଗ୍ରହଣ କରନ୍ତୁ ଏବଂ ତା 'ପରେ କପାର ତିନି ସପ୍ତାହ ପର୍ଯ୍ଯ଼ାଯ଼ରେ ମୃତ୍ତିକା ଉଠାନ୍ତୁ | 26 କି. ଗ୍ରା. ଯ଼ୁରିଆ ସହିତ 20 କି. ଗ୍ରା. ଏମ୍. ଓ. ପି. ହାଇବ୍ରିଡ୍ ଏବଂ 20 କି. ଗ୍ରା. ଯ଼ୁରିଆ ସହିତ 15 କି. ଗ୍ରା. ଏମ୍. ଓ. ପି. ଉଚ୍ଚ-ଉତ୍ପାଦନକାରୀ କିସମର ପ୍ରଯ଼ୋଗ କରନ୍ତୁ।",
            "କୀଟପତଙ୍ଗରୁ ରକ୍ଷା ପାଇବା ପାଇଁ ଫସଲ ପର୍ଯ୍ଯ଼ାଯ଼ର 30-45 ଦିନରେ 15 ଲିଟର ପାଣି ସହିତ ମିଶ୍ରଣ କରି ନିମ୍ବ ତେଲ @45 ମିଲି ପରି ନିମ୍ବ ଆଧାରିତ କୀଟନାଶକ ପ୍ରଯ଼ୋଗ କରିବା ଉଚିତ।",
            "ଉଦ୍ଭିଦ ହରମୋନ୍ ପ୍ଲାନଫିକ୍ସ @12 ମିଲି 15 ଲିଟର ପାଣି ସହିତ ମିଶ୍ରଣ କରିବା ଫସଲ ପର୍ଯ୍ଯ଼ାଯ଼ର 30-45 ଦିନରେ ଫୁଲ ବୁନ୍ଦା ନିଯ଼ନ୍ତ୍ରଣ କରିବା ପାଇଁ ପରାମର୍ଶ ଦିଆଯାଏ |"
         ]
      },
      "arhar": {
         "advisory": [
            "ଅତିରିକ୍ତ ବର୍ଷା ଜଳ ନିଷ୍କାସନ ପାଇଁ ଡ୍ରେନେଜ୍ ଚ୍ଯ଼ାନେଲ୍ ସୃଷ୍ଟି କରନ୍ତୁ।",
            "ତିନି ସପ୍ତାହର ପର୍ଯ୍ଯ଼ାଯ଼ରେ ହଏଇଂ, ନିଡ଼ାଇ ଓ ତା 'ପରେ ମୃତ୍ତିକା ଉତ୍ତୋଳନ କରାଯିବା ଉଚିତ।",
            "କୀଟ ସଂକ୍ରମଣର ଲକ୍ଷଣଗୁଡ଼ିକ ପାଇଁ ନିଯ଼ମିତ ଭାବେ ନିଜ କ୍ଷେତ ଉପରେ ନଜର ରଖନ୍ତୁ।"
         ]
      },
      "hybrid maize": {
         "advisory": [
            "ଅତ୍ଯ଼ଧିକ ବର୍ଷା କାରଣରୁ ଜଳମଗ୍ନ ପରିସ୍ଥିତିକୁ ଏଡ଼ାଇବା ପାଇଁ ଏକ ଉନ୍ନତ ଜଳ ନିଷ୍କାସନ ବ୍ଯ଼ବସ୍ଥା ବିକଶିତ କରନ୍ତୁ।",
            "ତିନି ସପ୍ତାହର ପର୍ଯ୍ଯ଼ାଯ଼ରେ ହୋଇଂ, ନିଡିଂ, ଏବଂ ପ୍ରଥମ ଟପ୍ ଡ୍ରେସିଂ ପରେ ଆର୍ଥିଂ ଅପ୍ ପାଇଁ ଯାଆନ୍ତୁ | ପ୍ରଥମ ଟପ୍ ଡ୍ରେସିଂ ଭାବରେ ଯ଼ୁରିଆ @75 କେଜି/ଏସି ଲଗାନ୍ତୁ |",
            "ଏହି ପର୍ଯ୍ଯ଼ାଯ଼ରେ ଷ୍ଟେମ ବୋରର ଏବଂ ବ୍ଯ଼ାଣ୍ଡେଡ ପତ୍ର ଏବଂ ସିଥ୍ ବ୍ଲାଇଟ୍ ଦେଖାଯାଇପାରେ | ନିଯ଼ମିତ ଭାବେ କ୍ଷେତ ଉପରେ ନଜର ରଖନ୍ତୁ ଏବଂ ସଂକ୍ରମିତ ଗଛର ଅଂଶଗୁଡ଼ିକୁ ବାହାର କରନ୍ତୁ।"
         ]
      },
      "brinjal": {
         "advisory": [
            "ମୁଖ୍ଯ଼ କ୍ଷେତରେ 30-45 ଦିନର ପୁରୁଣା ଚାରା ରୋପଣ କରନ୍ତୁ।",
            "ଜଳମଗ୍ନ ଅବସ୍ଥାକୁ ରୋକିବା ପାଇଁ ଆବଶ୍ଯ଼କ ଡ୍ରେନେଜ୍ ଚ୍ଯ଼ାନେଲ୍ ତିଆରି କରନ୍ତୁ |",
            "ଉଦ୍ଭିଦ ସଂଖ୍ଯ଼ାକୁ ବଜାଯ଼ ରଖିବା ପାଇଁ ମୁଖ୍ଯ଼ କ୍ଷେତରେ ଥିବା ଶୂନ୍ଯ଼ସ୍ଥାନଗୁଡ଼ିକୁ ଚିହ୍ନଟ କରନ୍ତୁ ଏବଂ ପୂରଣ କରନ୍ତୁ।",
            "କୀଟ ସଂକ୍ରମଣର ଲକ୍ଷଣଗୁଡ଼ିକ ପାଇଁ ନିଯ଼ମିତ ଭାବେ ନିଜ କ୍ଷେତ ଉପରେ ନଜର ରଖନ୍ତୁ।",
            "ସଂକ୍ରମିତ ଗଛକୁ ବାହାର କରି କ୍ଷେତ ବାହାରେ ପୋତି ଦିଅନ୍ତୁ।"
         ]
      },
      "chilli": {
         "advisory": [
            "ମୁଖ୍ଯ଼ କ୍ଷେତରେ 30-45 ଦିନର ପୁରୁଣା ଚାରା ରୋପଣ କରନ୍ତୁ।",
            "ଜଳମଗ୍ନ ଅବସ୍ଥାକୁ ରୋକିବା ପାଇଁ ଆବଶ୍ଯ଼କ ଡ୍ରେନେଜ୍ ଚ୍ଯ଼ାନେଲ୍ ତିଆରି କରନ୍ତୁ |",
            "ଉଦ୍ଭିଦ ସଂଖ୍ଯ଼ାକୁ ବଜାଯ଼ ରଖିବା ପାଇଁ ମୁଖ୍ଯ଼ କ୍ଷେତରେ ଥିବା ଶୂନ୍ଯ଼ସ୍ଥାନଗୁଡ଼ିକୁ ଚିହ୍ନଟ କରନ୍ତୁ ଏବଂ ପୂରଣ କରନ୍ତୁ।",
            "କୀଟ ସଂକ୍ରମଣର ଲକ୍ଷଣଗୁଡ଼ିକ ପାଇଁ ନିଯ଼ମିତ ଭାବେ ନିଜ କ୍ଷେତ ଉପରେ ନଜର ରଖନ୍ତୁ।",
            "ସଂକ୍ରମିତ ଗଛକୁ ବାହାର କରି କ୍ଷେତ ବାହାରେ ପୋତି ଦିଅନ୍ତୁ।"
         ]
      },
      "okra": {
         "advisory": [
            "ଅଧିକ ଉତ୍ପାଦନ ପାଇବା ପାଇଁ ଜୁଲାଇ ଶେଷ ସୁଦ୍ଧା ବୁଣିବା ଶେଷ ହେବା ଉଚିତ।",
            "ଜମି ପ୍ରସ୍ତୁତ କରିବା ସମଯ଼ରେ ଭଲ ଭାବେ ସଙ୍କୁଚିତ ହୋଇଥିବା ଏଫ୍. ୱାଇ. ଏମ୍. <ଆଇ. ଡି. 1> ଏକର ଜମି ବ୍ଯ଼ବହାର କରନ୍ତୁ।",
            "ବିହନ ହାର-ଏକର ପିଛା 4 କିଲୋଗ୍ରାମ। ମ୍ଲାନ ରୋଗରୁ ରକ୍ଷା ପାଇବା ପାଇଁ ବୁଣିବା ପୂର୍ବରୁ ବୀଜକୁ ବାଭିଷ୍ଟିନ୍ @2g କେଜି ମଞ୍ଜି ସହିତ ଚିକିତ୍ସା କରାଯିବା ଉଚିତ।",
            "ପ୍ରବଳ ବର୍ଷା କାରଣରୁ ଜଳମଗ୍ନ ପରିସ୍ଥିତିକୁ ଏଡ଼ାଇବା ପାଇଁ ଜଳ ନିଷ୍କାସନ ସୁବିଧା ପ୍ରଦାନ କରନ୍ତୁ।"
         ]
      },
      "onion": {
         "advisory": [
            "ଭୀମ ରାଜ, ଭୀମ ଡାର୍କ ରେଡ୍, ଭୀମ ସୁପର ଇତ୍ଯ଼ାଦି ଉପଯୁକ୍ତ କିସମର ଚଯ଼ନ କରାଯିବା ଉଚିତ।",
            "ଖରିଫ ପନିପରିବା ପାଇଁ ଏକ ଓଭରହେଡ୍-ସୁରକ୍ଷିତ ଢାଞ୍ଚା ଅଧୀନରେ ଉଠାଯାଇଥିବା ନର୍ସରୀ ଶଯ୍ଯ଼ା ପ୍ରସ୍ତୁତ କରାଯିବା ଉଚିତ୍ |",
            "ଭଲ ଚାରା ପାଇବା ପାଇଁ ବୀଜ ଉପଚାର, ବୁଣିବା, ଏବଂ ତା 'ପରେ ଧାନ ନଡ଼ିଆ ମାଲ୍ଚିଙ୍ଗ୍ ପ୍ରଯ଼ୋଗ କରିବାକୁ ପରାମର୍ଶ ଦିଆଯାଏ |",
            "ଉଇପୋକା ସଂକ୍ରମଣରୁ ରକ୍ଷା ପାଇବା ପାଇଁ କ୍ଲୋରୋପାଇରିଫୋସ୍ @1ml ଲିଟର ପାଣି ଲଗାନ୍ତୁ।"
         ]
      },
      "mango": {
         "advisory": [
            "ଆମ୍ବ ରୋପଣ ପାଇଁ ଉପଯୁକ୍ତ ସମଯ଼ ହେଉଛି ଜୁଲାଇରୁ ଅଗଷ୍ଟ।",
            "ବଙ୍ଗନପଲ୍ଲୀ, ତୋତାପୁରୀ, ବମ୍ବେ ଗ୍ରୀନ୍, ସୁବର୍ଣ୍ଣରେଖା, ନୀଲମ, ହିମସାଗର, ଲାଙ୍ଗ୍ରା, ଦଶେରୀ, ଆମ୍ରପାଲି, ମଲ୍ଲିକା, ରତ୍ନା, ରାମକେଲ୍ଲା, ରୁମ୍ମାନି, ସିନ୍ଧୁ, ଆଲ୍ଫାନ୍ସୋ ଏବଂ କେଶର ଇତ୍ଯ଼ାଦି ଉପଯୁକ୍ତ କିସମ ଚଯ଼ନ କରନ୍ତୁ | ସୁସ୍ଥ ଶାଖାବିହୀନ ଗ୍ରାଫ୍ଟେଡ ଚାରା ବ୍ଯ଼ବହାର କରନ୍ତୁ।",
            "10 ମିଟର x 10 ମିଟର ଦୂରତାରେ 1 ମିଟର x 1 ମିଟର x 1 ମିଟର ଗର୍ତ୍ତରେ ଚାରା ରୋପଣ କରନ୍ତୁ। ରୋପଣ ପୂର୍ବରୁ 5 କି. ଗ୍ରା. ଏଫ. ୱାଇ. ଏମ୍./ଗର୍ତ୍ତ ଲଗାନ୍ତୁ।"
         ]
      },
      "papaya": {
         "advisory": [
            "କଦଳୀ ଗଛ ଲଗାଇବା ପାଇଁ ଏହା ଉପଯୁକ୍ତ ସମଯ଼।",
            "ପେଁପେ ପାଇଁ ଏଚୱାଇଭି ହେଉଛି ହନିଡିଉ, କୁର୍ଗ ହନିଡିଉ, ସିଓ-1, ସିଓ-2, ପୁସା ସୁସ୍ୱାଦୁ, ପୁସା ମ୍ଯ଼ାଜେଷ୍ଟି ଏବଂ ପୁସା ଜଏଣ୍ଟ |",
            "ଚାରା ଗୁଡ଼ିକୁ 2.5 ମି. x 2.5 ମି. ଦୂରତା ଏବଂ 0.5 ମି. x 0.5 ମି. x 0.5 ମି. ଗର୍ତ୍ତରେ ରୋପଣ କରନ୍ତୁ। ରୋଗ ପ୍ରତିରୋଧକ ଏବଂ ଟିସ୍ଯ଼ୁ କଲ୍ଚର ଚାରା ବ୍ଯ଼ବହାର କରାଯିବା ଉଚିତ। ରୋପଣ ପୂର୍ବରୁ ଗର୍ତ୍ତରେ ଉପର ମାଟି ଏବଂ ଭଲ ଭାବେ ସଡି ଯାଇଥିବା ଏଫ୍. ଆଇ. ଏମ୍. ର ମିଶ୍ରଣ ଲଗାନ୍ତୁ।"
         ]
      },
      "cow": {
         "advisory": [
            "ଆର୍ଦ୍ରତା ବୃଦ୍ଧି ଏବଂ କ୍ଷତିକାରକ କବକ ବୃଦ୍ଧିକୁ ରୋକିବା ପାଇଁ ଶସ୍ଯ଼ ଭଣ୍ଡାରକୁ ଭଲ ଭାବେ ବାଯ଼ୁ-ସଞ୍ଚାଳିତ ଏବଂ ଲିକ୍-ମୁକ୍ତ ରଖନ୍ତୁ। ଗାଈ ଏବଂ ମଇଁଷିକୁ ଏଫ୍. ଏମ୍. ଡି., ଏଚ୍. ଏସ୍. ଏବଂ ବି. କ୍ଯ଼ୁ. ବିରୁଦ୍ଧରେ ଟୀକାକରଣ କରନ୍ତୁ ଏବଂ ଆର୍ଦ୍ର ପରିବେଶରେ ଆଭ୍ଯ଼ନ୍ତରୀଣ ପରଜୀବୀକୁ ନିଯ଼ନ୍ତ୍ରଣ କରିବା ପାଇଁ ଏକ କୃମି ନିବାରଣ ଯୋଜନା ପ୍ରସ୍ତୁତ କରନ୍ତୁ।"
         ]
      },
      "poultry": {
         "advisory": [
            "ବର୍ଷା ପାଣି ଭିତରକୁ ପ୍ରବେଶ କରିବାରୁ ରୋକିବା ପାଇଁ କୁକୁଡ଼ା ଘର ମରାମତି କରନ୍ତୁ | ଆବର୍ଜନା ସାମଗ୍ରୀକୁ ଓଦା ହେବାକୁ ଦିଅନ୍ତୁ ନାହିଁ।",
            "ଖାଦ୍ଯ଼ ସାମଗ୍ରୀକୁ ଓଦା ହେବାରୁ ରୋକନ୍ତୁ ଯାହା ଖାଦ୍ଯ଼ରେ ଫଙ୍ଗସ୍ ବୃଦ୍ଧି କରିପାରେ |"
         ]
      },
      "goat & sheep": {
         "advisory": [
            "ଆଭ୍ଯ଼ନ୍ତରୀଣ ପରଜୀବୀଗୁଡ଼ିକର ଭାର ହ୍ରାସ କରିବା ପାଇଁ ସେଗୁଡ଼ିକୁ ପତଳା କରନ୍ତୁ।",
            "ବାହ୍ଯ଼ ପରଜୀବୀ ବିରୁଦ୍ଧରେ ମେଣ୍ଢା କ୍ଷେତ୍ରରେ ଡିପିଂ କରାଯିବା ଉଚିତ୍ |",
            "ବର୍ଷା ସମଯ଼ରେ ପଶୁମାନଙ୍କୁ ଘର ଭିତରେ ରଖନ୍ତୁ ଏବଂ ସ୍ୱଚ୍ଛ ତଥା ସ୍ୱାସ୍ଥ୍ଯ଼କର ପାଣି ଯୋଗାଇ ଦିଅନ୍ତୁ ଏବଂ ବର୍ଷା ଋତୁରେ ମେଣ୍ଢା ଏବଂ ଛେଳି ପାଇଁ ଘରେ ଶୁଖିଲା ପଶୁଖାଦ୍ଯ଼ ଏବଂ ନଡ଼ିଆ ପ୍ରସ୍ତୁତ ରଖନ୍ତୁ |",
            "ଦଯ଼ା କରି ମଜା କରିବା ଏବଂ ଲାମ୍ବାଙ୍ଗ କରିବାର ଏକ ମାସ ପୂର୍ବରୁ ମେଣ୍ଢା ଏବଂ ଛେଳିଙ୍କୁ ସନ୍ତୁଳିତ ଏକାଗ୍ରତା ଦେବା ପାଇଁ ଫ୍ଲାଶିଂ ଅଭ୍ଯ଼ାସ ନିଶ୍ଚିତ କରନ୍ତୁ |"
         ]
      }
   },
   "date": "30-07-2024"
}