{
   "weather_details": {
      "31-07-2024": {
         "rainfall": 5,
         "t_max": 28,
         "t_min": 24,
         "rh_max": 88,
         "rh_min": 63,
         "wind_speed": 16,
         "wind_direction": 248,
         "cloud_cover": 8
      },
      "01-08-2024": {
         "rainfall": 10,
         "t_max": 27,
         "t_min": 24,
         "rh_max": 91,
         "rh_min": 74,
         "wind_speed": 18,
         "wind_direction": 257,
         "cloud_cover": 8
      },
      "02-08-2024": {
         "rainfall": 15,
         "t_max": 27,
         "t_min": 23,
         "rh_max": 88,
         "rh_min": 68,
         "wind_speed": 21,
         "wind_direction": 248,
         "cloud_cover": 8
      },
      "03-08-2024": {
         "rainfall": 15,
         "t_max": 29,
         "t_min": 24,
         "rh_max": 89,
         "rh_min": 76,
         "wind_speed": 18,
         "wind_direction": 248,
         "cloud_cover": 8
      },
      "04-08-2024": {
         "rainfall": 5,
         "t_max": 31,
         "t_min": 25,
         "rh_max": 90,
         "rh_min": 68,
         "wind_speed": 16,
         "wind_direction": 238,
         "cloud_cover": 8
      }
   },
   "names_of_crops": [
      "ଚାଉଳ",
      "ମକା",
      "କପା",
      "ପନିପରିବା ଫସଲ",
      "ପଶୁପାଳନ"
   ],
   "general_advisory": "ଆଇଏମଡିର ବର୍ଦ୍ଧିତ ରେଞ୍ଜ ପୂର୍ବାନୁମାନ ଅନୁଯାଯ଼ୀ, ବର୍ଷା ସ୍ୱାଭାବିକଠାରୁ ଅଧିକ, 04.08.2024 ରୁ 10.08.2024 ମଧ୍ଯ଼ରେ ଓଡ଼ିଶା ରାଜ୍ଯ଼ରେ ଉଭଯ଼ ସର୍ବାଧିକ ଏବଂ ସର୍ବନିମ୍ନ ତାପମାତ୍ରା ସ୍ୱାଭାବିକ ରହିବ ବୋଲି ଆଶା କରାଯାଉଛି। ଫସଲରେ ରୋଗ ଏବଂ କୀଟପତଙ୍ଗ ଆକ୍ରମଣ ବିରୁଦ୍ଧରେ ସତର୍କତା ଅବଲମ୍ବନ କରିବାକୁ କୃଷକମାନଙ୍କୁ ପରାମର୍ଶ ଦିଆଯାଇଛି।",
   "crops_data": {
      "rice": {
         "advisory": [
            "ଦିନ ବ୍ଯ଼ବଧାନରେ 7-10 ଦୁଇଥର କ୍ଷେତକୁ କାଦୁଅ କରି ଏବଂ ସମାନ ଫସଲ ଷ୍ଟାଣ୍ଡ ପାଇଁ ଜମି ସମତଳ କରି ମୁଖ୍ଯ଼ କ୍ଷେତ୍ର ଜମି ପ୍ରସ୍ତୁତି କରାଯିବା ଉଚିତ।",
            "ମୃତ୍ତିକା ଏବଂ ଧାନର ପ୍ରକାର ଆଧାରରେ ସାରର ସୁପାରିସ କରାଯାଇଥିବା ମୂଳ ମାତ୍ରା ପ୍ରଯ଼ୋଗ କରନ୍ତୁ।",
            "25-30 ଦିନର ପୁରୁଣା ଚାରା ରୋପଣ ସର୍ବୋତ୍ତମ ବ୍ଯ଼ବଧାନ ଏବଂ ଚାରା ସଂଖ୍ଯ଼ା ସହିତ ସଠିକ୍ ଭାବରେ କରାଯିବା ଉଚିତ୍ |",
            "ଶୁଷ୍କ ଋତୁରେ ଭବିଷ୍ଯ଼ତରେ ବ୍ଯ଼ବହାର ପାଇଁ ବର୍ଷା ଜଳକୁ ଗଚ୍ଛିତ ରଖନ୍ତୁ।"
         ]
      },
      "maize": {
         "advisory": [
            "ନିଡ଼ ନିଯ଼ନ୍ତ୍ରଣ ପାଇଁ ନିର୍ଦ୍ଦିଷ୍ଟ ବ୍ଯ଼ବଧାନରେ ହସ୍ତଚାଳିତ ହଏଇଂ କରନ୍ତୁ।",
            "ଆଗାମୀ ବର୍ଷା କାରଣରୁ ସିଞ୍ଚନ କାର୍ଯ୍ଯ଼ରେ ବିଳମ୍ବ କରନ୍ତୁ।",
            "ଆନ୍ତଃସାଂସ୍କୃତିକ କାର୍ଯ୍ଯ଼କଳାପ ସମ୍ବନ୍ଧରେ ଆବଶ୍ଯ଼କ ସତର୍କତା ଅବଲମ୍ବନ କରନ୍ତୁ।"
         ]
      },
      "cotton": {
         "advisory": [
            "କ୍ଷେତରେ ଉପଯୁକ୍ତ ଜଳ ନିଷ୍କାସନ ସୁନିଶ୍ଚିତ କରନ୍ତୁ ଏବଂ ନାଇଟ୍ରୋଜେନ୍ ସାର ପ୍ରଯ଼ୋଗରେ ବିଳମ୍ବ କରନ୍ତୁ।",
            "ସମ୍ଭାବ୍ଯ଼ ଅତିରିକ୍ତ ଜଳ ନିଷ୍କାସନ ପାଇଁ ପ୍ରସ୍ତୁତ ରୁହନ୍ତୁ।"
         ]
      },
      "vegetable crops": {
         "advisory": [
            "ଯଥେଷ୍ଟ ଜଳ ନିଷ୍କାସନ ସହିତ ଖରିଫ ପନିପରିବା ଫସଲ ପାଇଁ ଉଠାଯାଇଥିବା ଶଯ୍ଯ଼ା ନର୍ସରୀ ପ୍ରସ୍ତୁତି ଆରମ୍ଭ କରନ୍ତୁ।",
            "ପ୍ରବଳ ବର୍ଷା ସମଯ଼ରେ ରୋପଣ ଏବଂ ଆନ୍ତଃସାଂସ୍କୃତିକ କାର୍ଯ୍ଯ଼କଳାପରୁ ଦୂରେଇ ରୁହନ୍ତୁ।"
         ]
      },
      "animal husbandry": {
         "advisory": [
            "ସଂକ୍ରାମକ ରୋଗ ବିରୁଦ୍ଧରେ ପଶୁମାନଙ୍କର କୃମି ନିବାରଣ ଏବଂ ଟୀକାକରଣ ନିଶ୍ଚିତ କରନ୍ତୁ।",
            "ରୋଗ ବିସ୍ତାରକୁ ରୋକିବା ପାଇଁ ବର୍ଷା ଋତୁରେ ପଶୁମାନଙ୍କୁ ଆଶ୍ରଯ଼ ଦିଅନ୍ତୁ |",
            "ପଶୁମାନଙ୍କ ପାଇଁ ସ୍ୱଚ୍ଛ ପାନୀଯ଼ ଜଳ ଉତ୍ସ ସୁନିଶ୍ଚିତ କରିବା ଏବଂ ପ୍ରଦୂଷଣକୁ ରୋକିବା।"
         ]
      }
   },
   "date": "30-07-2024"
}