{
   "weather_details": {
      "31/07/2024": {
         "rainfall": 5,
         "t_max": 29,
         "t_min": 24,
         "rh_max": 92,
         "rh_min": 66,
         "wind_speed": 11,
         "wind_direction": 248,
         "cloud_cover": 7
      },
      "01/08/2024": {
         "rainfall": 15,
         "t_max": 29,
         "t_min": 23,
         "rh_max": 94,
         "rh_min": 76,
         "wind_speed": 11,
         "wind_direction": 248,
         "cloud_cover": 8
      },
      "02/08/2024": {
         "rainfall": 20,
         "t_max": 28,
         "t_min": 23,
         "rh_max": 93,
         "rh_min": 72,
         "wind_speed": 17,
         "wind_direction": 248,
         "cloud_cover": 8
      },
      "03/08/2024": {
         "rainfall": 6,
         "t_max": 30,
         "t_min": 24,
         "rh_max": 91,
         "rh_min": 85,
         "wind_speed": 16,
         "wind_direction": 225,
         "cloud_cover": 7
      },
      "04/08/2024": {
         "rainfall": 6,
         "t_max": 31,
         "t_min": 25,
         "rh_max": 93,
         "rh_min": 71,
         "wind_speed": 13,
         "wind_direction": 204,
         "cloud_cover": 7
      }
   },
   "names_of_crops": [
      "ଡାଲିଗୁଡ଼ିକ",
      "ଖରିଫ 2024 ଫସଲ ଯୋଜନା",
      "ଅରହର",
      "ଧାନ।",
      "ରାଗି।",
      "ମକା",
      "ଚିନାବାଦାମ",
      "ଅଦା।",
      "ହଳଦୀ",
      "ପନିପରିବା",
      "ଯ଼ାମ୍"
   ],
   "general_advisory": "ଖାଲି ଜମିରେ ଡାଲି ଭଳି ଅଣ-ଧାନ ଫସଲ ପାଇଁ ଯାଆନ୍ତୁ। କମ୍ ବର୍ଷା ହେତୁ ଧାନ କ୍ଷେତର ଯତ୍ନ ନିଅନ୍ତୁ।",
   "crops_data": {
      "pulses": {
         "advisory": [
            "ଏକ ଏକର ଗହମ ଏବଂ ଚଣା ଚାଷ ପାଇଁ 10 କିଲୋଗ୍ରାମ ମଞ୍ଜି ଆବଶ୍ଯ଼କ ହୋଇଥାଏ। ମଞ୍ଜି ଗୁଡ଼ିକୁ 20 ଗ୍ରାମ/କିଲୋଗ୍ରାମ ମଞ୍ଜି ଦେଇ ଚିକିତ୍ସା କରନ୍ତୁ। ସାତ ଦିନ ବୁଣିବା ପୂର୍ବରୁ କାର୍ବେଡାଜିମ୍ @2 ଗ୍ରାମ୍/କି. ଗ୍ରା. ମଞ୍ଜି ବ୍ଯ଼ବହାର କରନ୍ତୁ। ଭଲ କିସମଗୁଡ଼ିକ ହେଉଛି ଆଇପି-02-14, ଓଯ଼ୁଏମ-11-5, ପନ୍ତ-19, ପିଡିଏମ-54।"
         ]
      },
      "kharif 2024 crop planning": {
         "advisory": [
            "ଜମିର ପ୍ରକାର ଏବଂ ଉପଲବ୍ଧ ସମ୍ବଳ ଅନୁସାରେ କିସମର ଚଯ଼ନ କରନ୍ତୁ। 115-125 ଦିନର ସ୍ୱର୍ଣ୍ଣ ଶ୍ରେଯ଼ା ପରି ବିଭିନ୍ନତା | ଏହା ମରୁଡ଼ି ସହନଶୀଳ ଏବଂ ରୋଗ ଓ କୀଟପତଙ୍ଗ ପ୍ରତି ସହନଶୀଳ। ଏମ. ଟି. ଯ଼ୁ. 1156ର ଅବଧି 115ରୁ 120 ଦିନ। ଦୀର୍ଘକାଳୀନ କିସମ ଗୁଡ଼ିକ ହେଲା ପୂଜା, ଏମ୍ଟିଯ଼ୁ 7029, ପ୍ରତୀକ୍ଷା, ଏମ୍ଟିଯ଼ୁ 1075, କଳିଙ୍ଗ ଧନ 1203,1204,1205",
            "ନିଉ କାଲାଜିରା ଏବଂ କାଲାଜିରା, ନୁଆ ଆଚାରମତୀ ପରି ସୁଗନ୍ଧିତ ଧାନ। ତିନି ବର୍ଷ ପରେ ପ୍ରମାଣିତ ମଞ୍ଜି ବଦଳାନ୍ତୁ।",
            "ଯଦି ନିଜ ମଞ୍ଜି ବ୍ଯ଼ବହାର କରୁଛନ୍ତି, ବୁଣିବା ପୂର୍ବରୁ ଅଙ୍କୁରୋଦଗମ ପରୀକ୍ଷା କରନ୍ତୁ।",
            "ଯେଉଁ ଅଞ୍ଚଳରେ ବର୍ଷା ହୋଇଥାଏ, ସେହି ଅଞ୍ଚଳରେ ଧାନଚା ମଞ୍ଜି 10 କି. ଗ୍ରା./ଏ. ସି. ହାରରେ ବୁଣିବା ପାଇଁ ଯାଆନ୍ତୁ, ଯାହାକୁ ମୁଖ୍ଯ଼ ଖରିଫ ଫସଲ ଚାଷର 3 ସପ୍ତାହ ପୂର୍ବରୁ କ୍ଷେତରେ ଲଗାଇବା ଉଚିତ। ଏହା ମୃତ୍ତିକାକୁ ସ୍ଥିର କରିବ ଏବଂ ମୃତ୍ତିକାରେ ଜୈବିକ ପଦାର୍ଥ ଯୋଗ କରିବ।"
         ]
      },
      "arhar": {
         "advisory": [
            "ଉପସ୍-120, ଆଇ. ସି. ପି. ଏଲ୍. 86012, ପୁସା ଅରହର ଭଳି ଉନ୍ନତ ମାନର ଅରହର ମଞ୍ଜି ବାଛନ୍ତୁ। ସର୍ବଦା ଶୀଘ୍ରରୁ ମଧ୍ଯ଼ମ ଅବଧି ପାଇଁ ଅରହର ଯାଆନ୍ତୁ।"
         ]
      },
      "paddy": {
         "advisory": [
            "ଏକର ଧାନ ରୋପଣ ପାଇଁ ଆବଶ୍ଯ଼କ ଜମିର 10 ଦଶମିକ ଆକାରର ଏକ ଭଲ ଚାଷ ହୋଇଥିବା ଶୁଖିଲା ଶଯ୍ଯ଼ା ପ୍ରସ୍ତୁତ କରନ୍ତୁ। ବିଛଣା ମଧ୍ଯ଼ରେ 1 ଫୁଟ ବ୍ଯ଼ବଧାନ ରଖି ଜମି ଅନୁସାରେ 3 ଫୁଟ ଚଉଡ଼ା, 6 ଇଞ୍ଚ ଉଚ୍ଚତା ଏବଂ ଲମ୍ବ ବିଶିଷ୍ଟ ଶଯ୍ଯ଼ା ପ୍ରସ୍ତୁତ କରାଯାଇଥାଏ। ଶଯ୍ଯ଼ାରେ ଏଫ. ୱାଇ. ଏମ୍. ର 40ଟି ଝୁଡ଼ି ମିଶାଯାଏ। 20 କି. ଗ୍ରା. ମଞ୍ଜି 10 ଦଶମାଂଶ ବିଶିଷ୍ଟ ଧାଡ଼ିରେ ବୁଣି ମାଟି ଦ୍ୱାରା ଆଚ୍ଛାଦିତ କରନ୍ତୁ। ଧାନ ଚାରା 15 ଦିନ ପୁରୁଣା, 10 ଦଶମିକ କ୍ଷେତ୍ର ପାଇଁ 4 କେଜି ଯ଼ୁରିଆ ଲଗାନ୍ତୁ। କ୍ଷେତ ପ୍ରସ୍ତୁତ କରିବା ପାଇଁ ଯାଆନ୍ତୁ ଏବଂ କ୍ଷେତ ଏବଂ ବନ୍ଧର ସମସ୍ତ ମୂଷା ଛିଦ୍ର ଏବଂ ଅନ୍ଯ଼ାନ୍ଯ଼ ଛିଦ୍ରକୁ ବନ୍ଦ କରନ୍ତୁ ଏବଂ କ୍ଷେତ ପ୍ରସ୍ତୁତି ପାଇଁ ବର୍ଷା ଜଳ ସଞ୍ଚଯ଼ କରନ୍ତୁ |"
         ]
      },
      "ragi": {
         "advisory": [
            "ଅର୍ଜୁନ, କଲୁଆ, ଶ୍ରୀପ୍ରବ ଭଳି ଭଲ କିସମ ପ୍ରତି ଏସି 4 କି. ଗ୍ରା. ରେ ବାଛନ୍ତୁ। ଭଲ ବର୍ଷା ହେବା ପରେ, ଜମି ପ୍ରସ୍ତୁତ କରନ୍ତୁ ଏବଂ ହଳ ପଛରେ ରାଗି ମଞ୍ଜି ବୁଣନ୍ତୁ। 21 ଦିନ ପୁରୁଣା ରାଗି ଚାରା ରୋପଣ କରନ୍ତୁ।"
         ]
      },
      "maize": {
         "advisory": [
            "ଆନ୍ତଃ ଚାଷ ପାଇଁ ଯାଆନ୍ତୁ ଏବଂ 3-4 ସପ୍ତାହ ପର୍ଯ୍ଯ଼ାଯ଼ରେ ଏକର ପିଛା 16 କିଲୋଗ୍ରାମ ନାଇଟ୍ରୋଜେନ୍ ପ୍ରଯ଼ୋଗ କରନ୍ତୁ। 7-8 ସପ୍ତାହ ପର୍ଯ୍ଯ଼ାଯ଼ରେ ଏକର ପିଛା 8 କିଲୋଗ୍ରାମ ନାଇଟ୍ରୋଜେନ୍ ଲଗାନ୍ତୁ।"
         ]
      },
      "groundnut": {
         "advisory": [
            "ଧରଣୀ, ସ୍ମୃତି, କଦ୍ରି-6, କଳିଙ୍ଗ ଚିନାବାଦାମ ଭଳି ଭଲ କିସମ ପ୍ରତି ଏକରରେ 75 କିଲୋଗ୍ରାମ ଫଳି ବାଛନ୍ତୁ। ଭିଟାବ୍ଯ଼ାକ୍ସ ପାୱାର @2 ଗ୍ରାମ/କିଲୋଗ୍ରାମ ମଞ୍ଜି ସହିତ ମଞ୍ଜିଗୁଡ଼ିକୁ ଚିକିତ୍ସା କରନ୍ତୁ। ବୁଣିବାର ମାତ୍ର ଏକ ଘଣ୍ଟା ପୂର୍ବରୁ 20 ଗ୍ରାମ୍/କି. ଗ୍ରା. ମଞ୍ଜି ସହିତ ରାଇଜୋବିଯ଼ମ୍ ସଂସ୍କୃତି ସହିତ ଉପଚାର କରନ୍ତୁ। ଚୂଡ଼ାନ୍ତ ଜମି ପ୍ରସ୍ତୁତି ସମଯ଼ରେ ଏକର ପିଛା 2 ଟନ ଏଫ. ୱାଇ. ଏମ., 1 କ୍ଯ଼ୁ. ଗିସୁଫୁମ ସହିତ <ଆଇ. ଡି. 1> କେ. ଜି. ଏନ. ପି. କେ. ପ୍ରଯ଼ୋଗ କରନ୍ତୁ। ଏହାର ବ୍ଯ଼ବଧାନ ହେଉଛି 30 x 10 ସେ. ମି.।"
         ]
      },
      "ginger": {
         "advisory": [
            "କ୍ଷେତରୁ ଅତିରିକ୍ତ ପାଣି ବାହାର କରନ୍ତୁ।"
         ]
      },
      "turmeric": {
         "advisory": [
            "କ୍ଷେତରୁ ଅତିରିକ୍ତ ପାଣି ବାହାର କରନ୍ତୁ।"
         ]
      },
      "vegetables": {
         "advisory": [
            "ବାଇଗଣ ଫଳ ଏବଂ ଶୁଟ୍ ବୋରର୍ କ୍ଷେତ୍ରରେ 8 ଟି ଫେରୋମୋନ୍ ଟ୍ରାପ୍ ବ୍ଯ଼ବହାର କରନ୍ତୁ କିମ୍ବା 10-15 ଦିନ ବ୍ଯ଼ବଧାନରେ ଦୁଇଥର ନିମ୍-ଆଧାରିତ କୀଟନାଶକ ଲଗାନ୍ତୁ | ଫୁଲକୋବି ପରି ଅଫ ସିଜନ ପନିପରିବା ପାଇଁ ଯାଆନ୍ତୁ, ମୁଖ୍ଯ଼ କ୍ଷେତରେ ଚାରା ରୋପଣ କରନ୍ତୁ |"
         ]
      },
      "yam": {
         "advisory": [
            "ବୀଜ ହାର ହେଉଛି 8-10 q/ac। ବୀଜ ସାମଗ୍ରୀ 150-200 g ର ହେବା ଉଚିତ | ଭଲ ଭାବରେ ଦଳି ହୋଇଥିବା କ୍ଷେତ୍ର ପ୍ରସ୍ତୁତ କରନ୍ତୁ ଏବଂ 3 ଫୁଟ x 3 ଫୁଟ ଏବଂ 1.5ft ଗଭୀରତାର ଗର୍ତ୍ତ ତିଆରି କରନ୍ତୁ | ରୋପଣ ପରେ ଗର୍ତ୍ତଗୁଡ଼ିକୁ ସମାନ ପରିମାଣର ଏଫ. ୱାଇ. ଏମ୍. ଏବଂ ଉପର ମୃତ୍ତିକାରେ ଭର୍ତ୍ତି କରାଯିବା ଉଚିତ।"
         ]
      }
   },
   "date": "30-07-2024"
}