{
   "weather_details": {
      "31-07-2024": {
         "rainfall": 20,
         "t_max": 31,
         "t_min": 24,
         "rh_max": 82,
         "rh_min": 59,
         "wind_speed": 13,
         "wind_direction": 202,
         "cloud_cover": 8
      },
      "01-08-2024": {
         "rainfall": 25,
         "t_max": 29,
         "t_min": 24,
         "rh_max": 87,
         "rh_min": 64,
         "wind_speed": 9,
         "wind_direction": 259,
         "cloud_cover": 8
      },
      "02-08-2024": {
         "rainfall": 15,
         "t_max": 29,
         "t_min": 25,
         "rh_max": 81,
         "rh_min": 73,
         "wind_speed": 18,
         "wind_direction": 248,
         "cloud_cover": 8
      },
      "03-08-2024": {
         "rainfall": 10,
         "t_max": 30,
         "t_min": 25,
         "rh_max": 81,
         "rh_min": 64,
         "wind_speed": 18,
         "wind_direction": 225,
         "cloud_cover": 8
      },
      "04-08-2024": {
         "rainfall": 5,
         "t_max": 31,
         "t_min": 26,
         "rh_max": 80,
         "rh_min": 63,
         "wind_speed": 17,
         "wind_direction": 212,
         "cloud_cover": 7
      }
   },
   "names_of_crops": [
      "ଚାଉଳ",
      "ଝୋଟ",
      "ଆଖୁ",
      "ପନିପରିବା",
      "ମତ୍ସ୍ଯ଼ଚାଷ"
   ],
   "general_advisory": "ନିକଟରେ ହୋଇଥିବା ବର୍ଷାକୁ ବ୍ଯ଼ବହାର କରି ସିଧାସଳଖ ବିହନ ବୁଣାଯାଇଥିବା ଚାଉଳରେ ବିଉଶନିଂ ସମ୍ପୂର୍ଣ୍ଣ କରାଯିବା ଉଚିତ ଏବଂ କ୍ଷେତରେ ପାଣିର ଏକ ପତଳା ସ୍ତର ବଜାଯ଼ ରଖିବା ଉଚିତ। ଆଗାମୀ ଦିନରେ ଭଲ ପରିମାଣର ବର୍ଷା ହେବାର ସମ୍ଭାବନା ଥିବାରୁ ବର୍ଷା ଜଳ/କେନାଲ ଜଳ/ପୋଖରୀ ବ୍ଯ଼ବହାର କରି ଧାନ ରୋପଣ ଜାରି ରଖିବାକୁ କୃଷକମାନଙ୍କୁ ପରାମର୍ଶ ଦିଆଯାଇଛି। ଧାନ ନର୍ସରୀ ଏବଂ ଝୋଟ କ୍ଷେତରୁ ଅତିରିକ୍ତ ପାଣି ବାହାର କରନ୍ତୁ।",
   "crops_data": {
      "rice": {
         "advisory": [
            "ପ୍ରତ୍ଯାଶିତ ବର୍ଷାକୁ ଦୃଷ୍ଟିରେ ରଖି କୃଷକମାନେ ନର୍ସରୀ ଚିକିତ୍ସା ପରେ କାର୍ଟାପ୍ ହାଇଡ୍ରୋକ୍ଲୋରାଇଡ୍ (4ଜି) କିମ୍ବା ଫିପ୍ରୋନିଲ୍ 0.3 ଗ୍ରାମ୍ ପରି ଗ୍ରାନୁଲାର କୀଟନାଶକ ସହିତ ଧାନ ରୋପଣ ଆରମ୍ଭ କରିବା ଉଚିତ୍। ଉପଯୁକ୍ତ ବ୍ଯ଼ବଧାନ ସହିତ ଅଗଭୀର ଗଭୀରତାରେ 2 ରୁ 3 ଟି ଚାରା/ପାହାଡ ରୋପଣ କରନ୍ତୁ | ପ୍ରତିରୋପଣର 3 ରୁ 4 ଦିନ ପରେ ପ୍ରାକ-ଉତ୍ଥାନ ୱେଡିସାଇଡ୍ ପ୍ରଯ଼ୋଗ କରନ୍ତୁ |"
         ]
      },
      "jute": {
         "advisory": [
            "କ୍ଷେତରେ ଅତ୍ଯ଼ଧିକ ପାଣି ଝୋଟ୍ର ଗୁଣବତ୍ତା ହ୍ରାସ କରିଥାଏ। କ୍ଷେତରୁ ଅତିରିକ୍ତ ପାଣି ବାହାର କରନ୍ତୁ। ବୃଦ୍ଧି ବଢ଼ାଇବା ପାଇଁ ଆନ୍ତଃ-ଫସଲ ସମଯ଼ରେ ଶାଖାଗୁଡ଼ିକୁ କାଟି ଦିଅନ୍ତୁ। ସାମ୍ପ୍ରତିକ ବର୍ଷା ଝୋଟରେ ଆଗାଛା ସଂଖ୍ଯ଼ା ବୃଦ୍ଧି କରିବ, ଉପଯୁକ୍ତ ତୃଣନାଶକ ପ୍ରଯ଼ୋଗ କରିବ | ବର୍ଷା ପାଗ କୀଟପତଙ୍ଗ ପାଇଁ ଅନୁକୂଳ, ସେମାନଙ୍କୁ ସୁପାରିଶ କରାଯାଇଥିବା କୀଟନାଶକ ଦ୍ୱାରା ନିଯ଼ନ୍ତ୍ରଣ କରନ୍ତୁ।"
         ]
      },
      "sugarcane": {
         "advisory": [
            "ପ୍ରଭାବିତ ଛେଦକ ଟିଲର୍ ଏବଂ ବିଳମ୍ବରେ ଗଠିତ ଟିଲର୍ଗୁଡ଼ିକୁ ବାହାର କରିଦିଅନ୍ତୁ। ବେତ ଗୁଡ଼ିକୁ ଏକାଠି ବାନ୍ଧି ଦିଅନ୍ତୁ। ପ୍ରାରମ୍ଭିକ ସଟ ବୋରରକୁ ନିଯ଼ନ୍ତ୍ରଣ କରିବା ପାଇଁ ପତ୍ର ସ୍ପ୍ରେ ବ୍ଯ଼ବହାର କରନ୍ତୁ।"
         ]
      },
      "vegetables": {
         "advisory": [
            "କ୍ଷେତରୁ ପାଣି ବାହାର କରିଦିଅନ୍ତୁ, ଯାହାଦ୍ୱାରା ପାଣି ଶୁଖିଯିବ। କୀଟପତଙ୍ଗ ନିଯ଼ନ୍ତ୍ରଣ ପାଇଁ ଉପଯୁକ୍ତ କୀଟନାଶକ ଏବଂ କବକନାଶକ ବ୍ଯ଼ବହାର କରନ୍ତୁ।",
            "ବାଇଗଣ ଏବଂ ଓକ୍ରାରେ ଫଳ ଏବଂ ଅଙ୍କୁର ଛେଦକକୁ ନିଯ଼ନ୍ତ୍ରଣ କରିବା ପାଇଁ, ନିମ ଆଧାରିତ କୀଟନାଶକ ଏବଂ ବିକଳ୍ପ ସ୍ପ୍ରେ ବ୍ଯ଼ବହାର କରନ୍ତୁ।"
         ]
      },
      "pisciculture": {
         "advisory": [
            "ଉନ୍ନତ ଅଭିବୃଦ୍ଧି ପାଇଁ ସୁପାରିସ କରାଯାଇଥିବା ଅନୁପାତରେ ଷ୍ଟକ୍ କାର୍ପ। ଲାଭ ବଢ଼ାଇବା ପାଇଁ ନିର୍ଦ୍ଦିଷ୍ଟ ଖାଦ୍ଯ଼ ଏବଂ ସପ୍ଲିମେଣ୍ଟ ବ୍ଯ଼ବହାର କରନ୍ତୁ। ସାଧାରଣ ରୋଗ ବିରୁଦ୍ଧରେ ପଶୁମାନଙ୍କୁ ଟୀକାକରଣ କରନ୍ତୁ।"
         ]
      }
   },
   "date": "30-07-2024"
}