{
   "weather_details": {
      "01-02-2025": {
         "rainfall": 0,
         "t_max": 31,
         "t_min": 18,
         "rh_max": 94,
         "rh_min": 35,
         "wind_speed": 1,
         "wind_direction": 315,
         "cloud_cover": 3
      },
      "02-02-2025": {
         "rainfall": 0,
         "t_max": 31,
         "t_min": 18,
         "rh_max": 93,
         "rh_min": 33,
         "wind_speed": 1,
         "wind_direction": 154,
         "cloud_cover": 3
      },
      "03-02-2025": {
         "rainfall": 0,
         "t_max": 32,
         "t_min": 17,
         "rh_max": 83,
         "rh_min": 27,
         "wind_speed": 2,
         "wind_direction": 321,
         "cloud_cover": 2
      },
      "04-02-2025": {
         "rainfall": 0,
         "t_max": 32,
         "t_min": 17,
         "rh_max": 79,
         "rh_min": 29,
         "wind_speed": 3,
         "wind_direction": 90,
         "cloud_cover": 3
      },
      "05-02-2025": {
         "rainfall": 0,
         "t_max": 32,
         "t_min": 17,
         "rh_max": 75,
         "rh_min": 26,
         "wind_speed": 1,
         "wind_direction": 342,
         "cloud_cover": 2
      }
   },
   "names_of_crops": [
      "ସୋରିଷ",
      "ତୋରିଆ",
      "ଅଳସୀ",
      "ଚଣା",
      "ଟମାଟୋ",
      "ଧନିଆ",
      "ମଟର",
      "ଲଙ୍କା",
      "ଆଳୁ",
      "ଫୁଲକୋବି"
   ],
   "general_advisory": "ଅମଳ ପରେ ଫସଲର ମୂଲ୍ୟ ବୃଦ୍ଧି ଗୁରୁତ୍ୱପୂର୍ଣ୍ଣ। ଟମାଟୋ ସସ୍, ଆଳୁ ଚିପ୍ସ୍, ଫୁଲକୋବି ଚିପ୍ସ୍, ଆଚାର ଇତ୍ୟାଦି ତିଆରି କରନ୍ତୁ ଯାହା ସ୍ୱାଭାବିକଠାରୁ ଅଧିକ ଆୟ ଆକର୍ଷିତ କରିବ | ଏଫିଡ୍, ଜ୍ଯାସିଡ୍ ଏବଂ ହ୍ୱାଇଟ୍ଫ୍ଲାଇ ସଂକ୍ରମଣ ହ୍ରାସ କରିବା ପାଇଁ ସକାଳ ଏବଂ ସନ୍ଧ୍ୟା ସମୟରେ ଇମିଡାକ୍ଲୋପ୍ରିଡ୍ ଏବଂ ଡାଇମେଥୋଏଟ୍ ସ୍ପ୍ରେ କରନ୍ତୁ | କ୍ଷେତରୁ ଆଗାଛା ବାହାର କରି ଫସଲକୁ ଜଳସେଚନ କରନ୍ତୁ।",
   "crops_data": {
      "mustard": {
         "advisory": [
            "ସୋରିଷ ଗଛ ପ୍ରାୟ ଶାରୀରିକ ପରିପକ୍ୱତା ପର୍ଯ୍ୟାୟରେ ପହଞ୍ଚିଛି। ଜଳସେଚନକୁ ସୀମିତ କରନ୍ତୁ। ଯଦି ଗଛଗୁଡ଼ିକ ତଳେ ପଡ଼ି ରହିଛି, ତେବେ ସୁନିଶ୍ଚିତ କରନ୍ତୁ ଯେ ସିଲିକା ମୃତ୍ତିକାକୁ ସ୍ପର୍ଶ କରୁନାହିଁ, ଯାହାଦ୍ୱାରା ସଡ଼ିବା ଏବଂ କ୍ଷୟ ହେବା ରୋକାଯାଇପାରିବ। ଇମାମେକ୍ଟିନ୍ ବେନ୍ଜୋଏଟ୍ 4 ପ୍ରତିଶତ ଏସ୍ଜି @5 ଗ୍ରାମ୍/10 ଲିଟର ପାଣି ସ୍ପ୍ରେ କରନ୍ତୁ। ଏଫିଡ୍ସର ଗୁରୁତର ସଂକ୍ରମଣ କ୍ଷେତ୍ରରେ, ଇମିଡାକ୍ଲୋପ୍ରିଡ୍ କିମ୍ବା ଡାଇମେଥୋଏଟ୍ @2 ମିଲି/ଲିଟର ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "toria": {
         "advisory": [
            "ସୋରିଷ ଗଛ ପ୍ରାୟ ଶାରୀରିକ ପରିପକ୍ୱତା ପର୍ଯ୍ୟାୟରେ ପହଞ୍ଚିଛି। ଜଳସେଚନକୁ ସୀମିତ କରନ୍ତୁ। ଯଦି ଗଛଗୁଡ଼ିକ ତଳେ ପଡ଼ି ରହିଛି, ତେବେ ସୁନିଶ୍ଚିତ କରନ୍ତୁ ଯେ ସିଲିକା ମୃତ୍ତିକାକୁ ସ୍ପର୍ଶ କରୁନାହିଁ, ଯାହାଦ୍ୱାରା ସଡ଼ିବା ଏବଂ କ୍ଷୟ ହେବା ରୋକାଯାଇପାରିବ। ଇମାମେକ୍ଟିନ୍ ବେନ୍ଜୋଏଟ୍ 4 ପ୍ରତିଶତ ଏସ୍ଜି @5 ଗ୍ରାମ୍/10 ଲିଟର ପାଣି ସ୍ପ୍ରେ କରନ୍ତୁ। ଏଫିଡ୍ସର ଗୁରୁତର ସଂକ୍ରମଣ କ୍ଷେତ୍ରରେ, ଇମିଡାକ୍ଲୋପ୍ରିଡ୍ କିମ୍ବା ଡାଇମେଥୋଏଟ୍ @2 ମିଲି/ଲିଟର ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "linseed": {
         "advisory": [
            "ଯଦି ସମ୍ଭବ, ଫଳ ତିଆରି ସମୟରେ ଗୋଟିଏ ଜଳସେଚନ ବ୍ୟବସ୍ଥା କରାଯାଇପାରିବ। କ୍ଷେତରୁ କୌଣସି ଘାସ ବାହାର କରନ୍ତୁ। ହ୍ୱାଇଟ୍ଫ୍ଲାଇ, ଏଫିଡ୍ ଗୁଡ଼ିକୁ ଡାଇମେଥୋଏଟ୍ 30 ଇସି @2 ମିଲି/ଲିଟର ସିଞ୍ଚନ ଦ୍ୱାରା ପରିଚାଳନା କରାଯାଇପାରିବ।"
         ]
      },
      "chickpea": {
         "advisory": [
            "ଶୁଆ ଆରମ୍ଭ କିମ୍ବା ବିକାଶ ପର୍ଯ୍ୟାୟରେ ଜଳସେଚନ ପ୍ରଦାନ କରନ୍ତୁ। କ୍ଷେତରେ କଟୱର୍ମ ସଂକ୍ରମଣ ଦେଖିବାକୁ ମିଳିପାରେ। ଚଣା ଉପରେ ମିଥାଇଲ ପାରାଥିଅନକୁ 1 ମିଲି/ଲିଟରରେ ସିଞ୍ଚନ ଦ୍ୱାରା କଟୱର୍ମକୁ ନିୟନ୍ତ୍ରଣ କରାଯାଇପାରିବ। ବୁଟରେ ପାଉଡର ଫଙ୍ଗସ୍ ସାମ୍ପ୍ରତିକ ସମୟରେ ଏକ ପ୍ରମୁଖ ସମସ୍ୟା। ଏହାକୁ ପରିଚାଳନା କରିବା ପାଇଁ, ଆର୍ଦ୍ର ସଲଫର୍ ପାଉଡର କିମ୍ବା କପର୍ ଅକ୍ସିକ୍ଲୋରାଇଡ୍ @2 ମିଲି/ଲିଟର ଫସଲ ଉପରେ ସ୍ପ୍ରେ କରାଯାଇପାରିବ। ଭଲ ଫଳାଫଳ ପାଇଁ 7 ଦିନ ପରେ ଏହାକୁ ପୁନରାବୃତ୍ତି କରନ୍ତୁ। ଶୁଖିଲା ଗଛ କିମ୍ବା ନଷ୍ଟ ହୋଇଯାଇଥିବା ପତ୍ରକୁ ଗଛରୁ ବାହାର କରିଦେବା ଉଚିତ। ଦୀପର ସଂକ୍ରମଣକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ, କ୍ଲୋରୋପାଇରିଫୋସ୍ କିମ୍ବା ଇମିଡାକ୍ଲୋପ୍ରିଡ୍ @4 ମିଲି/10ଲିଟ୍ ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "tomato": {
         "advisory": [
            "ଟମାଟୋ ଚାଷ ପାଇଁ 6ରୁ 7 ଦିନ ବ୍ୟବଧାନରେ ଜଳସେଚନ କରନ୍ତୁ। ଫଳକୁ ମାଟି ସହିତ ସ୍ପର୍ଶ ନକରିବା ପ୍ରତି ସତର୍କ ରୁହନ୍ତୁ ଏବଂ ଗଛ ଲଗାଇବା କ୍ଷେତ୍ରରେ ଷ୍ଟେକିଂ ପ୍ରଦାନ କରନ୍ତୁ | ଶ୍ୱେତ ମାଛି ସଂକ୍ରମଣକୁ ପରିଚାଳନା କରିବା ପାଇଁ ଏସିଟାମିପ୍ରିଡ୍ 20 ଏସ. ପି. @0.5 ଗ୍ରାମ/ଏଲ. ଟି. କିମ୍ବା ପ୍ରୋଫେନୋଫସ୍ @1 ମିଲି/ଏଲ. ଟି. ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "coriander": {
         "advisory": [
            "ଫସଲକୁ ହାଲୁକା ଏବଂ ବାରମ୍ବାର ଜଳସେଚନ ପ୍ରଦାନ କରନ୍ତୁ। ପରିପକ୍ୱ ଗଛଗୁଡ଼ିକୁ ମୂଳୋତ୍ପାଟନ କରି ଅମଳ କରନ୍ତୁ। ଧନିଆ ଗଛର ବଣ୍ଡଲ୍ ତିଆରି କରି ବଜାରରେ ବିକ୍ରି କରନ୍ତୁ।"
         ]
      },
      "pea": {
         "advisory": [
            "ମଟରରେ ପୋଡ୍ ବୋରର୍ ଫୁଲ ଏବଂ ଶୁଣ୍ଢରେ ବୋରିଂ କରି ଫଳକୁ ବହୁତ କ୍ଷତି ପହଞ୍ଚାଇଥାଏ | ସମାନ ସ୍ପ୍ରେ ପରିଚାଳନା କରିବା ପାଇଁ ଇମାମେକ୍ଟିନ୍ ବେନ୍ଜୋଏଟ୍ 4 ପ୍ରତିଶତ ଏସ୍ଜି @5ଜି/10ଲିଟ୍ କିମ୍ବା କ୍ଲୋରୋପାଇରିଫସ୍ @1 ମିଲି/ଲିଟ୍। ପାଉଡର ଫଙ୍ଗୁର ପରିଚାଳନା ପାଇଁ, କାରାଥାନେ 40 ଇସି @1 ମିଲି/ଲିଟର ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "chilli": {
         "advisory": [
            "ପରିପକ୍ୱ ଲଙ୍କା ଅମଳ କରନ୍ତୁ। କ୍ଷେତରେ ଧନିଆ ପତ୍ର ଦେଖିବାକୁ ମିଳିଥାଏ। ଯଦି ଏହା ଘଟେ ତେବେ ଡାଇମେଥୋଏଟ୍ @2 ମିଲି/ଲିଟର ସ୍ପ୍ରେ କରନ୍ତୁ। କ୍ଷେତରେ ଏଫିଡ୍ ଏବଂ ଜ୍ଯାସିଡ୍ ସଂକ୍ରମଣ ଦେଖାଯାଇପାରେ | ଏହାକୁ ପରିଚାଳନା କରିବା ପାଇଁ ଇମିଡାକ୍ଲୋପ୍ରିଡ୍ 17.8% ଏସଏଲ @1 ମିଲି/ଲିଟର ସ୍ପ୍ରେ କରନ୍ତୁ। ଅମଳ ହୋଇଥିବା ଲଙ୍କାକୁ ଲଙ୍କା ଆଚାର ପ୍ରସ୍ତୁତ କରି ମୂଲ୍ୟଯୁକ୍ତ କରାଯାଇପାରିବ। ଲଙ୍କା ଆଚାରକୁ କଞ୍ଚା ବିକ୍ରି କରିବା ପରିବର୍ତ୍ତେ ଅଧିକ ଆୟ ମିଳିପାରିବ।"
         ]
      },
      "potato": {
         "advisory": [
            "ସିଧାସଳଖ ସୂର୍ଯ୍ୟକିରଣ ସଂସ୍ପର୍ଶରେ ନ ଆସିବା ପାଇଁ ଆଳୁରେ ମୃତ୍ତିକା ଉତ୍ତୋଳନ କରିବା ଆବଶ୍ୟକ। ଯଦି କ୍ଷେତରେ ଶୁଷ୍କତା ଦେଖାଯାଏ, ତେବେ ବ୍ଲିଟକ୍ସ-50 @45 ଗ୍ରାମ + ଷ୍ଟେପ୍ଟୋସାଇକ୍ଲିନ @2 ଗ୍ରାମକୁ 10 ଲିଟର ପାଣିରେ ଭିଜାଇ ଦିଅନ୍ତୁ।"
         ]
      },
      "cauliflower": {
         "advisory": [
            "ଫୁଲକୋବି ପରିପକ୍ୱ ହେବା ପରେ ତାକୁ ଅମଳ କରନ୍ତୁ। ସିଧାସଳଖ ସୂର୍ଯ୍ୟକିରଣରେ ଫୁଲକୁ ଉନ୍ମୁକ୍ତ କରନ୍ତୁ ନାହିଁ କାରଣ ଏହା ଫୁଲର ମୁଣ୍ଡକୁ ବାଧା ଦେଇପାରେ | ଏହାକୁ ଫୁଲକୋବି ପତ୍ରରେ ଢାଙ୍କି ଦିଅନ୍ତୁ। ଏହାକୁ ଉତ୍ତମ ଗୁଣବତ୍ତାରେ ରଖିବା ପାଇଁ ଆଗାଛା କାଟିବା ଏବଂ ଜଳସେଚନ ଗୁରୁତ୍ୱପୂର୍ଣ୍ଣ।"
         ]
      }
   },
   "date": "31-01-2025"
}