{
   "weather_details": {
      "01-02-2025": {
         "rainfall": 0,
         "t_max": 34,
         "t_min": 18,
         "rh_max": 64,
         "rh_min": 24,
         "wind_speed": 2,
         "wind_direction": 207,
         "cloud_cover": 1
      },
      "02-02-2025": {
         "rainfall": 0,
         "t_max": 34,
         "t_min": 18,
         "rh_max": 67,
         "rh_min": 21,
         "wind_speed": 2,
         "wind_direction": 202,
         "cloud_cover": 1
      },
      "03-02-2025": {
         "rainfall": 0,
         "t_max": 34,
         "t_min": 19,
         "rh_max": 55,
         "rh_min": 20,
         "wind_speed": 1,
         "wind_direction": 0,
         "cloud_cover": 2
      },
      "04-02-2025": {
         "rainfall": 0,
         "t_max": 33,
         "t_min": 19,
         "rh_max": 57,
         "rh_min": 22,
         "wind_speed": 2,
         "wind_direction": 63,
         "cloud_cover": 3
      },
      "05-02-2025": {
         "rainfall": 0,
         "t_max": 33,
         "t_min": 18,
         "rh_max": 51,
         "rh_min": 22,
         "wind_speed": 4,
         "wind_direction": 79,
         "cloud_cover": 2
      }
   },
   "names_of_crops": [
      "ଶୁଖିଲା ଋତୁ ଚାଉଳ",
      "ସବୁଜ ଚଣା",
      "କଳା ଚଣା",
      "ଆମ୍ବ",
      "ପନିପରିବା ଫସଲ",
      "ପଶୁପାଳନ"
   ],
   "general_advisory": "ବର୍ଦ୍ଧିତ ରେଞ୍ଜ ପୂର୍ବାନୁମାନ ଅନୁଯାୟୀ, ଓଡ଼ିଶାର ଜିଲ୍ଲାଗୁଡ଼ିକରେ ଶୁଖିଲା ପାଗ ହେବାର ସମ୍ଭାବନା ରହିଛି। ଜଳସେଚନ କରିବା, ସିଞ୍ଚନ କାର୍ଯ୍ୟ କରିବା, କ୍ଷେତକୁ ଆଗାଛାରୁ ମୁକ୍ତ ରଖିବା ଏବଂ ଫସଲ ତଥା ପଶୁଙ୍କ ସ୍ୱାସ୍ଥ୍ୟ ପାଇଁ ତାପମାତ୍ରା ସ୍ଥିତି ଉପରେ ନଜର ରଖିବା ପାଇଁ କୃଷକମାନଙ୍କୁ ପରାମର୍ଶ ଦିଆଯାଇଛି।",
   "crops_data": {
      "dry season rice": {
         "advisory": [
            "3ରୁ 5 ସପ୍ତାହ ପୁରୁଣା ଚାରା ଗୁଡ଼ିକୁ ଉପଯୁକ୍ତ ବ୍ୟବଧାନରେ, ଉପଯୁକ୍ତ ଉର୍ବରତା ସହିତ, ଭଲ ଭାବେ ଜମା ହୋଇଥିବା ମାଟିରେ ରୋପଣ କରିବା।",
            "ଫସଲର ସ୍ୱାସ୍ଥ୍ୟ ସୁନିଶ୍ଚିତ କରିବା ପାଇଁ ରୋପଣ ପରେ ଆଗାଛା ପରିଚାଳନା ରଣନୀତି କାର୍ଯ୍ୟକାରୀ କରନ୍ତୁ।",
            "ଫେରୋମୋନ୍ ଫାନ୍ଦ ଏବଂ ସୁପାରିସ କରାଯାଇଥିବା କୀଟନାଶକ ବ୍ୟବହାର କରି କୀଟପତଙ୍ଗ ଉପରେ ନଜର ରଖନ୍ତୁ ଏବଂ ନିୟନ୍ତ୍ରଣ କରନ୍ତୁ।"
         ]
      },
      "green gram": {
         "advisory": [
            "ଶୋଷକ କୀଟପତଙ୍ଗକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ ଏକର ପିଛା ହଳଦିଆ ଚଟପଟା ଜାଲ ବ୍ୟବହାର କରନ୍ତୁ।",
            "ବନସ୍ପତି ଅବସ୍ଥାରେ କୀଟ ନିୟନ୍ତ୍ରଣ ପାଇଁ ନିମ୍ବ ତେଲ ଲଗାନ୍ତୁ।",
            "ଫୁଲ ଫୁଟିବା ସମୟରେ କୀଟନାଶକ ପ୍ରୟୋଗରୁ ଦୂରେଇ ରୁହନ୍ତୁ।"
         ]
      },
      "black gram": {
         "advisory": [
            "ବୃଦ୍ଧିର ଉପଯୁକ୍ତ ପର୍ଯ୍ୟାୟରେ ସବୁଜ ଚଣା ପରି କୀଟ ନିୟନ୍ତ୍ରଣ ପଦକ୍ଷେପ କାର୍ଯ୍ୟକାରୀ କରନ୍ତୁ |"
         ]
      },
      "mango": {
         "advisory": [
            "ପଲିଥିନ୍ କିମ୍ବା ଆଲ୍କାଥେନ୍ ଶୀଟ୍ ରାପିଙ୍ଗ୍ ବ୍ୟବହାର କରି ଆମ୍ବ ଗଛକୁ ମିଳି ବଗ୍ରୁ ରକ୍ଷା କରନ୍ତୁ |",
            "ଫଙ୍ଗସ୍ ସଂକ୍ରମଣକୁ ପରିଚାଳନା କରିବା ପାଇଁ ରୋଗାକ୍ରାନ୍ତ ଶାଖା ଏବଂ ପତ୍ର କାଟି ଦିଅନ୍ତୁ।"
         ]
      },
      "vegetable crops": {
         "advisory": [
            "ବିଭିନ୍ନ ବୃଦ୍ଧି ପର୍ଯ୍ୟାୟରେ ପତ୍ର ଖାଉଥିବା କ୍ୟାଟର୍ପିଲାର୍ ଏବଂ ଫଳ ଛେଦକମାନଙ୍କୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ ସୁପାରିସ କରାଯାଇଥିବା କୀଟନାଶକ ବ୍ୟବହାର କରନ୍ତୁ।",
            "ଫୁଲ ଫୁଟିବା ସମୟରେ ନିୟମିତ ନିରୀକ୍ଷଣ କରନ୍ତୁ ଏବଂ ରାସାୟନିକ ପ୍ରୟୋଗରୁ ଦୂରେଇ ରୁହନ୍ତୁ।"
         ]
      },
      "livestock": {
         "advisory": [
            "ଶରୀରର ତାପମାତ୍ରା ବଜାୟ ରଖିବା ପାଇଁ ପଶୁମାନଙ୍କୁ ତୈଳ କେକ୍ ଏବଂ ଗୁଡ଼୍ର ମିଶ୍ରଣ ଖାଇବାକୁ ଦିଅନ୍ତୁ।",
            "ଗର୍ଭବତୀ ପଶୁମାନଙ୍କୁ ଅତିରିକ୍ତ ଖାଦ୍ୟ ପ୍ରଦାନ କରନ୍ତୁ ଏବଂ ଟୀକାକରଣ ଏବଂ କୃମି ନିବାରଣ ଅଭ୍ୟାସ ନିଶ୍ଚିତ କରନ୍ତୁ।"
         ]
      }
   },
   "date": "31-01-2025"
}