{
   "weather_details": {
      "01-02-2025": {
         "rainfall": 0,
         "t_max": 29,
         "t_min": 21,
         "rh_max": 93,
         "rh_min": 44,
         "wind_speed": 7,
         "wind_direction": 231,
         "cloud_cover": 1
      },
      "02-02-2025": {
         "rainfall": 0,
         "t_max": 30,
         "t_min": 21,
         "rh_max": 94,
         "rh_min": 43,
         "wind_speed": 5,
         "wind_direction": 225,
         "cloud_cover": 1
      },
      "03-02-2025": {
         "rainfall": 0,
         "t_max": 31,
         "t_min": 21,
         "rh_max": 94,
         "rh_min": 46,
         "wind_speed": 5,
         "wind_direction": 250,
         "cloud_cover": 3
      },
      "04-02-2025": {
         "rainfall": 0,
         "t_max": 32,
         "t_min": 20,
         "rh_max": 88,
         "rh_min": 44,
         "wind_speed": 2,
         "wind_direction": 315,
         "cloud_cover": 3
      },
      "05-02-2025": {
         "rainfall": 0,
         "t_max": 31,
         "t_min": 20,
         "rh_max": 85,
         "rh_min": 33,
         "wind_speed": 4,
         "wind_direction": 294,
         "cloud_cover": 2
      }
   },
   "names_of_crops": [
      "ଗ୍ରୀଷ୍ମକାଳୀନ ଚାଉଳ",
      "ଚିନାବାଦାମ",
      "ବ୍ଲାକଗ୍ରାମ/ଗ୍ରୀନଗ୍ରାମ",
      "ସୋରିଷ ଓ ସୋରିଷ",
      "ପନିପରିବା",
      "ଫଳ",
      "ଫୁଲ।",
      "ପଶୁପାଳନ"
   ],
   "general_advisory": "ଆଇଏମଡିର ବର୍ଦ୍ଧିତ ରେଞ୍ଜ ପୂର୍ବାନୁମାନ ଅନୁଯାୟୀ, (ଜାନୁଆରୀ 31 ରୁ ଫେବୃଆରୀ 06,2025) ମଧ୍ୟରେ ଓଡ଼ିଶାର ଜିଲ୍ଲାଗୁଡ଼ିକରେ ଶୁଖିଲା ପାଗ ରହିବାର ସମ୍ଭାବନା ରହିଛି। ପ୍ରଚଳିତ କୁହୁଡ଼ି ଅବସ୍ଥା ଏବଂ ତାପମାତ୍ରାରେ କ୍ରମିକ ବୃଦ୍ଧି ପନିପରିବାରେ ଧଳା ମାଛି, ଏଫିଡ୍, ଜ୍ଯାସିଡ୍ ଏବଂ ଥର୍ପସ୍ ପରି କୀଟ ଶୋଷିବା ପାଇଁ ସଂକ୍ରମଣ ବୃଦ୍ଧି କରିପାରେ ତେଣୁ ନିୟମିତ ଭାବରେ ଫସଲ ଉପରେ ନଜର ରଖନ୍ତୁ ଏବଂ ଏକର ପିଛା 8 ରେ ହଳଦିଆ ଷ୍ଟିକ୍ ଫାନ୍ଦ ସ୍ଥାପନ କରନ୍ତୁ | ମହୁମାଛିଙ୍କୁ ରକ୍ଷା କରିବା ପାଇଁ ଅପରାହ୍ନ 3ଟା ପରେ କୀଟନାଶକ ସିଞ୍ଚନ କରାଯିବ।",
   "crops_data": {
      "summer rice": {
         "advisory": [
            "ଯେଉଁ କୃଷକମାନେ ରୋପଣ କରିବାକୁ ଯାଉଛନ୍ତି ସେମାନେ ଏକର ପିଛା 35-କିଲୋଗ୍ରାମ ଡିଏପି, 20-କିଲୋଗ୍ରାମ ଏମଓପି ଏବଂ 8-କିଲୋଗ୍ରାମ ୟୁରିଆ ପ୍ରୟୋଗ କରିବା ଉଚିତ୍। ଜିଙ୍କ ଅଭାବ ଥିବା ମାଟିରେ ଜିଙ୍କ ସଲ୍ଫେଟ୍ (21 ପ୍ରତିଶତ) ଏକର ପିଛା 10 କିଲୋଗ୍ରାମ ଲେଖାଏଁ ଲଗାନ୍ତୁ।",
            "25-30 ଦିନ ପୁରୁଣା ଚାରା ରୋପଣ 20 x 15 ସେ. ମି. ବ୍ୟବଧାନରେ କରାଯିବା ଉଚିତ, ଅଧିକ ଉତ୍ପାଦନକ୍ଷମ ପ୍ରଜାତି ପାଇଁ ପ୍ରତି ପାହାଡ଼ରେ 2 ରୁ 3 ଚାରା ଲଗାଇବା ଉଚିତ।",
            "ନର୍ସରୀ ଏବଂ ମୁଖ୍ୟ କ୍ଷେତରେ ରୋଗ ପରିଚାଳନା ପାଇଁ ରୋପଣର 5-6 ଦିନ ପୂର୍ବରୁ (ଟେବୁକୋନାଜୋଲ୍ + ଟ୍ରାଇଫ୍ଲୋକ୍ସିସ୍ଟ୍ରୋବିନ୍) @0.5 ମିଲି/ଲିଟର ପାଣି ସହିତ plantomycin@1g ଲିଟର ପାଣି ସିଞ୍ଚନ କରିବା ସୁପାରିଶ କରାଯାଏ।"
         ]
      },
      "groundnut": {
         "advisory": [
            "ଫସଲକୁ କଳାର ରଟ୍, ଷ୍ଟେମ ରଟ୍ ଏବଂ ଟିକ୍କା ରୋଗରୁ ରକ୍ଷା କରିବା ପାଇଁ (କାର୍ବେଣ୍ଡାଜିମ୍ + ମାଙ୍କୋଜେବ୍) କିମ୍ବା (ମେଟାଲୋକ୍ସିଲ୍ + ମାଙ୍କୋଜେବ୍) @2 ଗ୍ରାମ/ଲିଟର ପାଣି ସହିତ ସ୍ପ୍ରେ ଏବଂ ଡ୍ରେଞ୍ଚିଂ ଆବଶ୍ୟକ |"
         ]
      },
      "blackgram/greengram": {
         "advisory": [
            "ପ୍ରାରମ୍ଭିକ ପର୍ଯ୍ୟାୟରେ ଶ୍ୱେତ ମାଛି ଏବଂ ଅନ୍ୟାନ୍ୟ ଶୋଷକ କୀଟପତଙ୍ଗରୁ ଫସଲକୁ ରକ୍ଷା କରିବା ପାଇଁ ବୁଣିବା ପୂର୍ବରୁ 1 କେଜି ମଞ୍ଜି ପିଛା ଇମିଡାକ୍ଲୋପ୍ରିଡ୍ 600 ଏଫ୍. ଏସ୍. @5 ମିଲି. ମିଶ୍ରଣ କରନ୍ତୁ।",
            "7 ଦିନ ପୂର୍ବରୁ (କାର୍ବୋକ୍ସିନ୍ + ଥିରମ୍) @2gm କିଲୋଗ୍ରାମ ମଞ୍ଜି ସହିତ ଉପଚାର କରିବା ପରେ ମଞ୍ଜି ବୁଣନ୍ତୁ। ମଞ୍ଜି ବୁଣିବା ଦିନ ପ୍ରତି କିଲୋଗ୍ରାମ ମଞ୍ଜି ପିଛା 20 ଗ୍ରାମ ରାଇଜୋବିୟମ୍ ବ୍ୟାକ୍ଟେରିଆ କଲ୍ଚରକୁ ମିଶାଇ ଛାୟାରେ ରଖନ୍ତୁ।",
            "ବିହନ ହାରଃ ସବୁଜ ବୁଟ ଏବଂ କଳା ବୁଟଃ ହେକ୍ଟର ପିଛା 25-30 କି. ଗ୍ରା., ଦୂରତା-25 ସେ. ମି. * 10 ସେ. ମି.। କିସମ-ସବୁଜ ଚଣା-ବିରାଟ, ଶିଖା, ପିଡିଏମ-54, ଆଇଇପିଏମ-203, ବ୍ଲାକଗ୍ରାମ-ପିଉ-10, ପି. ୟୁ.-11"
         ]
      },
      "rapeseed and mustard": {
         "advisory": [
            "ପୁଷ୍ପ ଏବଂ ଶୁଆ ବିକାଶ ପର୍ଯ୍ୟାୟରେ ଗୁରୁତ୍ୱପୂର୍ଣ୍ଣ ପର୍ଯ୍ୟାୟରେ ଗୋଟିଏ ଜଳସେଚନ ପ୍ରଦାନ କରନ୍ତୁ।",
            "ପ୍ରଚଳିତ କୁହୁଡ଼ି ଅବସ୍ଥା ଏବଂ ତାପମାତ୍ରାରେ କ୍ରମିକ ବୃଦ୍ଧି ସଂକ୍ରମଣ ଏଫିଡ୍ ବୃଦ୍ଧି କରିପାରେ | ଏଫିଡ୍କୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ ଆବଶ୍ୟକତା ଅନୁଯାୟୀ ଏକର ପିଛା 600 ମିଲି ନିମ୍ବ ତେଲ କିମ୍ବା ଏକର ପିଛା 60 ଗ୍ରାମ୍ ଫ୍ଲୋନିକାମିଡ ସିଞ୍ଚନ କରିବାକୁ ପରାମର୍ଶ ଦିଆଯାଇଛି। ମହୁମାଛିଙ୍କୁ ରକ୍ଷା କରିବା ପାଇଁ ଅପରାହ୍ନ 3ଟା ପରେ କୀଟନାଶକ ସିଞ୍ଚନ କରାଯିବ।"
         ]
      },
      "vegetables": {
         "advisory": [
            "3 ରୁ 4 ସପ୍ତାହ ପର୍ଯ୍ୟାୟରେ ଥିବା ରବି ପନିପରିବାରେ ସାର ପ୍ରୟୋଗ ପାଇଁ ପାଣିପାଗ ଉପଯୁକ୍ତ |",
            "ବାଇଗଣ ଏବଂ ଟମାଟୋରେ ଶୁଖିଲା କିମ୍ବା ଆଂଶିକ ଶୁଖିଲା ହେବାରୁ ରକ୍ଷା ପାଇବା ପାଇଁ ନିମ୍ବ କିମ୍ବା କରଞ୍ଜା କେକ୍ ଲଗାନ୍ତୁ ଏବଂ ସ୍ପ୍ରେ (ବେସାଲ୍ + ପତ୍ର) ଟେବୁକୋନାଜୋଲ୍ ଫଙ୍ଗିସାଇଡ୍ @1 ମିଲି/ଲିଟର କରନ୍ତୁ।"
         ]
      },
      "fruit": {
         "advisory": [
            "ପେପା-ପେପା ଲିଫ୍ କର୍ଲ ଭାଇରସର ଭେକ୍ଟର (ହ୍ୱାଇଟ୍ଫ୍ଲାଇ) କୁ ଧରିବା ପାଇଁ ହଳଦିଆ ଷ୍ଟିକି ଫାନ୍ଦ ଲଗାନ୍ତୁ। ଶ୍ୱେତ ମାଛି ନିୟନ୍ତ୍ରଣ ପାଇଁ ନିମ୍ବ ତେଲ ଗଠନ 1500 ପିପିଏମ @3ml ଲିଟର ପାଣି ଏବଂ ଫ୍ଲୋନିକାମିଡ 50 ଡବ୍ଲୁଜି @0.3 ଗ୍ରାମ/ଲିଟରର ବିକଳ୍ପ ସିଞ୍ଚନ।"
         ]
      },
      "flower": {
         "advisory": [
            "ମାରିଗୋଲ୍ଡ-ଡାଇଫେନ୍ଥୁରିୟନ @1g ଲି ସହିତ ମାରିଗୋଲ୍ଡ ଗଛକୁ ସ୍ପ୍ରେ କରନ୍ତୁ। ପାଣି କିମ୍ବା ଆବାମେକ୍ଟିନ୍ @0.75 ମିଲି/ଲି। ଥ୍ରୀ ଇପ୍ସ, ଏଫିଡ୍, ମାଇଟ୍ ଏବଂ ଲିଫ୍ ମାଇନରର ସଂକ୍ରମଣକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ ଜଳ।"
         ]
      },
      "livestock": {
         "advisory": [
            "ପଶୁମାନଙ୍କ ଶଯ୍ୟା ଭାବରେ ଶୁଖିଲା ନଡ଼ିଆ ସମେତ ଶୀତଳ ପବନରେ ପଶୁମାନଙ୍କର ସିଧାସଳଖ ସଂସ୍ପର୍ଶରେ ଆସିବାକୁ ଏଡ଼ାଇବା ପାଇଁ ରାତିରେ ପଶୁ ଆଶ୍ରୟସ୍ଥଳକୁ ଚାରି ପାର୍ଶ୍ୱରୁ ଘୋଡାଇ ରଖନ୍ତୁ | ଦୁର୍ବଳ ଏବଂ ଅସୁସ୍ଥ ପଶୁମାନଙ୍କୁ ଥଣ୍ଡାରୁ ରକ୍ଷା କରିବା ପାଇଁ ବସ୍ତା କପଡ଼ାରେ ଢାଙ୍କିବା ଉଚିତ।"
         ]
      }
   },
   "date": "31-01-2025"
}