{
   "weather_details": {
      "2025-02-01": {
         "rainfall": 0,
         "t_max": 31,
         "t_min": 17,
         "rh_max": 92,
         "rh_min": 31,
         "wind_speed": 3,
         "wind_direction": 277,
         "cloud_cover": 3
      },
      "2025-02-02": {
         "rainfall": 0,
         "t_max": 32,
         "t_min": 17,
         "rh_max": 86,
         "rh_min": 30,
         "wind_speed": 2,
         "wind_direction": 259,
         "cloud_cover": 3
      },
      "2025-02-03": {
         "rainfall": 0,
         "t_max": 34,
         "t_min": 19,
         "rh_max": 81,
         "rh_min": 24,
         "wind_speed": 3,
         "wind_direction": 278,
         "cloud_cover": 3
      },
      "2025-02-04": {
         "rainfall": 0,
         "t_max": 34,
         "t_min": 20,
         "rh_max": 70,
         "rh_min": 26,
         "wind_speed": 2,
         "wind_direction": 297,
         "cloud_cover": 2
      },
      "2025-02-05": {
         "rainfall": 0,
         "t_max": 34,
         "t_min": 20,
         "rh_max": 72,
         "rh_min": 23,
         "wind_speed": 2,
         "wind_direction": 284,
         "cloud_cover": 2
      }
   },
   "names_of_crops": [
      "ଚାଉଳ",
      "ଚିନାବାଦାମ",
      "କଳା ଚଣା",
      "ସୋରିଷ",
      "ଆଳୁ",
      "ମଟର/ଲୋବିଆ",
      "ରସୁଣ",
      "ମେନାସିନାକାହି",
      "ଲଙ୍କା",
      "ଫୁଲକୋବି",
      "କଦଳୀ",
      "ସାଧାରଣ ମାଛ",
      "ଚିକେନ୍"
   ],
   "general_advisory": "ଗତ ସପ୍ତାହରେ ଗଜପତି ଜିଲ୍ଲାର ହାରାହାରି ସର୍ବାଧିକ ଦୈନିକ ତାପମାତ୍ରା 32.6 ଡିଗ୍ରୀ ସେଲସିୟସ୍ ଏବଂ ହାରାହାରି ସର୍ବନିମ୍ନ ଦୈନିକ ତାପମାତ୍ରା 15.7 ଡିଗ୍ରୀ ସେଲସିୟସ୍ ଥିଲା। ଗତ ସପ୍ତାହରେ ଜିଲ୍ଲାରେ 0.9 ମିଲିମିଟର ବର୍ଷା ହୋଇଥିଲା। ସାମାନ୍ୟ ଶୁଖିଲା ପରିସ୍ଥିତି ଥିବାରୁ କୃଷକମାନଙ୍କୁ ସେମାନଙ୍କ କ୍ଷେତକୁ ଜଳସେଚନ କରିବାକୁ ପରାମର୍ଶ ଦିଆଯାଇଛି। ଗ୍ରୀଷ୍ମକାଳୀନ ଧାନ ପାଇଁ ମୁଖ୍ୟ କ୍ଷେତକୁ ପ୍ରସ୍ତୁତ କରନ୍ତୁ ଏବଂ 3 ସପ୍ତାହ ପୁରୁଣା ଚାରା ସହିତ ରୋପଣ ଆରମ୍ଭ କରନ୍ତୁ। 4 ରୁ 5 ଟି ପତ୍ର ପର୍ଯ୍ୟାୟରେ ଗ୍ରୀଷ୍ମ ଚାଉଳ ଚାରା ରୋପଣ ପାଇଁ ପ୍ରସ୍ତୁତ | ପାହାଡ଼ ପିଛା ଅଗଭୀର ଏବଂ ସିଧା ଧାଡ଼ିରେ 15 ସେ. ମି. ବ୍ୟବଧାନରେ ଏବଂ ପାହାଡ଼ଗୁଡ଼ିକ ମଧ୍ୟରେ 10 ସେ. ମି. ବ୍ୟବଧାନରେ 2ରୁ 3ଟି ଚାରା ରୋପଣ କରନ୍ତୁ।",
   "crops_data": {
      "rice": {
         "advisory": [
            "ଯେଉଁ କୃଷକମାନେ ରୋପଣ ପାଇଁ ଯାଉଛନ୍ତି, ସେମାନେ ଶେଷ ପୋଖରୀରେ ଏକର ପିଛା 35 କିଲୋଗ୍ରାମ ଡିଏପି, 30 କିଲୋଗ୍ରାମ ଏମଓପି ଏବଂ 8 କିଲୋଗ୍ରାମ ୟୁରିଆ ଲଗାଇବା ଉଚିତ। ବାଲୁକାମୟ ମୃତ୍ତିକା ପାଇଁ ଏକର ପିଛା 35 କିଲୋଗ୍ରାମ ଡିଏପି, 15 କିଲୋଗ୍ରାମ ଏମଓପି ଏବଂ 8 କିଲୋଗ୍ରାମ ୟୁରିଆ ଲଗାନ୍ତୁ। ଜିଙ୍କ ଅଭାବ ଥିବା ମାଟିରେ ଜିଙ୍କ ସଲ୍ଫେଟ୍ (21 ପ୍ରତିଶତ) ପ୍ରତି ତିନି ବର୍ଷରେ ଏକର ପିଛା 10 କିଲୋଗ୍ରାମ ଲେଖାଏଁ ଲଗାନ୍ତୁ। 20 x 15 ସେ. ମି. ବ୍ୟବଧାନରେ 25-30 ଦିନ ପୁରୁଣା ଚାରା ରୋପଣ କରାଯିବା ଉଚିତ, ଅଧିକ ଉତ୍ପାଦନକ୍ଷମ ପ୍ରଜାତି ପାଇଁ ପ୍ରତି ପାହାଡ଼ରେ 2ରୁ 3 ଚାରା ରୋପଣ କରାଯିବା ଉଚିତ।"
         ]
      },
      "groundnut": {
         "advisory": [
            "ବାଲିଡାମାଇସିନ୍ 3 ପ୍ରତିଶତ ଏଲ @400-ମିଲି/ଏକର କିମ୍ବା କ୍ୟାପଟାନ 70 ପ୍ରତିଶତ + ହେକ୍ସାକୋନାଜୋଲ 5 ପ୍ରତିଶତ ଡବ୍ଲ୍ୟୁ. ପି. @300-ଗ୍ରାମ/ଏକର ସହିତ ଚିନାବାଦାମ ଗର୍ତ୍ତ ମାଟିରେ କାଣ୍ଡ ପଚାକୁ ନିୟନ୍ତ୍ରଣ କରିବା।"
         ]
      },
      "black gram": {
         "advisory": [
            "ବ୍ଲାକଗ୍ରାମ୍ ଏବଂ ଗ୍ରୀନ୍ଗ୍ରାମ୍ ଫସଲରେ ପାଉଡର ଫଙ୍ଗୁର ରୋଗକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ ସଲଫର୍ 80 ପ୍ରତିଶତ ଡବ୍ଲ୍ୟୁ. ପି. @800-ଗ୍ରାମ୍/ଏକର କିମ୍ବା ହେକ୍ସାକୋନାଜୋଲ୍ 5 ପ୍ରତିଶତ ଇ. ସି. @300 ମିଲି/ଏକର କିମ୍ବା ପ୍ରୋପିକୋନାଜୋଲ୍ 25 ପ୍ରତିଶତ ଇ. ସି. @200 ମିଲି/ଏକର କିମ୍ବା ପେଙ୍କୋନାଜୋଲ୍ 10 ପ୍ରତିଶତ ଇ. ସି. @100 ମିଲି/ଏକରକୁ 200 ଲିଟର ପାଣିରେ ମିଶାଇ ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "mustard": {
         "advisory": [
            "ଶୀଘ୍ର ବୁଣାଯାଇଥିବା ସୋରିଷ ଫସଲରେ ଏଫିଡ୍ ସଂକ୍ରମଣ ହେବାର ସମ୍ଭାବନା ରହିଛି। ପ୍ରାରମ୍ଭିକ ପର୍ଯ୍ୟାୟରେ ଏଫିଡ୍ ପରିଚାଳନା କରିବାକୁ, ଏକର ପିଛା 8 ଟି ହଳଦିଆ ଷ୍ଟିକ୍ ଟ୍ରାପ୍ ଲଗାନ୍ତୁ | 200 ଲିଟର ପାଣିରେ ମିଶ୍ରଣ କରି ନିମ୍ବ ଆଧାରିତ କୀଟନାଶକ 1500 ପିପିଏମ @600-ମିଲି/ଏକର ସ୍ପ୍ରେ କରନ୍ତୁ। ଯଦି ସଂକ୍ରମଣ ଗୁରୁତର ହୁଏ, ତା \"ହେଲେ ରାସାୟନିକ କୀଟନାଶକ 'ଥାୟାମେଥୋକ୍ସାମ୍\" ସ୍ପ୍ରେ କରନ୍ତୁ, 25 ପ୍ରତିଶତ ଡବ୍ଲୁ. ଜି. @40 ଗ୍ରାମ୍/ଏକର କିମ୍ବା ଏସିଟାମିପ୍ରିଡ୍ 20 ପ୍ରତିଶତ ଏସ୍. ପି. @50 ଗ୍ରାମ୍/ଏକର, 200 ଲିଟର ପାଣିରେ ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "potato": {
         "advisory": [
            "ଆଳୁରେ ପ୍ରାରମ୍ଭିକ ବ୍ଲାଇଟ୍ ରୋଗ ହେବାର ସମ୍ଭାବନା ରହିଛି। ଆଳୁରେ ଶୀଘ୍ର ପତ୍ର ରୋଗକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ, ଏକର ପିଛା ମାନକୋଜେବ୍ 75 ପ୍ରତିଶତ ଡବ୍ଲ୍ୟୁ. ପି. @600 ଗ୍ରାମ୍ କିମ୍ବା କାର୍ବେଣ୍ଡାଜିମ୍ 12 ପ୍ରତିଶତ + ମାନକୋଜେବ୍ 63 ପ୍ରତିଶତ ଡବ୍ଲ୍ୟୁ. ପି. @400 ଗ୍ରାମ୍ ସ୍ପ୍ରେ କରନ୍ତୁ। ଆଳୁରେ ବିଳମ୍ବରେ ହେଉଥିବା ରୋଗକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ 10 ଦିନ ବ୍ୟବଧାନରେ ମେଟାଲ୍ୟାକ୍ସିଲ 8 ପ୍ରତିଶତ + ମାନକୋଜେବ 64 ପ୍ରତିଶତ ୱୁପି @400 ଗ୍ରାମ/ଏକରରେ ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "cowpea/lobia": {
         "advisory": [
            "ଲୋମଯୁକ୍ତ କ୍ୟାଟର୍ପିଲରକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ ଫ୍ଲୁବେଣ୍ଡିଆମାଇଡ୍ 39.35% ଏସ୍ସି @80 ମିଲି/200 ଲିଟର ପାଣି ସ୍ପ୍ରେ କରନ୍ତୁ। ଯଦି ସେରକୋସ୍ପୋରା ପତ୍ର ଦାଗ ଦେଖାଯାଏ, ତେବେ ଏକର ପିଛା ଡିଫିନୋକୋନାଜୋଲ୍ 25 ପ୍ରତିଶତ ଇସି @200 ମିଲି କିମ୍ବା କାର୍ବେଣ୍ଡାଜିମ୍ 12 ପ୍ରତିଶତ + ମାଙ୍କୋଜେବ୍ 63 ପ୍ରତିଶତ ଡବ୍ଲ୍ୟୁ. ପି. 400 ଗ୍ରାମ/200 ଲିଟର ପାଣି ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "onion": {
         "advisory": [
            "ପ୍ରାକ୍-ଆବିର୍ଭାବ ହର୍ବିସାଇଡ୍ ପେଣ୍ଡିମେଥାଲିନ୍ 30 ପ୍ରତିଶତ ଇ. ସି. 1 ଲିଟର/ଏକର ପିଛା 1-2 ଡିଏଟିରେ ଲଗାନ୍ତୁ।"
         ]
      },
      "menacinakahi": {
         "advisory": [
            "କୀଟ ସଂକ୍ରମଣର ପ୍ରାଥମିକ ପର୍ଯ୍ୟାୟରେ ଲଙ୍କାରେ ଏଫିଡ୍ ଏବଂ ଥ୍ରିପ୍ସକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ 200 ଲିଟର ପାଣିରେ ମିଶାଇ ଏକର ପିଛା 600-ମିଲି ପିଛା ନିମ୍ବ ଆଧାରିତ କୀଟନାଶକ 1500 ପିପିଏମ ସ୍ପ୍ରେ କରନ୍ତୁ। ଥିୟାମେଥୋକ୍ସାମ୍ 25 ପ୍ରତିଶତ ଡବ୍ଲୁ. ଜି. @40 ଗ୍ରାମ୍/ଏକର କିମ୍ବା ଏସିଟାମିପ୍ରିଡ୍ 20 ପ୍ରତିଶତ ଏସ. ପି. @50 ଗ୍ରାମ୍/ଏକର କିମ୍ବା ପ୍ରୋଫେନୋଫସ୍ 40 ପ୍ରତିଶତ + ଫେନପାଇରୋକ୍ସିମେଟ୍ 2.5 ପ୍ରତିଶତ ଇ. ସି. @400-ମିଲି/ଏକର ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "chilli": {
         "advisory": [
            "କୀଟ ସଂକ୍ରମଣର ପ୍ରାଥମିକ ପର୍ଯ୍ୟାୟରେ ଲଙ୍କାରେ ଏଫିଡ୍ ଏବଂ ଥ୍ରିପ୍ସକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ 200 ଲିଟର ପାଣିରେ ମିଶାଇ ଏକର ପିଛା 600-ମିଲି ପିଛା ନିମ୍ବ ଆଧାରିତ କୀଟନାଶକ 1500 ପିପିଏମ ସ୍ପ୍ରେ କରନ୍ତୁ। ଥିୟାମେଥୋକ୍ସାମ୍ 25 ପ୍ରତିଶତ ଡବ୍ଲୁ. ଜି. @40 ଗ୍ରାମ୍/ଏକର କିମ୍ବା ଏସିଟାମିପ୍ରିଡ୍ 20 ପ୍ରତିଶତ ଏସ. ପି. @50 ଗ୍ରାମ୍/ଏକର କିମ୍ବା ପ୍ରୋଫେନୋଫସ୍ 40 ପ୍ରତିଶତ + ଫେନପାଇରୋକ୍ସିମେଟ୍ 2.5 ପ୍ରତିଶତ ଇ. ସି. @400-ମିଲି/ଏକର ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "cauliflower": {
         "advisory": [
            "ବ୍ରାଉନ୍ ରଟ୍ କୁ ରୋକିବା ପାଇଁ କୋଲ୍ ଫସଲରେ ରୋପଣ ସମୟରେ ମାଟି ପ୍ରୟୋଗ ଭାବରେ ଏକର ପିଛା 4 କିଲୋଗ୍ରାମ ବୋରାକ୍ସ ଲଗାନ୍ତୁ | ଯଦି ଚାରା ରୋପଣ ସମୟରେ ବୋରାକ୍ସ ପ୍ରୟୋଗ କରାଯାଇନଥାଏ, ତେବେ ବୋରାକ୍ସ @2.5 ଗ୍ରାମ/ଲିଟର କିମ୍ବା ଫୋଲିବୋର/ସଲ୍ୟୁବର @1.5 ଗ୍ରାମ/ଲିଟର ସ୍ପ୍ରେ କରନ୍ତୁ। ପ୍ରତିରୋପଣର ଦୁଇ ସପ୍ତାହ ପରେ ଏବଂ ଦହି ତିଆରି ହେବାର ଦୁଇ ସପ୍ତାହ ପୂର୍ବରୁ ବୋରନ ମାଇକ୍ରୋ ନ୍ୟୁଟ୍ରିଏଣ୍ଟ ସିଞ୍ଚନ କରାଯିବା ଉଚିତ।"
         ]
      },
      "cabbage": {
         "advisory": [
            "ଶୀଘ୍ର ରୋପଣ କରାଯାଇଥିବା କୋଲ୍ ଫସଲରେ ଡିମଣ୍ଡ ବ୍ୟାକ୍ ମଥ୍ର ସଂକ୍ରମଣ ହେବାର ସମ୍ଭାବନା ରହିଛି। ଏହି କ୍ଷତି ପତ୍ର ତନ୍ତୁରେ ସୁଡ଼ଙ୍ଗ ଖୋଳିବା କିମ୍ବା ପତ୍ର ବ୍ଲେଡର ତଳ ପୃଷ୍ଠର ଏପିଡର୍ମାଲ୍ ପତ୍ର ତନ୍ତୁଗୁଡ଼ିକୁ ସ୍କ୍ରାପ୍ କରିବା ଦ୍ୱାରା ହୋଇଥାଏ, ଯାହା ପତ୍ରରେ ସାଧାରଣ ଧଳା ଦାଗ ସୃଷ୍ଟି କରିଥାଏ। ଏହି କୀଟକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ, ଏକର ପିଛା 6ରୁ 8ଟି ହାଲୁକା ଫାନ୍ଦ ଲଗାନ୍ତୁ। କୀଟ ସଂକ୍ରମଣର ପ୍ରାଥମିକ ପର୍ଯ୍ୟାୟରେ 200 ଲିଟର ପାଣିରେ ମିଶ୍ରଣ କରି ଏକର ପିଛା 1 ଲିଟର ନିମ୍ବ ଆଧାରିତ କୀଟନାଶକ ସ୍ପ୍ରେ କରନ୍ତୁ। ଏହି କୀଟକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ ରାସାୟନିକ ଉପାୟରେ ଟଲ୍ଫେନ୍ପାଇରାଡ୍ 15 ପ୍ରତିଶତ ଇସି @400-ମିଲି/ଏକର କିମ୍ବା ଫ୍ଲୁବେଣ୍ଡିଆମାଇଡ୍ 20 ପ୍ରତିଶତ ଡବ୍ଲୁଜି @20-ଗ୍ରାମ୍/ଏକର କିମ୍ବା ଇମାମେକ୍ଟିନ୍ ବେନ୍ଜୋଏଟ୍ 5 ପ୍ରତିଶତ ଏସ୍ଜି @80-ଗ୍ରାମ୍/ଏକରକୁ 200-ଲିଟର ପାଣିରେ ମିଶାଇ ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "common fish": {
         "advisory": [
            "ଶୀତ ଋତୁରେ ମାଛରେ 'ଇ. ୟୁ. ଏସ୍.' ରୋଗ ହେବାର ସମ୍ଭାବନା ରହିଛି। ପ୍ରତିଷେଧକ ପଦକ୍ଷେପ ସ୍ୱରୂପ କୃଷକମାନଙ୍କୁ ଏକ ଏକର ପୋଖରୀ ଅଞ୍ଚଳରେ 40 ଲିଟର ପାଣି ସହିତ 400 ମିଲିଲିଟର ସିଫ୍ୟାକ୍ସ ଲଗାଇବାକୁ ପରାମର୍ଶ ଦିଆଯାଇଛି। ମାଛମାନଙ୍କୁ ପ୍ରତିଦିନ ସେମାନଙ୍କର ମୋଟ ଜୈବବସ୍ତୁର 2-3% ହାରରେ ତୈଳ କେକ୍ ବ୍ରାନ୍ ମିଶ୍ରଣ ସହିତ ଖୁଆଇବା ଉଚିତ୍ |"
         ]
      },
      "chicken": {
         "advisory": [
            "ପ୍ରଚଳିତ ନିମ୍ନ ତାପମାତ୍ରାକୁ ଦୃଷ୍ଟିରେ ରଖି, କୁକୁଡ଼ା ପାଳିରେ ଉତ୍ତାପ ବଜାୟ ରଖିବା ପାଇଁ ବିଦ୍ୟୁତ ବଲ୍ବ ବ୍ୟବହାର କରନ୍ତୁ କିମ୍ବା ପାଳିରେ ହିଟର୍ ଲଗାନ୍ତୁ। ପଲିଥିନ୍ କିମ୍ବା ବ୍ୟାଗ୍ରେ କ୍ଷେତକୁ ଢାଙ୍କି ଦିଅନ୍ତୁ।"
         ]
      }
   },
   "date": "31-01-2025"
}