{
   "weather_details": {
      "01/02/2025": {
         "rainfall": 0,
         "t_max": 29,
         "t_min": 17,
         "rh_max": 86,
         "rh_min": 34,
         "wind_speed": 1,
         "wind_direction": 63,
         "cloud_cover": 3
      },
      "02/02/2025": {
         "rainfall": 0,
         "t_max": 30,
         "t_min": 17,
         "rh_max": 93,
         "rh_min": 29,
         "wind_speed": 2,
         "wind_direction": 100,
         "cloud_cover": 3
      },
      "03/02/2025": {
         "rainfall": 0,
         "t_max": 30,
         "t_min": 17,
         "rh_max": 78,
         "rh_min": 21,
         "wind_speed": 2,
         "wind_direction": 18,
         "cloud_cover": 3
      },
      "04/02/2025": {
         "rainfall": 0,
         "t_max": 31,
         "t_min": 16,
         "rh_max": 79,
         "rh_min": 28,
         "wind_speed": 2,
         "wind_direction": 68,
         "cloud_cover": 2
      },
      "05/02/2025": {
         "rainfall": 1,
         "t_max": 30,
         "t_min": 16,
         "rh_max": 76,
         "rh_min": 23,
         "wind_speed": 3,
         "wind_direction": 0,
         "cloud_cover": 2
      }
   },
   "names_of_crops": [
      "ରବି ଧାନ",
      "ମଞ୍ଜି ଏବଂ ସୋରିଷ",
      "ଗହମ",
      "ଗ୍ରୀଷ୍ମକାଳୀନ ମକା",
      "ସେସମମ୍",
      "ଗ୍ରୀଷ୍ମ ଋତୁର ଚିନାବାଦାମ",
      "ରସୁଣ",
      "କୁକୁଡ଼ା ଚାଷ",
      "ମତ୍ସ୍ୟଚାଷ"
   ],
   "general_advisory": "ଧାନ କ୍ଷେତରେ ହାଲୁକା ଜଳସେଚନ ବ୍ୟବସ୍ଥା କରନ୍ତୁ। ରବି ଫସଲ ପାଇଁ ଗୁରୁତ୍ୱପୂର୍ଣ୍ଣ ଜଳସେଚନ ବ୍ୟବସ୍ଥା ରଖନ୍ତୁ। କୀଟ ଆକ୍ରମଣ ପାଇଁ ସର୍ଭେ କରନ୍ତୁ ଏବଂ ଆବଶ୍ୟକ ପଦକ୍ଷେପ ନିଅନ୍ତୁ। ରବି ଫସଲରେ ସମ୍ପୂର୍ଣ୍ଣ ଜମି। ପାଣିପାଗ କାରଣରୁ ବିଭିନ୍ନ ଫସଲରେ ପାଉଡର ଫଙ୍ଗୁର ହେବାର ସମ୍ଭାବନା ରହିଛି, 200 ଲିଟର ପାଣିରେ 1 କିଲୋଗ୍ରାମର ସ୍ପ୍ରେ ସଲଫର୍ ପାଉଡରକୁ ପରିଚାଳନା କରିବା ପାଇଁ।",
   "crops_data": {
      "rabi paddy": {
         "advisory": [
            "ପ୍ରାରମ୍ଭିକ ପର୍ଯ୍ୟାୟରେ ଅର୍ଥାତ୍ ରୋପଣର 2ରୁ 3 ଦିନ ମଧ୍ୟରେ ଆଗାଛାକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ ପାଇରାଜୋ ସଲଫୁରାନ ଇଥାଇଲ ଲଗାନ୍ତୁ। ଏହାର ମାତ୍ରା ଏକର ପିଛା 80 ଗ୍ରାମ୍। ତୃଣନାଶକ ସିଞ୍ଚନ ସମୟରେ ପାଣି ରଖନ୍ତୁ। ଚାରା ଗୁଡ଼ିକର ଉପଯୁକ୍ତ ବୃଦ୍ଧି ପାଇଁ କ୍ଷେତରେ 2 ସେ. ମି. ପାଣି ରଖନ୍ତୁ।"
         ]
      },
      "rape seed & mustard": {
         "advisory": [
            "ପାଣିପାଗ କାରଣରୁ ଏଫିଡ୍ସର ଗୁରୁତର ସଂକ୍ରମଣ ହେବ, ଇମିଡାକ୍ଲୋପ୍ରିଡ୍ କିମ୍ବା ଡାଇମେଥୋଏଟ୍ @2 ମିଲି/ଲିଟର ସ୍ପ୍ରେ କରନ୍ତୁ।",
            "ପୁଷ୍ପ ଏବଂ ଶୁଆ ବିକାଶ ପର୍ଯ୍ୟାୟରେ ଗୁରୁତ୍ୱପୂର୍ଣ୍ଣ ପର୍ଯ୍ୟାୟରେ ଗୋଟିଏ ଜଳସେଚନ ପ୍ରଦାନ କରନ୍ତୁ।"
         ]
      },
      "wheat": {
         "advisory": [
            "ବର୍ଦ୍ଧିତ ତାପମାତ୍ରାର ପୂର୍ବାନୁମାନ ହେତୁ, ଫୁଲ ଫୁଟାଇବା ଏବଂ କ୍ଷୀର ଦୋଇବା ପର୍ଯ୍ୟାୟରେ ଫସଲକୁ ଗୁରୁତ୍ୱପୂର୍ଣ୍ଣ ପର୍ଯ୍ୟାୟ ଜଳସେଚନ ପ୍ରଦାନ କରନ୍ତୁ। ଯେକୌଣସି କୀଟ ପାଇଁ ସର୍ଭେ କରନ୍ତୁ ଏବଂ ଷ୍ଟେମ ବୋରର ଆକ୍ରମଣର ସମ୍ଭାବନା ଅଛି | ପ୍ରୟୋଗ କରନ୍ତୁ 12-16 କିଲୋଗ୍ରାମ ନାଇଟ୍ରୋଜେନ୍/ଏକର"
         ]
      },
      "summer maize": {
         "advisory": [
            "ଉଚ୍ଚଭୂମି ଇକୋସିଷ୍ଟମ୍ କାରଣରୁ ସେଠାରେ ଅଧିକ ଆଗାଛା ରହିବ, ଉଚ୍ଚଭୂମିରେ ଆଗାଛାକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ ବୁଣିବା ପରଦିନ 200 ଲିଟର ପାଣିରେ ଏକର ପିଛା 1 କିଲୋଗ୍ରାମ ଆଟ୍ରାଜିନ୍ ଲଗାନ୍ତୁ।"
         ]
      },
      "sesamum": {
         "advisory": [
            "ପ୍ରାଚି, ଜି-10, କାଳିକା ଭଳି ତିଲ ପ୍ରତି ଏକର ପିଛା 3 କି. ଗ୍ରା. ରେ ବୁଣିବା ପାଇଁ ଯାଆନ୍ତୁ। ମୃତ୍ତିକା ଜନ୍ମିତ ଏବଂ ବୀଜ ଜନ୍ମିତ ରୋଗର ସୁରକ୍ଷା ପାଇଁ ମଞ୍ଜିଗୁଡ଼ିକୁ ଚିକିତ୍ସା କରନ୍ତୁ। 12-8-8 କି. ଗ୍ରା. ଏନ. ପି. କେ./ଏକରକୁ 10 କି. ଗ୍ରା. ସଲଫର୍ ସହିତ ମୂଳ ମାତ୍ରା ଭାବେ ପ୍ରୟୋଗ କରନ୍ତୁ।"
         ]
      },
      "summer groundnut": {
         "advisory": [
            "30 x 10 ସେ. ମି. ବ୍ୟବଧାନରେ ଗ୍ରୀଷ୍ମକାଳୀନ ଚିନାବାଦାମ ସମ୍ପୂର୍ଣ୍ଣ ବୁଣିବା। ବୀଜର ହାର ହେଉଛି 50 କିଲୋଗ୍ରାମ ଶୁଆ/ଏସି। କଳିଙ୍ଗ ଚିନାବାଦମ୍, ଦେବୀ, ଧରଣୀ ପରି ଭଲ କିସମ |",
            "ପ୍ରାରମ୍ଭିକ ବୁଣାଯାଇଥିବା ଫସଲରେ, ଫୁଲ ଫୁଟିବା ପରେ ପରସ୍ପର ମଧ୍ୟରେ ଚାଷ କରନ୍ତୁ ନାହିଁ।"
         ]
      },
      "onion": {
         "advisory": [
            "ହାଲୁକା ଆନ୍ତଃ ଚାଷ କରିବାକୁ ପଡିବ କାରଣ ମୂଳଗୁଡ଼ିକ ଅଗଭୀର ହେବ ଏବଂ ମୃତ୍ତିକା ପୃଷ୍ଠରେ ଦେଖିବାକୁ ମିଳିବ |"
         ]
      },
      "poultry farming": {
         "advisory": [
            "କୁକୁଡ଼ା ଘର ସଫା ରଖନ୍ତୁ"
         ]
      },
      "fish farming": {
         "advisory": [
            "ଶରୀରର ଓଜନ ଅନୁଯାୟୀ ଖାଦ୍ୟ ମିଶ୍ରଣ ପ୍ରଦାନ କରନ୍ତୁ।"
         ]
      }
   },
   "date": "31-01-2025"
}